#pragma once

// Dumper.

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x580 (0x1198 - 0xC18)
// BlueprintGeneratedClass B_HidingProp.B_HidingProp_C
class UB_HidingProp_C : public UFortHidingProp
{
public:
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0xC18(0x8)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                       ProjectileLocation_ForwardVector;                  // 0xC20(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                  LandedOnCollisionMesh;                             // 0xC28(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                      Sphere;                                            // 0xC30(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                       HideLocation_ForwardVector;                        // 0xC38(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                        Loot_MovementTimeline_Forward_0FC694AE4A45D691CB6BD5A8CD00E521; // 0xC40(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        Loot_MovementTimeline_Z_0FC694AE4A45D691CB6BD5A8CD00E521; // 0xC44(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class ETimelineDirection                Loot_MovementTimeline__Direction_0FC694AE4A45D691CB6BD5A8CD00E521; // 0xC48(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_99C8[0x7];                                     // Fixing Size After Last Property..
	class UTimelineComponent*                    Loot_MovementTimeline;                             // 0xC50(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                        Enabled;                                           // 0xC58(0x28)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                        HidingEnabled;                                     // 0xC80(0x28)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                        PlayerLimit;                                       // 0xCA8(0x28)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                        TeleportEnabled;                                   // 0xCD0(0x28)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                        CanTeleport;                                       // 0xCF8(0x28)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UFortPawn*>                     HidingPlayers;                                     // 0xD20(0x10)(Edit, BlueprintVisible, Net, DisableEditOnTemplate, DisableEditOnInstance, RepNotify)
	struct FGameplayTag                          EnterGameplayCue;                                  // 0xD30(0x4)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                          ExitGameplayCue;                                   // 0xD34(0x4)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                          LandedOnGameplayCue;                               // 0xD38(0x4)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_99C9[0x4];                                     // Fixing Size After Last Property..
	class UMaterialInstanceDynamic*              Mid;                                               // 0xD40(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                          RustleGameplayCue;                                 // 0xD48(0x4)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                          ExitGameplayCue_Player;                            // 0xD4C(0x4)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                          WhileEnteringGameplayCue;                          // 0xD50(0x4)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_99CA[0x4];                                     // Fixing Size After Last Property..
	double                                       ObstructionTraceLength;                            // 0xD58(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<enum class EObjectTypeQuery>          DestroyObjectTypes;                                // 0xD60(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UFortPawn*>                     Array;                                             // 0xD70(0x10)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	int32                                        Int;                                               // 0xD80(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_99CB[0x4];                                     // Fixing Size After Last Property..
	struct FVector                               DeimosPropSpawnerOffset;                           // 0xD88(0x18)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         FixedEntranceDirection;                            // 0xDA0(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_99CC[0x7];                                     // Fixing Size After Last Property..
	double                                       MaxInteractAngle;                                  // 0xDA8(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                               WobbleLocationOffset;                              // 0xDB0(0x18)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       InteractBelowPropDistance;                         // 0xDC8(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<class UFortPawn*, double>               HiddenPlayersAndEnterTimes;                        // 0xDD0(0x50)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	class UFortPawn*                             LastPawnToInteract;                                // 0xE20(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UB_HidingProp_C*                       TargetTeleporter;                                  // 0xE28(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                          TeleporterEnterGameplayCue;                        // 0xE30(0x4)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                          TeleporterExitGameplayCue;                         // 0xE34(0x4)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                          LoopingTeleportingCue;                             // 0xE38(0x4)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                          GC_Wobble;                                         // 0xE3C(0x4)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                          WobbleTimerHandle;                                 // 0xE40(0x8)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<struct FGameplayTag>                  BlockEntranceTags;                                 // 0xE48(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FGameplayTag>                  BlockExitTags;                                     // 0xE58(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UAnimMontage*                          EnterAnimMontage;                                  // 0xE68(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                          ExitAnimMontage;                                   // 0xE70(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UFortPawn*                             LastPawnToHide;                                    // 0xE78(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                          TeleportingStateGC;                                // 0xE80(0x4)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                         RandomWobbleNormal;                                // 0xE84(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         SingleOccupant;                                    // 0xE85(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Teleporting;                                       // 0xE86(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         JumpOut;                                           // 0xE87(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                GE_OnExitingPropNoJump_BlockActions;               // 0xE88(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                         DestroyInNonSpyLTM;                                // 0xE90(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         ActiveInSpyLTM;                                    // 0xE91(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_99CD[0x6];                                     // Fixing Size After Last Property..
	TArray<struct FGameplayTag>                  ForceAllowInteractTags;                            // 0xE98(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTag                          IsTeleporter;                                      // 0xEA8(0x4)(Edit, BlueprintVisible, Net, DisableEditOnInstance, RepNotify, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                          ContainsPlayerRepNof;                              // 0xEAC(0x4)(Edit, BlueprintVisible, Net, DisableEditOnInstance, RepNotify, NoDestructor, HasGetValueTypeHash)
	struct FVector                               ObstructionTraceExtents;                           // 0xEB0(0x18)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                               ObstructionTraceStartOffSet;                       // 0xEC8(0x18)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       ExitLaunchVelocity;                                // 0xEE0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                               AdditionalLaunchVelocity;                          // 0xEE8(0x18)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                               FixedEntraceObstructionTraceEndOffset;             // 0xF00(0x18)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         IsActiveTeleportExit;                              // 0xF18(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_99CE[0x7];                                     // Fixing Size After Last Property..
	class UClass*                                GE_TeleportAbilityGranted;                         // 0xF20(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                         DisableWhenSubmergedInWater;                       // 0xF28(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_99CF[0x7];                                     // Fixing Size After Last Property..
	struct FGameplayTagContainer                 DisableWhenSubmergedExceptionTags;                 // 0xF30(0x20)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UFortPawn*>                     NonCosmeticPawns;                                  // 0xF50(0x10)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	class UClass*                                CameraModifier;                                    // 0xF60(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FVector                               NewVar_0;                                          // 0xF68(0x18)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UActor*                                Pawn;                                              // 0xF80(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FVector                               Loot_CachedActorForward;                           // 0xF88(0x18)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FVector>                       Loot_VectorOffsets;                                // 0xFA0(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                         SpawnedLoot;                                       // 0xFB0(0x1)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_99D0[0x7];                                     // Fixing Size After Last Property..
	double                                       Loot_MoveForwardDistance;                          // 0xFB8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       Loot_MoveUpDistance;                               // 0xFC0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       Loot_SpawnRadius;                                  // 0xFC8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                               Loot_SpawnOffset;                                  // 0xFD0(0x18)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         ShouldSpawnLoot;                                   // 0xFE8(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_99D1[0x7];                                     // Fixing Size After Last Property..
	class FString                                Loot_Tier_Group;                                   // 0xFF0(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                         SetEntranceRotation;                               // 0x1000(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_99D2[0x7];                                     // Fixing Size After Last Property..
	TSubclassOf<class UGameplayEffect>           PropSpecificEffectToApplyToHiders;                 // 0x1008(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	struct FScalableFloat                        RustlesPerWobble;                                  // 0x1010(0x28)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                        RustleWobbleRadius;                                // 0x1038(0x28)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                        EnterWobbleRadius;                                 // 0x1060(0x28)(Edit, BlueprintVisible, DisableEditOnInstance)
	double                                       NonJumpExitDistance;                               // 0x1088(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSubclassOf<class UFortCameraMode>           Camera_Mode;                                       // 0x1090(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                         MoveToActorOnEnter;                                // 0x1098(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         IgnorePhysicsBodyCollisionOnEnter;                 // 0x1099(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         bCanRustleAndWobble;                               // 0x109A(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         SkipRestoreCameraViewTargetOnStopHiding;           // 0x109B(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         SkipRootMotionMovementOnStopHiding;                // 0x109C(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_99D3[0x3];                                     // Fixing Size After Last Property..
	struct FRotator                              AddedSetEntranceRotation;                          // 0x10A0(0x18)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	double                                       MoveToActorDelayOnEnter;                           // 0x10B8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       MoveToActorDurationOverride;                       // 0x10C0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMarkedActorDisplayInfo               MarkerDisplay;                                     // 0x10C8(0xB8)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FVector                               MarkerPositionOffset;                              // 0x1180(0x18)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("B_HidingProp_C");
		return Clss;
	}

	struct FVector GetMarkerPositionOffset();
	struct FMarkedActorDisplayInfo GetMarkerDisplayData();
	void GetTurnClientCameraCollisionOnDelayTime(double* Delay, float CallFunc_GetPlayLength_ReturnValue, double K2Node_FunctionResult_Delay_ImplicitCast);
