#pragma once

// Dumper.

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x2C8 (0xE88 - 0xBC0)
// BlueprintGeneratedClass BGA_PhysicsTreeLog.BGA_PhysicsTreeLog_C
class UBGA_PhysicsTreeLog_C : public UBuildingProp
{
public:
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0xBC0(0x8)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                     NS_Physics_Tree_InWater_Ripples;                   // 0xBC8(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UFortSoundIndicatorComponent*          FortSoundIndicator;                                // 0xBD0(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCapsuleComponent*                     WaterInteractMiddle;                               // 0xBD8(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCapsuleComponent*                     WaterInteractBottom;                               // 0xBE0(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCapsuleComponent*                     WaterInteractTop;                                  // 0xBE8(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                     NS_Physics_Tree_Environment_Impact;                // 0xBF0(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FScalableFloat>                PlayerImpactTiers;                                 // 0xBF8(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FScalableFloat>                PlayerImpulseTiers;                                // 0xC08(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FVector                               LastImpactNormal;                                  // 0xC18(0x18)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                        VerticalImpulseRatio;                              // 0xC30(0x28)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UBuoyancyComponent*                    BuoyancyComponent;                                 // 0xC58(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                       NextImminentCollisionTime;                         // 0xC60(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       TimeBetweenImminentCollisions;                     // 0xC68(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*              MatReference;                                      // 0xC70(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                       BreakTreeDamage;                                   // 0xC78(0x8)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	double                                       NextPotentialLaunchTime;                           // 0xC80(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       LaunchDelay;                                       // 0xC88(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                          TreeDestructionBurstCue;                           // 0xC90(0x4)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_A086[0xC];                                     // Fixing Size After Last Property..
	struct FTransform                            TreeDestructionTransform;                          // 0xCA0(0x60)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        CachedDamageValue;                                 // 0xD00(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_A087[0x4];                                     // Fixing Size After Last Property..
	double                                       SnowTimerValue;                                    // 0xD08(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                          SnowRemovalTimerHandle;                            // 0xD10(0x8)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UFXSystemComponent*                    WaterFxPhysicsTreeMiddle;                          // 0xD18(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UFXSystemComponent*>            FxSystemArray;                                     // 0xD20(0x10)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	double                                       WaterFxPlaneDepth;                                 // 0xD30(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                               WaterFxPlaneLocation;                              // 0xD38(0x18)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        WaterFxIndex;                                      // 0xD50(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_A088[0x4];                                     // Fixing Size After Last Property..
	class UFXSystemComponent*                    WaterFxPhysicsTreeTop;                             // 0xD58(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UFXSystemComponent*                    WaterFxPhysicsTreeBottom;                          // 0xD60(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                          WaterSurfaceInfoTimer;                             // 0xD68(0x8)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FVector                               WaterFxPlaneNormal;                                // 0xD70(0x18)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_FluidSim_FN_C*                     FluidSim;                                          // 0xD88(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TMap<class FName, class FName>               Sockets_And_Endpoints;                             // 0xD90(0x50)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FFluidForceDynamic                    Fluid_Force_Dynamic;                               // 0xDE0(0x70)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference, HasGetValueTypeHash)
	double                                       LogLength;                                         // 0xE50(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         CanPlayDeathEffects;                               // 0xE58(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_A089[0x7];                                     // Fixing Size After Last Property..
	struct FScalableFloat                        bSplitWhenCutBySaber;                              // 0xE60(0x28)(Edit, BlueprintVisible, DisableEditOnInstance)

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("BGA_PhysicsTreeLog_C");
		return Clss;
	}

	void CalculateSplitOffset(bool bSmallSide, double SplitPercentage, double* LocalZOffset, double CallFunc_Divide_DoubleDouble_ReturnValue, double CallFunc_Subtract_DoubleDouble_ReturnValue, double CallFunc_Multiply_DoubleDouble_ReturnValue, double CallFunc_Multiply_DoubleDouble_ReturnValue_1, double CallFunc_Subtract_DoubleDouble_ReturnValue_1, double CallFunc_Divide_DoubleDouble_ReturnValue_1, double CallFunc_Multiply_DoubleDouble_ReturnValue_2);
	void CalculateSplitScale(bool bSmallSide, double SplitPercentage, double* SplitScale, double CallFunc_Subtract_DoubleDouble_ReturnValue, const struct FTransform& CallFunc_K2_GetComponentToWorld_ReturnValue, const struct FVector& CallFunc_BreakTransform_Location, const struct FRotator& CallFunc_BreakTransform_Rotation, const struct FVector& CallFunc_BreakTransform_Scale, double CallFunc_BreakVector_X, double CallFunc_BreakVector_Y, double CallFunc_BreakVector_Z, double CallFunc_Multiply_DoubleDouble_ReturnValue, double CallFunc_Multiply_DoubleDouble_ReturnValue_1);
	class UB_PhysicsTree_Reporter_C* GetAnalyticsReporterActor(bool* Success, bool CallFunc_IsServer_ReturnValue, const struct FTransform& CallFunc_MakeTransform_ReturnValue, class UActor* CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue, class UB_PhysicsTree_Reporter_C* CallFunc_GetActorOfClass_ReturnValue, class UB_PhysicsTree_Reporter_C* CallFunc_FinishSpawningActor_ReturnValue, bool CallFunc_IsValid_ReturnValue);
	void ReportTreeFellingToAnalytics(class UActor* FelledBy, const class FString& Feller, class UB_PhysicsTree_Reporter_C* CallFunc_GetAnalyticsReporterActor_ReturnValue, bool CallFunc_GetAnalyticsReporterActor_Success, class UActor* CallFunc_GetOwner_ReturnValue, bool CallFunc_IsValid_ReturnValue, class UFortPlayerPawnAthena* K2Node_DynamicCast_AsFort_Player_Pawn_Athena, bool K2Node_DynamicCast_bSuccess, class UFortPlayerStateAthena* K2Node_DynamicCast_AsFort_Player_State_Athena, bool K2Node_DynamicCast_bSuccess_1, const class FString& CallFunc_GetObjectName_ReturnValue, const struct FUniqueNetIdRepl& CallFunc_GetPlayerUniqueNetID_ReturnValue, const class FString& CallFunc_GetDebugStringForUniqueId_ReturnValue, bool CallFunc_IsServer_ReturnValue, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue, const class FString& CallFunc_GetObjectName_ReturnValue_1);
	void OnRep_BreakTreeDamage(int32 Temp_int_Variable, int32 CallFunc_Add_IntInt_ReturnValue, TArray<class FName>& CallFunc_GetAllSocketNames_ReturnValue, class FName CallFunc_Array_Get_Item, int32 CallFunc_Array_Length_ReturnValue, const struct FTransform& CallFunc_GetSocketTransform_ReturnValue, int32 CallFunc_Subtract_IntInt_ReturnValue, const struct FVector& CallFunc_BreakTransform_Location, const struct FRotator& CallFunc_BreakTransform_Rotation, const struct FVector& CallFunc_BreakTransform_Scale, double CallFunc_Conv_IntToDouble_ReturnValue, class UFXSystemComponent* CallFunc_SpawnFXAtLocation_ReturnValue, double CallFunc_Animate_Float_Curve_Value, bool CallFunc_Animate_Float_Curve_bIsComplete, int32 CallFunc_FCeil_ReturnValue, double CallFunc_Conv_IntToDouble_ReturnValue_1, double CallFunc_Divide_DoubleDouble_ReturnValue, int32 CallFunc_Min_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue_1, int32 CallFunc_Min_ReturnValue_1, bool CallFunc_LessEqual_IntInt_ReturnValue, float CallFunc_SetFloatParameter_Param_ImplicitCast, float CallFunc_SetScalarParameterValueOnMaterials_ParameterValue_ImplicitCast);
	void GetPlayerImpulseVelocityFromImpactVelocity(double Impact, bool* Minimum_Met, double* Impulse, double ReturnImpulseVelocity, int32 Temp_int_Array_Index_Variable, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Subtract_IntInt_ReturnValue, bool CallFunc_GreaterEqual_DoubleDouble_ReturnValue, bool CallFunc_GreaterEqual_IntInt_ReturnValue, const struct FScalableFloat& CallFunc_Array_Get_Item, const struct FScalableFloat& CallFunc_Array_Get_Item_1, float CallFunc_GetValueAtLevel_ReturnValue, float CallFunc_GetValueAtLevel_ReturnValue_1, bool CallFunc_GreaterEqual_DoubleDouble_ReturnValue_1, int32 CallFunc_Array_Length_ReturnValue, int32 CallFunc_Subtract_IntInt_ReturnValue_1, int32 CallFunc_Max_ReturnValue, double K2Node_VariableSet_ReturnImpulseVelocity_ImplicitCast, double CallFunc_GreaterEqual_DoubleDouble_B_ImplicitCast);
	void ReceiveBeginPlay();
	void OnComponentHit_Event_0(class UPrimitiveComponent* HitComponent, class UActor* OtherActor, class UPrimitiveComponent* OtherComp, const struct FVector& NormalImpulse, struct FHitResult& Hit);
	void LogDamaged(class UActor* DamagedActor, float Damage, class UController* InstigatedBy, class UActor* DamageCauser, const struct FVector& HitLocation, class UPrimitiveComponent* FHitComponent, class FName BoneName, const struct FVector& Momentum);
	void OnDeathPlayEffects(float Damage, struct FGameplayTagContainer& DamageTags, const struct FVector& Momentum, struct FHitResult& HitInfo, class UFortPawn* InstigatedBy, class UActor* DamageCauser, const struct FGameplayEffectContextHandle& EffectContext);
	void RemoveSnow();
	void CE_SplashInWater(const struct FVector& SplashLocation);
	void OnDeathServer(float Damage, struct FGameplayTagContainer& DamageTags, const struct FVector& Momentum, struct FHitResult& HitInfo, class UController* InstigatedBy, class UActor* DamageCauser, const struct FGameplayEffectContextHandle& EffectContext);
	void AdjustWaterSettings();
	void Update_Water_FX();
	void AwakeStateChanged(class UPrimitiveComponent* SimulatingComponent, bool bIsAwake);
	void Control2dSimForces();
	void OnPontoonEnteredWater(struct FSphericalPontoon& Pontoon);
	void OnPontoonExitedWater(struct FSphericalPontoon& Pontoon);
	void ReceiveEndPlay(enum class EEndPlayReason EndPlayReason);
	void ExecuteUbergraph_BGA_PhysicsTreeLog(int32 EntryPoint, float CallFunc_GetMaxHealth_ReturnValue, double CallFunc_GetTimeSeconds_ReturnValue, double CallFunc_GetTimeSeconds_ReturnValue_1, double CallFunc_Add_DoubleDouble_ReturnValue, float CallFunc_GetHealth_ReturnValue, double CallFunc_Divide_DoubleDouble_ReturnValue, double CallFunc_Subtract_DoubleDouble_ReturnValue, bool CallFunc_Greater_DoubleDouble_ReturnValue, const struct FTransform& CallFunc_K2_GetComponentToWorld_ReturnValue, const struct FGameplayCueParameters& CallFunc_MakeGameplayCueParameters_ReturnValue, float K2Node_Event_Damage_1, const struct FGameplayTagContainer& K2Node_Event_DamageTags_1, const struct FVector& K2Node_Event_Momentum_1, const struct FHitResult& K2Node_Event_HitInfo_1, class UFortPawn* K2Node_Event_InstigatedBy_1, class UActor* K2Node_Event_DamageCauser_1, const struct FGameplayEffectContextHandle& K2Node_Event_EffectContext_1, class UFortPhysicsObjectComponent* CallFunc_GetPhysicsObjectComponent_ReturnValue, double CallFunc_Add_DoubleDouble_ReturnValue_1, bool CallFunc_IsInWaterBody_ReturnValue, bool CallFunc_LessEqual_DoubleDouble_ReturnValue, double CallFunc_MultiplyMultiply_FloatFloat_ReturnValue, double CallFunc_MultiplyMultiply_FloatFloat_ReturnValue_1, double CallFunc_Lerp_ReturnValue, double CallFunc_Lerp_ReturnValue_1, class UBuoyancyComponent* CallFunc_GetComponentByClass_ReturnValue, bool CallFunc_IsServer_ReturnValue, bool CallFunc_IsInWaterBody_ReturnValue_1, class UPawn* CallFunc_GetPlayerPawn_ReturnValue, class UClass* CallFunc_GetObjectClass_ReturnValue, class UFortPhysicsObjectComponent* CallFunc_GetPhysicsObjectComponent_ReturnValue_1, float CallFunc_GetValueAtLevel_ReturnValue, double CallFunc_VSize_ReturnValue, const struct FVector& CallFunc_MakeVector_ReturnValue, bool CallFunc_LessEqual_DoubleDouble_ReturnValue_1, class UNiagaraComponent* CallFunc_SpawnSystemAttached_ReturnValue, class UNiagaraComponent* CallFunc_SpawnSystemAttached_ReturnValue_1, class UNiagaraComponent* CallFunc_SpawnSystemAttached_ReturnValue_2, const struct FVector& K2Node_CustomEvent_SplashLocation, const struct FVector& CallFunc_Multiply_VectorVector_ReturnValue, const struct FVector& CallFunc_GetVelocity_ReturnValue, const struct FVector& CallFunc_Add_VectorVector_ReturnValue, double CallFunc_VSize_ReturnValue_1, const struct FVector& CallFunc_Normal_ReturnValue, bool CallFunc_GetPlayerImpulseVelocityFromImpactVelocity_Minimum_Met, double CallFunc_GetPlayerImpulseVelocityFromImpactVelocity_Impulse, int32 Temp_int_Loop_Counter_Variable, const struct FVector& CallFunc_Conv_DoubleToVector_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue, const struct FVector& CallFunc_Multiply_VectorVector_ReturnValue_1, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_1, const struct FTimerHandle& CallFunc_K2_SetTimerDelegate_ReturnValue, float K2Node_Event_Damage, const struct FGameplayTagContainer& K2Node_Event_DamageTags, const struct FVector& K2Node_Event_Momentum, const struct FHitResult& K2Node_Event_HitInfo, class UController* K2Node_Event_InstigatedBy, class UActor* K2Node_Event_DamageCauser, const struct FGameplayEffectContextHandle& K2Node_Event_EffectContext, class UB_PhysicsTree_Reporter_C* CallFunc_GetAnalyticsReporterActor_ReturnValue, bool CallFunc_GetAnalyticsReporterActor_Success, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue, const class FString& CallFunc_GetObjectName_ReturnValue, class UActor* K2Node_CustomEvent_DamagedActor, float K2Node_CustomEvent_Damage, class UController* K2Node_CustomEvent_InstigatedBy, class UActor* K2Node_CustomEvent_DamageCauser, const struct FVector& K2Node_CustomEvent_HitLocation, class UPrimitiveComponent* K2Node_CustomEvent_FHitComponent, class FName K2Node_CustomEvent_BoneName, const struct FVector& K2Node_CustomEvent_Momentum, class UFortPlayerPawn* K2Node_DynamicCast_AsFort_Player_Pawn, bool K2Node_DynamicCast_bSuccess, bool CallFunc_IsOverlappingWaterBody_ReturnValue, class UFortPhysicsObjectComponent* CallFunc_GetPhysicsObjectComponent_ReturnValue_2, bool CallFunc_IsActive_ReturnValue, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_2, double CallFunc_Conv_IntToDouble_ReturnValue, int32 CallFunc_Array_Length_ReturnValue, class UPrimitiveComponent* K2Node_CustomEvent_HitComponent, class UActor* K2Node_CustomEvent_OtherActor, class UPrimitiveComponent* K2Node_CustomEvent_OtherComp, const struct FVector& K2Node_CustomEvent_NormalImpulse, const struct FHitResult& K2Node_CustomEvent_Hit, const struct FVector& CallFunc_GetLastWaterSurfaceInfo_OutWaterPlaneLocation, const struct FVector& CallFunc_GetLastWaterSurfaceInfo_OutWaterPlaneNormal, const struct FVector& CallFunc_GetLastWaterSurfaceInfo_OutWaterSurfacePosition, float CallFunc_GetLastWaterSurfaceInfo_OutWaterDepth, int32 CallFunc_GetLastWaterSurfaceInfo_OutWaterBodyIdx, const struct FVector& CallFunc_GetLastWaterSurfaceInfo_OutWaterVelocity, bool CallFunc_BreakHitResult_bBlockingHit, bool CallFunc_BreakHitResult_bInitialOverlap, float CallFunc_BreakHitResult_Time, float CallFunc_BreakHitResult_Distance, const struct FVector& CallFunc_BreakHitResult_Location, const struct FVector& CallFunc_BreakHitResult_ImpactPoint, const struct FVector& CallFunc_BreakHitResult_Normal, const struct FVector& CallFunc_BreakHitResult_ImpactNormal, class UPhysicalMaterial* CallFunc_BreakHitResult_PhysMat, class UActor* CallFunc_BreakHitResult_HitActor, class UPrimitiveComponent* CallFunc_BreakHitResult_HitComponent, class FName CallFunc_BreakHitResult_HitBoneName, class FName CallFunc_BreakHitResult_BoneName, int32 CallFunc_BreakHitResult_HitItem, int32 CallFunc_BreakHitResult_ElementIndex, int32 CallFunc_BreakHitResult_FaceIndex, const struct FVector& CallFunc_BreakHitResult_TraceStart, const struct FVector& CallFunc_BreakHitResult_TraceEnd, const struct FRotator& CallFunc_Conv_VectorToRotator_ReturnValue, int32 CallFunc_Conv_ByteToInt_ReturnValue, const struct FTransform& CallFunc_MakeTransform_ReturnValue, const struct FHitResult& CallFunc_K2_SetWorldTransform_SweepHitResult, double CallFunc_VSize_ReturnValue_2, class UFortPlayerPawn* K2Node_DynamicCast_AsFort_Player_Pawn_1, bool K2Node_DynamicCast_bSuccess_1, double CallFunc_Multiply_DoubleDouble_ReturnValue, double CallFunc_FClamp_ReturnValue, class UPrimitiveComponent* CallFunc_GetMovementBase_ReturnValue, class UClass* CallFunc_GetObjectClass_ReturnValue_1, bool CallFunc_EqualEqual_ObjectObject_ReturnValue, bool CallFunc_NotEqual_ClassClass_ReturnValue, bool CallFunc_IsDedicatedServer_ReturnValue, class UFXSystemComponent* CallFunc_SpawnFXSystemAttached_ReturnValue, bool CallFunc_IsValid_ReturnValue, bool CallFunc_IsValid_ReturnValue_1, class UFXSystemComponent* CallFunc_SpawnFXSystemAttached_ReturnValue_1, int32 Temp_int_Array_Index_Variable, TArray<class UBP_FluidSim_FN_C*>& CallFunc_GetAllActorsOfClass_OutActors, class UBP_FluidSim_FN_C* CallFunc_Array_Get_Item, int32 Temp_int_Array_Index_Variable_1, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_3, class UPrimitiveComponent* K2Node_CustomEvent_SimulatingComponent, bool K2Node_CustomEvent_bIsAwake, int32 Temp_int_Array_Index_Variable_2, class UFXSystemComponent* CallFunc_Array_Get_Item_1, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_4, const struct FTimerHandle& CallFunc_K2_SetTimerDelegate_ReturnValue_1, int32 Temp_int_Loop_Counter_Variable_1, int32 CallFunc_Add_IntInt_ReturnValue_1, int32 CallFunc_Array_Add_ReturnValue, int32 CallFunc_Array_Add_ReturnValue_1, int32 CallFunc_Array_Add_ReturnValue_2, class UFXSystemComponent* CallFunc_SpawnFXSystemAttached_ReturnValue_2, bool CallFunc_IsValid_ReturnValue_2, int32 Temp_int_Loop_Counter_Variable_2, int32 Temp_int_Array_Index_Variable_3, bool CallFunc_Less_IntInt_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue_2, int32 Temp_int_Loop_Counter_Variable_3, bool CallFunc_IsDedicatedServer_ReturnValue_1, int32 CallFunc_Add_IntInt_ReturnValue_3, bool CallFunc_IsDedicatedServer_ReturnValue_2, TArray<class USceneComponent*>& CallFunc_GetChildrenComponents_Children, TArray<class USceneComponent*>& CallFunc_GetChildrenComponents_Children_1, class USceneComponent* CallFunc_Array_Get_Item_2, class USceneComponent* CallFunc_Array_Get_Item_3, int32 CallFunc_Array_Length_ReturnValue_1, int32 CallFunc_Array_Length_ReturnValue_2, bool CallFunc_Less_IntInt_ReturnValue_1, bool CallFunc_Less_IntInt_ReturnValue_2, TArray<class USceneComponent*>& CallFunc_GetChildrenComponents_Children_2, class USceneComponent* CallFunc_Array_Get_Item_4, int32 CallFunc_Array_Length_ReturnValue_3, bool CallFunc_Less_IntInt_ReturnValue_3, bool CallFunc_IsOverlappingWaterBody_ReturnValue_1, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_5, const struct FSphericalPontoon& K2Node_CustomEvent_Pontoon_1, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_6, bool K2Node_SwitchName_CmpSuccess, const struct FSphericalPontoon& K2Node_CustomEvent_Pontoon, bool K2Node_SwitchName_CmpSuccess_1, class UFortPhysicsObjectComponent* CallFunc_GetPhysicsObjectComponent_ReturnValue_3, enum class EEndPlayReason K2Node_Event_EndPlayReason, class UFortPhysicsObjectComponent* CallFunc_GetPhysicsObjectComponent_ReturnValue_4, int32 CallFunc_GetCachedRidingPlayersInfo_NumberOfCachedPlayer, TArray<struct FVector>& CallFunc_GetCachedRidingPlayersInfo_OnBoardLocation, TArray<struct FVector>& CallFunc_GetCachedRidingPlayersInfo_OffBoardLocation, TArray<float>& CallFunc_GetCachedRidingPlayersInfo_SessionLength, double CallFunc_Divide_DoubleDouble_B_ImplicitCast, double CallFunc_Divide_DoubleDouble_A_ImplicitCast, float CallFunc_SetScalarParameterValueOnMaterials_ParameterValue_ImplicitCast, float CallFunc_SetScalarParameterValueOnMaterials_ParameterValue_ImplicitCast_1, double CallFunc_MakeVector_Z_ImplicitCast, float CallFunc_SetFloatParameter_Param_ImplicitCast, float CallFunc_SetFloatParameter_Param_ImplicitCast_1, double K2Node_VariableSet_WaterFxPlaneDepth_ImplicitCast, float CallFunc_SetVariableFloat_InValue_ImplicitCast);
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
