#pragma once

// Dumper.

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x320 (0xF30 - 0xC10)
// BlueprintGeneratedClass BP_GrindingComponent.BP_GrindingComponent_C
class UBP_GrindingComponent_C : public UFortPawnComponent_GrindRail
{
public:
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0xC10(0x8)(ZeroConstructor, Transient, DuplicateTransient)
	class UPlayerPawn_Athena_C*                  Player;                                            // 0xC18(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UCharacterMovementComponent*           MovementComponent;                                 // 0xC20(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                         Grinding;                                          // 0xC28(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_A27D[0x3];                                     // Fixing Size After Last Property..
	float                                        Delta_Seconds;                                     // 0xC2C(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTacticalSprintEnergyComponent_C*      SprintComponent;                                   // 0xC30(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                          GC_Sprint;                                         // 0xC38(0x4)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_A27E[0x4];                                     // Fixing Size After Last Property..
	class USkeletalMeshComponent*                PlayerMesh;                                        // 0xC40(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                         CurrentlyADS;                                      // 0xC48(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         AnimLayerActive;                                   // 0xC49(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_A27F[0x6];                                     // Fixing Size After Last Property..
	double                                       LastRailSwitchTime;                                // 0xC50(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_            JumpedOff;                                         // 0xC58(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UBGA_GrindRail_C*                      CurrentRail;                                       // 0xC68(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                       MaximumAngleForSideJump;                           // 0xC70(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        SideJump_NumberOfNewLocationsToTry;                // 0xC78(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_A280[0x4];                                     // Fixing Size After Last Property..
	double                                       SideJump_MinSpeedPercentToMaintain;                // 0xC80(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       SideJump_MaxSpeedWithoutAnchor;                    // 0xC88(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         DrawAnchorDebug;                                   // 0xC90(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_A281[0x7];                                     // Fixing Size After Last Property..
	struct FScalableFloat                        SF_Sprinting_EnergyToUsePerSecond;                 // 0xC98(0x28)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                        SF_LandingSpeedBoost;                              // 0xCC0(0x28)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                        SF_SameRailAnchoring_MaxForwardDistanceMultiplier; // 0xCE8(0x28)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                        SF_SameRailAnchoring_MaxAngle;                     // 0xD10(0x28)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                        SF_InfluenceOfMomentumOnAnchorJump;                // 0xD38(0x28)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                        SF_NoAnchorJumpDistanceMultiplier;                 // 0xD60(0x28)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                        SF_MinJumpOffSpeed;                                // 0xD88(0x28)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                        SF_JumpHeight;                                     // 0xDB0(0x28)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                        SF_JumpDistanceMultiplier;                         // 0xDD8(0x28)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                        SF_SpeedMultiplierWhenImpactedPlayer;              // 0xE00(0x28)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                        SF_SideJump_HorizontalAngleMultiplier;             // 0xE28(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_A282[0x4];                                     // Fixing Size After Last Property..
	double                                       LastJumpedTime;                                    // 0xE30(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class EGrindRailBoosterMode             _new__PreviousBoosterMode;                         // 0xE38(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         _new__GenerallyAccelerating;                       // 0xE39(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_A283[0x2];                                     // Fixing Size After Last Property..
	struct FGameplayTag                          GC_GenerallyAccelerating;                          // 0xE3C(0x4)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                 BeginGrindBlockTags;                               // 0xE40(0x20)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FVector                               CameraLocationOnStartedGrinding;                   // 0xE60(0x18)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortGrindRail*                        WaitingForCamera_SavedGrindRail;                   // 0xE78(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                         WaitingForCamera;                                  // 0xE80(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_A284[0x7];                                     // Fixing Size After Last Property..
	class UCameraModifier_Grinding_C*            CameraModifier;                                    // 0xE88(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                         StartedGrindFromLand;                              // 0xE90(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_A285[0x7];                                     // Fixing Size After Last Property..
	FMulticastInlineDelegateProperty_            OnFeetLanded;                                      // 0xE98(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FScalableFloat                        SF_MinBounceOffPlayerSpeed;                        // 0xEA8(0x28)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                         IgnoreStaticPlacedBuilding;                        // 0xED0(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         UseNativizedGrindingIgnoreActors;                  // 0xED1(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         UseNativizedSprintInput;                           // 0xED2(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_A286[0x1];                                     // Fixing Size After Last Property..
	struct FGameplayTag                          Start_Grinding_Event_Tag;                          // 0xED4(0x4)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                          Stop_Grinding_Event_Tag;                           // 0xED8(0x4)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                          Start_Sprinting_Event_Tag;                         // 0xEDC(0x4)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                         AudioLandedPlayed;                                 // 0xEE0(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         SoundLibraryAdded;                                 // 0xEE1(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_A287[0x6];                                     // Fixing Size After Last Property..
	double                                       CurrentMaxSpeed;                                   // 0xEE8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         HitObstacle;                                       // 0xEF0(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_A288[0x7];                                     // Fixing Size After Last Property..
	class UAudioComponent*                       JumpOnAudio;                                       // 0xEF8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                          RemoveIsGrindingTimer;                             // 0xF00(0x8)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                        SF_RemoveGASmashAfterDelay;                        // 0xF08(0x28)(Edit, BlueprintVisible, DisableEditOnInstance)

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("BP_GrindingComponent_C");
		return Clss;
	}

	void Play_Land_Sound(const struct FGameplayTag& Temp_struct_Variable, const struct FGameplayTag& Temp_struct_Variable_1, class USoundLibrarySubsystem* CallFunc_GetWorldSubsystem_ReturnValue, bool CallFunc_IsValid_ReturnValue, bool Temp_bool_Variable, bool CallFunc_IsValid_ReturnValue_1, const struct FGameplayTag& K2Node_Select_Default, class USceneComponent* CallFunc_K2_GetRootComponent_ReturnValue, const struct FSoundLibrarySimpleContextSettings& K2Node_MakeStruct_SoundLibrarySimpleContextSettings, const struct FSoundLibraryPlayResult& CallFunc_PlaySoundSimple_ReturnValue);
