#pragma once

// Dumper.

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// ENUMS
//---------------------------------------------------------------------------------------------------------------------

enum class EContextualAnimPointType : uint8
{
	FirstFrame                     = 0,
	SyncFrame                      = 1,
	LastFrame                      = 2,
	EContextualAnimPointType_MAX   = 3,
};

enum class EContextualAnimCriterionToConsider : uint8
{
	All                            = 0,
	Spatial                        = 1,
	Other                          = 2,
	EContextualAnimCriterionToConsider_MAX = 3,
};

enum class EContextualAnimActorPreviewType : uint8
{
	SkeletalMesh                   = 0,
	StaticMesh                     = 1,
	Actor                          = 2,
	None                           = 3,
	EContextualAnimActorPreviewType_MAX = 4,
};

enum class EContextualAnimCriterionType : uint8
{
	Spatial                        = 0,
	Other                          = 1,
	EContextualAnimCriterionType_MAX = 2,
};

enum class EContextualAnimCriterionConeMode : uint8
{
	ToPrimary                      = 0,
	FromPrimary                    = 1,
	EContextualAnimCriterionConeMode_MAX = 2,
};

enum class EContextualAnimCriterionDistanceMode : uint8
{
	Distance_3D                    = 0,
	Distance_2D                    = 1,
	Distance_MAX                   = 2,
};

enum class EContextualAnimJoinRule : uint8
{
	Default                        = 0,
	Late                           = 1,
	EContextualAnimJoinRule_MAX    = 2,
};

enum class EContextualAnimIKTargetProvider : uint8
{
	Autogenerated                  = 0,
	Bone                           = 1,
	EContextualAnimIKTargetProvider_MAX = 2,
};

enum class EContextualAnimWarpPointDefinitionMode : uint8
{
	PrimaryActor                   = 0,
	Socket                         = 1,
	Custom                         = 2,
	EContextualAnimWarpPointDefinitionMode_MAX = 3,
};


//---------------------------------------------------------------------------------------------------------------------
// STRUCTS
//---------------------------------------------------------------------------------------------------------------------

// 0x40 (0x40 - 0x0)
// ScriptStruct ContextualAnimation.ContextualAnimWarpTarget
struct FContextualAnimWarpTarget
{
public:
	class FName                                  Role;                                              // 0x0(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  TargetName;                                        // 0x4(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               TargetLocation;                                    // 0x8(0x18)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FQuat                                 TargetRotation;                                    // 0x20(0x20)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// ScriptStruct ContextualAnimation.ContextualAnimRepData
struct FContextualAnimRepData
{
public:
	uint8                                        RepCounter;                                        // 0x0(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xD0 (0xD0 - 0x0)
// ScriptStruct ContextualAnimation.ContextualAnimSceneBindingContext
struct FContextualAnimSceneBindingContext
{
public:
	TWeakObjectPtr<class UActor>                 Actor;                                             // 0x0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TWeakObjectPtr<class UContextualAnimSceneActorComponent> CachedSceneActorComp;                              // 0x8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TWeakObjectPtr<class UAnimInstance>          CachedAnimInstance;                                // 0x10(0x8)(ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TWeakObjectPtr<class USkeletalMeshComponent> CachedSkeletalMesh;                                // 0x18(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_4702[0xB0];                                    // Fixing Size Of Struct..
};

// 0xE0 (0xE0 - 0x0)
// ScriptStruct ContextualAnimation.ContextualAnimSceneBinding
struct FContextualAnimSceneBinding
{
public:
	struct FContextualAnimSceneBindingContext    Context;                                           // 0x0(0xD0)(ContainsInstancedReference, NativeAccessSpecifierPrivate)
	int32                                        AnimTrackIdx;                                      // 0xD0(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_4703[0xC];                                     // Fixing Size Of Struct..
};

// 0x28 (0x28 - 0x0)
// ScriptStruct ContextualAnimation.ContextualAnimSceneBindings
struct FContextualAnimSceneBindings
{
public:
	uint8                                        ID;                                                // 0x0(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_4704[0x7];                                     // Fixing Size After Last Property..
	class UContextualAnimSceneAsset*             SceneAsset;                                        // 0x8(0x8)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                        SectionIdx;                                        // 0x10(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                        AnimSetIdx;                                        // 0x14(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<struct FContextualAnimSceneBinding>   Data;                                              // 0x18(0x10)(ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
};

// 0x3F (0x40 - 0x1)
// ScriptStruct ContextualAnimation.ContextualAnimRepBindingsData
struct FContextualAnimRepBindingsData : public FContextualAnimRepData
{
public:
	uint8                                        Pad_4705[0x7];                                     // Fixing Size After Last Property..
	struct FContextualAnimSceneBindings          Bindings;                                          // 0x8(0x28)(ContainsInstancedReference, NativeAccessSpecifierPublic)
	TArray<struct FContextualAnimWarpTarget>     ExternalWarpTargets;                               // 0x30(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x27 (0x28 - 0x1)
// ScriptStruct ContextualAnimation.ContextualAnimRepLateJoinData
struct FContextualAnimRepLateJoinData : public FContextualAnimRepData
{
public:
	uint8                                        Pad_4706[0x7];                                     // Fixing Size After Last Property..
	class UActor*                                Actor;                                             // 0x8(0x8)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  Role;                                              // 0x10(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_4707[0x4];                                     // Fixing Size After Last Property..
	TArray<struct FContextualAnimWarpTarget>     ExternalWarpTargets;                               // 0x18(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x17 (0x18 - 0x1)
// ScriptStruct ContextualAnimation.ContextualAnimRepTransitionData
struct FContextualAnimRepTransitionData : public FContextualAnimRepData
{
public:
	uint8                                        ID;                                                // 0x1(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        SectionIdx;                                        // 0x2(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        AnimSetIdx;                                        // 0x3(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_4708[0x4];                                     // Fixing Size After Last Property..
	TArray<struct FContextualAnimWarpTarget>     ExternalWarpTargets;                               // 0x8(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x28 (0x28 - 0x0)
// ScriptStruct ContextualAnimation.ContextualAnimAlignmentTrackContainer
struct FContextualAnimAlignmentTrackContainer
{
public:
	struct FAnimSequenceTrackContainer           Tracks;                                            // 0x0(0x20)(NativeAccessSpecifierPublic)
	float                                        SampleInterval;                                    // 0x20(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_4709[0x4];                                     // Fixing Size Of Struct..
};

// 0xE0 (0xE0 - 0x0)
// ScriptStruct ContextualAnimation.ContextualAnimTrack
struct FContextualAnimTrack
{
public:
	class UAnimSequenceBase*                     Animation;                                         // 0x0(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        AnimMaxStartTime;                                  // 0x8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bRequireFlyingMode;                                // 0xC(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bOptional;                                         // 0xD(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_470A[0x2];                                     // Fixing Size After Last Property..
	struct FContextualAnimAlignmentTrackContainer AlignmentData;                                     // 0x10(0x28)(NativeAccessSpecifierPublic)
	struct FContextualAnimAlignmentTrackContainer IKTargetData;                                      // 0x38(0x28)(NativeAccessSpecifierPublic)
	TArray<class UContextualAnimSelectionCriterion*> SelectionCriteria;                                 // 0x60(0x10)(Edit, ExportObject, ZeroConstructor, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPublic)
	struct FTransform                            MeshToScene;                                       // 0x70(0x60)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  Role;                                              // 0xD0(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        SectionIdx;                                        // 0xD4(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        AnimSetIdx;                                        // 0xD8(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        AnimTrackIdx;                                      // 0xDC(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x68 (0x68 - 0x0)
// ScriptStruct ContextualAnimation.ContextualAnimSet
struct FContextualAnimSet
{
public:
	TArray<struct FContextualAnimTrack>          Tracks;                                            // 0x0(0x10)(Edit, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	TMap<class FName, struct FTransform>         WarpPoints;                                        // 0x10(0x50)(Edit, NativeAccessSpecifierPublic)
	float                                        RandomWeight;                                      // 0x60(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_470B[0x4];                                     // Fixing Size Of Struct..
};

// 0x14 (0x14 - 0x0)
// ScriptStruct ContextualAnimation.ContextualAnimIKTargetDefinition
struct FContextualAnimIKTargetDefinition
{
public:
	class FName                                  GoalName;                                          // 0x0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  BoneName;                                          // 0x4(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EContextualAnimIKTargetProvider   Provider;                                          // 0x8(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_470C[0x3];                                     // Fixing Size After Last Property..
	class FName                                  TargetRoleName;                                    // 0xC(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  TargetBoneName;                                    // 0x10(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// ScriptStruct ContextualAnimation.ContextualAnimIKTargetDefContainer
struct FContextualAnimIKTargetDefContainer
{
public:
	TArray<struct FContextualAnimIKTargetDefinition> IKTargetDefs;                                      // 0x0(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// ScriptStruct ContextualAnimation.ContextualAnimWarpPointCustomParams
struct FContextualAnimWarpPointCustomParams
{
public:
	class FName                                  Origin;                                            // 0x0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bAlongClosestDistance;                             // 0x4(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_470D[0x3];                                     // Fixing Size After Last Property..
	class FName                                  OtherRole;                                         // 0x8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        Weight;                                            // 0xC(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1C (0x1C - 0x0)
// ScriptStruct ContextualAnimation.ContextualAnimWarpPointDefinition
struct FContextualAnimWarpPointDefinition
{
public:
	class FName                                  WarpTargetName;                                    // 0x0(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EContextualAnimWarpPointDefinitionMode Mode;                                              // 0x4(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_470E[0x3];                                     // Fixing Size After Last Property..
	class FName                                  SocketName;                                        // 0x8(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FContextualAnimWarpPointCustomParams  Params;                                            // 0xC(0x10)(Edit, NoDestructor, NativeAccessSpecifierPublic)
};

// 0x78 (0x78 - 0x0)
// ScriptStruct ContextualAnimation.ContextualAnimSceneSection
struct FContextualAnimSceneSection
{
public:
	class FName                                  Name;                                              // 0x0(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_470F[0x4];                                     // Fixing Size After Last Property..
	TArray<struct FContextualAnimSet>            AnimSets;                                          // 0x8(0x10)(Edit, ZeroConstructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	TMap<class FName, struct FContextualAnimIKTargetDefContainer> RoleToIKTargetDefsMap;                             // 0x18(0x50)(Edit, Protected, NativeAccessSpecifierProtected)
	TArray<struct FContextualAnimWarpPointDefinition> WarpPointDefinitions;                              // 0x68(0x10)(Edit, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
};

// 0x80 (0x80 - 0x0)
// ScriptStruct ContextualAnimation.ContextualAnimPoint
struct FContextualAnimPoint
{
public:
	class FName                                  Role;                                              // 0x0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_4710[0xC];                                     // Fixing Size After Last Property..
	struct FTransform                            Transform;                                         // 0x10(0x60)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        Speed;                                             // 0x70(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        SectionIdx;                                        // 0x74(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        AnimSetIdx;                                        // 0x78(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        AnimTrackIdx;                                      // 0x7C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xA8 (0xA8 - 0x0)
// ScriptStruct ContextualAnimation.ContextualAnimActorPreviewData
struct FContextualAnimActorPreviewData
{
public:
	class FName                                  Role;                                              // 0x0(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EContextualAnimActorPreviewType   Type;                                              // 0x4(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_4711[0x3];                                     // Fixing Size After Last Property..
	TSoftObjectPtr<class USkeletalMesh>          PreviewSkeletalMesh;                               // 0x8(0x28)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UAnimInstance>           PreviewAnimInstance;                               // 0x30(0x28)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UStaticMesh>            PreviewStaticMesh;                                 // 0x58(0x28)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UActor>                  PreviewActorClass;                                 // 0x80(0x28)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x70 (0x70 - 0x0)
// ScriptStruct ContextualAnimation.ContextualAnimIKTarget
struct FContextualAnimIKTarget
{
public:
	class FName                                  GoalName;                                          // 0x0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        Alpha;                                             // 0x4(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_4712[0x8];                                     // Fixing Size After Last Property..
	struct FTransform                            Transform;                                         // 0x10(0x60)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x70 (0x70 - 0x0)
// ScriptStruct ContextualAnimation.ContextualAnimRoleDefinition
struct FContextualAnimRoleDefinition
{
public:
	class FName                                  Name;                                              // 0x0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIsCharacter;                                      // 0x4(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_4713[0xB];                                     // Fixing Size After Last Property..
	struct FTransform                            MeshToComponent;                                   // 0x10(0x60)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x70 (0x70 - 0x0)
// ScriptStruct ContextualAnimation.ContextualAnimWarpPoint
struct FContextualAnimWarpPoint
{
public:
	class FName                                  Name;                                              // 0x0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_4714[0xC];                                     // Fixing Size After Last Property..
	struct FTransform                            Transform;                                         // 0x10(0x60)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x68 (0x68 - 0x0)
// ScriptStruct ContextualAnimation.ContextualAnimStartSceneParams
struct FContextualAnimStartSceneParams
{
public:
	TMap<class FName, struct FContextualAnimSceneBindingContext> RoleToActorMap;                                    // 0x0(0x50)(Edit, BlueprintVisible, ContainsInstancedReference, NativeAccessSpecifierPublic)
	int32                                        SectionIdx;                                        // 0x50(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        AnimSetIdx;                                        // 0x54(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_4715[0x10];                                    // Fixing Size Of Struct..
};

// 0xE0 (0xE0 - 0x0)
// ScriptStruct ContextualAnimation.ContextualAnimQueryResult
struct FContextualAnimQueryResult
{
public:
	TWeakObjectPtr<class UAnimMontage>           Animation;                                         // 0x0(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_4716[0x8];                                     // Fixing Size After Last Property..
	struct FTransform                            EntryTransform;                                    // 0x10(0x60)(BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTransform                            SyncTransform;                                     // 0x70(0x60)(BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        AnimStartTime;                                     // 0xD0(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        AnimSetIdx;                                        // 0xD4(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_4717[0x8];                                     // Fixing Size Of Struct..
};

// 0x80 (0x80 - 0x0)
// ScriptStruct ContextualAnimation.ContextualAnimQueryParams
struct FContextualAnimQueryParams
{
public:
	TWeakObjectPtr<class UActor>                 Querier;                                           // 0x0(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_4718[0x8];                                     // Fixing Size After Last Property..
	struct FTransform                            QueryTransform;                                    // 0x10(0x60)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bComplexQuery;                                     // 0x70(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bFindAnimStartTime;                                // 0x71(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_4719[0xE];                                     // Fixing Size Of Struct..
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
