#pragma once

// Dumper.

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

#include "../SDK.hpp"

namespace SDK
{
namespace Params
{
//---------------------------------------------------------------------------------------------------------------------
// PARAMETERS
//---------------------------------------------------------------------------------------------------------------------

// 0xB0 (0xB0 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Rprefix_U_2d_U_L_Nvector3_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Rprefix_U_2d_U_L_Nvector3_R_Params
{
public:
	struct FSpatialMath_vector3                  __verse_0xB2CDDD72_Argument;                       // 0x0(0x18)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FSpatialMath_vector3                  RetVal;                                            // 0x18(0x18)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_0;                                // 0x30(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_1;                                     // 0x80(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_2;                                     // 0x90(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_3;                                     // 0xA0(0x10)(HasGetValueTypeHash)
};

// 0x90 (0x90 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Rprefix_U_2d_U_L_Nvector2_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Rprefix_U_2d_U_L_Nvector2_R_Params
{
public:
	struct FSpatialMath_vector2                  __verse_0xB2CDDD72_Argument;                       // 0x0(0x10)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FSpatialMath_vector2                  RetVal;                                            // 0x10(0x10)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_0;                                // 0x20(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_1;                                     // 0x70(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_2;                                     // 0x80(0x10)(HasGetValueTypeHash)
};

// 0x90 (0x90 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Rprefix_U_2d_U_L_Nvector2i_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Rprefix_U_2d_U_L_Nvector2i_R_Params
{
public:
	struct FSpatialMath_vector2i                 __verse_0xB2CDDD72_Argument;                       // 0x0(0x10)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FSpatialMath_vector2i                 RetVal;                                            // 0x10(0x10)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_0;                                // 0x20(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_1;                                     // 0x70(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_2;                                     // 0x80(0x10)(HasGetValueTypeHash)
};

// 0x98 (0x98 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2f_U_L_Nvector2_M_Nfloat_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2f_U_L_Nvector2_M_Nfloat_R_Params
{
public:
	struct FTuple_Lvector2_Mfloat_R              __verse_0xB2CDDD72_Argument;                       // 0x0(0x18)(Parm, HasGetValueTypeHash)
	struct FSpatialMath_vector2                  RetVal;                                            // 0x18(0x10)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_0;                                // 0x28(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_1;                                     // 0x78(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_2;                                     // 0x88(0x10)(HasGetValueTypeHash)
};

// 0xC8 (0xC8 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2f_U_L_Nvector3_M_Nvector3_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2f_U_L_Nvector3_M_Nvector3_R_Params
{
public:
	struct FTuple_Lvector3_Mvector3_R            __verse_0xB2CDDD72_Argument;                       // 0x0(0x30)(Parm, HasGetValueTypeHash)
	struct FSpatialMath_vector3                  RetVal;                                            // 0x30(0x18)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_0;                                // 0x48(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_1;                                     // 0x98(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_2;                                     // 0xA8(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_3;                                     // 0xB8(0x10)(HasGetValueTypeHash)
};

// 0xB8 (0xB8 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2f_U_L_Nvector3_M_Nfloat_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2f_U_L_Nvector3_M_Nfloat_R_Params
{
public:
	struct FTuple_Lvector3_Mfloat_R              __verse_0xB2CDDD72_Argument;                       // 0x0(0x20)(Parm, HasGetValueTypeHash)
	struct FSpatialMath_vector3                  RetVal;                                            // 0x20(0x18)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_0;                                // 0x38(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_1;                                     // 0x88(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_2;                                     // 0x98(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_3;                                     // 0xA8(0x10)(HasGetValueTypeHash)
};

// 0xA0 (0xA0 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2f_U_L_Nvector2_M_Nvector2_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2f_U_L_Nvector2_M_Nvector2_R_Params
{
public:
	struct FTuple_Lvector2_Mvector2_R            __verse_0xB2CDDD72_Argument;                       // 0x0(0x20)(Parm, HasGetValueTypeHash)
	struct FSpatialMath_vector2                  RetVal;                                            // 0x20(0x10)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_0;                                // 0x30(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_1;                                     // 0x80(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_2;                                     // 0x90(0x10)(HasGetValueTypeHash)
};

// 0x58 (0x58 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eUnrotateVector_U_L_Nrotation_M_Ntuple_L_R_M_Nvector3_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eUnrotateVector_U_L_Nrotation_M_Ntuple_L_R_M_Nvector3_R_Params
{
public:
	struct FTuple_Lrotation_Mtuple_L_R_Mvector3_R __verse_0xB2CDDD72_Argument;                       // 0x0(0x40)(Parm, HasGetValueTypeHash)
	struct FSpatialMath_vector3                  RetVal;                                            // 0x40(0x18)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// 0x70 (0x70 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eUnrotateBy_U_L_Nrotation_M_Ntuple_L_R_M_Nrotation_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eUnrotateBy_U_L_Nrotation_M_Ntuple_L_R_M_Nrotation_R_Params
{
public:
	struct FTuple_Lrotation_Mtuple_L_R_Mrotation_R __verse_0xB2CDDD72_Argument;                       // 0x0(0x50)(Parm, HasGetValueTypeHash)
	struct FVerseRotation                        RetVal;                                            // 0x50(0x20)(Parm, OutParm, ReturnParm, NoDestructor)
};

// 0x58 (0x58 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eRotateVector_U_L_Nrotation_M_Ntuple_L_R_M_Nvector3_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eRotateVector_U_L_Nrotation_M_Ntuple_L_R_M_Nvector3_R_Params
{
public:
	struct FTuple_Lrotation_Mtuple_L_R_Mvector3_R __verse_0xB2CDDD72_Argument;                       // 0x0(0x40)(Parm, HasGetValueTypeHash)
	struct FSpatialMath_vector3                  RetVal;                                            // 0x40(0x18)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// 0x70 (0x70 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eRotateBy_U_L_Nrotation_M_Ntuple_L_R_M_Nrotation_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eRotateBy_U_L_Nrotation_M_Ntuple_L_R_M_Nrotation_R_Params
{
public:
	struct FTuple_Lrotation_Mtuple_L_R_Mrotation_R __verse_0xB2CDDD72_Argument;                       // 0x0(0x50)(Parm, HasGetValueTypeHash)
	struct FVerseRotation                        RetVal;                                            // 0x50(0x20)(Parm, OutParm, ReturnParm, NoDestructor)
};

// 0x40 (0x40 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eMakeUnitVector_U_L_Nvector3_M_Ntuple_L_R_M_Ntuple_L_R_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eMakeUnitVector_U_L_Nvector3_M_Ntuple_L_R_M_Ntuple_L_R_R_Params
{
public:
	struct FTuple_Lvector3_Mtuple_L_R_Mtuple_L_R_R __verse_0xB2CDDD72_Argument;                       // 0x0(0x1A)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_3E82[0x6];                                     // Fixing Size After Last Property..
	FOptionProperty_                             RetVal;                                            // 0x20(0x20)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// 0x30 (0x30 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eMakeUnitVector_U_L_Nvector2_M_Ntuple_L_R_M_Ntuple_L_R_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eMakeUnitVector_U_L_Nvector2_M_Ntuple_L_R_M_Ntuple_L_R_R_Params
{
public:
	struct FTuple_Lvector2_Mtuple_L_R_Mtuple_L_R_R __verse_0xB2CDDD72_Argument;                       // 0x0(0x12)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_3E83[0x6];                                     // Fixing Size After Last Property..
	FOptionProperty_                             RetVal;                                            // 0x18(0x18)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// 0x72 (0x72 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eLengthXY_U_L_Nvector3_M_Ntuple_L_R_M_Ntuple_L_R_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eLengthXY_U_L_Nvector3_M_Ntuple_L_R_M_Ntuple_L_R_R_Params
{
public:
	struct FTuple_Lvector3_Mtuple_L_R_Mtuple_L_R_R __verse_0xB2CDDD72_Argument;                       // 0x0(0x1A)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_3E84[0x6];                                     // Fixing Size After Last Property..
	double                                       RetVal;                                            // 0x20(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_0;                                         // 0x28(0x10)(HasGetValueTypeHash)
	double                                       _ExprResultStack_1;                                // 0x38(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_2;                                         // 0x40(0x10)(HasGetValueTypeHash)
	struct FTuple_Lvector3_Mtuple_L_R_Mtuple_L_R_R _ExprResult_3;                                     // 0x50(0x1A)(HasGetValueTypeHash)
	uint8                                        Pad_3E85[0x6];                                     // Fixing Size After Last Property..
	struct FTuple_L_R                            _ExprResult_4;                                     // 0x70(0x1)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_5;                                     // 0x71(0x1)(HasGetValueTypeHash)
};

// 0x28 (0x28 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eLengthSquaredXY_U_L_Nvector3_M_Ntuple_L_R_M_Ntuple_L_R_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eLengthSquaredXY_U_L_Nvector3_M_Ntuple_L_R_M_Ntuple_L_R_R_Params
{
public:
	struct FTuple_Lvector3_Mtuple_L_R_Mtuple_L_R_R __verse_0xB2CDDD72_Argument;                       // 0x0(0x1A)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_3E86[0x6];                                     // Fixing Size After Last Property..
	double                                       RetVal;                                            // 0x20(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x28 (0x28 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eLengthSquared_U_L_Nvector3_M_Ntuple_L_R_M_Ntuple_L_R_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eLengthSquared_U_L_Nvector3_M_Ntuple_L_R_M_Ntuple_L_R_R_Params
{
public:
	struct FTuple_Lvector3_Mtuple_L_R_Mtuple_L_R_R __verse_0xB2CDDD72_Argument;                       // 0x0(0x1A)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_3E87[0x6];                                     // Fixing Size After Last Property..
	double                                       RetVal;                                            // 0x20(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x50 (0x50 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eLengthSquared_U_L_Nvector2_M_Ntuple_L_R_M_Ntuple_L_R_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eLengthSquared_U_L_Nvector2_M_Ntuple_L_R_M_Ntuple_L_R_R_Params
{
public:
	struct FTuple_Lvector2_Mtuple_L_R_Mtuple_L_R_R __verse_0xB2CDDD72_Argument;                       // 0x0(0x12)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_3E88[0x6];                                     // Fixing Size After Last Property..
	double                                       RetVal;                                            // 0x18(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_0;                                         // 0x20(0x10)(HasGetValueTypeHash)
	struct FTuple_Lvector2_Mvector2_R            _ExprResult_1;                                     // 0x30(0x20)(HasGetValueTypeHash)
};

// 0x62 (0x62 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eLength_U_L_Nvector2_M_Ntuple_L_R_M_Ntuple_L_R_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eLength_U_L_Nvector2_M_Ntuple_L_R_M_Ntuple_L_R_R_Params
{
public:
	struct FTuple_Lvector2_Mtuple_L_R_Mtuple_L_R_R __verse_0xB2CDDD72_Argument;                       // 0x0(0x12)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_3E89[0x6];                                     // Fixing Size After Last Property..
	double                                       RetVal;                                            // 0x18(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_0;                                         // 0x20(0x10)(HasGetValueTypeHash)
	double                                       _ExprResultStack_1;                                // 0x30(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_2;                                         // 0x38(0x10)(HasGetValueTypeHash)
	struct FTuple_Lvector2_Mtuple_L_R_Mtuple_L_R_R _ExprResult_3;                                     // 0x48(0x12)(HasGetValueTypeHash)
	uint8                                        Pad_3E8A[0x6];                                     // Fixing Size After Last Property..
	struct FTuple_L_R                            _ExprResult_4;                                     // 0x60(0x1)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_5;                                     // 0x61(0x1)(HasGetValueTypeHash)
};

// 0x72 (0x72 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eLength_U_L_Nvector3_M_Ntuple_L_R_M_Ntuple_L_R_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eLength_U_L_Nvector3_M_Ntuple_L_R_M_Ntuple_L_R_R_Params
{
public:
	struct FTuple_Lvector3_Mtuple_L_R_Mtuple_L_R_R __verse_0xB2CDDD72_Argument;                       // 0x0(0x1A)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_3E8B[0x6];                                     // Fixing Size After Last Property..
	double                                       RetVal;                                            // 0x20(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_0;                                         // 0x28(0x10)(HasGetValueTypeHash)
	double                                       _ExprResultStack_1;                                // 0x38(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_2;                                         // 0x40(0x10)(HasGetValueTypeHash)
	struct FTuple_Lvector3_Mtuple_L_R_Mtuple_L_R_R _ExprResult_3;                                     // 0x50(0x1A)(HasGetValueTypeHash)
	uint8                                        Pad_3E8C[0x6];                                     // Fixing Size After Last Property..
	struct FTuple_L_R                            _ExprResult_4;                                     // 0x70(0x1)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_5;                                     // 0x71(0x1)(HasGetValueTypeHash)
};

// 0x122 (0x122 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eIsFinite_U_L_Nvector2_M_Ntuple_L_R_M_Ntuple_L_R_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eIsFinite_U_L_Nvector2_M_Ntuple_L_R_M_Ntuple_L_R_R_Params
{
public:
	struct FTuple_Lvector2_Mtuple_L_R_Mtuple_L_R_R __verse_0xB2CDDD72_Argument;                       // 0x0(0x12)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_3E8D[0x6];                                     // Fixing Size After Last Property..
	FOptionProperty_                             RetVal;                                            // 0x18(0x18)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	enum class EVerseFalse                       _ExprResult_0;                                     // 0x30(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_3E8E[0x7];                                     // Fixing Size After Last Property..
	struct FSpatialMath_vector2                  _ExprResult_1;                                     // 0x38(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_2;                                // 0x48(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_3;                                     // 0x98(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_4;                                     // 0xA8(0x10)(HasGetValueTypeHash)
	FOptionProperty_                             _ExprResultStack_5;                                // 0xB8(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_6;                                         // 0xC8(0x10)(HasGetValueTypeHash)
	struct FTuple_Lfloat_Mtuple_L_R_Mtuple_L_R_R _ExprResult_7;                                     // 0xD8(0xA)(HasGetValueTypeHash)
	uint8                                        Pad_3E8F[0x6];                                     // Fixing Size After Last Property..
	struct FTuple_L_R                            _ExprResult_8;                                     // 0xE8(0x1)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_9;                                     // 0xE9(0x1)(HasGetValueTypeHash)
	uint8                                        Pad_3E90[0x6];                                     // Fixing Size After Last Property..
	FOptionProperty_                             _ExprResultStack_10;                               // 0xF0(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_11;                                        // 0x100(0x10)(HasGetValueTypeHash)
	struct FTuple_Lfloat_Mtuple_L_R_Mtuple_L_R_R _ExprResult_12;                                    // 0x110(0xA)(HasGetValueTypeHash)
	uint8                                        Pad_3E91[0x6];                                     // Fixing Size After Last Property..
	struct FTuple_L_R                            _ExprResult_13;                                    // 0x120(0x1)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_14;                                    // 0x121(0x1)(HasGetValueTypeHash)
};

// 0x182 (0x182 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eIsFinite_U_L_Nvector3_M_Ntuple_L_R_M_Ntuple_L_R_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eIsFinite_U_L_Nvector3_M_Ntuple_L_R_M_Ntuple_L_R_R_Params
{
public:
	struct FTuple_Lvector3_Mtuple_L_R_Mtuple_L_R_R __verse_0xB2CDDD72_Argument;                       // 0x0(0x1A)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_3E92[0x6];                                     // Fixing Size After Last Property..
	FOptionProperty_                             RetVal;                                            // 0x20(0x20)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	enum class EVerseFalse                       _ExprResult_0;                                     // 0x40(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_3E93[0x7];                                     // Fixing Size After Last Property..
	struct FSpatialMath_vector3                  _ExprResult_1;                                     // 0x48(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_2;                                // 0x60(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_3;                                     // 0xB0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_4;                                     // 0xC0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_5;                                     // 0xD0(0x10)(HasGetValueTypeHash)
	FOptionProperty_                             _ExprResultStack_6;                                // 0xE0(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_7;                                         // 0xF0(0x10)(HasGetValueTypeHash)
	struct FTuple_Lfloat_Mtuple_L_R_Mtuple_L_R_R _ExprResult_8;                                     // 0x100(0xA)(HasGetValueTypeHash)
	uint8                                        Pad_3E94[0x6];                                     // Fixing Size After Last Property..
	struct FTuple_L_R                            _ExprResult_9;                                     // 0x110(0x1)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_10;                                    // 0x111(0x1)(HasGetValueTypeHash)
	uint8                                        Pad_3E95[0x6];                                     // Fixing Size After Last Property..
	FOptionProperty_                             _ExprResultStack_11;                               // 0x118(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_12;                                        // 0x128(0x10)(HasGetValueTypeHash)
	struct FTuple_Lfloat_Mtuple_L_R_Mtuple_L_R_R _ExprResult_13;                                    // 0x138(0xA)(HasGetValueTypeHash)
	uint8                                        Pad_3E96[0x6];                                     // Fixing Size After Last Property..
	struct FTuple_L_R                            _ExprResult_14;                                    // 0x148(0x1)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_15;                                    // 0x149(0x1)(HasGetValueTypeHash)
	uint8                                        Pad_3E97[0x6];                                     // Fixing Size After Last Property..
	FOptionProperty_                             _ExprResultStack_16;                               // 0x150(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_17;                                        // 0x160(0x10)(HasGetValueTypeHash)
	struct FTuple_Lfloat_Mtuple_L_R_Mtuple_L_R_R _ExprResult_18;                                    // 0x170(0xA)(HasGetValueTypeHash)
	uint8                                        Pad_3E98[0x6];                                     // Fixing Size After Last Property..
	struct FTuple_L_R                            _ExprResult_19;                                    // 0x180(0x1)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_20;                                    // 0x181(0x1)(HasGetValueTypeHash)
};

// 0x60 (0x60 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eIsFinite_U_L_Nrotation_M_Ntuple_L_R_M_Ntuple_L_R_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eIsFinite_U_L_Nrotation_M_Ntuple_L_R_M_Ntuple_L_R_R_Params
{
public:
	struct FTuple_Lrotation_Mtuple_L_R_Mtuple_L_R_R __verse_0xB2CDDD72_Argument;                       // 0x0(0x22)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_3E99[0xE];                                     // Fixing Size After Last Property..
	FOptionProperty_                             RetVal;                                            // 0x30(0x30)(Parm, OutParm, ReturnParm, NoDestructor)
};

// 0x48 (0x48 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eIsAlmostZero_U_L_Nvector2_M_Ntuple_L_R_M_Nfloat_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eIsAlmostZero_U_L_Nvector2_M_Ntuple_L_R_M_Nfloat_R_Params
{
public:
	struct FTuple_Lvector2_Mtuple_L_R_Mfloat_R   __verse_0xB2CDDD72_Argument;                       // 0x0(0x20)(Parm, HasGetValueTypeHash)
	FOptionProperty_                             RetVal;                                            // 0x20(0x2)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        _ExprResult_0 : 1;                                 // Mask: 0x1, PropSize: 0x10x22(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_277 : 7;                                    // Fixing Bit-Field Size..
	uint8                                        Pad_3E9A[0x5];                                     // Fixing Size After Last Property..
	FOptionProperty_                             _ExprResultStack_1;                                // 0x28(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FOptionProperty_                             _ExprResultStack_2;                                // 0x38(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x60 (0x60 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eIsAlmostZero_U_L_Nvector3_M_Ntuple_L_R_M_Nfloat_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eIsAlmostZero_U_L_Nvector3_M_Ntuple_L_R_M_Nfloat_R_Params
{
public:
	struct FTuple_Lvector3_Mtuple_L_R_Mfloat_R   __verse_0xB2CDDD72_Argument;                       // 0x0(0x28)(Parm, HasGetValueTypeHash)
	FOptionProperty_                             RetVal;                                            // 0x28(0x2)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        _ExprResult_0 : 1;                                 // Mask: 0x1, PropSize: 0x10x2A(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_278 : 7;                                    // Fixing Bit-Field Size..
	uint8                                        Pad_3E9B[0x5];                                     // Fixing Size After Last Property..
	FOptionProperty_                             _ExprResultStack_1;                                // 0x30(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FOptionProperty_                             _ExprResultStack_2;                                // 0x40(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FOptionProperty_                             _ExprResultStack_3;                                // 0x50(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x50 (0x50 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eInvert_U_L_Nrotation_M_Ntuple_L_R_M_Ntuple_L_R_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eInvert_U_L_Nrotation_M_Ntuple_L_R_M_Ntuple_L_R_R_Params
{
public:
	struct FTuple_Lrotation_Mtuple_L_R_Mtuple_L_R_R __verse_0xB2CDDD72_Argument;                       // 0x0(0x22)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_3E9C[0xE];                                     // Fixing Size After Last Property..
	struct FVerseRotation                        RetVal;                                            // 0x30(0x20)(Parm, OutParm, ReturnParm, NoDestructor)
};

// 0x40 (0x40 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eGetYawPitchRollDegrees_U_L_Nrotation_M_Ntuple_L_R_M_Ntuple_L_R_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eGetYawPitchRollDegrees_U_L_Nrotation_M_Ntuple_L_R_M_Ntuple_L_R_R_Params
{
public:
	struct FTuple_Lrotation_Mtuple_L_R_Mtuple_L_R_R __verse_0xB2CDDD72_Argument;                       // 0x0(0x22)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_3E9D[0xE];                                     // Fixing Size After Last Property..
	TArray<double>                               RetVal;                                            // 0x30(0x10)(Parm, OutParm, ReturnParm, ContainsInstancedReference)
};

// 0x140 (0x140 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eGetLocalUp_U_L_Nrotation_M_Ntuple_L_R_M_Ntuple_L_R_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eGetLocalUp_U_L_Nrotation_M_Ntuple_L_R_M_Ntuple_L_R_R_Params
{
public:
	struct FTuple_Lrotation_Mtuple_L_R_Mtuple_L_R_R __verse_0xB2CDDD72_Argument;                       // 0x0(0x22)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_3E9E[0xE];                                     // Fixing Size After Last Property..
	struct FSpatialMath_vector3                  RetVal;                                            // 0x30(0x18)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_0;                                         // 0x48(0x10)(HasGetValueTypeHash)
	uint8                                        Pad_3E9F[0x8];                                     // Fixing Size After Last Property..
	struct FTuple_Lrotation_Mtuple_L_R_Mvector3_R _ExprResult_1;                                     // 0x60(0x40)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_2;                                     // 0xA0(0x1)(HasGetValueTypeHash)
	uint8                                        Pad_3EA0[0x7];                                     // Fixing Size After Last Property..
	struct FSpatialMath_vector3                  _ExprResult_3;                                     // 0xA8(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_4;                                // 0xC0(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_5;                                     // 0x110(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_6;                                     // 0x120(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_7;                                     // 0x130(0x10)(HasGetValueTypeHash)
};

// 0x140 (0x140 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eGetLocalRight_U_L_Nrotation_M_Ntuple_L_R_M_Ntuple_L_R_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eGetLocalRight_U_L_Nrotation_M_Ntuple_L_R_M_Ntuple_L_R_R_Params
{
public:
	struct FTuple_Lrotation_Mtuple_L_R_Mtuple_L_R_R __verse_0xB2CDDD72_Argument;                       // 0x0(0x22)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_3EA1[0xE];                                     // Fixing Size After Last Property..
	struct FSpatialMath_vector3                  RetVal;                                            // 0x30(0x18)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_0;                                         // 0x48(0x10)(HasGetValueTypeHash)
	uint8                                        Pad_3EA2[0x8];                                     // Fixing Size After Last Property..
	struct FTuple_Lrotation_Mtuple_L_R_Mvector3_R _ExprResult_1;                                     // 0x60(0x40)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_2;                                     // 0xA0(0x1)(HasGetValueTypeHash)
	uint8                                        Pad_3EA3[0x7];                                     // Fixing Size After Last Property..
	struct FSpatialMath_vector3                  _ExprResult_3;                                     // 0xA8(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_4;                                // 0xC0(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_5;                                     // 0x110(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_6;                                     // 0x120(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_7;                                     // 0x130(0x10)(HasGetValueTypeHash)
};

// 0x140 (0x140 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eGetLocalForward_U_L_Nrotation_M_Ntuple_L_R_M_Ntuple_L_R_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eGetLocalForward_U_L_Nrotation_M_Ntuple_L_R_M_Ntuple_L_R_R_Params
{
public:
	struct FTuple_Lrotation_Mtuple_L_R_Mtuple_L_R_R __verse_0xB2CDDD72_Argument;                       // 0x0(0x22)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_3EA4[0xE];                                     // Fixing Size After Last Property..
	struct FSpatialMath_vector3                  RetVal;                                            // 0x30(0x18)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_0;                                         // 0x48(0x10)(HasGetValueTypeHash)
	uint8                                        Pad_3EA5[0x8];                                     // Fixing Size After Last Property..
	struct FTuple_Lrotation_Mtuple_L_R_Mvector3_R _ExprResult_1;                                     // 0x60(0x40)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_2;                                     // 0xA0(0x1)(HasGetValueTypeHash)
	uint8                                        Pad_3EA6[0x7];                                     // Fixing Size After Last Property..
	struct FSpatialMath_vector3                  _ExprResult_3;                                     // 0xA8(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_4;                                // 0xC0(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_5;                                     // 0x110(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_6;                                     // 0x120(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_7;                                     // 0x130(0x10)(HasGetValueTypeHash)
};

// 0x48 (0x48 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eGetAxis_U_L_Nrotation_M_Ntuple_L_R_M_Ntuple_L_R_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eGetAxis_U_L_Nrotation_M_Ntuple_L_R_M_Ntuple_L_R_R_Params
{
public:
	struct FTuple_Lrotation_Mtuple_L_R_Mtuple_L_R_R __verse_0xB2CDDD72_Argument;                       // 0x0(0x22)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_3EA7[0xE];                                     // Fixing Size After Last Property..
	struct FSpatialMath_vector3                  RetVal;                                            // 0x30(0x18)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// 0x38 (0x38 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eGetAngle_U_L_Nrotation_M_Ntuple_L_R_M_Ntuple_L_R_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eGetAngle_U_L_Nrotation_M_Ntuple_L_R_M_Ntuple_L_R_R_Params
{
public:
	struct FTuple_Lrotation_Mtuple_L_R_Mtuple_L_R_R __verse_0xB2CDDD72_Argument;                       // 0x0(0x22)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_3EA8[0xE];                                     // Fixing Size After Last Property..
	double                                       RetVal;                                            // 0x30(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x50 (0x50 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eApplyYaw_U_L_Nrotation_M_Ntuple_L_R_M_Nfloat_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eApplyYaw_U_L_Nrotation_M_Ntuple_L_R_M_Nfloat_R_Params
{
public:
	struct FTuple_Lrotation_Mtuple_L_R_Mfloat_R  __verse_0xB2CDDD72_Argument;                       // 0x0(0x30)(Parm, HasGetValueTypeHash)
	struct FVerseRotation                        RetVal;                                            // 0x30(0x20)(Parm, OutParm, ReturnParm, NoDestructor)
};

// 0x50 (0x50 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eApplyWorldRotationZ_U_L_Nrotation_M_Ntuple_L_R_M_Nfloat_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eApplyWorldRotationZ_U_L_Nrotation_M_Ntuple_L_R_M_Nfloat_R_Params
{
public:
	struct FTuple_Lrotation_Mtuple_L_R_Mfloat_R  __verse_0xB2CDDD72_Argument;                       // 0x0(0x30)(Parm, HasGetValueTypeHash)
	struct FVerseRotation                        RetVal;                                            // 0x30(0x20)(Parm, OutParm, ReturnParm, NoDestructor)
};

// 0x50 (0x50 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eApplyWorldRotationY_U_L_Nrotation_M_Ntuple_L_R_M_Nfloat_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eApplyWorldRotationY_U_L_Nrotation_M_Ntuple_L_R_M_Nfloat_R_Params
{
public:
	struct FTuple_Lrotation_Mtuple_L_R_Mfloat_R  __verse_0xB2CDDD72_Argument;                       // 0x0(0x30)(Parm, HasGetValueTypeHash)
	struct FVerseRotation                        RetVal;                                            // 0x30(0x20)(Parm, OutParm, ReturnParm, NoDestructor)
};

// 0x50 (0x50 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eApplyWorldRotationX_U_L_Nrotation_M_Ntuple_L_R_M_Nfloat_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eApplyWorldRotationX_U_L_Nrotation_M_Ntuple_L_R_M_Nfloat_R_Params
{
public:
	struct FTuple_Lrotation_Mtuple_L_R_Mfloat_R  __verse_0xB2CDDD72_Argument;                       // 0x0(0x30)(Parm, HasGetValueTypeHash)
	struct FVerseRotation                        RetVal;                                            // 0x30(0x20)(Parm, OutParm, ReturnParm, NoDestructor)
};

// 0x50 (0x50 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eApplyRoll_U_L_Nrotation_M_Ntuple_L_R_M_Nfloat_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eApplyRoll_U_L_Nrotation_M_Ntuple_L_R_M_Nfloat_R_Params
{
public:
	struct FTuple_Lrotation_Mtuple_L_R_Mfloat_R  __verse_0xB2CDDD72_Argument;                       // 0x0(0x30)(Parm, HasGetValueTypeHash)
	struct FVerseRotation                        RetVal;                                            // 0x30(0x20)(Parm, OutParm, ReturnParm, NoDestructor)
};

// 0x50 (0x50 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eApplyPitch_U_L_Nrotation_M_Ntuple_L_R_M_Nfloat_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eApplyPitch_U_L_Nrotation_M_Ntuple_L_R_M_Nfloat_R_Params
{
public:
	struct FTuple_Lrotation_Mtuple_L_R_Mfloat_R  __verse_0xB2CDDD72_Argument;                       // 0x0(0x30)(Parm, HasGetValueTypeHash)
	struct FVerseRotation                        RetVal;                                            // 0x30(0x20)(Parm, OutParm, ReturnParm, NoDestructor)
};

// 0x172 (0x172 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eApplyLocalRotationZ_U_L_Nrotation_M_Ntuple_L_R_M_Nfloat_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eApplyLocalRotationZ_U_L_Nrotation_M_Ntuple_L_R_M_Nfloat_R_Params
{
public:
	struct FTuple_Lrotation_Mtuple_L_R_Mfloat_R  __verse_0xB2CDDD72_Argument;                       // 0x0(0x30)(Parm, HasGetValueTypeHash)
	struct FVerseRotation                        RetVal;                                            // 0x30(0x20)(Parm, OutParm, ReturnParm, NoDestructor)
	FVerseFunctionProperty_                      _Callee_0;                                         // 0x50(0x10)(HasGetValueTypeHash)
	struct FTuple_Lrotation_Mtuple_L_R_Mrotation_R _ExprResult_1;                                     // 0x60(0x50)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_2;                                     // 0xB0(0x1)(HasGetValueTypeHash)
	uint8                                        Pad_3EA9[0xF];                                     // Fixing Size After Last Property..
	struct FVerseRotation                        _ExprResultStack_3;                                // 0xC0(0x20)(NoDestructor)
	FVerseFunctionProperty_                      _Callee_4;                                         // 0xE0(0x10)(HasGetValueTypeHash)
	struct FTuple_Lvector3_Mfloat_R              _ExprResult_5;                                     // 0xF0(0x20)(HasGetValueTypeHash)
	struct FSpatialMath_vector3                  _ExprResultStack_6;                                // 0x110(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_7;                                         // 0x128(0x10)(HasGetValueTypeHash)
	uint8                                        Pad_3EAA[0x8];                                     // Fixing Size After Last Property..
	struct FTuple_Lrotation_Mtuple_L_R_Mtuple_L_R_R _ExprResult_8;                                     // 0x140(0x22)(HasGetValueTypeHash)
	uint8                                        Pad_3EAB[0xE];                                     // Fixing Size After Last Property..
	struct FTuple_L_R                            _ExprResult_9;                                     // 0x170(0x1)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_10;                                    // 0x171(0x1)(HasGetValueTypeHash)
};

// 0x172 (0x172 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eApplyLocalRotationY_U_L_Nrotation_M_Ntuple_L_R_M_Nfloat_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eApplyLocalRotationY_U_L_Nrotation_M_Ntuple_L_R_M_Nfloat_R_Params
{
public:
	struct FTuple_Lrotation_Mtuple_L_R_Mfloat_R  __verse_0xB2CDDD72_Argument;                       // 0x0(0x30)(Parm, HasGetValueTypeHash)
	struct FVerseRotation                        RetVal;                                            // 0x30(0x20)(Parm, OutParm, ReturnParm, NoDestructor)
	FVerseFunctionProperty_                      _Callee_0;                                         // 0x50(0x10)(HasGetValueTypeHash)
	struct FTuple_Lrotation_Mtuple_L_R_Mrotation_R _ExprResult_1;                                     // 0x60(0x50)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_2;                                     // 0xB0(0x1)(HasGetValueTypeHash)
	uint8                                        Pad_3EAC[0xF];                                     // Fixing Size After Last Property..
	struct FVerseRotation                        _ExprResultStack_3;                                // 0xC0(0x20)(NoDestructor)
	FVerseFunctionProperty_                      _Callee_4;                                         // 0xE0(0x10)(HasGetValueTypeHash)
	struct FTuple_Lvector3_Mfloat_R              _ExprResult_5;                                     // 0xF0(0x20)(HasGetValueTypeHash)
	struct FSpatialMath_vector3                  _ExprResultStack_6;                                // 0x110(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_7;                                         // 0x128(0x10)(HasGetValueTypeHash)
	uint8                                        Pad_3EAD[0x8];                                     // Fixing Size After Last Property..
	struct FTuple_Lrotation_Mtuple_L_R_Mtuple_L_R_R _ExprResult_8;                                     // 0x140(0x22)(HasGetValueTypeHash)
	uint8                                        Pad_3EAE[0xE];                                     // Fixing Size After Last Property..
	struct FTuple_L_R                            _ExprResult_9;                                     // 0x170(0x1)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_10;                                    // 0x171(0x1)(HasGetValueTypeHash)
};

// 0x172 (0x172 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eApplyLocalRotationX_U_L_Nrotation_M_Ntuple_L_R_M_Nfloat_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eApplyLocalRotationX_U_L_Nrotation_M_Ntuple_L_R_M_Nfloat_R_Params
{
public:
	struct FTuple_Lrotation_Mtuple_L_R_Mfloat_R  __verse_0xB2CDDD72_Argument;                       // 0x0(0x30)(Parm, HasGetValueTypeHash)
	struct FVerseRotation                        RetVal;                                            // 0x30(0x20)(Parm, OutParm, ReturnParm, NoDestructor)
	FVerseFunctionProperty_                      _Callee_0;                                         // 0x50(0x10)(HasGetValueTypeHash)
	struct FTuple_Lrotation_Mtuple_L_R_Mrotation_R _ExprResult_1;                                     // 0x60(0x50)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_2;                                     // 0xB0(0x1)(HasGetValueTypeHash)
	uint8                                        Pad_3EAF[0xF];                                     // Fixing Size After Last Property..
	struct FVerseRotation                        _ExprResultStack_3;                                // 0xC0(0x20)(NoDestructor)
	FVerseFunctionProperty_                      _Callee_4;                                         // 0xE0(0x10)(HasGetValueTypeHash)
	struct FTuple_Lvector3_Mfloat_R              _ExprResult_5;                                     // 0xF0(0x20)(HasGetValueTypeHash)
	struct FSpatialMath_vector3                  _ExprResultStack_6;                                // 0x110(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_7;                                         // 0x128(0x10)(HasGetValueTypeHash)
	uint8                                        Pad_3EB0[0x8];                                     // Fixing Size After Last Property..
	struct FTuple_Lrotation_Mtuple_L_R_Mtuple_L_R_R _ExprResult_8;                                     // 0x140(0x22)(HasGetValueTypeHash)
	uint8                                        Pad_3EB1[0xE];                                     // Fixing Size After Last Property..
	struct FTuple_L_R                            _ExprResult_9;                                     // 0x170(0x1)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_10;                                    // 0x171(0x1)(HasGetValueTypeHash)
};

// 0xA0 (0xA0 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2d_U_L_Nvector2i_M_Nvector2i_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2d_U_L_Nvector2i_M_Nvector2i_R_Params
{
public:
	struct FTuple_Lvector2i_Mvector2i_R          __verse_0xB2CDDD72_Argument;                       // 0x0(0x20)(Parm, HasGetValueTypeHash)
	struct FSpatialMath_vector2i                 RetVal;                                            // 0x20(0x10)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_0;                                // 0x30(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_1;                                     // 0x80(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_2;                                     // 0x90(0x10)(HasGetValueTypeHash)
};

// 0xC8 (0xC8 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2d_U_L_Nvector3_M_Nvector3_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2d_U_L_Nvector3_M_Nvector3_R_Params
{
public:
	struct FTuple_Lvector3_Mvector3_R            __verse_0xB2CDDD72_Argument;                       // 0x0(0x30)(Parm, HasGetValueTypeHash)
	struct FSpatialMath_vector3                  RetVal;                                            // 0x30(0x18)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_0;                                // 0x48(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_1;                                     // 0x98(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_2;                                     // 0xA8(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_3;                                     // 0xB8(0x10)(HasGetValueTypeHash)
};

// 0xA0 (0xA0 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2d_U_L_Nvector2_M_Nvector2_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2d_U_L_Nvector2_M_Nvector2_R_Params
{
public:
	struct FTuple_Lvector2_Mvector2_R            __verse_0xB2CDDD72_Argument;                       // 0x0(0x20)(Parm, HasGetValueTypeHash)
	struct FSpatialMath_vector2                  RetVal;                                            // 0x20(0x10)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_0;                                // 0x30(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_1;                                     // 0x80(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_2;                                     // 0x90(0x10)(HasGetValueTypeHash)
};

// 0xA0 (0xA0 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2b_U_L_Nvector2_M_Nvector2_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2b_U_L_Nvector2_M_Nvector2_R_Params
{
public:
	struct FTuple_Lvector2_Mvector2_R            __verse_0xB2CDDD72_Argument;                       // 0x0(0x20)(Parm, HasGetValueTypeHash)
	struct FSpatialMath_vector2                  RetVal;                                            // 0x20(0x10)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_0;                                // 0x30(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_1;                                     // 0x80(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_2;                                     // 0x90(0x10)(HasGetValueTypeHash)
};

// 0xA0 (0xA0 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2b_U_L_Nvector2i_M_Nvector2i_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2b_U_L_Nvector2i_M_Nvector2i_R_Params
{
public:
	struct FTuple_Lvector2i_Mvector2i_R          __verse_0xB2CDDD72_Argument;                       // 0x0(0x20)(Parm, HasGetValueTypeHash)
	struct FSpatialMath_vector2i                 RetVal;                                            // 0x20(0x10)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_0;                                // 0x30(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_1;                                     // 0x80(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_2;                                     // 0x90(0x10)(HasGetValueTypeHash)
};

// 0xC8 (0xC8 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2b_U_L_Nvector3_M_Nvector3_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2b_U_L_Nvector3_M_Nvector3_R_Params
{
public:
	struct FTuple_Lvector3_Mvector3_R            __verse_0xB2CDDD72_Argument;                       // 0x0(0x30)(Parm, HasGetValueTypeHash)
	struct FSpatialMath_vector3                  RetVal;                                            // 0x30(0x18)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_0;                                // 0x48(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_1;                                     // 0x98(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_2;                                     // 0xA8(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_3;                                     // 0xB8(0x10)(HasGetValueTypeHash)
};

// 0x98 (0x98 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2a_U_L_Nvector2i_M_Nint_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2a_U_L_Nvector2i_M_Nint_R_Params
{
public:
	struct FTuple_Lvector2i_Mint_R               __verse_0xB2CDDD72_Argument;                       // 0x0(0x18)(Parm, HasGetValueTypeHash)
	struct FSpatialMath_vector2i                 RetVal;                                            // 0x18(0x10)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_0;                                // 0x28(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_1;                                     // 0x78(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_2;                                     // 0x88(0x10)(HasGetValueTypeHash)
};

// 0xB8 (0xB8 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2a_U_L_Nfloat_M_Nvector3_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2a_U_L_Nfloat_M_Nvector3_R_Params
{
public:
	struct FTuple_Lfloat_Mvector3_R              __verse_0xB2CDDD72_Argument;                       // 0x0(0x20)(Parm, HasGetValueTypeHash)
	struct FSpatialMath_vector3                  RetVal;                                            // 0x20(0x18)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_0;                                // 0x38(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_1;                                     // 0x88(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_2;                                     // 0x98(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_3;                                     // 0xA8(0x10)(HasGetValueTypeHash)
};

// 0xB8 (0xB8 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2a_U_L_Nvector3_M_Nfloat_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2a_U_L_Nvector3_M_Nfloat_R_Params
{
public:
	struct FTuple_Lvector3_Mfloat_R              __verse_0xB2CDDD72_Argument;                       // 0x0(0x20)(Parm, HasGetValueTypeHash)
	struct FSpatialMath_vector3                  RetVal;                                            // 0x20(0x18)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_0;                                // 0x38(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_1;                                     // 0x88(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_2;                                     // 0x98(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_3;                                     // 0xA8(0x10)(HasGetValueTypeHash)
};

// 0xC8 (0xC8 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2a_U_L_Nvector3_M_Nvector3_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2a_U_L_Nvector3_M_Nvector3_R_Params
{
public:
	struct FTuple_Lvector3_Mvector3_R            __verse_0xB2CDDD72_Argument;                       // 0x0(0x30)(Parm, HasGetValueTypeHash)
	struct FSpatialMath_vector3                  RetVal;                                            // 0x30(0x18)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_0;                                // 0x48(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_1;                                     // 0x98(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_2;                                     // 0xA8(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_3;                                     // 0xB8(0x10)(HasGetValueTypeHash)
};

// 0x98 (0x98 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2a_U_L_Nvector2_M_Nfloat_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2a_U_L_Nvector2_M_Nfloat_R_Params
{
public:
	struct FTuple_Lvector2_Mfloat_R              __verse_0xB2CDDD72_Argument;                       // 0x0(0x18)(Parm, HasGetValueTypeHash)
	struct FSpatialMath_vector2                  RetVal;                                            // 0x18(0x10)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_0;                                // 0x28(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_1;                                     // 0x78(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_2;                                     // 0x88(0x10)(HasGetValueTypeHash)
};

// 0x98 (0x98 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2a_U_L_Nint_M_Nvector2i_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2a_U_L_Nint_M_Nvector2i_R_Params
{
public:
	struct FTuple_Lint_Mvector2i_R               __verse_0xB2CDDD72_Argument;                       // 0x0(0x18)(Parm, HasGetValueTypeHash)
	struct FSpatialMath_vector2i                 RetVal;                                            // 0x18(0x10)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_0;                                // 0x28(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_1;                                     // 0x78(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_2;                                     // 0x88(0x10)(HasGetValueTypeHash)
};

// 0x98 (0x98 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2a_U_L_Nfloat_M_Nvector2_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2a_U_L_Nfloat_M_Nvector2_R_Params
{
public:
	struct FTuple_Lfloat_Mvector2_R              __verse_0xB2CDDD72_Argument;                       // 0x0(0x18)(Parm, HasGetValueTypeHash)
	struct FSpatialMath_vector2                  RetVal;                                            // 0x18(0x10)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_0;                                // 0x28(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_1;                                     // 0x78(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_2;                                     // 0x88(0x10)(HasGetValueTypeHash)
};

// 0xA0 (0xA0 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RZero
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RZero_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_3EB2[0x7];                                     // Fixing Size After Last Property..
	struct FSpatialMath_vector3                  RetVal;                                            // 0x8(0x18)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_0;                                // 0x20(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_1;                                     // 0x70(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_2;                                     // 0x80(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_3;                                     // 0x90(0x10)(HasGetValueTypeHash)
};

// 0xA0 (0xA0 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RZAxis
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RZAxis_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_3EB3[0x7];                                     // Fixing Size After Last Property..
	struct FSpatialMath_vector3                  RetVal;                                            // 0x8(0x18)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_0;                                // 0x20(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_1;                                     // 0x70(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_2;                                     // 0x80(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_3;                                     // 0x90(0x10)(HasGetValueTypeHash)
};

// 0xA0 (0xA0 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RYAxis
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RYAxis_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_3EB4[0x7];                                     // Fixing Size After Last Property..
	struct FSpatialMath_vector3                  RetVal;                                            // 0x8(0x18)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_0;                                // 0x20(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_1;                                     // 0x70(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_2;                                     // 0x80(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_3;                                     // 0x90(0x10)(HasGetValueTypeHash)
};

// 0xA0 (0xA0 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RXAxis
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RXAxis_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_3EB5[0x7];                                     // Fixing Size After Last Property..
	struct FSpatialMath_vector3                  RetVal;                                            // 0x8(0x18)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_0;                                // 0x20(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_1;                                     // 0x70(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_2;                                     // 0x80(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_3;                                     // 0x90(0x10)(HasGetValueTypeHash)
};

// 0x98 (0x98 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RTransformVectorNoScale_L_Ntransform_M_Nvector3_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RTransformVectorNoScale_L_Ntransform_M_Nvector3_R_Params
{
public:
	struct FTuple_Ltransform_Mvector3_R          __verse_0xB2CDDD72_Argument;                       // 0x0(0x78)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_3EB6[0x8];                                     // Fixing Size After Last Property..
	struct FSpatialMath_vector3                  RetVal;                                            // 0x80(0x18)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// 0x98 (0x98 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RTransformVector_L_Ntransform_M_Nvector3_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RTransformVector_L_Ntransform_M_Nvector3_R_Params
{
public:
	struct FTuple_Ltransform_Mvector3_R          __verse_0xB2CDDD72_Argument;                       // 0x0(0x78)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_3EB7[0x8];                                     // Fixing Size After Last Property..
	struct FSpatialMath_vector3                  RetVal;                                            // 0x80(0x18)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// 0xE8 (0xE8 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RToVector2i_L_Nvector2_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RToVector2i_L_Nvector2_R_Params
{
public:
	struct FSpatialMath_vector2                  __verse_0xB2CDDD72_Argument;                       // 0x0(0x10)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	FOptionProperty_                             RetVal;                                            // 0x10(0x18)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	struct FSpatialMath_vector2i                 _ExprResult_0;                                     // 0x28(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_1;                                // 0x38(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_2;                                     // 0x88(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_3;                                     // 0x98(0x10)(HasGetValueTypeHash)
	FOptionProperty_                             _ExprResultStack_4;                                // 0xA8(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_5;                                         // 0xB8(0x10)(HasGetValueTypeHash)
	FOptionProperty_                             _ExprResultStack_6;                                // 0xC8(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_7;                                         // 0xD8(0x10)(HasGetValueTypeHash)
};

// 0x90 (0x90 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RToVector2_L_Nvector2i_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RToVector2_L_Nvector2i_R_Params
{
public:
	struct FSpatialMath_vector2i                 __verse_0xB2CDDD72_Argument;                       // 0x0(0x10)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FSpatialMath_vector2                  RetVal;                                            // 0x10(0x10)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_0;                                // 0x20(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_1;                                     // 0x70(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_2;                                     // 0x80(0x10)(HasGetValueTypeHash)
};

// 0x20 (0x20 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RToString_L_Nvector2i_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RToString_L_Nvector2i_R_Params
{
public:
	struct FSpatialMath_vector2i                 __verse_0xB2CDDD72_Argument;                       // 0x0(0x10)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseStringProperty_                        RetVal;                                            // 0x10(0x10)(Parm, OutParm, ReturnParm, HasGetValueTypeHash)
};

// 0x28 (0x28 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RToString_L_Nvector3_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RToString_L_Nvector3_R_Params
{
public:
	struct FSpatialMath_vector3                  __verse_0xB2CDDD72_Argument;                       // 0x0(0x18)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseStringProperty_                        RetVal;                                            // 0x18(0x10)(Parm, OutParm, ReturnParm, HasGetValueTypeHash)
};

// 0x30 (0x30 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RToString_L_Nrotation_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RToString_L_Nrotation_R_Params
{
public:
	struct FVerseRotation                        __verse_0xB2CDDD72_Argument;                       // 0x0(0x20)(Parm, NoDestructor)
	FVerseStringProperty_                        RetVal;                                            // 0x20(0x10)(Parm, OutParm, ReturnParm, HasGetValueTypeHash)
};

// 0x20 (0x20 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RToString_L_Nvector2_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RToString_L_Nvector2_R_Params
{
public:
	struct FSpatialMath_vector2                  __verse_0xB2CDDD72_Argument;                       // 0x0(0x10)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseStringProperty_                        RetVal;                                            // 0x10(0x10)(Parm, OutParm, ReturnParm, HasGetValueTypeHash)
};

// 0x80 (0x80 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RSlerp_L_Nrotation_M_Nrotation_M_Nfloat_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RSlerp_L_Nrotation_M_Nrotation_M_Nfloat_R_Params
{
public:
	struct FTuple_Lrotation_Mrotation_Mfloat_R   __verse_0xB2CDDD72_Argument;                       // 0x0(0x48)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_3EB8[0x8];                                     // Fixing Size After Last Property..
	FOptionProperty_                             RetVal;                                            // 0x50(0x30)(Parm, OutParm, ReturnParm, NoDestructor)
};

// 0x38 (0x38 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RReflectVector_L_Nvector2_M_Nvector2_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RReflectVector_L_Nvector2_M_Nvector2_R_Params
{
public:
	struct FTuple_Lvector2_Mvector2_R            __verse_0xB2CDDD72_Argument;                       // 0x0(0x20)(Parm, HasGetValueTypeHash)
	FOptionProperty_                             RetVal;                                            // 0x20(0x18)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// 0x50 (0x50 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RReflectVector_L_Nvector3_M_Nvector3_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RReflectVector_L_Nvector3_M_Nvector3_R_Params
{
public:
	struct FTuple_Lvector3_Mvector3_R            __verse_0xB2CDDD72_Argument;                       // 0x0(0x30)(Parm, HasGetValueTypeHash)
	FOptionProperty_                             RetVal;                                            // 0x30(0x20)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// 0x10 (0x10 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RRadiansToDegrees_L_Nfloat_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RRadiansToDegrees_L_Nfloat_R_Params
{
public:
	double                                       __verse_0xB2CDDD72_Argument;                       // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       RetVal;                                            // 0x8(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0xA0 (0xA0 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_ROnes
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_ROnes_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_3EB9[0x7];                                     // Fixing Size After Last Property..
	struct FSpatialMath_vector3                  RetVal;                                            // 0x8(0x18)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_0;                                // 0x20(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_1;                                     // 0x70(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_2;                                     // 0x80(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_3;                                     // 0x90(0x10)(HasGetValueTypeHash)
};

// 0x50 (0x50 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RMakeShortestRotationBetween_L_Nvector3_M_Nvector3_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RMakeShortestRotationBetween_L_Nvector3_M_Nvector3_R_Params
{
public:
	struct FTuple_Lvector3_Mvector3_R            __verse_0xB2CDDD72_Argument;                       // 0x0(0x30)(Parm, HasGetValueTypeHash)
	struct FVerseRotation                        RetVal;                                            // 0x30(0x20)(Parm, OutParm, ReturnParm, NoDestructor)
};

// 0x60 (0x60 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RMakeShortestRotationBetween_L_Nrotation_M_Nrotation_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RMakeShortestRotationBetween_L_Nrotation_M_Nrotation_R_Params
{
public:
	struct FTuple_Lrotation_Mrotation_R          __verse_0xB2CDDD72_Argument;                       // 0x0(0x40)(Parm, HasGetValueTypeHash)
	struct FVerseRotation                        RetVal;                                            // 0x40(0x20)(Parm, OutParm, ReturnParm, NoDestructor)
};

// 0x40 (0x40 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RMakeRotationFromYawPitchRollDegrees_L_Nfloat_M_Nfloat_M_Nfloat_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RMakeRotationFromYawPitchRollDegrees_L_Nfloat_M_Nfloat_M_Nfloat_R_Params
{
public:
	struct FTuple_Lfloat_Mfloat_Mfloat_R         __verse_0xB2CDDD72_Argument;                       // 0x0(0x18)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_3EBA[0x8];                                     // Fixing Size After Last Property..
	struct FVerseRotation                        RetVal;                                            // 0x20(0x20)(Parm, OutParm, ReturnParm, NoDestructor)
};

// 0x40 (0x40 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RMakeRotation_L_Nvector3_M_Nfloat_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RMakeRotation_L_Nvector3_M_Nfloat_R_Params
{
public:
	struct FTuple_Lvector3_Mfloat_R              __verse_0xB2CDDD72_Argument;                       // 0x0(0x20)(Parm, HasGetValueTypeHash)
	struct FVerseRotation                        RetVal;                                            // 0x20(0x20)(Parm, OutParm, ReturnParm, NoDestructor)
};

// 0x108 (0x108 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RLerp_L_Nvector2_M_Nvector2_M_Nfloat_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RLerp_L_Nvector2_M_Nvector2_M_Nfloat_R_Params
{
public:
	struct FTuple_Lvector2_Mvector2_Mfloat_R     __verse_0xB2CDDD72_Argument;                       // 0x0(0x28)(Parm, HasGetValueTypeHash)
	struct FSpatialMath_vector2                  RetVal;                                            // 0x28(0x10)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_0;                                // 0x38(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_1;                                     // 0x88(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_2;                                     // 0x98(0x10)(HasGetValueTypeHash)
	double                                       _ExprResultStack_3;                                // 0xA8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_4;                                         // 0xB0(0x10)(HasGetValueTypeHash)
	struct FTuple_Lfloat_Mfloat_Mfloat_R         _ExprResult_5;                                     // 0xC0(0x18)(HasGetValueTypeHash)
	double                                       _ExprResultStack_6;                                // 0xD8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_7;                                         // 0xE0(0x10)(HasGetValueTypeHash)
	struct FTuple_Lfloat_Mfloat_Mfloat_R         _ExprResult_8;                                     // 0xF0(0x18)(HasGetValueTypeHash)
};

// 0x160 (0x160 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RLerp_L_Nvector3_M_Nvector3_M_Nfloat_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RLerp_L_Nvector3_M_Nvector3_M_Nfloat_R_Params
{
public:
	struct FTuple_Lvector3_Mvector3_Mfloat_R     __verse_0xB2CDDD72_Argument;                       // 0x0(0x38)(Parm, HasGetValueTypeHash)
	struct FSpatialMath_vector3                  RetVal;                                            // 0x38(0x18)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_0;                                // 0x50(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_1;                                     // 0xA0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_2;                                     // 0xB0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_3;                                     // 0xC0(0x10)(HasGetValueTypeHash)
	double                                       _ExprResultStack_4;                                // 0xD0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_5;                                         // 0xD8(0x10)(HasGetValueTypeHash)
	struct FTuple_Lfloat_Mfloat_Mfloat_R         _ExprResult_6;                                     // 0xE8(0x18)(HasGetValueTypeHash)
	double                                       _ExprResultStack_7;                                // 0x100(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_8;                                         // 0x108(0x10)(HasGetValueTypeHash)
	struct FTuple_Lfloat_Mfloat_Mfloat_R         _ExprResult_9;                                     // 0x118(0x18)(HasGetValueTypeHash)
	double                                       _ExprResultStack_10;                               // 0x130(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_11;                                        // 0x138(0x10)(HasGetValueTypeHash)
	struct FTuple_Lfloat_Mfloat_Mfloat_R         _ExprResult_12;                                    // 0x148(0x18)(HasGetValueTypeHash)
};

// 0x50 (0x50 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RIsAlmostEqual_L_Nvector2_M_Nvector2_M_Nfloat_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RIsAlmostEqual_L_Nvector2_M_Nvector2_M_Nfloat_R_Params
{
public:
	struct FTuple_Lvector2_Mvector2_Mfloat_R     __verse_0xB2CDDD72_Argument;                       // 0x0(0x28)(Parm, HasGetValueTypeHash)
	FOptionProperty_                             RetVal;                                            // 0x28(0x2)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        _ExprResult_0 : 1;                                 // Mask: 0x1, PropSize: 0x10x2A(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_279 : 7;                                    // Fixing Bit-Field Size..
	uint8                                        Pad_3EBB[0x5];                                     // Fixing Size After Last Property..
	FOptionProperty_                             _ExprResultStack_1;                                // 0x30(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FOptionProperty_                             _ExprResultStack_2;                                // 0x40(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x70 (0x70 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RIsAlmostEqual_L_Nvector3_M_Nvector3_M_Nfloat_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RIsAlmostEqual_L_Nvector3_M_Nvector3_M_Nfloat_R_Params
{
public:
	struct FTuple_Lvector3_Mvector3_Mfloat_R     __verse_0xB2CDDD72_Argument;                       // 0x0(0x38)(Parm, HasGetValueTypeHash)
	FOptionProperty_                             RetVal;                                            // 0x38(0x2)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        _ExprResult_0 : 1;                                 // Mask: 0x1, PropSize: 0x10x3A(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_27A : 7;                                    // Fixing Bit-Field Size..
	uint8                                        Pad_3EBC[0x5];                                     // Fixing Size After Last Property..
	FOptionProperty_                             _ExprResultStack_1;                                // 0x40(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FOptionProperty_                             _ExprResultStack_2;                                // 0x50(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FOptionProperty_                             _ExprResultStack_3;                                // 0x60(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x30 (0x30 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RIdentityRotation
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RIdentityRotation_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_3EBD[0xF];                                     // Fixing Size After Last Property..
	struct FVerseRotation                        RetVal;                                            // 0x10(0x20)(Parm, OutParm, ReturnParm, NoDestructor)
};

// 0x160 (0x160 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_REquals_L_Nvector2i_M_Nvector2i_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_REquals_L_Nvector2i_M_Nvector2i_R_Params
{
public:
	struct FTuple_Lvector2i_Mvector2i_R          __verse_0xB2CDDD72_Argument;                       // 0x0(0x20)(Parm, HasGetValueTypeHash)
	FOptionProperty_                             RetVal;                                            // 0x20(0x18)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	enum class EVerseFalse                       _ExprResult_0;                                     // 0x38(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_3EBE[0x7];                                     // Fixing Size After Last Property..
	struct FSpatialMath_vector2i                 _ExprResult_1;                                     // 0x40(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_2;                                // 0x50(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_3;                                     // 0xA0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_4;                                     // 0xB0(0x10)(HasGetValueTypeHash)
	int64                                        _ExprResult_5;                                     // 0xC0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResultStack_6;                                // 0xC8(0x10)(HasGetValueTypeHash)
	FOptionProperty_                             _ExprResultStack_7;                                // 0xD8(0x18)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_8;                                     // 0xF0(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_9;                                     // 0x100(0x10)(HasGetValueTypeHash)
	int64                                        _ExprResult_10;                                    // 0x110(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResultStack_11;                               // 0x118(0x10)(HasGetValueTypeHash)
	FOptionProperty_                             _ExprResultStack_12;                               // 0x128(0x18)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_13;                                    // 0x140(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_14;                                    // 0x150(0x10)(HasGetValueTypeHash)
};

// 0x28 (0x28 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDotProduct_L_Nvector2i_M_Nvector2i_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDotProduct_L_Nvector2i_M_Nvector2i_R_Params
{
public:
	struct FTuple_Lvector2i_Mvector2i_R          __verse_0xB2CDDD72_Argument;                       // 0x0(0x20)(Parm, HasGetValueTypeHash)
	int64                                        RetVal;                                            // 0x20(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x28 (0x28 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDotProduct_L_Nvector2_M_Nvector2_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDotProduct_L_Nvector2_M_Nvector2_R_Params
{
public:
	struct FTuple_Lvector2_Mvector2_R            __verse_0xB2CDDD72_Argument;                       // 0x0(0x20)(Parm, HasGetValueTypeHash)
	double                                       RetVal;                                            // 0x20(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x38 (0x38 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDotProduct_L_Nvector3_M_Nvector3_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDotProduct_L_Nvector3_M_Nvector3_R_Params
{
public:
	struct FTuple_Lvector3_Mvector3_R            __verse_0xB2CDDD72_Argument;                       // 0x0(0x30)(Parm, HasGetValueTypeHash)
	double                                       RetVal;                                            // 0x30(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x38 (0x38 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDistanceXY_L_Nvector3_M_Nvector3_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDistanceXY_L_Nvector3_M_Nvector3_R_Params
{
public:
	struct FTuple_Lvector3_Mvector3_R            __verse_0xB2CDDD72_Argument;                       // 0x0(0x30)(Parm, HasGetValueTypeHash)
	double                                       RetVal;                                            // 0x30(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x38 (0x38 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDistanceSquaredXY_L_Nvector3_M_Nvector3_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDistanceSquaredXY_L_Nvector3_M_Nvector3_R_Params
{
public:
	struct FTuple_Lvector3_Mvector3_R            __verse_0xB2CDDD72_Argument;                       // 0x0(0x30)(Parm, HasGetValueTypeHash)
	double                                       RetVal;                                            // 0x30(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x38 (0x38 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDistanceSquared_L_Nvector3_M_Nvector3_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDistanceSquared_L_Nvector3_M_Nvector3_R_Params
{
public:
	struct FTuple_Lvector3_Mvector3_R            __verse_0xB2CDDD72_Argument;                       // 0x0(0x30)(Parm, HasGetValueTypeHash)
	double                                       RetVal;                                            // 0x30(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x28 (0x28 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDistanceSquared_L_Nvector2_M_Nvector2_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDistanceSquared_L_Nvector2_M_Nvector2_R_Params
{
public:
	struct FTuple_Lvector2_Mvector2_R            __verse_0xB2CDDD72_Argument;                       // 0x0(0x20)(Parm, HasGetValueTypeHash)
	double                                       RetVal;                                            // 0x20(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x28 (0x28 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDistance_L_Nvector2_M_Nvector2_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDistance_L_Nvector2_M_Nvector2_R_Params
{
public:
	struct FTuple_Lvector2_Mvector2_R            __verse_0xB2CDDD72_Argument;                       // 0x0(0x20)(Parm, HasGetValueTypeHash)
	double                                       RetVal;                                            // 0x20(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x48 (0x48 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDistance_L_Nrotation_M_Nrotation_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDistance_L_Nrotation_M_Nrotation_R_Params
{
public:
	struct FTuple_Lrotation_Mrotation_R          __verse_0xB2CDDD72_Argument;                       // 0x0(0x40)(Parm, HasGetValueTypeHash)
	double                                       RetVal;                                            // 0x40(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x38 (0x38 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDistance_L_Nvector3_M_Nvector3_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDistance_L_Nvector3_M_Nvector3_R_Params
{
public:
	struct FTuple_Lvector3_Mvector3_R            __verse_0xB2CDDD72_Argument;                       // 0x0(0x30)(Parm, HasGetValueTypeHash)
	double                                       RetVal;                                            // 0x30(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x10 (0x10 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDegreesToRadians_L_Nfloat_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDegreesToRadians_L_Nfloat_R_Params
{
public:
	double                                       __verse_0xB2CDDD72_Argument;                       // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       RetVal;                                            // 0x8(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x48 (0x48 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RCrossProduct_L_Nvector3_M_Nvector3_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RCrossProduct_L_Nvector3_M_Nvector3_R_Params
{
public:
	struct FTuple_Lvector3_Mvector3_R            __verse_0xB2CDDD72_Argument;                       // 0x0(0x30)(Parm, HasGetValueTypeHash)
	struct FSpatialMath_vector3                  RetVal;                                            // 0x30(0x18)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// 0xAA (0xAA - 0x0)
// Function EpicGamesTemporary.SpatialMath.SpatialMath_vector3$OverrideFactory
struct USpatialMath_SpatialMath_vector3_OverrideFactory_Params
{
public:
	struct FSpatialMath_vector3                  RetVal;                                            // 0x0(0x18)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           __verse_0xFB48ED96__InitOverrideMap;               // 0x18(0x50)(ConstParm, Parm, ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResultStack_0;                                // 0x68(0x10)(HasGetValueTypeHash)
	FOptionProperty_                             _ExprResult_1;                                     // 0x78(0x2)(NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_3EBF[0x6];                                     // Fixing Size After Last Property..
	FVerseStringProperty_                        _ExprResultStack_2;                                // 0x80(0x10)(HasGetValueTypeHash)
	FOptionProperty_                             _ExprResult_3;                                     // 0x90(0x2)(NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_3EC0[0x6];                                     // Fixing Size After Last Property..
	FVerseStringProperty_                        _ExprResultStack_4;                                // 0x98(0x10)(HasGetValueTypeHash)
	FOptionProperty_                             _ExprResult_5;                                     // 0xA8(0x2)(NoDestructor, HasGetValueTypeHash)
};

// 0x18 (0x18 - 0x0)
// Function EpicGamesTemporary.SpatialMath.SpatialMath_vector3$Factory
struct USpatialMath_SpatialMath_vector3_Factory_Params
{
public:
	struct FSpatialMath_vector3                  RetVal;                                            // 0x0(0x18)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// 0x8A (0x8A - 0x0)
// Function EpicGamesTemporary.SpatialMath.SpatialMath_vector2i$OverrideFactory
struct USpatialMath_SpatialMath_vector2i_OverrideFactory_Params
{
public:
	struct FSpatialMath_vector2i                 RetVal;                                            // 0x0(0x10)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           __verse_0xFB48ED96__InitOverrideMap;               // 0x10(0x50)(ConstParm, Parm, ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResultStack_0;                                // 0x60(0x10)(HasGetValueTypeHash)
	FOptionProperty_                             _ExprResult_1;                                     // 0x70(0x2)(NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_3EC1[0x6];                                     // Fixing Size After Last Property..
	FVerseStringProperty_                        _ExprResultStack_2;                                // 0x78(0x10)(HasGetValueTypeHash)
	FOptionProperty_                             _ExprResult_3;                                     // 0x88(0x2)(NoDestructor, HasGetValueTypeHash)
};

// 0x10 (0x10 - 0x0)
// Function EpicGamesTemporary.SpatialMath.SpatialMath_vector2i$Factory
struct USpatialMath_SpatialMath_vector2i_Factory_Params
{
public:
	struct FSpatialMath_vector2i                 RetVal;                                            // 0x0(0x10)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// 0x8A (0x8A - 0x0)
// Function EpicGamesTemporary.SpatialMath.SpatialMath_vector2$OverrideFactory
struct USpatialMath_SpatialMath_vector2_OverrideFactory_Params
{
public:
	struct FSpatialMath_vector2                  RetVal;                                            // 0x0(0x10)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           __verse_0xFB48ED96__InitOverrideMap;               // 0x10(0x50)(ConstParm, Parm, ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResultStack_0;                                // 0x60(0x10)(HasGetValueTypeHash)
	FOptionProperty_                             _ExprResult_1;                                     // 0x70(0x2)(NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_3EC2[0x6];                                     // Fixing Size After Last Property..
	FVerseStringProperty_                        _ExprResultStack_2;                                // 0x78(0x10)(HasGetValueTypeHash)
	FOptionProperty_                             _ExprResult_3;                                     // 0x88(0x2)(NoDestructor, HasGetValueTypeHash)
};

// 0x10 (0x10 - 0x0)
// Function EpicGamesTemporary.SpatialMath.SpatialMath_vector2$Factory
struct USpatialMath_SpatialMath_vector2_Factory_Params
{
public:
	struct FSpatialMath_vector2                  RetVal;                                            // 0x0(0x10)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// 0x268 (0x268 - 0x0)
// Function EpicGamesTemporary.SpatialMath.SpatialMath_transform$OverrideFactory
struct USpatialMath_SpatialMath_transform_OverrideFactory_Params
{
public:
	struct FSpatialMath_transform                RetVal;                                            // 0x0(0x60)(Parm, OutParm, ReturnParm, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           __verse_0xFB48ED96__InitOverrideMap;               // 0x60(0x50)(ConstParm, Parm, ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResultStack_0;                                // 0xB0(0x10)(HasGetValueTypeHash)
	FOptionProperty_                             _ExprResult_1;                                     // 0xC0(0x2)(NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_3EC3[0x6];                                     // Fixing Size After Last Property..
	struct FSpatialMath_vector3                  _ExprResult_2;                                     // 0xC8(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_3;                                // 0xE0(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_4;                                     // 0x130(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_5;                                     // 0x140(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_6;                                     // 0x150(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResultStack_7;                                // 0x160(0x10)(HasGetValueTypeHash)
	FOptionProperty_                             _ExprResult_8;                                     // 0x170(0x2)(NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_3EC4[0xE];                                     // Fixing Size After Last Property..
	struct FVerseRotation                        _ExprResultStack_9;                                // 0x180(0x20)(NoDestructor)
	FVerseFunctionProperty_                      _Callee_10;                                        // 0x1A0(0x10)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_11;                                    // 0x1B0(0x1)(HasGetValueTypeHash)
	uint8                                        Pad_3EC5[0x7];                                     // Fixing Size After Last Property..
	FVerseStringProperty_                        _ExprResultStack_12;                               // 0x1B8(0x10)(HasGetValueTypeHash)
	FOptionProperty_                             _ExprResult_13;                                    // 0x1C8(0x2)(NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_3EC6[0x6];                                     // Fixing Size After Last Property..
	struct FSpatialMath_vector3                  _ExprResult_14;                                    // 0x1D0(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_15;                               // 0x1E8(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_16;                                    // 0x238(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_17;                                    // 0x248(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_18;                                    // 0x258(0x10)(HasGetValueTypeHash)
};

// 0x1D0 (0x1D0 - 0x0)
// Function EpicGamesTemporary.SpatialMath.SpatialMath_transform$Factory
struct USpatialMath_SpatialMath_transform_Factory_Params
{
public:
	struct FSpatialMath_transform                RetVal;                                            // 0x0(0x60)(Parm, OutParm, ReturnParm, NoDestructor)
	struct FSpatialMath_vector3                  _ExprResult_0;                                     // 0x60(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_1;                                // 0x78(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_2;                                     // 0xC8(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_3;                                     // 0xD8(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_4;                                     // 0xE8(0x10)(HasGetValueTypeHash)
	uint8                                        Pad_3EC7[0x8];                                     // Fixing Size After Last Property..
	struct FVerseRotation                        _ExprResultStack_5;                                // 0x100(0x20)(NoDestructor)
	FVerseFunctionProperty_                      _Callee_6;                                         // 0x120(0x10)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_7;                                     // 0x130(0x1)(HasGetValueTypeHash)
	uint8                                        Pad_3EC8[0x7];                                     // Fixing Size After Last Property..
	struct FSpatialMath_vector3                  _ExprResult_8;                                     // 0x138(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_9;                                // 0x150(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_10;                                    // 0x1A0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_11;                                    // 0x1B0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_12;                                    // 0x1C0(0x10)(HasGetValueTypeHash)
};

// 0x0 (0x0 - 0x0)
// Function EpicGamesTemporary.SpatialMath.$InitCDO
struct USpatialMath__InitCDO_Params
{
public:
};

}
}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
