#pragma once

// Dumper.

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x8B22 (0x9372 - 0x850)
// AnimBlueprintGeneratedClass Player_SkyDiveAndGlide_AnimBP.Player_SkyDiveAndGlide_AnimBP_C
class UPlayer_SkyDiveAndGlide_AnimBP_C : public UFortSkydivingAnimInstance
{
public:
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0x850(0x8)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimBlueprintGeneratedMutableData    __AnimBlueprintMutables;                           // 0x858(0x42C)(HasGetValueTypeHash)
	uint8                                        Pad_3B00[0x4];                                     // Fixing Size After Last Property..
	struct FAnimSubsystemInstance                AnimBlueprintExtension_PropertyAccess;             // 0xC88(0x8)()
	struct FAnimSubsystemInstance                AnimBlueprintExtension_Base;                       // 0xC90(0x8)()
	struct FAnimNode_Root                        AnimGraphNode_Root;                                // 0xC98(0x20)()
	struct FAnimNode_RefPose                     AnimGraphNode_LocalRefPose_3;                      // 0xCB8(0x10)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_20;                   // 0xCC8(0x48)()
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_39;                    // 0xD10(0xC8)()
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_38;                    // 0xDD8(0xC8)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_115;                // 0xEA0(0x70)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_114;                // 0xF10(0x70)()
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_37;                    // 0xF80(0xC8)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_19;                   // 0x1048(0x48)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_18;                   // 0x1090(0x48)()
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_36;                    // 0x10D8(0xC8)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_17;                   // 0x11A0(0x48)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_16;                   // 0x11E8(0x48)()
	struct FAnimNode_BlendListByInt              AnimGraphNode_BlendListByInt_4;                    // 0x1230(0x48)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_35;                      // 0x1278(0x20)()
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine_12;                     // 0x1298(0xC8)()
	struct FAnimNode_RefPose                     AnimGraphNode_LocalRefPose_2;                      // 0x1360(0x10)()
	struct FAnimNode_BlendListByEnum             AnimGraphNode_BlendListByEnum_39;                  // 0x1370(0x48)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_113;                // 0x13B8(0x70)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_112;                // 0x1428(0x70)()
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_35;                    // 0x1498(0xC8)()
	struct FAnimNode_BlendListByEnum             AnimGraphNode_BlendListByEnum_38;                  // 0x1560(0x48)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_111;                // 0x15A8(0x70)()
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_34;                    // 0x1618(0xC8)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_110;                // 0x16E0(0x70)()
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_33;                    // 0x1750(0xC8)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_109;                // 0x1818(0x70)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_108;                // 0x1888(0x70)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_107;                // 0x18F8(0x70)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_106;                // 0x1968(0x70)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_105;                // 0x19D8(0x70)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_104;                // 0x1A48(0x70)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_103;                // 0x1AB8(0x70)()
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_32;                    // 0x1B28(0xC8)()
	struct FAnimNode_BlendListByInt              AnimGraphNode_BlendListByInt_3;                    // 0x1BF0(0x48)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_34;                      // 0x1C38(0x20)()
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine_11;                     // 0x1C58(0xC8)()
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_1;                    // 0x1D20(0x100)()
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose;                      // 0x1E20(0x100)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_50;                 // 0x1F20(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_49;                 // 0x1F48(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_48;                 // 0x1F70(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_47;                 // 0x1F98(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_46;                 // 0x1FC0(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_45;                 // 0x1FE8(0x28)()
	struct FAnimNode_TwoWayBlend                 AnimGraphNode_TwoWayBlend_10;                      // 0x2010(0xC0)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_102;                // 0x20D0(0x70)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_101;                // 0x2140(0x70)()
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_31;                    // 0x21B0(0xC8)()
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_30;                    // 0x2278(0xC8)()
	struct FAnimNode_TwoWayBlend                 AnimGraphNode_TwoWayBlend_9;                       // 0x2340(0xC0)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_100;                // 0x2400(0x70)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_99;                 // 0x2470(0x70)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool;                     // 0x24E0(0x48)()
	struct FAnimNode_BlendListByInt              AnimGraphNode_BlendListByInt_2;                    // 0x2528(0x48)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_98;                 // 0x2570(0x70)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_97;                 // 0x25E0(0x70)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_96;                 // 0x2650(0x70)()
	struct FAnimNode_BlendListByInt              AnimGraphNode_BlendListByInt_1;                    // 0x26C0(0x48)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_15;                   // 0x2708(0x48)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_14;                   // 0x2750(0x48)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_13;                   // 0x2798(0x48)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_33;                      // 0x27E0(0x20)()
	struct FAnimNode_BlendListByInt              AnimGraphNode_BlendListByInt;                      // 0x2800(0x48)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_12;                   // 0x2848(0x48)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_11;                   // 0x2890(0x48)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_10;                   // 0x28D8(0x48)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_32;                      // 0x2920(0x20)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_44;                 // 0x2940(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_43;                 // 0x2968(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_42;                 // 0x2990(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_41;                 // 0x29B8(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_40;                 // 0x29E0(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_39;                 // 0x2A08(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_38;                 // 0x2A30(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_37;                 // 0x2A58(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_36;                 // 0x2A80(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_35;                 // 0x2AA8(0x28)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_95;                 // 0x2AD0(0x70)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_94;                 // 0x2B40(0x70)()
	struct FAnimNode_TwoWayBlend                 AnimGraphNode_TwoWayBlend_8;                       // 0x2BB0(0xC0)()
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_29;                    // 0x2C70(0xC8)()
	struct FAnimNode_TwoWayBlend                 AnimGraphNode_TwoWayBlend_7;                       // 0x2D38(0xC0)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_93;                 // 0x2DF8(0x70)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_92;                 // 0x2E68(0x70)()
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_28;                    // 0x2ED8(0xC8)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_91;                 // 0x2FA0(0x70)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_31;                      // 0x3010(0x20)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_90;                 // 0x3030(0x70)()
	struct FAnimNode_BlendListByEnum             AnimGraphNode_BlendListByEnum_37;                  // 0x30A0(0x48)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_89;                 // 0x30E8(0x70)()
	struct FAnimNode_BlendListByEnum             AnimGraphNode_BlendListByEnum_36;                  // 0x3158(0x48)()
	struct FAnimNode_TwoWayBlend                 AnimGraphNode_TwoWayBlend_6;                       // 0x31A0(0xC0)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_88;                 // 0x3260(0x70)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_87;                 // 0x32D0(0x70)()
	struct FAnimNode_TwoWayBlend                 AnimGraphNode_TwoWayBlend_5;                       // 0x3340(0xC0)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_86;                 // 0x3400(0x70)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_85;                 // 0x3470(0x70)()
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_27;                    // 0x34E0(0xC8)()
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_26;                    // 0x35A8(0xC8)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_84;                 // 0x3670(0x70)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_30;                      // 0x36E0(0x20)()
	struct FAnimNode_RefPose                     AnimGraphNode_LocalRefPose_1;                      // 0x3700(0x10)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_29;                      // 0x3710(0x20)()
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_25;                    // 0x3730(0xC8)()
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_3;                     // 0x37F8(0x28)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_83;                 // 0x3820(0x70)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_28;                      // 0x3890(0x20)()
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_24;                    // 0x38B0(0xC8)()
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_2;                     // 0x3978(0x28)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_82;                 // 0x39A0(0x70)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_27;                      // 0x3A10(0x20)()
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine_10;                     // 0x3A30(0xC8)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_26;                      // 0x3AF8(0x20)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_34;                 // 0x3B18(0x28)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_81;                 // 0x3B40(0x70)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_80;                 // 0x3BB0(0x70)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_79;                 // 0x3C20(0x70)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_78;                 // 0x3C90(0x70)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_77;                 // 0x3D00(0x70)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_76;                 // 0x3D70(0x70)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_75;                 // 0x3DE0(0x70)()
	struct FAnimNode_BlendListByEnum             AnimGraphNode_BlendListByEnum_35;                  // 0x3E50(0x48)()
	struct FAnimNode_BlendListByEnum             AnimGraphNode_BlendListByEnum_34;                  // 0x3E98(0x48)()
	struct FAnimNode_BlendListByEnum             AnimGraphNode_BlendListByEnum_33;                  // 0x3EE0(0x48)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_74;                 // 0x3F28(0x70)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_73;                 // 0x3F98(0x70)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_72;                 // 0x4008(0x70)()
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_23;                    // 0x4078(0xC8)()
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_22;                    // 0x4140(0xC8)()
	struct FAnimNode_BlendListByEnum             AnimGraphNode_BlendListByEnum_32;                  // 0x4208(0x48)()
	struct FAnimNode_BlendListByEnum             AnimGraphNode_BlendListByEnum_31;                  // 0x4250(0x48)()
	struct FAnimNode_BlendListByEnum             AnimGraphNode_BlendListByEnum_30;                  // 0x4298(0x48)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_71;                 // 0x42E0(0x70)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_25;                      // 0x4350(0x20)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_70;                 // 0x4370(0x70)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_69;                 // 0x43E0(0x70)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_68;                 // 0x4450(0x70)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_67;                 // 0x44C0(0x70)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_66;                 // 0x4530(0x70)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_65;                 // 0x45A0(0x70)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_64;                 // 0x4610(0x70)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_63;                 // 0x4680(0x70)()
	struct FAnimNode_BlendListByEnum             AnimGraphNode_BlendListByEnum_29;                  // 0x46F0(0x48)()
	struct FAnimNode_BlendListByEnum             AnimGraphNode_BlendListByEnum_28;                  // 0x4738(0x48)()
	struct FAnimNode_BlendListByEnum             AnimGraphNode_BlendListByEnum_27;                  // 0x4780(0x48)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_62;                 // 0x47C8(0x70)()
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_21;                    // 0x4838(0xC8)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_61;                 // 0x4900(0x70)()
	struct FAnimNode_BlendListByEnum             AnimGraphNode_BlendListByEnum_26;                  // 0x4970(0x48)()
	struct FAnimNode_BlendListByEnum             AnimGraphNode_BlendListByEnum_25;                  // 0x49B8(0x48)()
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_20;                    // 0x4A00(0xC8)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_60;                 // 0x4AC8(0x70)()
	struct FAnimNode_BlendListByEnum             AnimGraphNode_BlendListByEnum_24;                  // 0x4B38(0x48)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_24;                      // 0x4B80(0x20)()
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine_9;                      // 0x4BA0(0xC8)()
	struct FAnimNode_BlendListByEnum             AnimGraphNode_BlendListByEnum_23;                  // 0x4C68(0x48)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_33;                 // 0x4CB0(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_32;                 // 0x4CD8(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_31;                 // 0x4D00(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_30;                 // 0x4D28(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_29;                 // 0x4D50(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_28;                 // 0x4D78(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_27;                 // 0x4DA0(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_26;                 // 0x4DC8(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_25;                 // 0x4DF0(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_24;                 // 0x4E18(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_23;                 // 0x4E40(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_22;                 // 0x4E68(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_21;                 // 0x4E90(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_20;                 // 0x4EB8(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_19;                 // 0x4EE0(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_18;                 // 0x4F08(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_17;                 // 0x4F30(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_16;                 // 0x4F58(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_15;                 // 0x4F80(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_14;                 // 0x4FA8(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_13;                 // 0x4FD0(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_12;                 // 0x4FF8(0x28)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_9;                    // 0x5020(0x48)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_23;                      // 0x5068(0x20)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_8;                    // 0x5088(0x48)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_22;                      // 0x50D0(0x20)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_7;                    // 0x50F0(0x48)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_21;                      // 0x5138(0x20)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_6;                    // 0x5158(0x48)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_20;                      // 0x51A0(0x20)()
	struct FAnimNode_RefPose                     AnimGraphNode_IdentityPose_1;                      // 0x51C0(0x10)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_19;                      // 0x51D0(0x20)()
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine_8;                      // 0x51F0(0xC8)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_18;                      // 0x52B8(0x20)()
	struct FAnimNode_BlendListByEnum             AnimGraphNode_BlendListByEnum_22;                  // 0x52D8(0x48)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_5;                    // 0x5320(0x48)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_4;                    // 0x5368(0x48)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_3;                    // 0x53B0(0x48)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_2;                    // 0x53F8(0x48)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_1;                    // 0x5440(0x48)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_17;                      // 0x5488(0x20)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_59;                 // 0x54A8(0x70)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_58;                 // 0x5518(0x70)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_57;                 // 0x5588(0x70)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_56;                 // 0x55F8(0x70)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_55;                 // 0x5668(0x70)()
	struct FAnimNode_BlendListByEnum             AnimGraphNode_BlendListByEnum_21;                  // 0x56D8(0x48)()
	struct FAnimNode_BlendListByEnum             AnimGraphNode_BlendListByEnum_20;                  // 0x5720(0x48)()
	struct FAnimNode_BlendListByEnum             AnimGraphNode_BlendListByEnum_19;                  // 0x5768(0x48)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_16;                      // 0x57B0(0x20)()
	struct FAnimNode_RefPose                     AnimGraphNode_IdentityPose;                        // 0x57D0(0x10)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_15;                      // 0x57E0(0x20)()
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine_7;                      // 0x5800(0xC8)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_11;                 // 0x58C8(0x28)()
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_19;                    // 0x58F0(0xC8)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_54;                 // 0x59B8(0x70)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_14;                      // 0x5A28(0x20)()
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine_6;                      // 0x5A48(0xC8)()
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_18;                    // 0x5B10(0xC8)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_53;                 // 0x5BD8(0x70)()
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_17;                    // 0x5C48(0xC8)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_52;                 // 0x5D10(0x70)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_51;                 // 0x5D80(0x70)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_13;                      // 0x5DF0(0x20)()
	struct FAnimNode_BlendListByEnum             AnimGraphNode_BlendListByEnum_18;                  // 0x5E10(0x48)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_50;                 // 0x5E58(0x70)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_49;                 // 0x5EC8(0x70)()
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_16;                    // 0x5F38(0xC8)()
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_15;                    // 0x6000(0xC8)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_48;                 // 0x60C8(0x70)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_47;                 // 0x6138(0x70)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_12;                      // 0x61A8(0x20)()
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine_5;                      // 0x61C8(0xC8)()
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_14;                    // 0x6290(0xC8)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_10;                 // 0x6358(0x28)()
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_13;                    // 0x6380(0xC8)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_46;                 // 0x6448(0x70)()
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_12;                    // 0x64B8(0xC8)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_45;                 // 0x6580(0x70)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_44;                 // 0x65F0(0x70)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_11;                      // 0x6660(0x20)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_43;                 // 0x6680(0x70)()
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_11;                    // 0x66F0(0xC8)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_42;                 // 0x67B8(0x70)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_10;                      // 0x6828(0x20)()
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine_4;                      // 0x6848(0xC8)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_9;                  // 0x6910(0x28)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_41;                 // 0x6938(0x70)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_40;                 // 0x69A8(0x70)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_39;                 // 0x6A18(0x70)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_38;                 // 0x6A88(0x70)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_37;                 // 0x6AF8(0x70)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_36;                 // 0x6B68(0x70)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_35;                 // 0x6BD8(0x70)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_34;                 // 0x6C48(0x70)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_33;                 // 0x6CB8(0x70)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_32;                 // 0x6D28(0x70)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_31;                 // 0x6D98(0x70)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_30;                 // 0x6E08(0x70)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_29;                 // 0x6E78(0x70)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_28;                 // 0x6EE8(0x70)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_27;                 // 0x6F58(0x70)()
	struct FAnimNode_TwoWayBlend                 AnimGraphNode_TwoWayBlend_4;                       // 0x6FC8(0xC0)()
	struct FAnimNode_BlendListByEnum             AnimGraphNode_BlendListByEnum_17;                  // 0x7088(0x48)()
	struct FAnimNode_BlendListByEnum             AnimGraphNode_BlendListByEnum_16;                  // 0x70D0(0x48)()
	struct FAnimNode_BlendListByEnum             AnimGraphNode_BlendListByEnum_15;                  // 0x7118(0x48)()
	struct FAnimNode_BlendListByEnum             AnimGraphNode_BlendListByEnum_14;                  // 0x7160(0x48)()
	struct FAnimNode_BlendListByEnum             AnimGraphNode_BlendListByEnum_13;                  // 0x71A8(0x48)()
	struct FAnimNode_BlendListByEnum             AnimGraphNode_BlendListByEnum_12;                  // 0x71F0(0x48)()
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_10;                    // 0x7238(0xC8)()
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_9;                     // 0x7300(0xC8)()
	struct FAnimNode_BlendListByEnum             AnimGraphNode_BlendListByEnum_11;                  // 0x73C8(0x48)()
	struct FAnimNode_BlendListByEnum             AnimGraphNode_BlendListByEnum_10;                  // 0x7410(0x48)()
	struct FAnimNode_BlendListByEnum             AnimGraphNode_BlendListByEnum_9;                   // 0x7458(0x48)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_26;                 // 0x74A0(0x70)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_9;                       // 0x7510(0x20)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_25;                 // 0x7530(0x70)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_24;                 // 0x75A0(0x70)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_23;                 // 0x7610(0x70)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_22;                 // 0x7680(0x70)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_21;                 // 0x76F0(0x70)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_20;                 // 0x7760(0x70)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_19;                 // 0x77D0(0x70)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_18;                 // 0x7840(0x70)()
	struct FAnimNode_BlendListByEnum             AnimGraphNode_BlendListByEnum_8;                   // 0x78B0(0x48)()
	struct FAnimNode_BlendListByEnum             AnimGraphNode_BlendListByEnum_7;                   // 0x78F8(0x48)()
	struct FAnimNode_BlendListByEnum             AnimGraphNode_BlendListByEnum_6;                   // 0x7940(0x48)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_17;                 // 0x7988(0x70)()
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_8;                     // 0x79F8(0xC8)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_16;                 // 0x7AC0(0x70)()
	struct FAnimNode_BlendListByEnum             AnimGraphNode_BlendListByEnum_5;                   // 0x7B30(0x48)()
	struct FAnimNode_BlendListByEnum             AnimGraphNode_BlendListByEnum_4;                   // 0x7B78(0x48)()
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_7;                     // 0x7BC0(0xC8)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_15;                 // 0x7C88(0x70)()
	struct FAnimNode_BlendListByEnum             AnimGraphNode_BlendListByEnum_3;                   // 0x7CF8(0x48)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_8;                       // 0x7D40(0x20)()
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine_3;                      // 0x7D60(0xC8)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_7;                       // 0x7E28(0x20)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_8;                  // 0x7E48(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_7;                  // 0x7E70(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_6;                  // 0x7E98(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_5;                  // 0x7EC0(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_4;                  // 0x7EE8(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_3;                  // 0x7F10(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_2;                  // 0x7F38(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_1;                  // 0x7F60(0x28)()
	struct FAnimNode_RefPose                     AnimGraphNode_LocalRefPose;                        // 0x7F88(0x10)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_6;                       // 0x7F98(0x20)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_14;                 // 0x7FB8(0x70)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_13;                 // 0x8028(0x70)()
	struct FAnimNode_TwoWayBlend                 AnimGraphNode_TwoWayBlend_3;                       // 0x8098(0xC0)()
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_6;                     // 0x8158(0xC8)()
	struct FAnimNode_TwoWayBlend                 AnimGraphNode_TwoWayBlend_2;                       // 0x8220(0xC0)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_12;                 // 0x82E0(0x70)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_11;                 // 0x8350(0x70)()
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_5;                     // 0x83C0(0xC8)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_10;                 // 0x8488(0x70)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_5;                       // 0x84F8(0x20)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_9;                  // 0x8518(0x70)()
	struct FAnimNode_BlendListByEnum             AnimGraphNode_BlendListByEnum_2;                   // 0x8588(0x48)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_8;                  // 0x85D0(0x70)()
	struct FAnimNode_BlendListByEnum             AnimGraphNode_BlendListByEnum_1;                   // 0x8640(0x48)()
	struct FAnimNode_TwoWayBlend                 AnimGraphNode_TwoWayBlend_1;                       // 0x8688(0xC0)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_7;                  // 0x8748(0x70)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_6;                  // 0x87B8(0x70)()
	struct FAnimNode_TwoWayBlend                 AnimGraphNode_TwoWayBlend;                         // 0x8828(0xC0)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_5;                  // 0x88E8(0x70)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_4;                  // 0x8958(0x70)()
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_4;                     // 0x89C8(0xC8)()
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_3;                     // 0x8A90(0xC8)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_3;                  // 0x8B58(0x70)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_4;                       // 0x8BC8(0x20)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer;                      // 0x8BE8(0x48)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_2;                  // 0x8C30(0x70)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_1;                  // 0x8CA0(0x70)()
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_2;                     // 0x8D10(0xC8)()
	struct FAnimNode_BlendListByEnum             AnimGraphNode_BlendListByEnum;                     // 0x8DD8(0x48)()
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_1;                     // 0x8E20(0xC8)()
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_1;                     // 0x8EE8(0x28)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_3;                       // 0x8F10(0x20)()
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive;                       // 0x8F30(0xC8)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer;                    // 0x8FF8(0x70)()
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose;                       // 0x9068(0x28)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_2;                       // 0x9090(0x20)()
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine_2;                      // 0x90B0(0xC8)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_1;                       // 0x9178(0x20)()
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine_1;                      // 0x9198(0xC8)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult;                         // 0x9260(0x20)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult;                    // 0x9280(0x28)()
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine;                        // 0x92A8(0xC8)()
	bool                                         ParaGlide_TriggerAnim;                             // 0x9370(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         BlockAnimRule;                                     // 0x9371(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("Player_SkyDiveAndGlide_AnimBP_C");
		return Clss;
	}

	void AnimGraph(struct FPoseLink* AnimGraph);
	void ExecuteUbergraph_Player_SkyDiveAndGlide_AnimBP(int32 EntryPoint);
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
