#pragma once

// Dumper.

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x26C8 (0x3CA8 - 0x15E0)
// AnimBlueprintGeneratedClass Player_TacticalState_AnimBP.Player_TacticalState_AnimBP_C
class UPlayer_TacticalState_AnimBP_C : public UFortPlayerTacticalStateAnimInstance
{
public:
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0x15E0(0x8)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimBlueprintGeneratedMutableData    __AnimBlueprintMutables;                           // 0x15E8(0x22)(HasGetValueTypeHash)
	uint8                                        Pad_8E6D[0x6];                                     // Fixing Size After Last Property..
	struct FAnimSubsystemInstance                AnimBlueprintExtension_PropertyAccess;             // 0x1610(0x8)()
	struct FAnimSubsystemInstance                AnimBlueprintExtension_Base;                       // 0x1618(0x8)()
	struct FAnimNode_Root                        AnimGraphNode_Root_2;                              // 0x1620(0x20)()
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_2;                     // 0x1640(0xC8)()
	struct FAnimNode_BlendListByEnum             AnimGraphNode_BlendListByEnum;                     // 0x1708(0x48)()
	struct FAnimNode_RefPose                     AnimGraphNode_IdentityPose;                        // 0x1750(0x10)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_38;                   // 0x1760(0x48)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_37;                   // 0x17A8(0x48)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_36;                   // 0x17F0(0x48)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_35;                   // 0x1838(0x48)()
	struct FAnimNode_LinkedInputPose             AnimGraphNode_LinkedInputPose;                     // 0x1880(0xC0)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_34;                   // 0x1940(0x48)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_33;                   // 0x1988(0x48)()
	struct FAnimNode_Root                        AnimGraphNode_Root_1;                              // 0x19D0(0x20)()
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_2;                     // 0x19F0(0x28)()
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_1;                     // 0x1A18(0xC8)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_1;                  // 0x1AE0(0x70)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_22;                      // 0x1B50(0x20)()
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine_4;                      // 0x1B70(0xC8)()
	struct FAnimNode_Inertialization             AnimGraphNode_Inertialization;                     // 0x1C38(0x100)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_32;                 // 0x1D38(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_31;                 // 0x1D60(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_30;                 // 0x1D88(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_29;                 // 0x1DB0(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_28;                 // 0x1DD8(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_27;                 // 0x1E00(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_26;                 // 0x1E28(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_25;                 // 0x1E50(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_24;                 // 0x1E78(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_23;                 // 0x1EA0(0x28)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_32;                   // 0x1EC8(0x48)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_21;                      // 0x1F10(0x20)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_22;                 // 0x1F30(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_21;                 // 0x1F58(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_20;                 // 0x1F80(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_19;                 // 0x1FA8(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_18;                 // 0x1FD0(0x28)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_31;                   // 0x1FF8(0x48)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_14;                  // 0x2040(0x48)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_30;                   // 0x2088(0x48)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_20;                      // 0x20D0(0x20)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_13;                  // 0x20F0(0x48)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_29;                   // 0x2138(0x48)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_28;                   // 0x2180(0x48)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_19;                      // 0x21C8(0x20)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_12;                  // 0x21E8(0x48)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_27;                   // 0x2230(0x48)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_26;                   // 0x2278(0x48)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_18;                      // 0x22C0(0x20)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_25;                   // 0x22E0(0x48)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_11;                  // 0x2328(0x48)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_24;                   // 0x2370(0x48)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_17;                      // 0x23B8(0x20)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_23;                   // 0x23D8(0x48)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_10;                  // 0x2420(0x48)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_22;                   // 0x2468(0x48)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_16;                      // 0x24B0(0x20)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_17;                 // 0x24D0(0x28)()
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine_3;                      // 0x24F8(0xC8)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_15;                      // 0x25C0(0x20)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_16;                 // 0x25E0(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_15;                 // 0x2608(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_14;                 // 0x2630(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_13;                 // 0x2658(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_12;                 // 0x2680(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_11;                 // 0x26A8(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_10;                 // 0x26D0(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_9;                  // 0x26F8(0x28)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_21;                   // 0x2720(0x48)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_20;                   // 0x2768(0x48)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_9;                   // 0x27B0(0x48)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_14;                      // 0x27F8(0x20)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_19;                   // 0x2818(0x48)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_8;                   // 0x2860(0x48)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_18;                   // 0x28A8(0x48)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_13;                      // 0x28F0(0x20)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_7;                   // 0x2910(0x48)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_17;                   // 0x2958(0x48)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_16;                   // 0x29A0(0x48)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_12;                      // 0x29E8(0x20)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_15;                   // 0x2A08(0x48)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_6;                   // 0x2A50(0x48)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_14;                   // 0x2A98(0x48)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_11;                      // 0x2AE0(0x20)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_13;                   // 0x2B00(0x48)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_5;                   // 0x2B48(0x48)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_12;                   // 0x2B90(0x48)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_10;                      // 0x2BD8(0x20)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_11;                   // 0x2BF8(0x48)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_4;                   // 0x2C40(0x48)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_10;                   // 0x2C88(0x48)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_9;                       // 0x2CD0(0x20)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_3;                   // 0x2CF0(0x48)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_9;                    // 0x2D38(0x48)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_8;                    // 0x2D80(0x48)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_8;                       // 0x2DC8(0x20)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_7;                    // 0x2DE8(0x48)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_2;                   // 0x2E30(0x48)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_6;                    // 0x2E78(0x48)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_7;                       // 0x2EC0(0x20)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_8;                  // 0x2EE0(0x28)()
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine_2;                      // 0x2F08(0xC8)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_6;                       // 0x2FD0(0x20)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_7;                  // 0x2FF0(0x28)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_5;                    // 0x3018(0x48)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_5;                       // 0x3060(0x20)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_4;                    // 0x3080(0x48)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_4;                       // 0x30C8(0x20)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_3;                    // 0x30E8(0x48)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_3;                       // 0x3130(0x20)()
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine_1;                      // 0x3150(0xC8)()
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_1;                    // 0x3218(0x100)()
	struct FAnimNode_RotateRootBone              AnimGraphNode_RotateRootBone;                      // 0x3318(0xB0)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer;                    // 0x33C8(0x70)()
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive;                       // 0x3438(0xC8)()
	struct FAnimNode_Root                        AnimGraphNode_Root;                                // 0x3500(0x20)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_6;                  // 0x3520(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_5;                  // 0x3548(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_4;                  // 0x3570(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_3;                  // 0x3598(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_2;                  // 0x35C0(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_1;                  // 0x35E8(0x28)()
	struct FAnimNode_ModifyCurve                 AnimGraphNode_ModifyCurve;                         // 0x3610(0x100)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_2;                    // 0x3710(0x48)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_2;                       // 0x3758(0x20)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult;                    // 0x3778(0x28)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_1;                    // 0x37A0(0x48)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_1;                       // 0x37E8(0x20)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer;                      // 0x3808(0x48)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult;                         // 0x3850(0x20)()
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine;                        // 0x3870(0xC8)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_1;                   // 0x3938(0x48)()
	struct FAnimNode_LinkedAnimLayer             AnimGraphNode_LinkedAnimLayer_1;                   // 0x3980(0xC8)()
	struct FAnimNode_LinkedAnimLayer             AnimGraphNode_LinkedAnimLayer;                     // 0x3A48(0xC8)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool;                     // 0x3B10(0x48)()
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose;                      // 0x3B58(0x100)()
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_1;                     // 0x3C58(0x28)()
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose;                       // 0x3C80(0x28)()

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("Player_TacticalState_AnimBP_C");
		return Clss;
	}

	void WeaponBoneFixLayer(const struct FPoseLink& InPose, struct FPoseLink* WeaponBoneFixLayer);
	void TacticalSprintLayer(struct FPoseLink* TacticalSprintLayer);
	void AnimGraph(struct FPoseLink* AnimGraph);
	void ExecuteUbergraph_Player_TacticalState_AnimBP(int32 EntryPoint);
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
