#pragma once

// Dumper.

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x5F8 (0x4D28 - 0x4730)
// BlueprintGeneratedClass PlayerPawn_Generic.PlayerPawn_Generic_C
class UPlayerPawn_Generic_C : public UPlayerPawn_Generic_Parent_C
{
public:
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0x4730(0x8)(ZeroConstructor, Transient, DuplicateTransient)
	class UMotionWarpingComponent*               MotionWarping;                                     // 0x4738(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*              SplashEffectsForEnteringOrExitingWater;            // 0x4740(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*              GamplayWindInteractionEffects;                     // 0x4748(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*              Effect_Player_Run_Land;                            // 0x4750(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*              Effect_Player_Walk_Land;                           // 0x4758(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*              Effect_Player_Walk_Water;                          // 0x4760(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*              Effect_Player_Run_Water;                           // 0x4768(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*              Effect_WaterInteraction_FX;                        // 0x4770(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*              HitDamageParticles;                                // 0x4778(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UWidgetComponent*                      SpeechBubbleComponent;                             // 0x4780(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                   PlayerLight;                                       // 0x4788(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                        ShatterShield_Push_3B96BD02488A8F69F3D086A2B7978EC8; // 0x4790(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        ShatterShield_Opacity_3B96BD02488A8F69F3D086A2B7978EC8; // 0x4794(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        ShatterShield_Highlight_Cracks_3B96BD02488A8F69F3D086A2B7978EC8; // 0x4798(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class ETimelineDirection                ShatterShield__Direction_3B96BD02488A8F69F3D086A2B7978EC8; // 0x479C(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_927F[0x3];                                     // Fixing Size After Last Property..
	class UTimelineComponent*                    ShatterShield;                                     // 0x47A0(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                            HitByHuskRangedSound;                              // 0x47A8(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                            HitByHuskMeleeSound;                               // 0x47B0(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                          SoulSuckVictimMontage;                             // 0x47B8(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                       PlayerSpeed;                                       // 0x47C0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       Run_Particle_Activate_Speed;                       // 0x47C8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       Walk_Dust_Activate_Speed;                          // 0x47D0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       Walk_Particle_Reset_Speed;                         // 0x47D8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                               PreviousVelocityVector;                            // 0x47E0(0x18)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         CanSpawnRunKickupFX_;                              // 0x47F8(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         CanSpawnWalkKickupFX_;                             // 0x47F9(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         CanSpawnDustLandFX_;                               // 0x47FA(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_9280[0x5];                                     // Fixing Size After Last Property..
	struct FRotator                              RunWalkParticleRotation;                           // 0x4800(0x18)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                         IsNinjaInShadowStance_;                            // 0x4818(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_9281[0x7];                                     // Fixing Size After Last Property..
	struct FGameplayTagContainer                 GameplayTagsForHitByHuskMeleeSound;                // 0x4820(0x20)(Edit, BlueprintVisible)
	class UMaterialInterface*                    Shield_Material;                                   // 0x4840(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class UMaterialInstanceDynamic*>      BodyShieldMIDArray;                                // 0x4848(0x10)(Edit, BlueprintVisible, DisableEditOnInstance, Deprecated)
	TArray<class UMaterialInstanceDynamic*>      HeadShieldMIDArray;                                // 0x4858(0x10)(Edit, BlueprintVisible, DisableEditOnInstance, Deprecated)
	bool                                         Shield_Active;                                     // 0x4868(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_9282[0x7];                                     // Fixing Size After Last Property..
	class USoundBase*                            Sound_Shield_Impact;                               // 0x4870(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                            Sound_Shield_Destroyed;                            // 0x4878(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                            Sound_Shield_FullyCharged;                         // 0x4880(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                       Shield_Shatter_Opacity;                            // 0x4888(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       Regen_Opacity;                                     // 0x4890(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       Damage_Opacity;                                    // 0x4898(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       Default_Shield_opacity;                            // 0x48A0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       Shield_PushMinValue;                               // 0x48A8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         ShieldVisible_Hit;                                 // 0x48B0(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         ShieldVisible_Recover;                             // 0x48B1(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         ShieldVisible_Shatter;                             // 0x48B2(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         ShieldVisible_FullHealth;                          // 0x48B3(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_9283[0x4];                                     // Fixing Size After Last Property..
	double                                       Fully_Regened_Shield_health_Opacity;               // 0x48B8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                 TC_GameplayCueDamageShielded;                      // 0x48C0(0x20)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                         LatestDamageIsShieldDamage;                        // 0x48E0(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_9284[0x7];                                     // Fixing Size After Last Property..
	double                                       Damage_Taken;                                      // 0x48E8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       Last_Shield_Damage_Time;                           // 0x48F0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UMaterialInstanceDynamic*>      CharmShieldMIDArray;                               // 0x48F8(0x10)(Edit, BlueprintVisible, DisableEditOnInstance, Deprecated)
	bool                                         BodyValid;                                         // 0x4908(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         BackpackValid;                                     // 0x4909(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         HatValid;                                          // 0x490A(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         FaceValid;                                         // 0x490B(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         CharmValid;                                        // 0x490C(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         HeadValid;                                         // 0x490D(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         On_Player_Built_Floor;                             // 0x490E(0x1)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_9285[0x1];                                     // Fixing Size After Last Property..
	struct FGameplayTag                          Event_NeedRoadsActive;                             // 0x4910(0x4)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                          Event_NeedRoadsDeactive;                           // 0x4914(0x4)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                 TC_WhereWereGoingWeNeedRoads;                      // 0x4918(0x20)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UParticleSystem*                       Effect_Player_LandedDust;                          // 0x4938(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                Shield_BodySkeletalMesh;                           // 0x4940(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, Deprecated, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                Shield_HeadSkeletalMesh;                           // 0x4948(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, Deprecated, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                Shield_CharmSkeletalMesh;                          // 0x4950(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, Deprecated, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                       Sound_Player_Hit;                                  // 0x4958(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UForceFeedbackEffect*                  DamageForceFeedback;                               // 0x4960(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                       Effect_Player_Landed_WindVector_P;                 // 0x4968(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UClass*                                SpeechBubbleWidgetClass;                           // 0x4970(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class FText                                  LastSpeechText;                                    // 0x4978(0x18)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UClass*                                DamageCameraShake;                                 // 0x4990(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                         UseAnimTrailsNotifies;                             // 0x4998(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_9286[0x7];                                     // Fixing Size After Last Property..
	struct FVector                               StableVelocityVector;                              // 0x49A0(0x18)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         TickWaterLevel;                                    // 0x49B8(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_9287[0x7];                                     // Fixing Size After Last Property..
	class UTextureRenderTarget2D*                WetnessDepthTexture;                               // 0x49C0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*              WaterLevelMID;                                     // 0x49C8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*              WaterDecayMID;                                     // 0x49D0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                         Was_RTT_Enabled_Var_Set;                           // 0x49D8(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Water_Scene_Capture_Enabled;                       // 0x49D9(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_9288[0x6];                                     // Fixing Size After Last Property..
	class UActor*                                CachedEffect;                                      // 0x49E0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class UMaterialInstanceDynamic*>      WaterInteractionWakeMIDS;                          // 0x49E8(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FLinearColor                          WaterTraceImpactNormalAndZHeightLocation;          // 0x49F8(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                               PlayerVelocity;                                    // 0x4A08(0x18)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         EnableRunWalkWaterGroundFX;                        // 0x4A20(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_9289[0x7];                                     // Fixing Size After Last Property..
	TArray<class UMaterialInstanceDynamic*>      Previous_MID;                                      // 0x4A28(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UMaterialInstanceDynamic*>      Previous_Weapon_MID;                               // 0x4A38(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	class USkeletalMeshComponent*                DuplicateCharacterMesh;                            // 0x4A48(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UMaterialInstanceDynamic*>      Previous_Head_MID;                                 // 0x4A50(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UMaterialInstanceDynamic*>      Previous_Body_MID;                                 // 0x4A60(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UMaterialInstanceDynamic*>      Previous_Hat_MID;                                  // 0x4A70(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UMaterialInstanceDynamic*>      Previous_Backpack_MID;                             // 0x4A80(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UMaterialInstanceDynamic*>      Previous_Charm_MID;                                // 0x4A90(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UMaterialInstanceDynamic*>      Previous_Face_MID;                                 // 0x4AA0(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	FMulticastInlineDelegateProperty_            SwingRight;                                        // 0x4AB0(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_            SwingRightEnd;                                     // 0x4AC0(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_            SwingLeft;                                         // 0x4AD0(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_            SwingLeftEnd;                                      // 0x4AE0(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_            AnimNotify_Begin;                                  // 0x4AF0(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_            AnimNotify_End;                                    // 0x4B00(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UFXSystemComponent*                    OverrideAnimTrail;                                 // 0x4B10(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_            SwingRight2;                                       // 0x4B18(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_            SwingLeft2;                                        // 0x4B28(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UFXSystemComponent*                    AnimTrailFX;                                       // 0x4B38(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                         BlockedByPawns;                                    // 0x4B40(0x1)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_928A[0x7];                                     // Fixing Size After Last Property..
	struct FGameplayAttribute                    Attribute_CurrentShield_Const;                     // 0x4B48(0x38)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	struct FGameplayAttribute                    Attribute_Shield_Const;                            // 0x4B80(0x38)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	struct FGameplayAttribute                    Attribute_CurrentHealth_Const;                     // 0x4BB8(0x38)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	struct FGameplayAttribute                    Attribute_Max_Health_Const;                        // 0x4BF0(0x38)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	struct FCameraLensInterfaceClassSupport      LensEffectInterfaceClass_PlayerHealthDamage;       // 0x4C28(0x8)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FCameraLensInterfaceClassSupport      LensEffectInterfaceClass_PlayerShieldDamage;       // 0x4C30(0x8)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FCameraLensInterfaceClassSupport      LensEffectInterfaceClass_Directional_PlayerShieldDamage; // 0x4C38(0x8)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FCameraLensInterfaceClassSupport      LensEffectInterfaceClass_Directional_PlayerHealthDamage; // 0x4C40(0x8)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	TArray<class UMaterialInstanceDynamic*>      Temp_DIM_Array;                                    // 0x4C48(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<enum class EFortCustomPartType, bool>   PartValid;                                         // 0x4C58(0x50)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<enum class EFortCustomPartType>       ShieldPartList;                                    // 0x4CA8(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)
	TArray<struct FCharacterPartMidArrayStruct>  ShieldMIDArrays;                                   // 0x4CB8(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<enum class EFortCustomPartType, class USkeletalMeshComponent*> ShieldSkMeshes;                                    // 0x4CC8(0x50)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	int32                                        L_ShieldMIDIndex;                                  // 0x4D18(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_928B[0x4];                                     // Fixing Size After Last Property..
	class USkeletalMeshComponent*                NullPart_Mesh;                                     // 0x4D20(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("PlayerPawn_Generic_C");
		return Clss;
	}

	void Melee_Effect_Color(struct FVector* Melee_Color_Set);
	void On_Set_Material_Part(class UFortPlayerPawn* Pawn, class UCustomCharacterPart* Part, class USkeletalMeshComponent* MeshPart, enum class EFortCustomPartType PartType, bool K2Node_SwitchEnum_CmpSuccess);
