#pragma once

// Dumper.

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

#include "../SDK.hpp"

namespace SDK
{
namespace Params
{
//---------------------------------------------------------------------------------------------------------------------
// PARAMETERS
//---------------------------------------------------------------------------------------------------------------------

// 0x20 (0x20 - 0x0)
// Function VerseFortniteUI.UI._L_2fFortnite_2ecom_2fUI_N_Roperator_U_2eShowHUDElements_U_L_Nplayer__ui_M_Ntuple_L_R_M_N_Khud__element__identifier_R
struct UUI__L_2fFortnite_2ecom_2fUI_N_Roperator_U_2eShowHUDElements_U_L_Nplayer__ui_M_Ntuple_L_R_M_N_Khud__element__identifier_R_Params
{
public:
	struct FTuple_Lplayer__ui_Mtuple_L_R_M_Khud__element__identifier_R __verse_0xB2CDDD72_Argument;                       // 0x0(0x20)(Parm, HasGetValueTypeHash)
};

// 0x20 (0x20 - 0x0)
// Function VerseFortniteUI.UI._L_2fFortnite_2ecom_2fUI_N_Roperator_U_2eResetHUDElementVisibility_U_L_Nplayer__ui_M_Ntuple_L_R_M_N_Khud__element__identifier_R
struct UUI__L_2fFortnite_2ecom_2fUI_N_Roperator_U_2eResetHUDElementVisibility_U_L_Nplayer__ui_M_Ntuple_L_R_M_N_Khud__element__identifier_R_Params
{
public:
	struct FTuple_Lplayer__ui_Mtuple_L_R_M_Khud__element__identifier_R __verse_0xB2CDDD72_Argument;                       // 0x0(0x20)(Parm, HasGetValueTypeHash)
};

// 0x20 (0x20 - 0x0)
// Function VerseFortniteUI.UI._L_2fFortnite_2ecom_2fUI_N_Roperator_U_2eHideHUDElements_U_L_Nplayer__ui_M_Ntuple_L_R_M_N_Khud__element__identifier_R
struct UUI__L_2fFortnite_2ecom_2fUI_N_Roperator_U_2eHideHUDElements_U_L_Nplayer__ui_M_Ntuple_L_R_M_N_Khud__element__identifier_R_Params
{
public:
	struct FTuple_Lplayer__ui_Mtuple_L_R_M_Khud__element__identifier_R __verse_0xB2CDDD72_Argument;                       // 0x0(0x20)(Parm, HasGetValueTypeHash)
};

// 0x18 (0x18 - 0x0)
// Function VerseFortniteUI.UI._L_2fFortnite_2ecom_2fUI_N_Roperator_U_2eGetHUDController_U_L_Nfort__playspace_M_Ntuple_L_R_M_Ntuple_L_R_R
struct UUI__L_2fFortnite_2ecom_2fUI_N_Roperator_U_2eGetHUDController_U_L_Nfort__playspace_M_Ntuple_L_R_M_Ntuple_L_R_R_Params
{
public:
	struct FTuple_Lfort__playspace_Mtuple_L_R_Mtuple_L_R_R __verse_0xB2CDDD72_Argument;                       // 0x0(0xA)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_41F2[0x6];                                     // Fixing Size After Last Property..
	class UObject*                               RetVal;                                            // 0x10(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteUI.UI.$InitCDO
struct UUI__InitCDO_Params
{
public:
};

// 0x10 (0x10 - 0x0)
// Function VerseFortniteUI.UI_editable_text_base._L_2fFortnite_2ecom_2fUI_2feditable__text__base_N_ROnTextCommitted
struct UUI_editable_text_base__L_2fFortnite_2ecom_2fUI_2feditable__text__base_N_ROnTextCommitted_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_41F3[0x7];                                     // Fixing Size After Last Property..
	class UObject*                               RetVal;                                            // 0x8(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteUI.UI_editable_text_base.$InitInstance
struct UUI_editable_text_base__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteUI.UI_editable_text_base.$Block
struct UUI_editable_text_base__Block_Params
{
public:
};

// 0x10 (0x10 - 0x0)
// Function VerseFortniteUI.UI_editable_text_base.$InitCDO
struct UUI_editable_text_base__InitCDO_Params
{
public:
	class UVerseEngine_subscribable_event*       _ExprResult_0;                                     // 0x0(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                       _InstancingGraph_1;                                // 0x8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteUI.UI_editable_text.$InitInstance
struct UUI_editable_text__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteUI.UI_editable_text.$Block
struct UUI_editable_text__Block_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteUI.UI_editable_text.$InitCDO
struct UUI_editable_text__InitCDO_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteUI.UI_editable_text_box.$InitInstance
struct UUI_editable_text_box__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteUI.UI_editable_text_box.$Block
struct UUI_editable_text_box__Block_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteUI.UI_editable_text_box.$InitCDO
struct UUI_editable_text_box__InitCDO_Params
{
public:
};

// 0x10 (0x10 - 0x0)
// Function VerseFortniteUI.UI_fort_hud_controller._L_2fFortnite_2ecom_2fUI_2ffort__hud__controller_N_RShowElements_L_N_Khud__element__identifier_R
struct UUI_fort_hud_controller__L_2fFortnite_2ecom_2fUI_2ffort__hud__controller_N_RShowElements_L_N_Khud__element__identifier_R_Params
{
public:
	TArray<class UUI_hud_element_identifier*>    __verse_0xB2CDDD72_Argument;                       // 0x0(0x10)(Parm, ContainsInstancedReference)
};

// 0x10 (0x10 - 0x0)
// Function VerseFortniteUI.UI_fort_hud_controller._L_2fFortnite_2ecom_2fUI_2ffort__hud__controller_N_RResetElementVisibility_L_N_Khud__element__identifier_R
struct UUI_fort_hud_controller__L_2fFortnite_2ecom_2fUI_2ffort__hud__controller_N_RResetElementVisibility_L_N_Khud__element__identifier_R_Params
{
public:
	TArray<class UUI_hud_element_identifier*>    __verse_0xB2CDDD72_Argument;                       // 0x0(0x10)(Parm, ContainsInstancedReference)
};

// 0x10 (0x10 - 0x0)
// Function VerseFortniteUI.UI_fort_hud_controller._L_2fFortnite_2ecom_2fUI_2ffort__hud__controller_N_RHideElements_L_N_Khud__element__identifier_R
struct UUI_fort_hud_controller__L_2fFortnite_2ecom_2fUI_2ffort__hud__controller_N_RHideElements_L_N_Khud__element__identifier_R_Params
{
public:
	TArray<class UUI_hud_element_identifier*>    __verse_0xB2CDDD72_Argument;                       // 0x0(0x10)(Parm, ContainsInstancedReference)
};

// 0x10 (0x10 - 0x0)
// Function VerseFortniteUI.UI_fort_playspace_hud_controller_impl._L_2fFortnite_2ecom_2fUI_2ffort__hud__controller_N_RShowElements_L_N_Khud__element__identifier_R
struct UUI_fort_playspace_hud_controller_impl__L_2fFortnite_2ecom_2fUI_2ffort__hud__controller_N_RShowElements_L_N_Khud__element__identifier_R_Params
{
public:
	TArray<class UUI_hud_element_identifier*>    __verse_0xB2CDDD72_Argument;                       // 0x0(0x10)(Parm, ContainsInstancedReference)
};

// 0x10 (0x10 - 0x0)
// Function VerseFortniteUI.UI_fort_playspace_hud_controller_impl._L_2fFortnite_2ecom_2fUI_2ffort__hud__controller_N_RResetElementVisibility_L_N_Khud__element__identifier_R
struct UUI_fort_playspace_hud_controller_impl__L_2fFortnite_2ecom_2fUI_2ffort__hud__controller_N_RResetElementVisibility_L_N_Khud__element__identifier_R_Params
{
public:
	TArray<class UUI_hud_element_identifier*>    __verse_0xB2CDDD72_Argument;                       // 0x0(0x10)(Parm, ContainsInstancedReference)
};

// 0x10 (0x10 - 0x0)
// Function VerseFortniteUI.UI_fort_playspace_hud_controller_impl._L_2fFortnite_2ecom_2fUI_2ffort__hud__controller_N_RHideElements_L_N_Khud__element__identifier_R
struct UUI_fort_playspace_hud_controller_impl__L_2fFortnite_2ecom_2fUI_2ffort__hud__controller_N_RHideElements_L_N_Khud__element__identifier_R_Params
{
public:
	TArray<class UUI_hud_element_identifier*>    __verse_0xB2CDDD72_Argument;                       // 0x0(0x10)(Parm, ContainsInstancedReference)
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteUI.UI_fort_playspace_hud_controller_impl.$InitInstance
struct UUI_fort_playspace_hud_controller_impl__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteUI.UI_fort_playspace_hud_controller_impl.$Block
struct UUI_fort_playspace_hud_controller_impl__Block_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteUI.UI_fort_playspace_hud_controller_impl.$InitCDO
struct UUI_fort_playspace_hud_controller_impl__InitCDO_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteUI.UI_hud_element_identifier.$InitInstance
struct UUI_hud_element_identifier__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteUI.UI_hud_element_identifier.$Block
struct UUI_hud_element_identifier__Block_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteUI.UI_hud_element_identifier.$InitCDO
struct UUI_hud_element_identifier__InitCDO_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteUI.UI_hud_element_game_phase_identifier_base.$InitInstance
struct UUI_hud_element_game_phase_identifier_base__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteUI.UI_hud_element_game_phase_identifier_base.$Block
struct UUI_hud_element_game_phase_identifier_base__Block_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteUI.UI_hud_element_game_phase_identifier_base.$InitCDO
struct UUI_hud_element_game_phase_identifier_base__InitCDO_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteUI.UI_hud_element_gameplay_tag_identifier_base.$InitInstance
struct UUI_hud_element_gameplay_tag_identifier_base__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteUI.UI_hud_element_gameplay_tag_identifier_base.$Block
struct UUI_hud_element_gameplay_tag_identifier_base__Block_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteUI.UI_hud_element_gameplay_tag_identifier_base.$InitCDO
struct UUI_hud_element_gameplay_tag_identifier_base__InitCDO_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteUI.UI_creative_hud_identifier_all.$InitInstance
struct UUI_creative_hud_identifier_all__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteUI.UI_creative_hud_identifier_all.$Block
struct UUI_creative_hud_identifier_all__Block_Params
{
public:
};

// 0x10 (0x10 - 0x0)
// Function VerseFortniteUI.UI_creative_hud_identifier_all.$InitCDO
struct UUI_creative_hud_identifier_all__InitCDO_Params
{
public:
	FVerseStringProperty_                        _ExprResult_0;                                     // 0x0(0x10)(HasGetValueTypeHash)
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteUI.UI_creative_hud_identifier_build_menu.$InitInstance
struct UUI_creative_hud_identifier_build_menu__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteUI.UI_creative_hud_identifier_build_menu.$Block
struct UUI_creative_hud_identifier_build_menu__Block_Params
{
public:
};

// 0x10 (0x10 - 0x0)
// Function VerseFortniteUI.UI_creative_hud_identifier_build_menu.$InitCDO
struct UUI_creative_hud_identifier_build_menu__InitCDO_Params
{
public:
	FVerseStringProperty_                        _ExprResult_0;                                     // 0x0(0x10)(HasGetValueTypeHash)
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteUI.UI_creative_hud_identifier_crafting_resources.$InitInstance
struct UUI_creative_hud_identifier_crafting_resources__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteUI.UI_creative_hud_identifier_crafting_resources.$Block
struct UUI_creative_hud_identifier_crafting_resources__Block_Params
{
public:
};

// 0x10 (0x10 - 0x0)
// Function VerseFortniteUI.UI_creative_hud_identifier_crafting_resources.$InitCDO
struct UUI_creative_hud_identifier_crafting_resources__InitCDO_Params
{
public:
	FVerseStringProperty_                        _ExprResult_0;                                     // 0x0(0x10)(HasGetValueTypeHash)
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteUI.UI_creative_hud_identifier_elimination_counter.$InitInstance
struct UUI_creative_hud_identifier_elimination_counter__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteUI.UI_creative_hud_identifier_elimination_counter.$Block
struct UUI_creative_hud_identifier_elimination_counter__Block_Params
{
public:
};

// 0x10 (0x10 - 0x0)
// Function VerseFortniteUI.UI_creative_hud_identifier_elimination_counter.$InitCDO
struct UUI_creative_hud_identifier_elimination_counter__InitCDO_Params
{
public:
	FVerseStringProperty_                        _ExprResult_0;                                     // 0x0(0x10)(HasGetValueTypeHash)
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteUI.UI_creative_hud_identifier_equipped_item.$InitInstance
struct UUI_creative_hud_identifier_equipped_item__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteUI.UI_creative_hud_identifier_equipped_item.$Block
struct UUI_creative_hud_identifier_equipped_item__Block_Params
{
public:
};

// 0x10 (0x10 - 0x0)
// Function VerseFortniteUI.UI_creative_hud_identifier_equipped_item.$InitCDO
struct UUI_creative_hud_identifier_equipped_item__InitCDO_Params
{
public:
	FVerseStringProperty_                        _ExprResult_0;                                     // 0x0(0x10)(HasGetValueTypeHash)
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteUI.UI_creative_hud_identifier_experience_level.$InitInstance
struct UUI_creative_hud_identifier_experience_level__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteUI.UI_creative_hud_identifier_experience_level.$Block
struct UUI_creative_hud_identifier_experience_level__Block_Params
{
public:
};

// 0x10 (0x10 - 0x0)
// Function VerseFortniteUI.UI_creative_hud_identifier_experience_level.$InitCDO
struct UUI_creative_hud_identifier_experience_level__InitCDO_Params
{
public:
	FVerseStringProperty_                        _ExprResult_0;                                     // 0x0(0x10)(HasGetValueTypeHash)
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteUI.UI_creative_hud_identifier_experience_supercharged.$InitInstance
struct UUI_creative_hud_identifier_experience_supercharged__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteUI.UI_creative_hud_identifier_experience_supercharged.$Block
struct UUI_creative_hud_identifier_experience_supercharged__Block_Params
{
public:
};

// 0x10 (0x10 - 0x0)
// Function VerseFortniteUI.UI_creative_hud_identifier_experience_supercharged.$InitCDO
struct UUI_creative_hud_identifier_experience_supercharged__InitCDO_Params
{
public:
	FVerseStringProperty_                        _ExprResult_0;                                     // 0x0(0x10)(HasGetValueTypeHash)
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteUI.UI_creative_hud_identifier_experience_ui.$InitInstance
struct UUI_creative_hud_identifier_experience_ui__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteUI.UI_creative_hud_identifier_experience_ui.$Block
struct UUI_creative_hud_identifier_experience_ui__Block_Params
{
public:
};

// 0x10 (0x10 - 0x0)
// Function VerseFortniteUI.UI_creative_hud_identifier_experience_ui.$InitCDO
struct UUI_creative_hud_identifier_experience_ui__InitCDO_Params
{
public:
	FVerseStringProperty_                        _ExprResult_0;                                     // 0x0(0x10)(HasGetValueTypeHash)
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteUI.UI_creative_hud_identifier_health.$InitInstance
struct UUI_creative_hud_identifier_health__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteUI.UI_creative_hud_identifier_health.$Block
struct UUI_creative_hud_identifier_health__Block_Params
{
public:
};

// 0x10 (0x10 - 0x0)
// Function VerseFortniteUI.UI_creative_hud_identifier_health.$InitCDO
struct UUI_creative_hud_identifier_health__InitCDO_Params
{
public:
	FVerseStringProperty_                        _ExprResult_0;                                     // 0x0(0x10)(HasGetValueTypeHash)
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteUI.UI_creative_hud_identifier_health_numbers.$InitInstance
struct UUI_creative_hud_identifier_health_numbers__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteUI.UI_creative_hud_identifier_health_numbers.$Block
struct UUI_creative_hud_identifier_health_numbers__Block_Params
{
public:
};

// 0x10 (0x10 - 0x0)
// Function VerseFortniteUI.UI_creative_hud_identifier_health_numbers.$InitCDO
struct UUI_creative_hud_identifier_health_numbers__InitCDO_Params
{
public:
	FVerseStringProperty_                        _ExprResult_0;                                     // 0x0(0x10)(HasGetValueTypeHash)
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteUI.UI_creative_hud_identifier_hud_info.$InitInstance
struct UUI_creative_hud_identifier_hud_info__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteUI.UI_creative_hud_identifier_hud_info.$Block
struct UUI_creative_hud_identifier_hud_info__Block_Params
{
public:
};

// 0x10 (0x10 - 0x0)
// Function VerseFortniteUI.UI_creative_hud_identifier_hud_info.$InitCDO
struct UUI_creative_hud_identifier_hud_info__InitCDO_Params
{
public:
	FVerseStringProperty_                        _ExprResult_0;                                     // 0x0(0x10)(HasGetValueTypeHash)
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteUI.UI_creative_hud_identifier_interaction_prompts.$InitInstance
struct UUI_creative_hud_identifier_interaction_prompts__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteUI.UI_creative_hud_identifier_interaction_prompts.$Block
struct UUI_creative_hud_identifier_interaction_prompts__Block_Params
{
public:
};

// 0x10 (0x10 - 0x0)
// Function VerseFortniteUI.UI_creative_hud_identifier_interaction_prompts.$InitCDO
struct UUI_creative_hud_identifier_interaction_prompts__InitCDO_Params
{
public:
	FVerseStringProperty_                        _ExprResult_0;                                     // 0x0(0x10)(HasGetValueTypeHash)
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteUI.UI_creative_hud_identifier_map_prompts.$InitInstance
struct UUI_creative_hud_identifier_map_prompts__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteUI.UI_creative_hud_identifier_map_prompts.$Block
struct UUI_creative_hud_identifier_map_prompts__Block_Params
{
public:
};

// 0x10 (0x10 - 0x0)
// Function VerseFortniteUI.UI_creative_hud_identifier_map_prompts.$InitCDO
struct UUI_creative_hud_identifier_map_prompts__InitCDO_Params
{
public:
	FVerseStringProperty_                        _ExprResult_0;                                     // 0x0(0x10)(HasGetValueTypeHash)
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteUI.UI_creative_hud_identifier_mimimap.$InitInstance
struct UUI_creative_hud_identifier_mimimap__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteUI.UI_creative_hud_identifier_mimimap.$Block
struct UUI_creative_hud_identifier_mimimap__Block_Params
{
public:
};

// 0x10 (0x10 - 0x0)
// Function VerseFortniteUI.UI_creative_hud_identifier_mimimap.$InitCDO
struct UUI_creative_hud_identifier_mimimap__InitCDO_Params
{
public:
	FVerseStringProperty_                        _ExprResult_0;                                     // 0x0(0x10)(HasGetValueTypeHash)
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteUI.UI_creative_hud_identifier_minimap.$InitInstance
struct UUI_creative_hud_identifier_minimap__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteUI.UI_creative_hud_identifier_minimap.$Block
struct UUI_creative_hud_identifier_minimap__Block_Params
{
public:
};

// 0x10 (0x10 - 0x0)
// Function VerseFortniteUI.UI_creative_hud_identifier_minimap.$InitCDO
struct UUI_creative_hud_identifier_minimap__InitCDO_Params
{
public:
	FVerseStringProperty_                        _ExprResult_0;                                     // 0x0(0x10)(HasGetValueTypeHash)
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteUI.UI_creative_hud_identifier_pickup_stream.$InitInstance
struct UUI_creative_hud_identifier_pickup_stream__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteUI.UI_creative_hud_identifier_pickup_stream.$Block
struct UUI_creative_hud_identifier_pickup_stream__Block_Params
{
public:
};

// 0x10 (0x10 - 0x0)
// Function VerseFortniteUI.UI_creative_hud_identifier_pickup_stream.$InitCDO
struct UUI_creative_hud_identifier_pickup_stream__InitCDO_Params
{
public:
	FVerseStringProperty_                        _ExprResult_0;                                     // 0x0(0x10)(HasGetValueTypeHash)
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteUI.UI_creative_hud_identifier_player_count.$InitInstance
struct UUI_creative_hud_identifier_player_count__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteUI.UI_creative_hud_identifier_player_count.$Block
struct UUI_creative_hud_identifier_player_count__Block_Params
{
public:
};

// 0x10 (0x10 - 0x0)
// Function VerseFortniteUI.UI_creative_hud_identifier_player_count.$InitCDO
struct UUI_creative_hud_identifier_player_count__InitCDO_Params
{
public:
	FVerseStringProperty_                        _ExprResult_0;                                     // 0x0(0x10)(HasGetValueTypeHash)
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteUI.UI_creative_hud_identifier_player_inventory.$InitInstance
struct UUI_creative_hud_identifier_player_inventory__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteUI.UI_creative_hud_identifier_player_inventory.$Block
struct UUI_creative_hud_identifier_player_inventory__Block_Params
{
public:
};

// 0x10 (0x10 - 0x0)
// Function VerseFortniteUI.UI_creative_hud_identifier_player_inventory.$InitCDO
struct UUI_creative_hud_identifier_player_inventory__InitCDO_Params
{
public:
	FVerseStringProperty_                        _ExprResult_0;                                     // 0x0(0x10)(HasGetValueTypeHash)
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteUI.UI_creative_hud_identifier_round_info.$InitInstance
struct UUI_creative_hud_identifier_round_info__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteUI.UI_creative_hud_identifier_round_info.$Block
struct UUI_creative_hud_identifier_round_info__Block_Params
{
public:
};

// 0x10 (0x10 - 0x0)
// Function VerseFortniteUI.UI_creative_hud_identifier_round_info.$InitCDO
struct UUI_creative_hud_identifier_round_info__InitCDO_Params
{
public:
	FVerseStringProperty_                        _ExprResult_0;                                     // 0x0(0x10)(HasGetValueTypeHash)
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteUI.UI_creative_hud_identifier_round_timer.$InitInstance
struct UUI_creative_hud_identifier_round_timer__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteUI.UI_creative_hud_identifier_round_timer.$Block
struct UUI_creative_hud_identifier_round_timer__Block_Params
{
public:
};

// 0x10 (0x10 - 0x0)
// Function VerseFortniteUI.UI_creative_hud_identifier_round_timer.$InitCDO
struct UUI_creative_hud_identifier_round_timer__InitCDO_Params
{
public:
	FVerseStringProperty_                        _ExprResult_0;                                     // 0x0(0x10)(HasGetValueTypeHash)
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteUI.UI_creative_hud_identifier_shield_numbers.$InitInstance
struct UUI_creative_hud_identifier_shield_numbers__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteUI.UI_creative_hud_identifier_shield_numbers.$Block
struct UUI_creative_hud_identifier_shield_numbers__Block_Params
{
public:
};

// 0x10 (0x10 - 0x0)
// Function VerseFortniteUI.UI_creative_hud_identifier_shield_numbers.$InitCDO
struct UUI_creative_hud_identifier_shield_numbers__InitCDO_Params
{
public:
	FVerseStringProperty_                        _ExprResult_0;                                     // 0x0(0x10)(HasGetValueTypeHash)
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteUI.UI_creative_hud_identifier_shields.$InitInstance
struct UUI_creative_hud_identifier_shields__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteUI.UI_creative_hud_identifier_shields.$Block
struct UUI_creative_hud_identifier_shields__Block_Params
{
public:
};

// 0x10 (0x10 - 0x0)
// Function VerseFortniteUI.UI_creative_hud_identifier_shields.$InitCDO
struct UUI_creative_hud_identifier_shields__InitCDO_Params
{
public:
	FVerseStringProperty_                        _ExprResult_0;                                     // 0x0(0x10)(HasGetValueTypeHash)
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteUI.UI_creative_hud_identifier_shileds.$InitInstance
struct UUI_creative_hud_identifier_shileds__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteUI.UI_creative_hud_identifier_shileds.$Block
struct UUI_creative_hud_identifier_shileds__Block_Params
{
public:
};

// 0x10 (0x10 - 0x0)
// Function VerseFortniteUI.UI_creative_hud_identifier_shileds.$InitCDO
struct UUI_creative_hud_identifier_shileds__InitCDO_Params
{
public:
	FVerseStringProperty_                        _ExprResult_0;                                     // 0x0(0x10)(HasGetValueTypeHash)
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteUI.UI_creative_hud_identifier_storm_notifications.$InitInstance
struct UUI_creative_hud_identifier_storm_notifications__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteUI.UI_creative_hud_identifier_storm_notifications.$Block
struct UUI_creative_hud_identifier_storm_notifications__Block_Params
{
public:
};

// 0x10 (0x10 - 0x0)
// Function VerseFortniteUI.UI_creative_hud_identifier_storm_notifications.$InitCDO
struct UUI_creative_hud_identifier_storm_notifications__InitCDO_Params
{
public:
	FVerseStringProperty_                        _ExprResult_0;                                     // 0x0(0x10)(HasGetValueTypeHash)
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteUI.UI_creative_hud_identifier_storm_timer.$InitInstance
struct UUI_creative_hud_identifier_storm_timer__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteUI.UI_creative_hud_identifier_storm_timer.$Block
struct UUI_creative_hud_identifier_storm_timer__Block_Params
{
public:
};

// 0x10 (0x10 - 0x0)
// Function VerseFortniteUI.UI_creative_hud_identifier_storm_timer.$InitCDO
struct UUI_creative_hud_identifier_storm_timer__InitCDO_Params
{
public:
	FVerseStringProperty_                        _ExprResult_0;                                     // 0x0(0x10)(HasGetValueTypeHash)
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteUI.UI_creative_hud_identifier_team_info.$InitInstance
struct UUI_creative_hud_identifier_team_info__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteUI.UI_creative_hud_identifier_team_info.$Block
struct UUI_creative_hud_identifier_team_info__Block_Params
{
public:
};

// 0x10 (0x10 - 0x0)
// Function VerseFortniteUI.UI_creative_hud_identifier_team_info.$InitCDO
struct UUI_creative_hud_identifier_team_info__InitCDO_Params
{
public:
	FVerseStringProperty_                        _ExprResult_0;                                     // 0x0(0x10)(HasGetValueTypeHash)
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteUI.UI_hud_element_world_resource_identifier_base.$InitInstance
struct UUI_hud_element_world_resource_identifier_base__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteUI.UI_hud_element_world_resource_identifier_base.$Block
struct UUI_hud_element_world_resource_identifier_base__Block_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteUI.UI_hud_element_world_resource_identifier_base.$InitCDO
struct UUI_hud_element_world_resource_identifier_base__InitCDO_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteUI.UI_hud_identifier_game_phase_bus_flying.$InitInstance
struct UUI_hud_identifier_game_phase_bus_flying__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteUI.UI_hud_identifier_game_phase_bus_flying.$Block
struct UUI_hud_identifier_game_phase_bus_flying__Block_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteUI.UI_hud_identifier_game_phase_bus_flying.$InitCDO
struct UUI_hud_identifier_game_phase_bus_flying__InitCDO_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteUI.UI_hud_identifier_game_phase_bus_locked.$InitInstance
struct UUI_hud_identifier_game_phase_bus_locked__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteUI.UI_hud_identifier_game_phase_bus_locked.$Block
struct UUI_hud_identifier_game_phase_bus_locked__Block_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteUI.UI_hud_identifier_game_phase_bus_locked.$InitCDO
struct UUI_hud_identifier_game_phase_bus_locked__InitCDO_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteUI.UI_hud_identifier_game_phase_countdown.$InitInstance
struct UUI_hud_identifier_game_phase_countdown__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteUI.UI_hud_identifier_game_phase_countdown.$Block
struct UUI_hud_identifier_game_phase_countdown__Block_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteUI.UI_hud_identifier_game_phase_countdown.$InitCDO
struct UUI_hud_identifier_game_phase_countdown__InitCDO_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteUI.UI_hud_identifier_game_phase_end_game.$InitInstance
struct UUI_hud_identifier_game_phase_end_game__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteUI.UI_hud_identifier_game_phase_end_game.$Block
struct UUI_hud_identifier_game_phase_end_game__Block_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteUI.UI_hud_identifier_game_phase_end_game.$InitCDO
struct UUI_hud_identifier_game_phase_end_game__InitCDO_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteUI.UI_hud_identifier_game_phase_final_countdown.$InitInstance
struct UUI_hud_identifier_game_phase_final_countdown__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteUI.UI_hud_identifier_game_phase_final_countdown.$Block
struct UUI_hud_identifier_game_phase_final_countdown__Block_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteUI.UI_hud_identifier_game_phase_final_countdown.$InitCDO
struct UUI_hud_identifier_game_phase_final_countdown__InitCDO_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteUI.UI_hud_identifier_game_phase_none.$InitInstance
struct UUI_hud_identifier_game_phase_none__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteUI.UI_hud_identifier_game_phase_none.$Block
struct UUI_hud_identifier_game_phase_none__Block_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteUI.UI_hud_identifier_game_phase_none.$InitCDO
struct UUI_hud_identifier_game_phase_none__InitCDO_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteUI.UI_hud_identifier_game_phase_setup.$InitInstance
struct UUI_hud_identifier_game_phase_setup__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteUI.UI_hud_identifier_game_phase_setup.$Block
struct UUI_hud_identifier_game_phase_setup__Block_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteUI.UI_hud_identifier_game_phase_setup.$InitCDO
struct UUI_hud_identifier_game_phase_setup__InitCDO_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteUI.UI_hud_identifier_game_phase_storm_forming.$InitInstance
struct UUI_hud_identifier_game_phase_storm_forming__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteUI.UI_hud_identifier_game_phase_storm_forming.$Block
struct UUI_hud_identifier_game_phase_storm_forming__Block_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteUI.UI_hud_identifier_game_phase_storm_forming.$InitCDO
struct UUI_hud_identifier_game_phase_storm_forming__InitCDO_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteUI.UI_hud_identifier_game_phase_storm_holding.$InitInstance
struct UUI_hud_identifier_game_phase_storm_holding__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteUI.UI_hud_identifier_game_phase_storm_holding.$Block
struct UUI_hud_identifier_game_phase_storm_holding__Block_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteUI.UI_hud_identifier_game_phase_storm_holding.$InitCDO
struct UUI_hud_identifier_game_phase_storm_holding__InitCDO_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteUI.UI_hud_identifier_game_phase_storm_shrinking.$InitInstance
struct UUI_hud_identifier_game_phase_storm_shrinking__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteUI.UI_hud_identifier_game_phase_storm_shrinking.$Block
struct UUI_hud_identifier_game_phase_storm_shrinking__Block_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteUI.UI_hud_identifier_game_phase_storm_shrinking.$InitCDO
struct UUI_hud_identifier_game_phase_storm_shrinking__InitCDO_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteUI.UI_hud_identifier_game_phase_warmup.$InitInstance
struct UUI_hud_identifier_game_phase_warmup__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteUI.UI_hud_identifier_game_phase_warmup.$Block
struct UUI_hud_identifier_game_phase_warmup__Block_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteUI.UI_hud_identifier_game_phase_warmup.$InitCDO
struct UUI_hud_identifier_game_phase_warmup__InitCDO_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteUI.UI_hud_identifier_world_resource_gold_currency.$InitInstance
struct UUI_hud_identifier_world_resource_gold_currency__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteUI.UI_hud_identifier_world_resource_gold_currency.$Block
struct UUI_hud_identifier_world_resource_gold_currency__Block_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteUI.UI_hud_identifier_world_resource_gold_currency.$InitCDO
struct UUI_hud_identifier_world_resource_gold_currency__InitCDO_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteUI.UI_hud_identifier_world_resource_ingredient.$InitInstance
struct UUI_hud_identifier_world_resource_ingredient__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteUI.UI_hud_identifier_world_resource_ingredient.$Block
struct UUI_hud_identifier_world_resource_ingredient__Block_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteUI.UI_hud_identifier_world_resource_ingredient.$InitCDO
struct UUI_hud_identifier_world_resource_ingredient__InitCDO_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteUI.UI_hud_identifier_world_resource_metal.$InitInstance
struct UUI_hud_identifier_world_resource_metal__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteUI.UI_hud_identifier_world_resource_metal.$Block
struct UUI_hud_identifier_world_resource_metal__Block_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteUI.UI_hud_identifier_world_resource_metal.$InitCDO
struct UUI_hud_identifier_world_resource_metal__InitCDO_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteUI.UI_hud_identifier_world_resource_permanite.$InitInstance
struct UUI_hud_identifier_world_resource_permanite__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteUI.UI_hud_identifier_world_resource_permanite.$Block
struct UUI_hud_identifier_world_resource_permanite__Block_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteUI.UI_hud_identifier_world_resource_permanite.$InitCDO
struct UUI_hud_identifier_world_resource_permanite__InitCDO_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteUI.UI_hud_identifier_world_resource_stone.$InitInstance
struct UUI_hud_identifier_world_resource_stone__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteUI.UI_hud_identifier_world_resource_stone.$Block
struct UUI_hud_identifier_world_resource_stone__Block_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteUI.UI_hud_identifier_world_resource_stone.$InitCDO
struct UUI_hud_identifier_world_resource_stone__InitCDO_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteUI.UI_hud_identifier_world_resource_wood.$InitInstance
struct UUI_hud_identifier_world_resource_wood__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteUI.UI_hud_identifier_world_resource_wood.$Block
struct UUI_hud_identifier_world_resource_wood__Block_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteUI.UI_hud_identifier_world_resource_wood.$InitCDO
struct UUI_hud_identifier_world_resource_wood__InitCDO_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteUI.UI_player_hud_identifier_all.$InitInstance
struct UUI_player_hud_identifier_all__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteUI.UI_player_hud_identifier_all.$Block
struct UUI_player_hud_identifier_all__Block_Params
{
public:
};

// 0x10 (0x10 - 0x0)
// Function VerseFortniteUI.UI_player_hud_identifier_all.$InitCDO
struct UUI_player_hud_identifier_all__InitCDO_Params
{
public:
	FVerseStringProperty_                        _ExprResult_0;                                     // 0x0(0x10)(HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function VerseFortniteUI.UI_slider_regular._L_2fFortnite_2ecom_2fUI_2fslider__regular_N_RSetValue_L_Nfloat_R
struct UUI_slider_regular__L_2fFortnite_2ecom_2fUI_2fslider__regular_N_RSetValue_L_Nfloat_R_Params
{
public:
	double                                       __verse_0xB2CDDD72_Argument;                       // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function VerseFortniteUI.UI_slider_regular._L_2fFortnite_2ecom_2fUI_2fslider__regular_N_RSetStepSize_L_Nfloat_R
struct UUI_slider_regular__L_2fFortnite_2ecom_2fUI_2fslider__regular_N_RSetStepSize_L_Nfloat_R_Params
{
public:
	double                                       __verse_0xB2CDDD72_Argument;                       // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function VerseFortniteUI.UI_slider_regular._L_2fFortnite_2ecom_2fUI_2fslider__regular_N_RSetMinValue_L_Nfloat_R
struct UUI_slider_regular__L_2fFortnite_2ecom_2fUI_2fslider__regular_N_RSetMinValue_L_Nfloat_R_Params
{
public:
	double                                       __verse_0xB2CDDD72_Argument;                       // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function VerseFortniteUI.UI_slider_regular._L_2fFortnite_2ecom_2fUI_2fslider__regular_N_RSetMaxValue_L_Nfloat_R
struct UUI_slider_regular__L_2fFortnite_2ecom_2fUI_2fslider__regular_N_RSetMaxValue_L_Nfloat_R_Params
{
public:
	double                                       __verse_0xB2CDDD72_Argument;                       // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x10 (0x10 - 0x0)
// Function VerseFortniteUI.UI_slider_regular._L_2fFortnite_2ecom_2fUI_2fslider__regular_N_ROnValueChanged
struct UUI_slider_regular__L_2fFortnite_2ecom_2fUI_2fslider__regular_N_ROnValueChanged_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_41F6[0x7];                                     // Fixing Size After Last Property..
	class UObject*                               RetVal;                                            // 0x8(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// 0x10 (0x10 - 0x0)
// Function VerseFortniteUI.UI_slider_regular._L_2fFortnite_2ecom_2fUI_2fslider__regular_N_RGetValue
struct UUI_slider_regular__L_2fFortnite_2ecom_2fUI_2fslider__regular_N_RGetValue_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_41F7[0x7];                                     // Fixing Size After Last Property..
	double                                       RetVal;                                            // 0x8(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x10 (0x10 - 0x0)
// Function VerseFortniteUI.UI_slider_regular._L_2fFortnite_2ecom_2fUI_2fslider__regular_N_RGetStepSize
struct UUI_slider_regular__L_2fFortnite_2ecom_2fUI_2fslider__regular_N_RGetStepSize_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_41F8[0x7];                                     // Fixing Size After Last Property..
	double                                       RetVal;                                            // 0x8(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x10 (0x10 - 0x0)
// Function VerseFortniteUI.UI_slider_regular._L_2fFortnite_2ecom_2fUI_2fslider__regular_N_RGetMinValue
struct UUI_slider_regular__L_2fFortnite_2ecom_2fUI_2fslider__regular_N_RGetMinValue_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_41F9[0x7];                                     // Fixing Size After Last Property..
	double                                       RetVal;                                            // 0x8(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x10 (0x10 - 0x0)
// Function VerseFortniteUI.UI_slider_regular._L_2fFortnite_2ecom_2fUI_2fslider__regular_N_RGetMaxValue
struct UUI_slider_regular__L_2fFortnite_2ecom_2fUI_2fslider__regular_N_RGetMaxValue_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_41FA[0x7];                                     // Fixing Size After Last Property..
	double                                       RetVal;                                            // 0x8(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteUI.UI_slider_regular.$InitInstance
struct UUI_slider_regular__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteUI.UI_slider_regular.$Block
struct UUI_slider_regular__Block_Params
{
public:
};

// 0x10 (0x10 - 0x0)
// Function VerseFortniteUI.UI_slider_regular.$InitCDO
struct UUI_slider_regular__InitCDO_Params
{
public:
	class UVerseEngine_subscribable_event*       _ExprResult_0;                                     // 0x0(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                       _InstancingGraph_1;                                // 0x8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function VerseFortniteUI.UI_text_block._L_2fFortnite_2ecom_2fUI_2ftext__block_N_RSetShadowOpacity_L_Ntype_7b__X_Nfloat_20where_200_2e000000_20_3c_3d_20__X_M_20__X_20_3c_3d_201_2e000000_7d_R
struct UUI_text_block__L_2fFortnite_2ecom_2fUI_2ftext__block_N_RSetShadowOpacity_L_Ntype_7b__X_Nfloat_20where_200_2e000000_20_3c_3d_20__X_M_20__X_20_3c_3d_201_2e000000_7d_R_Params
{
public:
	double                                       __verse_0xB2CDDD72_Argument;                       // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x18 (0x18 - 0x0)
// Function VerseFortniteUI.UI_text_block._L_2fFortnite_2ecom_2fUI_2ftext__block_N_RSetShadowOffset_L_N_Qvector2_R
struct UUI_text_block__L_2fFortnite_2ecom_2fUI_2ftext__block_N_RSetShadowOffset_L_N_Qvector2_R_Params
{
public:
	FOptionProperty_                             __verse_0xB2CDDD72_Argument;                       // 0x0(0x18)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// 0x18 (0x18 - 0x0)
// Function VerseFortniteUI.UI_text_block._L_2fFortnite_2ecom_2fUI_2ftext__block_N_RSetShadowColor_L_Ncolor_R
struct UUI_text_block__L_2fFortnite_2ecom_2fUI_2ftext__block_N_RSetShadowColor_L_Ncolor_R_Params
{
public:
	struct FColors_color                         __verse_0xB2CDDD72_Argument;                       // 0x0(0x18)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// 0x10 (0x10 - 0x0)
// Function VerseFortniteUI.UI_text_block._L_2fFortnite_2ecom_2fUI_2ftext__block_N_RGetShadowOpacity
struct UUI_text_block__L_2fFortnite_2ecom_2fUI_2ftext__block_N_RGetShadowOpacity_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_41FB[0x7];                                     // Fixing Size After Last Property..
	double                                       RetVal;                                            // 0x8(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x20 (0x20 - 0x0)
// Function VerseFortniteUI.UI_text_block._L_2fFortnite_2ecom_2fUI_2ftext__block_N_RGetShadowOffset
struct UUI_text_block__L_2fFortnite_2ecom_2fUI_2ftext__block_N_RGetShadowOffset_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_41FC[0x7];                                     // Fixing Size After Last Property..
	FOptionProperty_                             RetVal;                                            // 0x8(0x18)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// 0x20 (0x20 - 0x0)
// Function VerseFortniteUI.UI_text_block._L_2fFortnite_2ecom_2fUI_2ftext__block_N_RGetShadowColor
struct UUI_text_block__L_2fFortnite_2ecom_2fUI_2ftext__block_N_RGetShadowColor_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_41FD[0x7];                                     // Fixing Size After Last Property..
	struct FColors_color                         RetVal;                                            // 0x8(0x18)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteUI.UI_text_block.$InitInstance
struct UUI_text_block__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteUI.UI_text_block.$Block
struct UUI_text_block__Block_Params
{
public:
};

// 0x1D (0x1D - 0x0)
// Function VerseFortniteUI.UI_text_block.$InitCDO
struct UUI_text_block__InitCDO_Params
{
public:
	FOptionProperty_                             _ExprResult_0;                                     // 0x0(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FOptionProperty_                             __verse_0x00000000__1;                             // 0x18(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        _ExprResult_1 : 1;                                 // Mask: 0x1, PropSize: 0x10x1A(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_289 : 7;                                    // Fixing Bit-Field Size..
	FOptionProperty_                             _ExprResultStack_2;                                // 0x1B(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function VerseFortniteUI.UI_text_button_base._L_2fFortnite_2ecom_2fUI_2ftext__button__base_N_RSetText_L_Nmessage_R
struct UUI_text_button_base__L_2fFortnite_2ecom_2fUI_2ftext__button__base_N_RSetText_L_Nmessage_R_Params
{
public:
	class UVerse_message*                        __verse_0xB2CDDD72_Argument;                       // 0x0(0x8)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// 0x10 (0x10 - 0x0)
// Function VerseFortniteUI.UI_text_button_base._L_2fFortnite_2ecom_2fUI_2ftext__button__base_N_ROnClick
struct UUI_text_button_base__L_2fFortnite_2ecom_2fUI_2ftext__button__base_N_ROnClick_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_41FF[0x7];                                     // Fixing Size After Last Property..
	class UObject*                               RetVal;                                            // 0x8(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// 0x18 (0x18 - 0x0)
// Function VerseFortniteUI.UI_text_button_base._L_2fFortnite_2ecom_2fUI_2ftext__button__base_N_RGetText
struct UUI_text_button_base__L_2fFortnite_2ecom_2fUI_2ftext__button__base_N_RGetText_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_4200[0x7];                                     // Fixing Size After Last Property..
	FVerseStringProperty_                        RetVal;                                            // 0x8(0x10)(Parm, OutParm, ReturnParm, HasGetValueTypeHash)
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteUI.UI_text_button_base.$InitInstance
struct UUI_text_button_base__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteUI.UI_text_button_base.$Block
struct UUI_text_button_base__Block_Params
{
public:
};

// 0x1B8 (0x1B8 - 0x0)
// Function VerseFortniteUI.UI_text_button_base.$InitCDO
struct UUI_text_button_base__InitCDO_Params
{
public:
	class UVerse_message*                        _ExprResultStack_0;                                // 0x0(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_1;                                         // 0x8(0x10)(HasGetValueTypeHash)
	struct FTuple_L_Kchar_M_Kchar_M_5b_Kchar_5dlocalizable__value_R _ExprResult_2;                                     // 0x18(0x70)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_3;                                     // 0x88(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_4;                                     // 0x98(0x10)(HasGetValueTypeHash)
	TMap<FVerseStringProperty_, class UVerse_localizable_value*> _ExprResult_5;                                     // 0xA8(0x50)(ContainsInstancedReference)
	TMap<enum class EVerseFalse, enum class EVerseFalse> __verse_0xC87067A2_Map_1;                          // 0xF8(0x50)(ContainsInstancedReference)
	TMap<FVerseStringProperty_, class UVerse_localizable_value*> _ForResult_6;                                      // 0x148(0x50)(ContainsInstancedReference)
	int64                                        _ForIndex_7;                                       // 0x198(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class EVerseFalse                       __verse_0x589418B4_Key_3;                          // 0x1A0(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class EVerseFalse                       __verse_0x31A8F10C_Value_3;                        // 0x1A1(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        _ExprResult_8 : 1;                                 // Mask: 0x1, PropSize: 0x10x1A2(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_28A : 7;                                    // Fixing Bit-Field Size..
	uint8                                        _ExprResult_9 : 1;                                 // Mask: 0x1, PropSize: 0x10x1A3(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_28B : 7;                                    // Fixing Bit-Field Size..
	uint8                                        Pad_4201[0x4];                                     // Fixing Size After Last Property..
	class UVerseEngine_subscribable_event*       _ExprResult_10;                                    // 0x1A8(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                       _InstancingGraph_11;                               // 0x1B0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteUI.UI_button_loud.$InitInstance
struct UUI_button_loud__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteUI.UI_button_loud.$Block
struct UUI_button_loud__Block_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteUI.UI_button_loud.$InitCDO
struct UUI_button_loud__InitCDO_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteUI.UI_button_quiet.$InitInstance
struct UUI_button_quiet__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteUI.UI_button_quiet.$Block
struct UUI_button_quiet__Block_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteUI.UI_button_quiet.$InitCDO
struct UUI_button_quiet__InitCDO_Params
{
public:
};

// 0x0 (0x0 - 0x0)
