#pragma once

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// ENUMS
//---------------------------------------------------------------------------------------------------------------------

enum class EStatisticResetIntervalOption : uint8
{
	pfenum_Never                   = 0,
	pfenum_Hour                    = 1,
	pfenum_Day                     = 2,
	pfenum_Week                    = 3,
	pfenum_Month                   = 4,
	pfenum_MAX                     = 5,
};

enum class EStatisticAggregationMethod : uint8
{
	pfenum_Last                    = 0,
	pfenum_Min                     = 1,
	pfenum_Max                     = 2,
	pfenum_Sum                     = 3,
};

enum class ERegion : uint8
{
	pfenum_USCentral               = 0,
	pfenum_USEast                  = 1,
	pfenum_EUWest                  = 2,
	pfenum_Singapore               = 3,
	pfenum_Japan                   = 4,
	pfenum_Brazil                  = 5,
	pfenum_Australia               = 6,
	pfenum_MAX                     = 7,
};

enum class EPfSourceType : uint8
{
	pfenum_Admin                   = 0,
	pfenum_BackEnd                 = 1,
	pfenum_GameClient              = 2,
	pfenum_GameServer              = 3,
	pfenum_Partner                 = 4,
	pfenum_Custom                  = 5,
	pfenum_API                     = 6,
	pfenum_MAX                     = 7,
};

enum class EGameBuildStatus : uint8
{
	pfenum_Available               = 0,
	pfenum_Validating              = 1,
	pfenum_InvalidBuildPackage     = 2,
	pfenum_Processing              = 3,
	pfenum_FailedToProcess         = 4,
	pfenum_MAX                     = 5,
};

enum class EAuthTokenType : uint8
{
	pfenum_Email                   = 0,
	pfenum_MAX                     = 1,
};

enum class ETaskInstanceStatus : uint8
{
	pfenum_Succeeded               = 0,
	pfenum_Starting                = 1,
	pfenum_InProgress              = 2,
	pfenum_Failed                  = 3,
	pfenum_Aborted                 = 4,
	pfenum_Stalled                 = 5,
	pfenum_MAX                     = 6,
};

enum class EResolutionOutcome : uint8
{
	pfenum_Revoke                  = 0,
	pfenum_Reinstate               = 1,
	pfenum_Manual                  = 2,
	pfenum_MAX                     = 3,
};

enum class EPushSetupPlatform : uint8
{
	pfenum_GCM                     = 0,
	pfenum_APNS                    = 1,
	pfenum_APNS_SANDBOX            = 2,
	pfenum_MAX                     = 3,
};

enum class EScheduledTaskType : uint8
{
	pfenum_CloudScript             = 0,
	pfenum_ActionsOnPlayerSegment  = 1,
	pfenum_CloudScriptAzureFunctions = 2,
	pfenum_InsightsScheduledScaling = 3,
	pfenum_MAX                     = 4,
};

enum class EUserDataPermission : uint8
{
	pfenum_Private                 = 0,
	pfenum_Public                  = 1,
	pfenum_MAX                     = 2,
};

enum class ELoginIdentityProvider : uint8
{
	pfenum_Unknown                 = 0,
	pfenum_PlayFab                 = 1,
	pfenum_Custom                  = 2,
	pfenum_GameCenter              = 3,
	pfenum_GooglePlay              = 4,
	pfenum_Steam                   = 5,
	pfenum_XBoxLive                = 6,
	pfenum_PSN                     = 7,
	pfenum_Kongregate              = 8,
	pfenum_Facebook                = 9,
	pfenum_IOSDevice               = 10,
	pfenum_AndroidDevice           = 11,
	pfenum_Twitch                  = 12,
	pfenum_WindowsHello            = 13,
	pfenum_GameServer              = 14,
	pfenum_CustomServer            = 15,
	pfenum_NintendoSwitch          = 16,
	pfenum_FacebookInstantGames    = 17,
	pfenum_OpenIdConnect           = 18,
	pfenum_Apple                   = 19,
	pfenum_NintendoSwitchAccount   = 20,
	pfenum_GooglePlayGames         = 21,
	pfenum_MAX                     = 22,
};

enum class EIdentifiedDeviceType : uint8
{
	pfenum_Unknown                 = 0,
	pfenum_XboxOne                 = 1,
	pfenum_Scarlett                = 2,
	pfenum_MAX                     = 3,
};

enum class EMatchmakeStatus : uint8
{
	pfenum_Complete                = 0,
	pfenum_Waiting                 = 1,
	pfenum_GameNotFound            = 2,
	pfenum_NoAvailableSlots        = 3,
	pfenum_SessionClosed           = 4,
	pfenum_MAX                     = 5,
};

enum class ETransactionStatus : uint8
{
	pfenum_CreateCart              = 0,
	pfenum_Init                    = 1,
	pfenum_Approved                = 2,
	pfenum_Succeeded               = 3,
	pfenum_FailedByProvider        = 4,
	pfenum_DisputePending          = 5,
	pfenum_RefundPending           = 6,
	pfenum_Refunded                = 7,
	pfenum_RefundFailed            = 8,
	pfenum_ChargedBack             = 9,
	pfenum_FailedByUber            = 10,
	pfenum_FailedByPlayFab         = 11,
	pfenum_Revoked                 = 12,
	pfenum_TradePending            = 13,
	pfenum_Traded                  = 14,
	pfenum_Upgraded                = 15,
	pfenum_StackPending            = 16,
	pfenum_Stacked                 = 17,
	pfenum_Other                   = 18,
	pfenum_Failed                  = 19,
	pfenum_MAX                     = 20,
};

enum class ECloudScriptRevisionOption : uint8
{
	pfenum_Live                    = 0,
	pfenum_Latest                  = 1,
	pfenum_Specific                = 2,
	pfenum_MAX                     = 3,
};

enum class EExternalFriendSources : uint8
{
	pfenum_None                    = 0,
	pfenum_Steam                   = 1,
	pfenum_Facebook                = 2,
	pfenum_Xbox                    = 3,
	pfenum_Psn                     = 4,
	pfenum_All                     = 5,
	pfenum_MAX                     = 6,
};

enum class ETradeStatus : uint8
{
	pfenum_Invalid                 = 0,
	pfenum_Opening                 = 1,
	pfenum_Open                    = 2,
	pfenum_Accepting               = 3,
	pfenum_Accepted                = 4,
	pfenum_Filled                  = 5,
	pfenum_Cancelled               = 6,
	pfenum_MAX                     = 7,
};

enum class EAdActivity : uint8
{
	pfenum_Opened                  = 0,
	pfenum_Closed                  = 1,
	pfenum_Start                   = 2,
	pfenum_End                     = 3,
	pfenum_MAX                     = 4,
};

enum class EPublishResult : uint8
{
	pfenum_Unknown                 = 0,
	pfenum_Pending                 = 1,
	pfenum_Succeeded               = 2,
	pfenum_Failed                  = 3,
	pfenum_Canceled                = 4,
	pfenum_MAX                     = 5,
};

enum class EConcernCategory : uint8
{
	pfenum_None                    = 0,
	pfenum_OffensiveContent        = 1,
	pfenum_ChildExploitation       = 2,
	pfenum_MalwareOrVirus          = 3,
	pfenum_PrivacyConcerns         = 4,
	pfenum_MisleadingApp           = 5,
	pfenum_PoorPerformance         = 6,
	pfenum_ReviewResponse          = 7,
	pfenum_SpamAdvertising         = 8,
	pfenum_Profanity               = 9,
	pfenum_MAX                     = 10,
};

enum class EModerationStatus : uint8
{
	pfenum_Unknown                 = 0,
	pfenum_AwaitingModeration      = 1,
	pfenum_Approved                = 2,
	pfenum_Rejected                = 3,
	pfenum_MAX                     = 4,
};

enum class EHelpfulnessVote : uint8
{
	pfenum_None                    = 0,
	pfenum_UnHelpful               = 1,
	pfenum_Helpful                 = 2,
	pfenum_MAX                     = 3,
};

enum class EExperimentType : uint8
{
	pfenum_Active                  = 0,
	pfenum_Snapshot                = 1,
	pfenum_MAX                     = 2,
};

enum class EOperationTypes : uint8
{
	pfenum_Created                 = 0,
	pfenum_Updated                 = 1,
	pfenum_Deleted                 = 2,
	pfenum_None                    = 3,
	pfenum_MAX                     = 4,
};

enum class EAzureVmSize : uint8
{
	pfenum_Standard_A1             = 0,
	pfenum_Standard_A2             = 1,
	pfenum_Standard_A3             = 2,
	pfenum_Standard_A4             = 3,
	pfenum_Standard_A1_v2          = 4,
	pfenum_Standard_A2_v2          = 5,
	pfenum_Standard_A4_v2          = 6,
	pfenum_Standard_A8_v2          = 7,
	pfenum_Standard_D1_v2          = 8,
	pfenum_Standard_D2_v2          = 9,
	pfenum_Standard_D3_v2          = 10,
	pfenum_Standard_D4_v2          = 11,
	pfenum_Standard_D5_v2          = 12,
	pfenum_Standard_D2_v3          = 13,
	pfenum_Standard_D4_v3          = 14,
	pfenum_Standard_D8_v3          = 15,
	pfenum_Standard_D16_v3         = 16,
	pfenum_Standard_F1             = 17,
	pfenum_Standard_F2             = 18,
	pfenum_Standard_F4             = 19,
	pfenum_Standard_F8             = 20,
	pfenum_Standard_F16            = 21,
	pfenum_Standard_F2s_v2         = 22,
	pfenum_Standard_F4s_v2         = 23,
	pfenum_Standard_F8s_v2         = 24,
	pfenum_Standard_F16s_v2        = 25,
	pfenum_Standard_D2as_v4        = 26,
	pfenum_Standard_D4as_v4        = 27,
	pfenum_Standard_D8as_v4        = 28,
	pfenum_Standard_D16as_v4       = 29,
	pfenum_Standard_D2a_v4         = 30,
	pfenum_Standard_D4a_v4         = 31,
	pfenum_Standard_D8a_v4         = 32,
	pfenum_Standard_D16a_v4        = 33,
	pfenum_Standard_D2ads_v5       = 34,
	pfenum_Standard_D4ads_v5       = 35,
	pfenum_Standard_D8ads_v5       = 36,
	pfenum_Standard_D16ads_v5      = 37,
	pfenum_Standard_E2a_v4         = 38,
	pfenum_Standard_E4a_v4         = 39,
	pfenum_Standard_E8a_v4         = 40,
	pfenum_Standard_E16a_v4        = 41,
	pfenum_Standard_E2as_v4        = 42,
	pfenum_Standard_E4as_v4        = 43,
	pfenum_Standard_E8as_v4        = 44,
	pfenum_Standard_E16as_v4       = 45,
	pfenum_Standard_D2s_v3         = 46,
	pfenum_Standard_D4s_v3         = 47,
	pfenum_Standard_D8s_v3         = 48,
	pfenum_Standard_D16s_v3        = 49,
	pfenum_Standard_DS1_v2         = 50,
	pfenum_Standard_DS2_v2         = 51,
	pfenum_Standard_DS3_v2         = 52,
	pfenum_Standard_DS4_v2         = 53,
	pfenum_Standard_DS5_v2         = 54,
	pfenum_Standard_NC4as_T4_v3    = 55,
	pfenum_Standard_D2d_v4         = 56,
	pfenum_Standard_D4d_v4         = 57,
	pfenum_Standard_D8d_v4         = 58,
	pfenum_Standard_D16d_v4        = 59,
	pfenum_Standard_D2ds_v4        = 60,
	pfenum_Standard_D4ds_v4        = 61,
	pfenum_Standard_D8ds_v4        = 62,
	pfenum_Standard_D16ds_v4       = 63,
	pfenum_Standard_HB120_16rs_v3  = 64,
	pfenum_Standard_HB120_32rs_v3  = 65,
	pfenum_Standard_HB120_64rs_v3  = 66,
	pfenum_Standard_HB120_96rs_v3  = 67,
	pfenum_Standard_HB120rs_v3     = 68,
	pfenum_Standard_MAX            = 69,
};

enum class EContainerFlavor : uint8
{
	pfenum_ManagedWindowsServerCore = 0,
	pfenum_CustomLinux             = 1,
	pfenum_ManagedWindowsServerCorePreview = 2,
	pfenum_Invalid                 = 3,
	pfenum_MAX                     = 4,
};

enum class EOwnerMigrationPolicy : uint8
{
	pfenum_None                    = 0,
	pfenum_Automatic               = 1,
	pfenum_Manual                  = 2,
	pfenum_Server                  = 3,
	pfenum_MAX                     = 4,
};

enum class EAccessPolicy : uint8
{
	pfenum_Public                  = 0,
	pfenum_Friends                 = 1,
	pfenum_Private                 = 2,
	pfenum_MAX                     = 3,
};

enum class ETitleMultiplayerServerEnabledStatus : uint8
{
	pfenum_Initializing            = 0,
	pfenum_Enabled                 = 1,
	pfenum_Disabled                = 2,
	pfenum_MAX                     = 3,
};

enum class ESubscriptionType : uint8
{
	pfenum_LobbyChange             = 0,
	pfenum_LobbyInvite             = 1,
	pfenum_MAX                     = 2,
};

enum class EMembershipLock : uint8
{
	pfenum_Unlocked                = 0,
	pfenum_Locked                  = 1,
	pfenum_MAX                     = 2,
};

enum class EPlayerConnectionState : uint8
{
	pfenum_Unassigned              = 0,
	pfenum_Connecting              = 1,
	pfenum_Participating           = 2,
	pfenum_Participated            = 3,
	pfenum_MAX                     = 4,
};

enum class EGameInstanceState : uint8
{
	pfenum_Open                    = 0,
	pfenum_Closed                  = 1,
	pfenum_MAX                     = 2,
};

enum class EChurnRiskLevel : uint8
{
	pfenum_NoData                  = 0,
	pfenum_LowRisk                 = 1,
	pfenum_MediumRisk              = 2,
	pfenum_HighRisk                = 3,
	pfenum_MAX                     = 4,
};

enum class EConditionals : uint8
{
	pfenum_Any                     = 0,
	pfenum_True                    = 1,
	pfenum_False                   = 2,
	pfenum_MAX                     = 3,
};

enum class EContinentCode : uint8
{
	pfenum_AF                      = 0,
	pfenum_AN                      = 1,
	pfenum_AS                      = 2,
	pfenum_EU                      = 3,
	pfenum_NA                      = 4,
	pfenum_OC                      = 5,
	pfenum_SA                      = 6,
	pfenum_MAX                     = 7,
};

enum class ECountryCode : uint8
{
	pfenum_AF                      = 0,
	pfenum_AX                      = 1,
	pfenum_AL                      = 2,
	pfenum_DZ                      = 3,
	pfenum_AS                      = 4,
	pfenum_AD                      = 5,
	pfenum_AO                      = 6,
	pfenum_AI                      = 7,
	pfenum_AQ                      = 8,
	pfenum_AG                      = 9,
	pfenum_AR                      = 10,
	pfenum_AM                      = 11,
	pfenum_AW                      = 12,
	pfenum_AU                      = 13,
	pfenum_AT                      = 14,
	pfenum_AZ                      = 15,
	pfenum_BS                      = 16,
	pfenum_BH                      = 17,
	pfenum_BD                      = 18,
	pfenum_BB                      = 19,
	pfenum_BY                      = 20,
	pfenum_BE                      = 21,
	pfenum_BZ                      = 22,
	pfenum_BJ                      = 23,
	pfenum_BM                      = 24,
	pfenum_BT                      = 25,
	pfenum_BO                      = 26,
	pfenum_BQ                      = 27,
	pfenum_BA                      = 28,
	pfenum_BW                      = 29,
	pfenum_BV                      = 30,
	pfenum_BR                      = 31,
	pfenum_IO                      = 32,
	pfenum_BN                      = 33,
	pfenum_BG                      = 34,
	pfenum_BF                      = 35,
	pfenum_BI                      = 36,
	pfenum_KH                      = 37,
	pfenum_CM                      = 38,
	pfenum_CA                      = 39,
	pfenum_CV                      = 40,
	pfenum_KY                      = 41,
	pfenum_CF                      = 42,
	pfenum_TD                      = 43,
	pfenum_CL                      = 44,
	pfenum_CN                      = 45,
	pfenum_CX                      = 46,
	pfenum_CC                      = 47,
	pfenum_CO                      = 48,
	pfenum_KM                      = 49,
	pfenum_CG                      = 50,
	pfenum_CD                      = 51,
	pfenum_CK                      = 52,
	pfenum_CR                      = 53,
	pfenum_CI                      = 54,
	pfenum_HR                      = 55,
	pfenum_CU                      = 56,
	pfenum_CW                      = 57,
	pfenum_CY                      = 58,
	pfenum_CZ                      = 59,
	pfenum_DK                      = 60,
	pfenum_DJ                      = 61,
	pfenum_DM                      = 62,
	pfenum_DO                      = 63,
	pfenum_EC                      = 64,
	pfenum_EG                      = 65,
	pfenum_SV                      = 66,
	pfenum_GQ                      = 67,
	pfenum_ER                      = 68,
	pfenum_EE                      = 69,
	pfenum_ET                      = 70,
	pfenum_FK                      = 71,
	pfenum_FO                      = 72,
	pfenum_FJ                      = 73,
	pfenum_FI                      = 74,
	pfenum_FR                      = 75,
	pfenum_GF                      = 76,
	pfenum_PF                      = 77,
	pfenum_TF                      = 78,
	pfenum_GA                      = 79,
	pfenum_GM                      = 80,
	pfenum_GE                      = 81,
	pfenum_DE                      = 82,
	pfenum_GH                      = 83,
	pfenum_GI                      = 84,
	pfenum_GR                      = 85,
	pfenum_GL                      = 86,
	pfenum_GD                      = 87,
	pfenum_GP                      = 88,
	pfenum_GU                      = 89,
	pfenum_GT                      = 90,
	pfenum_GG                      = 91,
	pfenum_GN                      = 92,
	pfenum_GW                      = 93,
	pfenum_GY                      = 94,
	pfenum_HT                      = 95,
	pfenum_HM                      = 96,
	pfenum_VA                      = 97,
	pfenum_HN                      = 98,
	pfenum_HK                      = 99,
	pfenum_HU                      = 100,
	pfenum_IS                      = 101,
	pfenum_IN                      = 102,
	pfenum_ID                      = 103,
	pfenum_IR                      = 104,
	pfenum_IQ                      = 105,
	pfenum_IE                      = 106,
	pfenum_IM                      = 107,
	pfenum_IL                      = 108,
	pfenum_IT                      = 109,
	pfenum_JM                      = 110,
	pfenum_JP                      = 111,
	pfenum_JE                      = 112,
	pfenum_JO                      = 113,
	pfenum_KZ                      = 114,
	pfenum_KE                      = 115,
	pfenum_KI                      = 116,
	pfenum_KP                      = 117,
	pfenum_KR                      = 118,
	pfenum_KW                      = 119,
	pfenum_KG                      = 120,
	pfenum_LA                      = 121,
	pfenum_LV                      = 122,
	pfenum_LB                      = 123,
	pfenum_LS                      = 124,
	pfenum_LR                      = 125,
	pfenum_LY                      = 126,
	pfenum_LI                      = 127,
	pfenum_LT                      = 128,
	pfenum_LU                      = 129,
	pfenum_MO                      = 130,
	pfenum_MK                      = 131,
	pfenum_MG                      = 132,
	pfenum_MW                      = 133,
	pfenum_MY                      = 134,
	pfenum_MV                      = 135,
	pfenum_ML                      = 136,
	pfenum_MT                      = 137,
	pfenum_MH                      = 138,
	pfenum_MQ                      = 139,
	pfenum_MR                      = 140,
	pfenum_MU                      = 141,
	pfenum_YT                      = 142,
	pfenum_MX                      = 143,
	pfenum_FM                      = 144,
	pfenum_MD                      = 145,
	pfenum_MC                      = 146,
	pfenum_MN                      = 147,
	pfenum_ME                      = 148,
	pfenum_MS                      = 149,
	pfenum_MA                      = 150,
	pfenum_MZ                      = 151,
	pfenum_MM                      = 152,
	pfenum_NA                      = 153,
	pfenum_NR                      = 154,
	pfenum_NP                      = 155,
	pfenum_NL                      = 156,
	pfenum_NC                      = 157,
	pfenum_NZ                      = 158,
	pfenum_NI                      = 159,
	pfenum_NE                      = 160,
	pfenum_NG                      = 161,
	pfenum_NU                      = 162,
	pfenum_NF                      = 163,
	pfenum_MP                      = 164,
	pfenum_NO                      = 165,
	pfenum_OM                      = 166,
	pfenum_PK                      = 167,
	pfenum_PW                      = 168,
	pfenum_PS                      = 169,
	pfenum_PA                      = 170,
	pfenum_PG                      = 171,
	pfenum_PY                      = 172,
	pfenum_PE                      = 173,
	pfenum_PH                      = 174,
	pfenum_PN                      = 175,
	pfenum_PL                      = 176,
	pfenum_PT                      = 177,
	pfenum_PR                      = 178,
	pfenum_QA                      = 179,
	pfenum_RE                      = 180,
	pfenum_RO                      = 181,
	pfenum_RU                      = 182,
	pfenum_RW                      = 183,
	pfenum_BL                      = 184,
	pfenum_SH                      = 185,
	pfenum_KN                      = 186,
	pfenum_LC                      = 187,
	pfenum_MF                      = 188,
	pfenum_PM                      = 189,
	pfenum_VC                      = 190,
	pfenum_WS                      = 191,
	pfenum_SM                      = 192,
	pfenum_ST                      = 193,
	pfenum_SA                      = 194,
	pfenum_SN                      = 195,
	pfenum_RS                      = 196,
	pfenum_SC                      = 197,
	pfenum_SL                      = 198,
	pfenum_SG                      = 199,
	pfenum_SX                      = 200,
	pfenum_SK                      = 201,
	pfenum_SI                      = 202,
	pfenum_SB                      = 203,
	pfenum_SO                      = 204,
	pfenum_ZA                      = 205,
	pfenum_GS                      = 206,
	pfenum_SS                      = 207,
	pfenum_ES                      = 208,
	pfenum_LK                      = 209,
	pfenum_SD                      = 210,
	pfenum_SR                      = 211,
	pfenum_SJ                      = 212,
	pfenum_SZ                      = 213,
	pfenum_SE                      = 214,
	pfenum_CH                      = 215,
	pfenum_SY                      = 216,
	pfenum_TW                      = 217,
	pfenum_TJ                      = 218,
	pfenum_TZ                      = 219,
	pfenum_TH                      = 220,
	pfenum_TL                      = 221,
	pfenum_TG                      = 222,
	pfenum_TK                      = 223,
	pfenum_TO                      = 224,
	pfenum_TT                      = 225,
	pfenum_TN                      = 226,
	pfenum_TR                      = 227,
	pfenum_TM                      = 228,
	pfenum_TC                      = 229,
	pfenum_TV                      = 230,
	pfenum_UG                      = 231,
	pfenum_UA                      = 232,
	pfenum_AE                      = 233,
	pfenum_GB                      = 234,
	pfenum_US                      = 235,
	pfenum_UM                      = 236,
	pfenum_UY                      = 237,
	pfenum_UZ                      = 238,
	pfenum_VU                      = 239,
	pfenum_VE                      = 240,
	pfenum_VN                      = 241,
	pfenum_VG                      = 242,
	pfenum_VI                      = 243,
	pfenum_WF                      = 244,
	pfenum_EH                      = 245,
	pfenum_YE                      = 246,
	pfenum_ZM                      = 247,
	pfenum_ZW                      = 248,
	pfenum_MAX                     = 249,
};

enum class ECurrency : uint8
{
	pfenum_AED                     = 0,
	pfenum_AFN                     = 1,
	pfenum_ALL                     = 2,
	pfenum_AMD                     = 3,
	pfenum_ANG                     = 4,
	pfenum_AOA                     = 5,
	pfenum_ARS                     = 6,
	pfenum_AUD                     = 7,
	pfenum_AWG                     = 8,
	pfenum_AZN                     = 9,
	pfenum_BAM                     = 10,
	pfenum_BBD                     = 11,
	pfenum_BDT                     = 12,
	pfenum_BGN                     = 13,
	pfenum_BHD                     = 14,
	pfenum_BIF                     = 15,
	pfenum_BMD                     = 16,
	pfenum_BND                     = 17,
	pfenum_BOB                     = 18,
	pfenum_BRL                     = 19,
	pfenum_BSD                     = 20,
	pfenum_BTN                     = 21,
	pfenum_BWP                     = 22,
	pfenum_BYR                     = 23,
	pfenum_BZD                     = 24,
	pfenum_CAD                     = 25,
	pfenum_CDF                     = 26,
	pfenum_CHF                     = 27,
	pfenum_CLP                     = 28,
	pfenum_CNY                     = 29,
	pfenum_COP                     = 30,
	pfenum_CRC                     = 31,
	pfenum_CUC                     = 32,
	pfenum_CUP                     = 33,
	pfenum_CVE                     = 34,
	pfenum_CZK                     = 35,
	pfenum_DJF                     = 36,
	pfenum_DKK                     = 37,
	pfenum_DOP                     = 38,
	pfenum_DZD                     = 39,
	pfenum_EGP                     = 40,
	pfenum_ERN                     = 41,
	pfenum_ETB                     = 42,
	pfenum_EUR                     = 43,
	pfenum_FJD                     = 44,
	pfenum_FKP                     = 45,
	pfenum_GBP                     = 46,
	pfenum_GEL                     = 47,
	pfenum_GGP                     = 48,
	pfenum_GHS                     = 49,
	pfenum_GIP                     = 50,
	pfenum_GMD                     = 51,
	pfenum_GNF                     = 52,
	pfenum_GTQ                     = 53,
	pfenum_GYD                     = 54,
	pfenum_HKD                     = 55,
	pfenum_HNL                     = 56,
	pfenum_HRK                     = 57,
	pfenum_HTG                     = 58,
	pfenum_HUF                     = 59,
	pfenum_IDR                     = 60,
	pfenum_ILS                     = 61,
	pfenum_IMP                     = 62,
	pfenum_INR                     = 63,
	pfenum_IQD                     = 64,
	pfenum_IRR                     = 65,
	pfenum_ISK                     = 66,
	pfenum_JEP                     = 67,
	pfenum_JMD                     = 68,
	pfenum_JOD                     = 69,
	pfenum_JPY                     = 70,
	pfenum_KES                     = 71,
	pfenum_KGS                     = 72,
	pfenum_KHR                     = 73,
	pfenum_KMF                     = 74,
	pfenum_KPW                     = 75,
	pfenum_KRW                     = 76,
	pfenum_KWD                     = 77,
	pfenum_KYD                     = 78,
	pfenum_KZT                     = 79,
	pfenum_LAK                     = 80,
	pfenum_LBP                     = 81,
	pfenum_LKR                     = 82,
	pfenum_LRD                     = 83,
	pfenum_LSL                     = 84,
	pfenum_LYD                     = 85,
	pfenum_MAD                     = 86,
	pfenum_MDL                     = 87,
	pfenum_MGA                     = 88,
	pfenum_MKD                     = 89,
	pfenum_MMK                     = 90,
	pfenum_MNT                     = 91,
	pfenum_MOP                     = 92,
	pfenum_MRO                     = 93,
	pfenum_MUR                     = 94,
	pfenum_MVR                     = 95,
	pfenum_MWK                     = 96,
	pfenum_MXN                     = 97,
	pfenum_MYR                     = 98,
	pfenum_MZN                     = 99,
	pfenum_NAD                     = 100,
	pfenum_NGN                     = 101,
	pfenum_NIO                     = 102,
	pfenum_NOK                     = 103,
	pfenum_NPR                     = 104,
	pfenum_NZD                     = 105,
	pfenum_OMR                     = 106,
	pfenum_PAB                     = 107,
	pfenum_PEN                     = 108,
	pfenum_PGK                     = 109,
	pfenum_PHP                     = 110,
	pfenum_PKR                     = 111,
	pfenum_PLN                     = 112,
	pfenum_PYG                     = 113,
	pfenum_QAR                     = 114,
	pfenum_RON                     = 115,
	pfenum_RSD                     = 116,
	pfenum_RUB                     = 117,
	pfenum_RWF                     = 118,
	pfenum_SAR                     = 119,
	pfenum_SBD                     = 120,
	pfenum_SCR                     = 121,
	pfenum_SDG                     = 122,
	pfenum_SEK                     = 123,
	pfenum_SGD                     = 124,
	pfenum_SHP                     = 125,
	pfenum_SLL                     = 126,
	pfenum_SOS                     = 127,
	pfenum_SPL                     = 128,
	pfenum_SRD                     = 129,
	pfenum_STD                     = 130,
	pfenum_SVC                     = 131,
	pfenum_SYP                     = 132,
	pfenum_SZL                     = 133,
	pfenum_THB                     = 134,
	pfenum_TJS                     = 135,
	pfenum_TMT                     = 136,
	pfenum_TND                     = 137,
	pfenum_TOP                     = 138,
	pfenum_TRY                     = 139,
	pfenum_TTD                     = 140,
	pfenum_TVD                     = 141,
	pfenum_TWD                     = 142,
	pfenum_TZS                     = 143,
	pfenum_UAH                     = 144,
	pfenum_UGX                     = 145,
	pfenum_USD                     = 146,
	pfenum_UYU                     = 147,
	pfenum_UZS                     = 148,
	pfenum_VEF                     = 149,
	pfenum_VND                     = 150,
	pfenum_VUV                     = 151,
	pfenum_WST                     = 152,
	pfenum_XAF                     = 153,
	pfenum_XCD                     = 154,
	pfenum_XDR                     = 155,
	pfenum_XOF                     = 156,
	pfenum_XPF                     = 157,
	pfenum_YER                     = 158,
	pfenum_ZAR                     = 159,
	pfenum_ZMW                     = 160,
	pfenum_ZWD                     = 161,
	pfenum_MAX                     = 162,
};

enum class EEffectType : uint8
{
	pfenum_Allow                   = 0,
	pfenum_Deny                    = 1,
	pfenum_MAX                     = 2,
};

enum class EEmailVerificationStatus : uint8
{
	pfenum_Unverified              = 0,
	pfenum_Pending                 = 1,
	pfenum_Confirmed               = 2,
	pfenum_MAX                     = 3,
};

enum class EPushNotificationPlatform : uint8
{
	pfenum_ApplePushNotificationService = 0,
	pfenum_GoogleCloudMessaging    = 1,
	pfenum_MAX                     = 2,
};

enum class EResultTableNodeType : uint8
{
	pfenum_ItemId                  = 0,
	pfenum_TableId                 = 1,
	pfenum_MAX                     = 2,
};

enum class ESegmentCountryCode : uint8
{
	pfenum_AF                      = 0,
	pfenum_AX                      = 1,
	pfenum_AL                      = 2,
	pfenum_DZ                      = 3,
	pfenum_AS                      = 4,
	pfenum_AD                      = 5,
	pfenum_AO                      = 6,
	pfenum_AI                      = 7,
	pfenum_AQ                      = 8,
	pfenum_AG                      = 9,
	pfenum_AR                      = 10,
	pfenum_AM                      = 11,
	pfenum_AW                      = 12,
	pfenum_AU                      = 13,
	pfenum_AT                      = 14,
	pfenum_AZ                      = 15,
	pfenum_BS                      = 16,
	pfenum_BH                      = 17,
	pfenum_BD                      = 18,
	pfenum_BB                      = 19,
	pfenum_BY                      = 20,
	pfenum_BE                      = 21,
	pfenum_BZ                      = 22,
	pfenum_BJ                      = 23,
	pfenum_BM                      = 24,
	pfenum_BT                      = 25,
	pfenum_BO                      = 26,
	pfenum_BQ                      = 27,
	pfenum_BA                      = 28,
	pfenum_BW                      = 29,
	pfenum_BV                      = 30,
	pfenum_BR                      = 31,
	pfenum_IO                      = 32,
	pfenum_BN                      = 33,
	pfenum_BG                      = 34,
	pfenum_BF                      = 35,
	pfenum_BI                      = 36,
	pfenum_KH                      = 37,
	pfenum_CM                      = 38,
	pfenum_CA                      = 39,
	pfenum_CV                      = 40,
	pfenum_KY                      = 41,
	pfenum_CF                      = 42,
	pfenum_TD                      = 43,
	pfenum_CL                      = 44,
	pfenum_CN                      = 45,
	pfenum_CX                      = 46,
	pfenum_CC                      = 47,
	pfenum_CO                      = 48,
	pfenum_KM                      = 49,
	pfenum_CG                      = 50,
	pfenum_CD                      = 51,
	pfenum_CK                      = 52,
	pfenum_CR                      = 53,
	pfenum_CI                      = 54,
	pfenum_HR                      = 55,
	pfenum_CU                      = 56,
	pfenum_CW                      = 57,
	pfenum_CY                      = 58,
	pfenum_CZ                      = 59,
	pfenum_DK                      = 60,
	pfenum_DJ                      = 61,
	pfenum_DM                      = 62,
	pfenum_DO                      = 63,
	pfenum_EC                      = 64,
	pfenum_EG                      = 65,
	pfenum_SV                      = 66,
	pfenum_GQ                      = 67,
	pfenum_ER                      = 68,
	pfenum_EE                      = 69,
	pfenum_ET                      = 70,
	pfenum_FK                      = 71,
	pfenum_FO                      = 72,
	pfenum_FJ                      = 73,
	pfenum_FI                      = 74,
	pfenum_FR                      = 75,
	pfenum_GF                      = 76,
	pfenum_PF                      = 77,
	pfenum_TF                      = 78,
	pfenum_GA                      = 79,
	pfenum_GM                      = 80,
	pfenum_GE                      = 81,
	pfenum_DE                      = 82,
	pfenum_GH                      = 83,
	pfenum_GI                      = 84,
	pfenum_GR                      = 85,
	pfenum_GL                      = 86,
	pfenum_GD                      = 87,
	pfenum_GP                      = 88,
	pfenum_GU                      = 89,
	pfenum_GT                      = 90,
	pfenum_GG                      = 91,
	pfenum_GN                      = 92,
	pfenum_GW                      = 93,
	pfenum_GY                      = 94,
	pfenum_HT                      = 95,
	pfenum_HM                      = 96,
	pfenum_VA                      = 97,
	pfenum_HN                      = 98,
	pfenum_HK                      = 99,
	pfenum_HU                      = 100,
	pfenum_IS                      = 101,
	pfenum_IN                      = 102,
	pfenum_ID                      = 103,
	pfenum_IR                      = 104,
	pfenum_IQ                      = 105,
	pfenum_IE                      = 106,
	pfenum_IM                      = 107,
	pfenum_IL                      = 108,
	pfenum_IT                      = 109,
	pfenum_JM                      = 110,
	pfenum_JP                      = 111,
	pfenum_JE                      = 112,
	pfenum_JO                      = 113,
	pfenum_KZ                      = 114,
	pfenum_KE                      = 115,
	pfenum_KI                      = 116,
	pfenum_KP                      = 117,
	pfenum_KR                      = 118,
	pfenum_KW                      = 119,
	pfenum_KG                      = 120,
	pfenum_LA                      = 121,
	pfenum_LV                      = 122,
	pfenum_LB                      = 123,
	pfenum_LS                      = 124,
	pfenum_LR                      = 125,
	pfenum_LY                      = 126,
	pfenum_LI                      = 127,
	pfenum_LT                      = 128,
	pfenum_LU                      = 129,
	pfenum_MO                      = 130,
	pfenum_MK                      = 131,
	pfenum_MG                      = 132,
	pfenum_MW                      = 133,
	pfenum_MY                      = 134,
	pfenum_MV                      = 135,
	pfenum_ML                      = 136,
	pfenum_MT                      = 137,
	pfenum_MH                      = 138,
	pfenum_MQ                      = 139,
	pfenum_MR                      = 140,
	pfenum_MU                      = 141,
	pfenum_YT                      = 142,
	pfenum_MX                      = 143,
	pfenum_FM                      = 144,
	pfenum_MD                      = 145,
	pfenum_MC                      = 146,
	pfenum_MN                      = 147,
	pfenum_ME                      = 148,
	pfenum_MS                      = 149,
	pfenum_MA                      = 150,
	pfenum_MZ                      = 151,
	pfenum_MM                      = 152,
	pfenum_NA                      = 153,
	pfenum_NR                      = 154,
	pfenum_NP                      = 155,
	pfenum_NL                      = 156,
	pfenum_NC                      = 157,
	pfenum_NZ                      = 158,
	pfenum_NI                      = 159,
	pfenum_NE                      = 160,
	pfenum_NG                      = 161,
	pfenum_NU                      = 162,
	pfenum_NF                      = 163,
	pfenum_MP                      = 164,
	pfenum_NO                      = 165,
	pfenum_OM                      = 166,
	pfenum_PK                      = 167,
	pfenum_PW                      = 168,
	pfenum_PS                      = 169,
	pfenum_PA                      = 170,
	pfenum_PG                      = 171,
	pfenum_PY                      = 172,
	pfenum_PE                      = 173,
	pfenum_PH                      = 174,
	pfenum_PN                      = 175,
	pfenum_PL                      = 176,
	pfenum_PT                      = 177,
	pfenum_PR                      = 178,
	pfenum_QA                      = 179,
	pfenum_RE                      = 180,
	pfenum_RO                      = 181,
	pfenum_RU                      = 182,
	pfenum_RW                      = 183,
	pfenum_BL                      = 184,
	pfenum_SH                      = 185,
	pfenum_KN                      = 186,
	pfenum_LC                      = 187,
	pfenum_MF                      = 188,
	pfenum_PM                      = 189,
	pfenum_VC                      = 190,
	pfenum_WS                      = 191,
	pfenum_SM                      = 192,
	pfenum_ST                      = 193,
	pfenum_SA                      = 194,
	pfenum_SN                      = 195,
	pfenum_RS                      = 196,
	pfenum_SC                      = 197,
	pfenum_SL                      = 198,
	pfenum_SG                      = 199,
	pfenum_SX                      = 200,
	pfenum_SK                      = 201,
	pfenum_SI                      = 202,
	pfenum_SB                      = 203,
	pfenum_SO                      = 204,
	pfenum_ZA                      = 205,
	pfenum_GS                      = 206,
	pfenum_SS                      = 207,
	pfenum_ES                      = 208,
	pfenum_LK                      = 209,
	pfenum_SD                      = 210,
	pfenum_SR                      = 211,
	pfenum_SJ                      = 212,
	pfenum_SZ                      = 213,
	pfenum_SE                      = 214,
	pfenum_CH                      = 215,
	pfenum_SY                      = 216,
	pfenum_TW                      = 217,
	pfenum_TJ                      = 218,
	pfenum_TZ                      = 219,
	pfenum_TH                      = 220,
	pfenum_TL                      = 221,
	pfenum_TG                      = 222,
	pfenum_TK                      = 223,
	pfenum_TO                      = 224,
	pfenum_TT                      = 225,
	pfenum_TN                      = 226,
	pfenum_TR                      = 227,
	pfenum_TM                      = 228,
	pfenum_TC                      = 229,
	pfenum_TV                      = 230,
	pfenum_UG                      = 231,
	pfenum_UA                      = 232,
	pfenum_AE                      = 233,
	pfenum_GB                      = 234,
	pfenum_US                      = 235,
	pfenum_UM                      = 236,
	pfenum_UY                      = 237,
	pfenum_UZ                      = 238,
	pfenum_VU                      = 239,
	pfenum_VE                      = 240,
	pfenum_VN                      = 241,
	pfenum_VG                      = 242,
	pfenum_VI                      = 243,
	pfenum_WF                      = 244,
	pfenum_EH                      = 245,
	pfenum_YE                      = 246,
	pfenum_ZM                      = 247,
	pfenum_ZW                      = 248,
	pfenum_MAX                     = 249,
};

enum class ESegmentCurrency : uint8
{
	pfenum_AED                     = 0,
	pfenum_AFN                     = 1,
	pfenum_ALL                     = 2,
	pfenum_AMD                     = 3,
	pfenum_ANG                     = 4,
	pfenum_AOA                     = 5,
	pfenum_ARS                     = 6,
	pfenum_AUD                     = 7,
	pfenum_AWG                     = 8,
	pfenum_AZN                     = 9,
	pfenum_BAM                     = 10,
	pfenum_BBD                     = 11,
	pfenum_BDT                     = 12,
	pfenum_BGN                     = 13,
	pfenum_BHD                     = 14,
	pfenum_BIF                     = 15,
	pfenum_BMD                     = 16,
	pfenum_BND                     = 17,
	pfenum_BOB                     = 18,
	pfenum_BRL                     = 19,
	pfenum_BSD                     = 20,
	pfenum_BTN                     = 21,
	pfenum_BWP                     = 22,
	pfenum_BYR                     = 23,
	pfenum_BZD                     = 24,
	pfenum_CAD                     = 25,
	pfenum_CDF                     = 26,
	pfenum_CHF                     = 27,
	pfenum_CLP                     = 28,
	pfenum_CNY                     = 29,
	pfenum_COP                     = 30,
	pfenum_CRC                     = 31,
	pfenum_CUC                     = 32,
	pfenum_CUP                     = 33,
	pfenum_CVE                     = 34,
	pfenum_CZK                     = 35,
	pfenum_DJF                     = 36,
	pfenum_DKK                     = 37,
	pfenum_DOP                     = 38,
	pfenum_DZD                     = 39,
	pfenum_EGP                     = 40,
	pfenum_ERN                     = 41,
	pfenum_ETB                     = 42,
	pfenum_EUR                     = 43,
	pfenum_FJD                     = 44,
	pfenum_FKP                     = 45,
	pfenum_GBP                     = 46,
	pfenum_GEL                     = 47,
	pfenum_GGP                     = 48,
	pfenum_GHS                     = 49,
	pfenum_GIP                     = 50,
	pfenum_GMD                     = 51,
	pfenum_GNF                     = 52,
	pfenum_GTQ                     = 53,
	pfenum_GYD                     = 54,
	pfenum_HKD                     = 55,
	pfenum_HNL                     = 56,
	pfenum_HRK                     = 57,
	pfenum_HTG                     = 58,
	pfenum_HUF                     = 59,
	pfenum_IDR                     = 60,
	pfenum_ILS                     = 61,
	pfenum_IMP                     = 62,
	pfenum_INR                     = 63,
	pfenum_IQD                     = 64,
	pfenum_IRR                     = 65,
	pfenum_ISK                     = 66,
	pfenum_JEP                     = 67,
	pfenum_JMD                     = 68,
	pfenum_JOD                     = 69,
	pfenum_JPY                     = 70,
	pfenum_KES                     = 71,
	pfenum_KGS                     = 72,
	pfenum_KHR                     = 73,
	pfenum_KMF                     = 74,
	pfenum_KPW                     = 75,
	pfenum_KRW                     = 76,
	pfenum_KWD                     = 77,
	pfenum_KYD                     = 78,
	pfenum_KZT                     = 79,
	pfenum_LAK                     = 80,
	pfenum_LBP                     = 81,
	pfenum_LKR                     = 82,
	pfenum_LRD                     = 83,
	pfenum_LSL                     = 84,
	pfenum_LYD                     = 85,
	pfenum_MAD                     = 86,
	pfenum_MDL                     = 87,
	pfenum_MGA                     = 88,
	pfenum_MKD                     = 89,
	pfenum_MMK                     = 90,
	pfenum_MNT                     = 91,
	pfenum_MOP                     = 92,
	pfenum_MRO                     = 93,
	pfenum_MUR                     = 94,
	pfenum_MVR                     = 95,
	pfenum_MWK                     = 96,
	pfenum_MXN                     = 97,
	pfenum_MYR                     = 98,
	pfenum_MZN                     = 99,
	pfenum_NAD                     = 100,
	pfenum_NGN                     = 101,
	pfenum_NIO                     = 102,
	pfenum_NOK                     = 103,
	pfenum_NPR                     = 104,
	pfenum_NZD                     = 105,
	pfenum_OMR                     = 106,
	pfenum_PAB                     = 107,
	pfenum_PEN                     = 108,
	pfenum_PGK                     = 109,
	pfenum_PHP                     = 110,
	pfenum_PKR                     = 111,
	pfenum_PLN                     = 112,
	pfenum_PYG                     = 113,
	pfenum_QAR                     = 114,
	pfenum_RON                     = 115,
	pfenum_RSD                     = 116,
	pfenum_RUB                     = 117,
	pfenum_RWF                     = 118,
	pfenum_SAR                     = 119,
	pfenum_SBD                     = 120,
	pfenum_SCR                     = 121,
	pfenum_SDG                     = 122,
	pfenum_SEK                     = 123,
	pfenum_SGD                     = 124,
	pfenum_SHP                     = 125,
	pfenum_SLL                     = 126,
	pfenum_SOS                     = 127,
	pfenum_SPL                     = 128,
	pfenum_SRD                     = 129,
	pfenum_STD                     = 130,
	pfenum_SVC                     = 131,
	pfenum_SYP                     = 132,
	pfenum_SZL                     = 133,
	pfenum_THB                     = 134,
	pfenum_TJS                     = 135,
	pfenum_TMT                     = 136,
	pfenum_TND                     = 137,
	pfenum_TOP                     = 138,
	pfenum_TRY                     = 139,
	pfenum_TTD                     = 140,
	pfenum_TVD                     = 141,
	pfenum_TWD                     = 142,
	pfenum_TZS                     = 143,
	pfenum_UAH                     = 144,
	pfenum_UGX                     = 145,
	pfenum_USD                     = 146,
	pfenum_UYU                     = 147,
	pfenum_UZS                     = 148,
	pfenum_VEF                     = 149,
	pfenum_VND                     = 150,
	pfenum_VUV                     = 151,
	pfenum_WST                     = 152,
	pfenum_XAF                     = 153,
	pfenum_XCD                     = 154,
	pfenum_XDR                     = 155,
	pfenum_XOF                     = 156,
	pfenum_XPF                     = 157,
	pfenum_YER                     = 158,
	pfenum_ZAR                     = 159,
	pfenum_ZMW                     = 160,
	pfenum_ZWD                     = 161,
	pfenum_MAX                     = 162,
};

enum class ESegmentFilterComparison : uint8
{
	pfenum_GreaterThan             = 0,
	pfenum_LessThan                = 1,
	pfenum_EqualTo                 = 2,
	pfenum_NotEqualTo              = 3,
	pfenum_GreaterThanOrEqual      = 4,
	pfenum_LessThanOrEqual         = 5,
	pfenum_Exists                  = 6,
	pfenum_Contains                = 7,
	pfenum_NotContains             = 8,
	pfenum_MAX                     = 9,
};

enum class ESegmentLoginIdentityProvider : uint8
{
	pfenum_Unknown                 = 0,
	pfenum_PlayFab                 = 1,
	pfenum_Custom                  = 2,
	pfenum_GameCenter              = 3,
	pfenum_GooglePlay              = 4,
	pfenum_Steam                   = 5,
	pfenum_XBoxLive                = 6,
	pfenum_PSN                     = 7,
	pfenum_Kongregate              = 8,
	pfenum_Facebook                = 9,
	pfenum_IOSDevice               = 10,
	pfenum_AndroidDevice           = 11,
	pfenum_Twitch                  = 12,
	pfenum_WindowsHello            = 13,
	pfenum_GameServer              = 14,
	pfenum_CustomServer            = 15,
	pfenum_NintendoSwitch          = 16,
	pfenum_FacebookInstantGames    = 17,
	pfenum_OpenIdConnect           = 18,
	pfenum_Apple                   = 19,
	pfenum_NintendoSwitchAccount   = 20,
	pfenum_MAX                     = 21,
};

enum class ESegmentPushNotificationDevicePlatform : uint8
{
	pfenum_ApplePushNotificationService = 0,
	pfenum_GoogleCloudMessaging    = 1,
	pfenum_MAX                     = 2,
};

enum class EStatisticVersionArchivalStatus : uint8
{
	pfenum_NotScheduled            = 0,
	pfenum_Scheduled               = 1,
	pfenum_Queued                  = 2,
	pfenum_InProgress              = 3,
	pfenum_Complete                = 4,
	pfenum_MAX                     = 5,
};

enum class EStatisticVersionStatus : uint8
{
	pfenum_Active                  = 0,
	pfenum_SnapshotPending         = 1,
	pfenum_Snapshot                = 2,
	pfenum_ArchivalPending         = 3,
	pfenum_Archived                = 4,
	pfenum_MAX                     = 5,
};

enum class ESubscriptionProviderStatus : uint8
{
	pfenum_NoError                 = 0,
	pfenum_Cancelled               = 1,
	pfenum_UnknownError            = 2,
	pfenum_BillingError            = 3,
	pfenum_ProductUnavailable      = 4,
	pfenum_CustomerDidNotAcceptPriceChange = 5,
	pfenum_FreeTrial               = 6,
	pfenum_PaymentPending          = 7,
	pfenum_MAX                     = 8,
};

enum class ETitleActivationStatus : uint8
{
	pfenum_None                    = 0,
	pfenum_ActivatedTitleKey       = 1,
	pfenum_PendingSteam            = 2,
	pfenum_ActivatedSteam          = 3,
	pfenum_RevokedSteam            = 4,
	pfenum_MAX                     = 5,
};

enum class EUserOrigination : uint8
{
	pfenum_Organic                 = 0,
	pfenum_Steam                   = 1,
	pfenum_Google                  = 2,
	pfenum_Amazon                  = 3,
	pfenum_Facebook                = 4,
	pfenum_Kongregate              = 5,
	pfenum_GamersFirst             = 6,
	pfenum_Unknown                 = 7,
	pfenum_IOS                     = 8,
	pfenum_LoadTest                = 9,
	pfenum_Android                 = 10,
	pfenum_PSN                     = 11,
	pfenum_GameCenter              = 12,
	pfenum_CustomId                = 13,
	pfenum_XboxLive                = 14,
	pfenum_Parse                   = 15,
	pfenum_Twitch                  = 16,
	pfenum_ServerCustomId          = 17,
	pfenum_NintendoSwitchDeviceId  = 18,
	pfenum_FacebookInstantGamesId  = 19,
	pfenum_OpenIdConnect           = 20,
	pfenum_Apple                   = 21,
	pfenum_NintendoSwitchAccount   = 22,
	pfenum_GooglePlayGames         = 23,
	pfenum_MAX                     = 24,
};

enum class EPfTriggerType : uint8
{
	pfenum_HTTP                    = 0,
	pfenum_Queue                   = 1,
	pfenum_MAX                     = 2,
};

enum class EDisplayPropertyType : uint8
{
	pfenum_None                    = 0,
	pfenum_QueryDateTime           = 1,
	pfenum_QueryDouble             = 2,
	pfenum_QueryString             = 3,
	pfenum_SearchString            = 4,
	pfenum_MAX                     = 5,
};

enum class EAnalysisTaskState : uint8
{
	pfenum_Waiting                 = 0,
	pfenum_ReadyForSubmission      = 1,
	pfenum_SubmittingToPipeline    = 2,
	pfenum_Running                 = 3,
	pfenum_Completed               = 4,
	pfenum_Failed                  = 5,
	pfenum_Canceled                = 6,
	pfenum_MAX                     = 7,
};

enum class EExperimentState : uint8
{
	pfenum_New                     = 0,
	pfenum_Started                 = 1,
	pfenum_Stopped                 = 2,
	pfenum_Deleted                 = 3,
	pfenum_MAX                     = 4,
};

enum class EAzureRegion : uint8
{
	pfenum_AustraliaEast           = 0,
	pfenum_AustraliaSoutheast      = 1,
	pfenum_BrazilSouth             = 2,
	pfenum_CentralUs               = 3,
	pfenum_EastAsia                = 4,
	pfenum_EastUs                  = 5,
	pfenum_EastUs2                 = 6,
	pfenum_JapanEast               = 7,
	pfenum_JapanWest               = 8,
	pfenum_NorthCentralUs          = 9,
	pfenum_NorthEurope             = 10,
	pfenum_SouthCentralUs          = 11,
	pfenum_SoutheastAsia           = 12,
	pfenum_WestEurope              = 13,
	pfenum_WestUs                  = 14,
	pfenum_SouthAfricaNorth        = 15,
	pfenum_WestCentralUs           = 16,
	pfenum_KoreaCentral            = 17,
	pfenum_FranceCentral           = 18,
	pfenum_WestUs2                 = 19,
	pfenum_CentralIndia            = 20,
	pfenum_UaeNorth                = 21,
	pfenum_UkSouth                 = 22,
	pfenum_MAX                     = 23,
};

enum class EAzureVmFamily : uint8
{
	pfenum_A                       = 0,
	pfenum_Av2                     = 1,
	pfenum_Dv2                     = 2,
	pfenum_Dv3                     = 3,
	pfenum_F                       = 4,
	pfenum_Fsv2                    = 5,
	pfenum_Dasv4                   = 6,
	pfenum_Dav4                    = 7,
	pfenum_Dadsv5                  = 8,
	pfenum_Eav4                    = 9,
	pfenum_Easv4                   = 10,
	pfenum_Ev4                     = 11,
	pfenum_Esv4                    = 12,
	pfenum_Dsv3                    = 13,
	pfenum_Dsv2                    = 14,
	pfenum_NCasT4_v3               = 15,
	pfenum_Ddv4                    = 16,
	pfenum_Ddsv4                   = 17,
	pfenum_HBv3                    = 18,
	pfenum_MAX                     = 19,
};

enum class ECancellationReason : uint8
{
	pfenum_Requested               = 0,
	pfenum_Internal                = 1,
	pfenum_Timeout                 = 2,
	pfenum_MAX                     = 3,
};

enum class EOsPlatform : uint8
{
	pfenum_Windows                 = 0,
	pfenum_Linux                   = 1,
	pfenum_MAX                     = 2,
};

enum class EProtocolType : uint8
{
	pfenum_TCP                     = 0,
	pfenum_UDP                     = 1,
	pfenum_MAX                     = 2,
};

enum class ERoutingType : uint8
{
	pfenum_Microsoft               = 0,
	pfenum_Internet                = 1,
	pfenum_MAX                     = 2,
};

enum class EServerType : uint8
{
	pfenum_Container               = 0,
	pfenum_Process                 = 1,
	pfenum_MAX                     = 2,
};

enum class EPFJson : uint8
{
	None                           = 0,
	Null                           = 1,
	String                         = 2,
	Number                         = 3,
	Boolean                        = 4,
	Array                          = 5,
	Object                         = 6,
	EPFJson_MAX                    = 7,
};


//---------------------------------------------------------------------------------------------------------------------
// STRUCTS
//---------------------------------------------------------------------------------------------------------------------

// 0x38 (0x38 - 0x0)
// ScriptStruct PlayFab.PlayFabError
struct FPlayFabError
{
public:
	bool                                         HasError;                                          // 0x0(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_37FF[0x3];                                     // Fixing Size After Last Property
	int32                                        ErrorCode;                                         // 0x4(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                ErrorName;                                         // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                ErrorMessage;                                      // 0x18(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                ErrorDetails;                                      // 0x28(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x40 (0x40 - 0x0)
// ScriptStruct PlayFab.PlayFabBaseModel
struct FPlayFabBaseModel
{
public:
	struct FPlayFabError                         ResponseError;                                     // 0x0(0x38)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	class UPlayFabJsonObject*                    ResponseData;                                      // 0x38(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// ScriptStruct PlayFab.PlayFabResultCommon
struct FPlayFabResultCommon
{
public:
	class UPlayFabJsonObject*                    Request;                                           // 0x0(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x8 - 0x8)
// ScriptStruct PlayFab.AdminEmptyResponse
struct FAdminEmptyResponse : public FPlayFabResultCommon
{
public:
};

// 0x8 (0x8 - 0x0)
// ScriptStruct PlayFab.PlayFabRequestCommon
struct FPlayFabRequestCommon
{
public:
	class UPlayFabAuthenticationContext*         AuthenticationContext;                             // 0x0(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x20 - 0x8)
// ScriptStruct PlayFab.AdminAbortTaskInstanceRequest
struct FAdminAbortTaskInstanceRequest : public FPlayFabRequestCommon
{
public:
	class UPlayFabJsonObject*                    CustomTags;                                        // 0x8(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                TaskInstanceId;                                    // 0x10(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x8 - 0x8)
// ScriptStruct PlayFab.AdminAddLocalizedNewsResult
struct FAdminAddLocalizedNewsResult : public FPlayFabResultCommon
{
public:
};

// 0x48 (0x50 - 0x8)
// ScriptStruct PlayFab.AdminAddLocalizedNewsRequest
struct FAdminAddLocalizedNewsRequest : public FPlayFabRequestCommon
{
public:
	class FString                                Body;                                              // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabJsonObject*                    CustomTags;                                        // 0x18(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                Language;                                          // 0x20(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                NewsId;                                            // 0x30(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                Title;                                             // 0x40(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x18 - 0x8)
// ScriptStruct PlayFab.AdminAddNewsResult
struct FAdminAddNewsResult : public FPlayFabResultCommon
{
public:
	class FString                                NewsId;                                            // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x38 (0x40 - 0x8)
// ScriptStruct PlayFab.AdminAddNewsRequest
struct FAdminAddNewsRequest : public FPlayFabRequestCommon
{
public:
	class FString                                Body;                                              // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabJsonObject*                    CustomTags;                                        // 0x18(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                Timestamp;                                         // 0x20(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                Title;                                             // 0x30(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x8 - 0x8)
// ScriptStruct PlayFab.AdminAddPlayerTagResult
struct FAdminAddPlayerTagResult : public FPlayFabResultCommon
{
public:
};

// 0x28 (0x30 - 0x8)
// ScriptStruct PlayFab.AdminAddPlayerTagRequest
struct FAdminAddPlayerTagRequest : public FPlayFabRequestCommon
{
public:
	class UPlayFabJsonObject*                    CustomTags;                                        // 0x8(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                PlayFabId;                                         // 0x10(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                TagName;                                           // 0x20(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x28 (0x30 - 0x8)
// ScriptStruct PlayFab.AdminModifyUserVirtualCurrencyResult
struct FAdminModifyUserVirtualCurrencyResult : public FPlayFabResultCommon
{
public:
	int32                                        Balance;                                           // 0x8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        BalanceChange;                                     // 0xC(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                PlayFabId;                                         // 0x10(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                VirtualCurrency;                                   // 0x20(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x30 (0x38 - 0x8)
// ScriptStruct PlayFab.AdminAddUserVirtualCurrencyRequest
struct FAdminAddUserVirtualCurrencyRequest : public FPlayFabRequestCommon
{
public:
	int32                                        Amount;                                            // 0x8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3803[0x4];                                     // Fixing Size After Last Property
	class UPlayFabJsonObject*                    CustomTags;                                        // 0x10(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                PlayFabId;                                         // 0x18(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                VirtualCurrency;                                   // 0x28(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x8 - 0x8)
// ScriptStruct PlayFab.AdminBlankResult
struct FAdminBlankResult : public FPlayFabResultCommon
{
public:
};

// 0x10 (0x18 - 0x8)
// ScriptStruct PlayFab.AdminAddVirtualCurrencyTypesRequest
struct FAdminAddVirtualCurrencyTypesRequest : public FPlayFabRequestCommon
{
public:
	TArray<class UPlayFabJsonObject*>            VirtualCurrencies;                                 // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x10 (0x18 - 0x8)
// ScriptStruct PlayFab.AdminBanUsersResult
struct FAdminBanUsersResult : public FPlayFabResultCommon
{
public:
	TArray<class UPlayFabJsonObject*>            BanData;                                           // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x18 (0x20 - 0x8)
// ScriptStruct PlayFab.AdminBanUsersRequest
struct FAdminBanUsersRequest : public FPlayFabRequestCommon
{
public:
	TArray<class UPlayFabJsonObject*>            Bans;                                              // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	class UPlayFabJsonObject*                    CustomTags;                                        // 0x18(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x10 - 0x8)
// ScriptStruct PlayFab.AdminCheckLimitedEditionItemAvailabilityResult
struct FAdminCheckLimitedEditionItemAvailabilityResult : public FPlayFabResultCommon
{
public:
	int32                                        Amount;                                            // 0x8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3806[0x4];                                     // Fixing Size Of Struct
};

// 0x20 (0x28 - 0x8)
// ScriptStruct PlayFab.AdminCheckLimitedEditionItemAvailabilityRequest
struct FAdminCheckLimitedEditionItemAvailabilityRequest : public FPlayFabRequestCommon
{
public:
	class FString                                CatalogVersion;                                    // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                ItemId;                                            // 0x18(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x18 - 0x8)
// ScriptStruct PlayFab.AdminCreateTaskResult
struct FAdminCreateTaskResult : public FPlayFabResultCommon
{
public:
	class FString                                TaskId;                                            // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x48 (0x50 - 0x8)
// ScriptStruct PlayFab.AdminCreateActionsOnPlayerSegmentTaskRequest
struct FAdminCreateActionsOnPlayerSegmentTaskRequest : public FPlayFabRequestCommon
{
public:
	class UPlayFabJsonObject*                    CustomTags;                                        // 0x8(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                Description;                                       // 0x10(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         IsActive;                                          // 0x20(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3808[0x7];                                     // Fixing Size After Last Property
	class FString                                Name;                                              // 0x28(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabJsonObject*                    Parameter;                                         // 0x38(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                Schedule;                                          // 0x40(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x48 (0x50 - 0x8)
// ScriptStruct PlayFab.AdminCreateCloudScriptTaskRequest
struct FAdminCreateCloudScriptTaskRequest : public FPlayFabRequestCommon
{
public:
	class UPlayFabJsonObject*                    CustomTags;                                        // 0x8(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                Description;                                       // 0x10(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         IsActive;                                          // 0x20(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_380A[0x7];                                     // Fixing Size After Last Property
	class FString                                Name;                                              // 0x28(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabJsonObject*                    Parameter;                                         // 0x38(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                Schedule;                                          // 0x40(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x48 (0x50 - 0x8)
// ScriptStruct PlayFab.AdminCreateInsightsScheduledScalingTaskRequest
struct FAdminCreateInsightsScheduledScalingTaskRequest : public FPlayFabRequestCommon
{
public:
	class UPlayFabJsonObject*                    CustomTags;                                        // 0x8(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                Description;                                       // 0x10(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         IsActive;                                          // 0x20(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_380B[0x7];                                     // Fixing Size After Last Property
	class FString                                Name;                                              // 0x28(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabJsonObject*                    Parameter;                                         // 0x38(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                Schedule;                                          // 0x40(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x50 (0x58 - 0x8)
// ScriptStruct PlayFab.AdminCreateOpenIdConnectionRequest
struct FAdminCreateOpenIdConnectionRequest : public FPlayFabRequestCommon
{
public:
	class FString                                ClientId;                                          // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                ClientSecret;                                      // 0x18(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                ConnectionId;                                      // 0x28(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         IgnoreNonce;                                       // 0x38(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_380D[0x7];                                     // Fixing Size After Last Property
	class FString                                IssuerDiscoveryUrl;                                // 0x40(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabJsonObject*                    IssuerInformation;                                 // 0x50(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x18 - 0x8)
// ScriptStruct PlayFab.AdminCreatePlayerSharedSecretResult
struct FAdminCreatePlayerSharedSecretResult : public FPlayFabResultCommon
{
public:
	class FString                                SecretKey;                                         // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x18 - 0x8)
// ScriptStruct PlayFab.AdminCreatePlayerSharedSecretRequest
struct FAdminCreatePlayerSharedSecretRequest : public FPlayFabRequestCommon
{
public:
	class FString                                FriendlyName;                                      // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x10 - 0x8)
// ScriptStruct PlayFab.AdminCreatePlayerStatisticDefinitionResult
struct FAdminCreatePlayerStatisticDefinitionResult : public FPlayFabResultCommon
{
public:
	class UPlayFabJsonObject*                    Statistic;                                         // 0x8(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x28 (0x30 - 0x8)
// ScriptStruct PlayFab.AdminCreatePlayerStatisticDefinitionRequest
struct FAdminCreatePlayerStatisticDefinitionRequest : public FPlayFabRequestCommon
{
public:
	enum class EStatisticAggregationMethod       AggregationMethod;                                 // 0x8(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_380F[0x7];                                     // Fixing Size After Last Property
	class UPlayFabJsonObject*                    CustomTags;                                        // 0x10(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                StatisticName;                                     // 0x18(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EStatisticResetIntervalOption     VersionChangeInterval;                             // 0x28(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3810[0x7];                                     // Fixing Size Of Struct
};

// 0x20 (0x28 - 0x8)
// ScriptStruct PlayFab.AdminCreateSegmentResponse
struct FAdminCreateSegmentResponse : public FPlayFabResultCommon
{
public:
	class FString                                ErrorMessage;                                      // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                SegmentId;                                         // 0x18(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x10 - 0x8)
// ScriptStruct PlayFab.AdminCreateSegmentRequest
struct FAdminCreateSegmentRequest : public FPlayFabRequestCommon
{
public:
	class UPlayFabJsonObject*                    SegmentModel;                                      // 0x8(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x28 - 0x8)
// ScriptStruct PlayFab.AdminDeleteMasterPlayerAccountResult
struct FAdminDeleteMasterPlayerAccountResult : public FPlayFabResultCommon
{
public:
	class FString                                JobReceiptId;                                      // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                TitleIds;                                          // 0x18(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x8 - 0x8)
// ScriptStruct PlayFab.AdminDeleteMembershipSubscriptionResult
struct FAdminDeleteMembershipSubscriptionResult : public FPlayFabResultCommon
{
public:
};

// 0x0 (0x8 - 0x8)
// ScriptStruct PlayFab.AdminDeletePlayerResult
struct FAdminDeletePlayerResult : public FPlayFabResultCommon
{
public:
};

// 0x0 (0x8 - 0x8)
// ScriptStruct PlayFab.AdminDeletePlayerSharedSecretResult
struct FAdminDeletePlayerSharedSecretResult : public FPlayFabResultCommon
{
public:
};

// 0x10 (0x18 - 0x8)
// ScriptStruct PlayFab.AdminDeleteSegmentsResponse
struct FAdminDeleteSegmentsResponse : public FPlayFabResultCommon
{
public:
	class FString                                ErrorMessage;                                      // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x8 - 0x8)
// ScriptStruct PlayFab.AdminDeleteStoreResult
struct FAdminDeleteStoreResult : public FPlayFabResultCommon
{
public:
};

// 0x0 (0x8 - 0x8)
// ScriptStruct PlayFab.AdminDeleteTitleResult
struct FAdminDeleteTitleResult : public FPlayFabResultCommon
{
public:
};

// 0x0 (0x8 - 0x8)
// ScriptStruct PlayFab.AdminDeleteTitleDataOverrideResult
struct FAdminDeleteTitleDataOverrideResult : public FPlayFabResultCommon
{
public:
};

// 0x10 (0x18 - 0x8)
// ScriptStruct PlayFab.AdminExportMasterPlayerDataResult
struct FAdminExportMasterPlayerDataResult : public FPlayFabResultCommon
{
public:
	class FString                                JobReceiptId;                                      // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x28 - 0x8)
// ScriptStruct PlayFab.AdminExportPlayersInSegmentResult
struct FAdminExportPlayersInSegmentResult : public FPlayFabResultCommon
{
public:
	class FString                                ExportId;                                          // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                SegmentId;                                         // 0x18(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x18 - 0x8)
// ScriptStruct PlayFab.AdminGetActionsOnPlayersInSegmentTaskInstanceResult
struct FAdminGetActionsOnPlayersInSegmentTaskInstanceResult : public FPlayFabResultCommon
{
public:
	class UPlayFabJsonObject*                    Parameter;                                         // 0x8(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabJsonObject*                    Summary;                                           // 0x10(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x18 - 0x8)
// ScriptStruct PlayFab.AdminGetAllSegmentsResult
struct FAdminGetAllSegmentsResult : public FPlayFabResultCommon
{
public:
	TArray<class UPlayFabJsonObject*>            Segments;                                          // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x10 (0x18 - 0x8)
// ScriptStruct PlayFab.AdminGetCatalogItemsResult
struct FAdminGetCatalogItemsResult : public FPlayFabResultCommon
{
public:
	TArray<class UPlayFabJsonObject*>            Catalog;                                           // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x30 (0x38 - 0x8)
// ScriptStruct PlayFab.AdminGetCloudScriptRevisionResult
struct FAdminGetCloudScriptRevisionResult : public FPlayFabResultCommon
{
public:
	class FString                                CreatedAt;                                         // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UPlayFabJsonObject*>            Files;                                             // 0x18(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                         IsPublished;                                       // 0x28(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3813[0x3];                                     // Fixing Size After Last Property
	int32                                        Revision;                                          // 0x2C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        Version;                                           // 0x30(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3814[0x4];                                     // Fixing Size Of Struct
};

// 0x10 (0x18 - 0x8)
// ScriptStruct PlayFab.AdminGetCloudScriptTaskInstanceResult
struct FAdminGetCloudScriptTaskInstanceResult : public FPlayFabResultCommon
{
public:
	class UPlayFabJsonObject*                    Parameter;                                         // 0x8(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabJsonObject*                    Summary;                                           // 0x10(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x18 - 0x8)
// ScriptStruct PlayFab.AdminGetCloudScriptVersionsResult
struct FAdminGetCloudScriptVersionsResult : public FPlayFabResultCommon
{
public:
	TArray<class UPlayFabJsonObject*>            Versions;                                          // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x18 (0x20 - 0x8)
// ScriptStruct PlayFab.AdminGetContentListResult
struct FAdminGetContentListResult : public FPlayFabResultCommon
{
public:
	TArray<class UPlayFabJsonObject*>            Contents;                                          // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                        ItemCount;                                         // 0x18(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        TotalSize;                                         // 0x1C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x18 - 0x8)
// ScriptStruct PlayFab.AdminGetContentUploadUrlResult
struct FAdminGetContentUploadUrlResult : public FPlayFabResultCommon
{
public:
	class FString                                URL;                                               // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x18 - 0x8)
// ScriptStruct PlayFab.AdminGetDataReportResult
struct FAdminGetDataReportResult : public FPlayFabResultCommon
{
public:
	class FString                                DownloadUrl;                                       // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xB0 (0xB8 - 0x8)
// ScriptStruct PlayFab.AdminGetMatchmakerGameInfoResult
struct FAdminGetMatchmakerGameInfoResult : public FPlayFabResultCommon
{
public:
	class FString                                BuildVersion;                                      // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                EndTime;                                           // 0x18(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                LobbyId;                                           // 0x28(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                Mode;                                              // 0x38(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                Players;                                           // 0x48(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class ERegion                           Region;                                            // 0x58(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3816[0x7];                                     // Fixing Size After Last Property
	class FString                                ServerIPV4Address;                                 // 0x60(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                ServerIPV6Address;                                 // 0x70(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        ServerPort;                                        // 0x80(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3818[0x4];                                     // Fixing Size After Last Property
	class FString                                ServerPublicDNSName;                               // 0x88(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                StartTime;                                         // 0x98(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                TitleId;                                           // 0xA8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x18 - 0x8)
// ScriptStruct PlayFab.AdminGetMatchmakerGameModesResult
struct FAdminGetMatchmakerGameModesResult : public FPlayFabResultCommon
{
public:
	TArray<class UPlayFabJsonObject*>            GameModes;                                         // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x10 (0x18 - 0x8)
// ScriptStruct PlayFab.AdminGetPlayedTitleListResult
struct FAdminGetPlayedTitleListResult : public FPlayFabResultCommon
{
public:
	class FString                                TitleIds;                                          // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x18 - 0x8)
// ScriptStruct PlayFab.AdminGetPlayerIdFromAuthTokenResult
struct FAdminGetPlayerIdFromAuthTokenResult : public FPlayFabResultCommon
{
public:
	class FString                                PlayFabId;                                         // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x10 - 0x8)
// ScriptStruct PlayFab.AdminGetPlayerProfileResult
struct FAdminGetPlayerProfileResult : public FPlayFabResultCommon
{
public:
	class UPlayFabJsonObject*                    PlayerProfile;                                     // 0x8(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x18 - 0x8)
// ScriptStruct PlayFab.AdminGetPlayerSegmentsResult
struct FAdminGetPlayerSegmentsResult : public FPlayFabResultCommon
{
public:
	TArray<class UPlayFabJsonObject*>            Segments;                                          // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x10 (0x18 - 0x8)
// ScriptStruct PlayFab.AdminGetPlayerSharedSecretsResult
struct FAdminGetPlayerSharedSecretsResult : public FPlayFabResultCommon
{
public:
	TArray<class UPlayFabJsonObject*>            SharedSecrets;                                     // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x28 (0x30 - 0x8)
// ScriptStruct PlayFab.AdminGetPlayersInSegmentResult
struct FAdminGetPlayersInSegmentResult : public FPlayFabResultCommon
{
public:
	class FString                                ContinuationToken;                                 // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UPlayFabJsonObject*>            PlayerProfiles;                                    // 0x18(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                        ProfilesInSegment;                                 // 0x28(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3819[0x4];                                     // Fixing Size Of Struct
};

// 0x10 (0x18 - 0x8)
// ScriptStruct PlayFab.AdminGetPlayerStatisticDefinitionsResult
struct FAdminGetPlayerStatisticDefinitionsResult : public FPlayFabResultCommon
{
public:
	TArray<class UPlayFabJsonObject*>            Statistics;                                        // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x10 (0x18 - 0x8)
// ScriptStruct PlayFab.AdminGetPlayerStatisticVersionsResult
struct FAdminGetPlayerStatisticVersionsResult : public FPlayFabResultCommon
{
public:
	TArray<class UPlayFabJsonObject*>            StatisticVersions;                                 // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x20 (0x28 - 0x8)
// ScriptStruct PlayFab.AdminGetPlayerTagsResult
struct FAdminGetPlayerTagsResult : public FPlayFabResultCommon
{
public:
	class FString                                PlayFabId;                                         // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                Tags;                                              // 0x18(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x28 (0x30 - 0x8)
// ScriptStruct PlayFab.AdminGetPolicyResponse
struct FAdminGetPolicyResponse : public FPlayFabResultCommon
{
public:
	class FString                                PolicyName;                                        // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        PolicyVersion;                                     // 0x18(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_381B[0x4];                                     // Fixing Size After Last Property
	TArray<class UPlayFabJsonObject*>            Statements;                                        // 0x20(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x8 (0x10 - 0x8)
// ScriptStruct PlayFab.AdminGetPublisherDataResult
struct FAdminGetPublisherDataResult : public FPlayFabResultCommon
{
public:
	class UPlayFabJsonObject*                    Data;                                              // 0x8(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x10 - 0x8)
// ScriptStruct PlayFab.AdminGetRandomResultTablesResult
struct FAdminGetRandomResultTablesResult : public FPlayFabResultCommon
{
public:
	class UPlayFabJsonObject*                    Tables;                                            // 0x8(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x28 - 0x8)
// ScriptStruct PlayFab.AdminGetPlayersInSegmentExportResponse
struct FAdminGetPlayersInSegmentExportResponse : public FPlayFabResultCommon
{
public:
	class FString                                IndexUrl;                                          // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                State;                                             // 0x18(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x28 - 0x8)
// ScriptStruct PlayFab.AdminGetSegmentsResponse
struct FAdminGetSegmentsResponse : public FPlayFabResultCommon
{
public:
	class FString                                ErrorMessage;                                      // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UPlayFabJsonObject*>            Segments;                                          // 0x18(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x40 (0x48 - 0x8)
// ScriptStruct PlayFab.AdminGetStoreItemsResult
struct FAdminGetStoreItemsResult : public FPlayFabResultCommon
{
public:
	class FString                                CatalogVersion;                                    // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabJsonObject*                    MarketingData;                                     // 0x18(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EPfSourceType                     Source;                                            // 0x20(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_381C[0x7];                                     // Fixing Size After Last Property
	TArray<class UPlayFabJsonObject*>            Store;                                             // 0x28(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	class FString                                StoreId;                                           // 0x38(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x18 - 0x8)
// ScriptStruct PlayFab.AdminGetTaskInstancesResult
struct FAdminGetTaskInstancesResult : public FPlayFabResultCommon
{
public:
	TArray<class UPlayFabJsonObject*>            Summaries;                                         // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x10 (0x18 - 0x8)
// ScriptStruct PlayFab.AdminGetTasksResult
struct FAdminGetTasksResult : public FPlayFabResultCommon
{
public:
	TArray<class UPlayFabJsonObject*>            Tasks;                                             // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x8 (0x10 - 0x8)
// ScriptStruct PlayFab.AdminGetTitleDataResult
struct FAdminGetTitleDataResult : public FPlayFabResultCommon
{
public:
	class UPlayFabJsonObject*                    Data;                                              // 0x8(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x10 - 0x8)
// ScriptStruct PlayFab.AdminLookupUserAccountInfoResult
struct FAdminLookupUserAccountInfoResult : public FPlayFabResultCommon
{
public:
	class UPlayFabJsonObject*                    UserInfo;                                          // 0x8(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x18 - 0x8)
// ScriptStruct PlayFab.AdminGetUserBansResult
struct FAdminGetUserBansResult : public FPlayFabResultCommon
{
public:
	TArray<class UPlayFabJsonObject*>            BanData;                                           // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x20 (0x28 - 0x8)
// ScriptStruct PlayFab.AdminGetUserDataResult
struct FAdminGetUserDataResult : public FPlayFabResultCommon
{
public:
	class UPlayFabJsonObject*                    Data;                                              // 0x8(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        DataVersion;                                       // 0x10(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_381D[0x4];                                     // Fixing Size After Last Property
	class FString                                PlayFabId;                                         // 0x18(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x30 (0x38 - 0x8)
// ScriptStruct PlayFab.AdminGetUserInventoryResult
struct FAdminGetUserInventoryResult : public FPlayFabResultCommon
{
public:
	TArray<class UPlayFabJsonObject*>            Inventory;                                         // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	class FString                                PlayFabId;                                         // 0x18(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabJsonObject*                    VirtualCurrency;                                   // 0x28(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabJsonObject*                    VirtualCurrencyRechargeTimes;                      // 0x30(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x18 - 0x8)
// ScriptStruct PlayFab.AdminGrantItemsToUsersResult
struct FAdminGrantItemsToUsersResult : public FPlayFabResultCommon
{
public:
	TArray<class UPlayFabJsonObject*>            ItemGrantResults;                                  // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x0 (0x8 - 0x8)
// ScriptStruct PlayFab.AdminIncrementLimitedEditionItemAvailabilityResult
struct FAdminIncrementLimitedEditionItemAvailabilityResult : public FPlayFabResultCommon
{
public:
};

// 0x8 (0x10 - 0x8)
// ScriptStruct PlayFab.AdminIncrementPlayerStatisticVersionResult
struct FAdminIncrementPlayerStatisticVersionResult : public FPlayFabResultCommon
{
public:
	class UPlayFabJsonObject*                    StatisticVersion;                                  // 0x8(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x18 - 0x8)
// ScriptStruct PlayFab.AdminListOpenIdConnectionResponse
struct FAdminListOpenIdConnectionResponse : public FPlayFabResultCommon
{
public:
	TArray<class UPlayFabJsonObject*>            Connections;                                       // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x10 (0x18 - 0x8)
// ScriptStruct PlayFab.AdminListVirtualCurrencyTypesResult
struct FAdminListVirtualCurrencyTypesResult : public FPlayFabResultCommon
{
public:
	TArray<class UPlayFabJsonObject*>            VirtualCurrencies;                                 // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x80 (0x88 - 0x8)
// ScriptStruct PlayFab.AdminModifyServerBuildResult
struct FAdminModifyServerBuildResult : public FPlayFabResultCommon
{
public:
	class FString                                ActiveRegions;                                     // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                BuildId;                                           // 0x18(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                CommandLineTemplate;                               // 0x28(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                Comment;                                           // 0x38(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                ExecutablePath;                                    // 0x48(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        MaxGamesPerHost;                                   // 0x58(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        MinFreeGameSlots;                                  // 0x5C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EGameBuildStatus                  Status;                                            // 0x60(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_381E[0x7];                                     // Fixing Size After Last Property
	class FString                                Timestamp;                                         // 0x68(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                TitleId;                                           // 0x78(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x18 - 0x8)
// ScriptStruct PlayFab.AdminRefundPurchaseResponse
struct FAdminRefundPurchaseResponse : public FPlayFabResultCommon
{
public:
	class FString                                PurchaseStatus;                                    // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x8 - 0x8)
// ScriptStruct PlayFab.AdminRemovePlayerTagResult
struct FAdminRemovePlayerTagResult : public FPlayFabResultCommon
{
public:
};

// 0x0 (0x8 - 0x8)
// ScriptStruct PlayFab.AdminResetCharacterStatisticsResult
struct FAdminResetCharacterStatisticsResult : public FPlayFabResultCommon
{
public:
};

// 0x0 (0x8 - 0x8)
// ScriptStruct PlayFab.AdminResetPasswordResult
struct FAdminResetPasswordResult : public FPlayFabResultCommon
{
public:
};

// 0x0 (0x8 - 0x8)
// ScriptStruct PlayFab.AdminResetUserStatisticsResult
struct FAdminResetUserStatisticsResult : public FPlayFabResultCommon
{
public:
};

// 0x10 (0x18 - 0x8)
// ScriptStruct PlayFab.AdminResolvePurchaseDisputeResponse
struct FAdminResolvePurchaseDisputeResponse : public FPlayFabResultCommon
{
public:
	class FString                                PurchaseStatus;                                    // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x18 - 0x8)
// ScriptStruct PlayFab.AdminRevokeAllBansForUserResult
struct FAdminRevokeAllBansForUserResult : public FPlayFabResultCommon
{
public:
	TArray<class UPlayFabJsonObject*>            BanData;                                           // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x10 (0x18 - 0x8)
// ScriptStruct PlayFab.AdminRevokeBansResult
struct FAdminRevokeBansResult : public FPlayFabResultCommon
{
public:
	TArray<class UPlayFabJsonObject*>            BanData;                                           // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x0 (0x8 - 0x8)
// ScriptStruct PlayFab.AdminRevokeInventoryResult
struct FAdminRevokeInventoryResult : public FPlayFabResultCommon
{
public:
};

// 0x10 (0x18 - 0x8)
// ScriptStruct PlayFab.AdminRevokeInventoryItemsResult
struct FAdminRevokeInventoryItemsResult : public FPlayFabResultCommon
{
public:
	TArray<class UPlayFabJsonObject*>            Errors;                                            // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x10 (0x18 - 0x8)
// ScriptStruct PlayFab.AdminRunTaskResult
struct FAdminRunTaskResult : public FPlayFabResultCommon
{
public:
	class FString                                TaskInstanceId;                                    // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x8 - 0x8)
// ScriptStruct PlayFab.AdminSendAccountRecoveryEmailResult
struct FAdminSendAccountRecoveryEmailResult : public FPlayFabResultCommon
{
public:
};

// 0x0 (0x8 - 0x8)
// ScriptStruct PlayFab.AdminUpdateCatalogItemsResult
struct FAdminUpdateCatalogItemsResult : public FPlayFabResultCommon
{
public:
};

// 0x0 (0x8 - 0x8)
// ScriptStruct PlayFab.AdminSetMembershipOverrideResult
struct FAdminSetMembershipOverrideResult : public FPlayFabResultCommon
{
public:
};

// 0x0 (0x8 - 0x8)
// ScriptStruct PlayFab.AdminSetPlayerSecretResult
struct FAdminSetPlayerSecretResult : public FPlayFabResultCommon
{
public:
};

// 0x0 (0x8 - 0x8)
// ScriptStruct PlayFab.AdminSetPublishedRevisionResult
struct FAdminSetPublishedRevisionResult : public FPlayFabResultCommon
{
public:
};

// 0x0 (0x8 - 0x8)
// ScriptStruct PlayFab.AdminSetPublisherDataResult
struct FAdminSetPublisherDataResult : public FPlayFabResultCommon
{
public:
};

// 0x0 (0x8 - 0x8)
// ScriptStruct PlayFab.AdminUpdateStoreItemsResult
struct FAdminUpdateStoreItemsResult : public FPlayFabResultCommon
{
public:
};

// 0x0 (0x8 - 0x8)
// ScriptStruct PlayFab.AdminSetTitleDataResult
struct FAdminSetTitleDataResult : public FPlayFabResultCommon
{
public:
};

// 0x0 (0x8 - 0x8)
// ScriptStruct PlayFab.AdminSetTitleDataAndOverridesResult
struct FAdminSetTitleDataAndOverridesResult : public FPlayFabResultCommon
{
public:
};

// 0x10 (0x18 - 0x8)
// ScriptStruct PlayFab.AdminSetupPushNotificationResult
struct FAdminSetupPushNotificationResult : public FPlayFabResultCommon
{
public:
	class FString                                ARN;                                               // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x18 - 0x8)
// ScriptStruct PlayFab.AdminUpdateBansResult
struct FAdminUpdateBansResult : public FPlayFabResultCommon
{
public:
	TArray<class UPlayFabJsonObject*>            BanData;                                           // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x8 (0x10 - 0x8)
// ScriptStruct PlayFab.AdminUpdateCloudScriptResult
struct FAdminUpdateCloudScriptResult : public FPlayFabResultCommon
{
public:
	int32                                        Revision;                                          // 0x8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        Version;                                           // 0xC(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x8 - 0x8)
// ScriptStruct PlayFab.AdminUpdatePlayerSharedSecretResult
struct FAdminUpdatePlayerSharedSecretResult : public FPlayFabResultCommon
{
public:
};

// 0x8 (0x10 - 0x8)
// ScriptStruct PlayFab.AdminUpdatePlayerStatisticDefinitionResult
struct FAdminUpdatePlayerStatisticDefinitionResult : public FPlayFabResultCommon
{
public:
	class UPlayFabJsonObject*                    Statistic;                                         // 0x8(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x28 - 0x8)
// ScriptStruct PlayFab.AdminUpdatePolicyResponse
struct FAdminUpdatePolicyResponse : public FPlayFabResultCommon
{
public:
	class FString                                PolicyName;                                        // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UPlayFabJsonObject*>            Statements;                                        // 0x18(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x0 (0x8 - 0x8)
// ScriptStruct PlayFab.AdminUpdateRandomResultTablesResult
struct FAdminUpdateRandomResultTablesResult : public FPlayFabResultCommon
{
public:
};

// 0x20 (0x28 - 0x8)
// ScriptStruct PlayFab.AdminUpdateSegmentResponse
struct FAdminUpdateSegmentResponse : public FPlayFabResultCommon
{
public:
	class FString                                ErrorMessage;                                      // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                SegmentId;                                         // 0x18(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x10 - 0x8)
// ScriptStruct PlayFab.AdminUpdateUserDataResult
struct FAdminUpdateUserDataResult : public FPlayFabResultCommon
{
public:
	int32                                        DataVersion;                                       // 0x8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3820[0x4];                                     // Fixing Size Of Struct
};

// 0x10 (0x18 - 0x8)
// ScriptStruct PlayFab.AdminUpdateUserTitleDisplayNameResult
struct FAdminUpdateUserTitleDisplayNameResult : public FPlayFabResultCommon
{
public:
	class FString                                DisplayName;                                       // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x18 - 0x8)
// ScriptStruct PlayFab.AdminDeleteContentRequest
struct FAdminDeleteContentRequest : public FPlayFabRequestCommon
{
public:
	class FString                                Key;                                               // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x28 - 0x8)
// ScriptStruct PlayFab.AdminDeleteMasterPlayerAccountRequest
struct FAdminDeleteMasterPlayerAccountRequest : public FPlayFabRequestCommon
{
public:
	class FString                                MetaData;                                          // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                PlayFabId;                                         // 0x18(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x38 (0x40 - 0x8)
// ScriptStruct PlayFab.AdminDeleteMembershipSubscriptionRequest
struct FAdminDeleteMembershipSubscriptionRequest : public FPlayFabRequestCommon
{
public:
	class UPlayFabJsonObject*                    CustomTags;                                        // 0x8(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                MembershipId;                                      // 0x10(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                PlayFabId;                                         // 0x20(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                SubscriptionId;                                    // 0x30(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x18 - 0x8)
// ScriptStruct PlayFab.AdminDeleteOpenIdConnectionRequest
struct FAdminDeleteOpenIdConnectionRequest : public FPlayFabRequestCommon
{
public:
	class FString                                ConnectionId;                                      // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x18 - 0x8)
// ScriptStruct PlayFab.AdminDeletePlayerRequest
struct FAdminDeletePlayerRequest : public FPlayFabRequestCommon
{
public:
	class FString                                PlayFabId;                                         // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x18 - 0x8)
// ScriptStruct PlayFab.AdminDeletePlayerSharedSecretRequest
struct FAdminDeletePlayerSharedSecretRequest : public FPlayFabRequestCommon
{
public:
	class FString                                SecretKey;                                         // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x18 - 0x8)
// ScriptStruct PlayFab.AdminDeleteSegmentRequest
struct FAdminDeleteSegmentRequest : public FPlayFabRequestCommon
{
public:
	class FString                                SegmentId;                                         // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x28 (0x30 - 0x8)
// ScriptStruct PlayFab.AdminDeleteStoreRequest
struct FAdminDeleteStoreRequest : public FPlayFabRequestCommon
{
public:
	class FString                                CatalogVersion;                                    // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabJsonObject*                    CustomTags;                                        // 0x18(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                StoreId;                                           // 0x20(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x10 - 0x8)
// ScriptStruct PlayFab.AdminDeleteTaskRequest
struct FAdminDeleteTaskRequest : public FPlayFabRequestCommon
{
public:
	class UPlayFabJsonObject*                    Identifier;                                        // 0x8(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x8 - 0x8)
// ScriptStruct PlayFab.AdminDeleteTitleRequest
struct FAdminDeleteTitleRequest : public FPlayFabRequestCommon
{
public:
};

// 0x10 (0x18 - 0x8)
// ScriptStruct PlayFab.AdminDeleteTitleDataOverrideRequest
struct FAdminDeleteTitleDataOverrideRequest : public FPlayFabRequestCommon
{
public:
	class FString                                OverrideLabel;                                     // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x18 - 0x8)
// ScriptStruct PlayFab.AdminExportMasterPlayerDataRequest
struct FAdminExportMasterPlayerDataRequest : public FPlayFabRequestCommon
{
public:
	class FString                                PlayFabId;                                         // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x18 - 0x8)
// ScriptStruct PlayFab.AdminExportPlayersInSegmentRequest
struct FAdminExportPlayersInSegmentRequest : public FPlayFabRequestCommon
{
public:
	class FString                                SegmentId;                                         // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x18 - 0x8)
// ScriptStruct PlayFab.AdminGetTaskInstanceRequest
struct FAdminGetTaskInstanceRequest : public FPlayFabRequestCommon
{
public:
	class FString                                TaskInstanceId;                                    // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x8 - 0x8)
// ScriptStruct PlayFab.AdminGetAllSegmentsRequest
struct FAdminGetAllSegmentsRequest : public FPlayFabRequestCommon
{
public:
};

// 0x10 (0x18 - 0x8)
// ScriptStruct PlayFab.AdminGetCatalogItemsRequest
struct FAdminGetCatalogItemsRequest : public FPlayFabRequestCommon
{
public:
	class FString                                CatalogVersion;                                    // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x10 - 0x8)
// ScriptStruct PlayFab.AdminGetCloudScriptRevisionRequest
struct FAdminGetCloudScriptRevisionRequest : public FPlayFabRequestCommon
{
public:
	int32                                        Revision;                                          // 0x8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        Version;                                           // 0xC(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x8 - 0x8)
// ScriptStruct PlayFab.AdminGetCloudScriptVersionsRequest
struct FAdminGetCloudScriptVersionsRequest : public FPlayFabRequestCommon
{
public:
};

// 0x10 (0x18 - 0x8)
// ScriptStruct PlayFab.AdminGetContentListRequest
struct FAdminGetContentListRequest : public FPlayFabRequestCommon
{
public:
	class FString                                Prefix;                                            // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x28 - 0x8)
// ScriptStruct PlayFab.AdminGetContentUploadUrlRequest
struct FAdminGetContentUploadUrlRequest : public FPlayFabRequestCommon
{
public:
	class FString                                ContentType;                                       // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                Key;                                               // 0x18(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x28 - 0x8)
// ScriptStruct PlayFab.AdminGetDataReportRequest
struct FAdminGetDataReportRequest : public FPlayFabRequestCommon
{
public:
	int32                                        Day;                                               // 0x8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        Month;                                             // 0xC(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                ReportName;                                        // 0x10(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        Year;                                              // 0x20(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3821[0x4];                                     // Fixing Size Of Struct
};

// 0x10 (0x18 - 0x8)
// ScriptStruct PlayFab.AdminGetMatchmakerGameInfoRequest
struct FAdminGetMatchmakerGameInfoRequest : public FPlayFabRequestCommon
{
public:
	class FString                                LobbyId;                                           // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x18 - 0x8)
// ScriptStruct PlayFab.AdminGetMatchmakerGameModesRequest
struct FAdminGetMatchmakerGameModesRequest : public FPlayFabRequestCommon
{
public:
	class FString                                BuildVersion;                                      // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x18 - 0x8)
// ScriptStruct PlayFab.AdminGetPlayedTitleListRequest
struct FAdminGetPlayedTitleListRequest : public FPlayFabRequestCommon
{
public:
	class FString                                PlayFabId;                                         // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x20 - 0x8)
// ScriptStruct PlayFab.AdminGetPlayerIdFromAuthTokenRequest
struct FAdminGetPlayerIdFromAuthTokenRequest : public FPlayFabRequestCommon
{
public:
	class FString                                Token;                                             // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EAuthTokenType                    TokenType;                                         // 0x18(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3822[0x7];                                     // Fixing Size Of Struct
};

// 0x20 (0x28 - 0x8)
// ScriptStruct PlayFab.AdminGetPlayerProfileRequest
struct FAdminGetPlayerProfileRequest : public FPlayFabRequestCommon
{
public:
	class UPlayFabJsonObject*                    CustomTags;                                        // 0x8(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                PlayFabId;                                         // 0x10(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabJsonObject*                    ProfileConstraints;                                // 0x20(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x20 - 0x8)
// ScriptStruct PlayFab.AdminGetPlayersSegmentsRequest
struct FAdminGetPlayersSegmentsRequest : public FPlayFabRequestCommon
{
public:
	class UPlayFabJsonObject*                    CustomTags;                                        // 0x8(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                PlayFabId;                                         // 0x10(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x8 - 0x8)
// ScriptStruct PlayFab.AdminGetPlayerSharedSecretsRequest
struct FAdminGetPlayerSharedSecretsRequest : public FPlayFabRequestCommon
{
public:
};

// 0x38 (0x40 - 0x8)
// ScriptStruct PlayFab.AdminGetPlayersInSegmentRequest
struct FAdminGetPlayersInSegmentRequest : public FPlayFabRequestCommon
{
public:
	class FString                                ContinuationToken;                                 // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabJsonObject*                    CustomTags;                                        // 0x18(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         GetProfilesAsync;                                  // 0x20(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3823[0x3];                                     // Fixing Size After Last Property
	int32                                        MaxBatchSize;                                      // 0x24(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        SecondsToLive;                                     // 0x28(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3824[0x4];                                     // Fixing Size After Last Property
	class FString                                SegmentId;                                         // 0x30(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x8 - 0x8)
// ScriptStruct PlayFab.AdminGetPlayerStatisticDefinitionsRequest
struct FAdminGetPlayerStatisticDefinitionsRequest : public FPlayFabRequestCommon
{
public:
};

// 0x18 (0x20 - 0x8)
// ScriptStruct PlayFab.AdminGetPlayerStatisticVersionsRequest
struct FAdminGetPlayerStatisticVersionsRequest : public FPlayFabRequestCommon
{
public:
	class UPlayFabJsonObject*                    CustomTags;                                        // 0x8(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                StatisticName;                                     // 0x10(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x28 (0x30 - 0x8)
// ScriptStruct PlayFab.AdminGetPlayerTagsRequest
struct FAdminGetPlayerTagsRequest : public FPlayFabRequestCommon
{
public:
	class UPlayFabJsonObject*                    CustomTags;                                        // 0x8(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                Namespace;                                         // 0x10(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                PlayFabId;                                         // 0x20(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x18 - 0x8)
// ScriptStruct PlayFab.AdminGetPolicyRequest
struct FAdminGetPolicyRequest : public FPlayFabRequestCommon
{
public:
	class FString                                PolicyName;                                        // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x18 - 0x8)
// ScriptStruct PlayFab.AdminGetPublisherDataRequest
struct FAdminGetPublisherDataRequest : public FPlayFabRequestCommon
{
public:
	class FString                                Keys;                                              // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x18 - 0x8)
// ScriptStruct PlayFab.AdminGetRandomResultTablesRequest
struct FAdminGetRandomResultTablesRequest : public FPlayFabRequestCommon
{
public:
	class FString                                CatalogVersion;                                    // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x18 - 0x8)
// ScriptStruct PlayFab.AdminGetPlayersInSegmentExportRequest
struct FAdminGetPlayersInSegmentExportRequest : public FPlayFabRequestCommon
{
public:
	class FString                                ExportId;                                          // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x18 - 0x8)
// ScriptStruct PlayFab.AdminGetSegmentsRequest
struct FAdminGetSegmentsRequest : public FPlayFabRequestCommon
{
public:
	class FString                                SegmentIds;                                        // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x28 - 0x8)
// ScriptStruct PlayFab.AdminGetStoreItemsRequest
struct FAdminGetStoreItemsRequest : public FPlayFabRequestCommon
{
public:
	class FString                                CatalogVersion;                                    // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                StoreId;                                           // 0x18(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x30 (0x38 - 0x8)
// ScriptStruct PlayFab.AdminGetTaskInstancesRequest
struct FAdminGetTaskInstancesRequest : public FPlayFabRequestCommon
{
public:
	class FString                                StartedAtRangeFrom;                                // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                StartedAtRangeTo;                                  // 0x18(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class ETaskInstanceStatus               StatusFilter;                                      // 0x28(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3825[0x7];                                     // Fixing Size After Last Property
	class UPlayFabJsonObject*                    TaskIdentifier;                                    // 0x30(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x10 - 0x8)
// ScriptStruct PlayFab.AdminGetTasksRequest
struct FAdminGetTasksRequest : public FPlayFabRequestCommon
{
public:
	class UPlayFabJsonObject*                    Identifier;                                        // 0x8(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x28 - 0x8)
// ScriptStruct PlayFab.AdminGetTitleDataRequest
struct FAdminGetTitleDataRequest : public FPlayFabRequestCommon
{
public:
	class FString                                Keys;                                              // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                OverrideLabel;                                     // 0x18(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x40 (0x48 - 0x8)
// ScriptStruct PlayFab.AdminLookupUserAccountInfoRequest
struct FAdminLookupUserAccountInfoRequest : public FPlayFabRequestCommon
{
public:
	class FString                                Email;                                             // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                PlayFabId;                                         // 0x18(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                TitleDisplayName;                                  // 0x28(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                Username;                                          // 0x38(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x18 - 0x8)
// ScriptStruct PlayFab.AdminGetUserBansRequest
struct FAdminGetUserBansRequest : public FPlayFabRequestCommon
{
public:
	class FString                                PlayFabId;                                         // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x28 (0x30 - 0x8)
// ScriptStruct PlayFab.AdminGetUserDataRequest
struct FAdminGetUserDataRequest : public FPlayFabRequestCommon
{
public:
	int32                                        IfChangedFromDataVersion;                          // 0x8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3827[0x4];                                     // Fixing Size After Last Property
	class FString                                Keys;                                              // 0x10(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                PlayFabId;                                         // 0x20(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x20 - 0x8)
// ScriptStruct PlayFab.AdminGetUserInventoryRequest
struct FAdminGetUserInventoryRequest : public FPlayFabRequestCommon
{
public:
	class UPlayFabJsonObject*                    CustomTags;                                        // 0x8(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                PlayFabId;                                         // 0x10(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x28 (0x30 - 0x8)
// ScriptStruct PlayFab.AdminGrantItemsToUsersRequest
struct FAdminGrantItemsToUsersRequest : public FPlayFabRequestCommon
{
public:
	class FString                                CatalogVersion;                                    // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabJsonObject*                    CustomTags;                                        // 0x18(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UPlayFabJsonObject*>            ItemGrants;                                        // 0x20(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x30 (0x38 - 0x8)
// ScriptStruct PlayFab.AdminIncrementLimitedEditionItemAvailabilityRequest
struct FAdminIncrementLimitedEditionItemAvailabilityRequest : public FPlayFabRequestCommon
{
public:
	int32                                        Amount;                                            // 0x8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3829[0x4];                                     // Fixing Size After Last Property
	class FString                                CatalogVersion;                                    // 0x10(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabJsonObject*                    CustomTags;                                        // 0x20(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                ItemId;                                            // 0x28(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x20 - 0x8)
// ScriptStruct PlayFab.AdminIncrementPlayerStatisticVersionRequest
struct FAdminIncrementPlayerStatisticVersionRequest : public FPlayFabRequestCommon
{
public:
	class UPlayFabJsonObject*                    CustomTags;                                        // 0x8(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                StatisticName;                                     // 0x10(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x8 - 0x8)
// ScriptStruct PlayFab.AdminListOpenIdConnectionRequest
struct FAdminListOpenIdConnectionRequest : public FPlayFabRequestCommon
{
public:
};

// 0x0 (0x8 - 0x8)
// ScriptStruct PlayFab.AdminListVirtualCurrencyTypesRequest
struct FAdminListVirtualCurrencyTypesRequest : public FPlayFabRequestCommon
{
public:
};

// 0x70 (0x78 - 0x8)
// ScriptStruct PlayFab.AdminModifyServerBuildRequest
struct FAdminModifyServerBuildRequest : public FPlayFabRequestCommon
{
public:
	class FString                                ActiveRegions;                                     // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                BuildId;                                           // 0x18(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                CommandLineTemplate;                               // 0x28(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                Comment;                                           // 0x38(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabJsonObject*                    CustomTags;                                        // 0x48(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                ExecutablePath;                                    // 0x50(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        MaxGamesPerHost;                                   // 0x60(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        MinFreeGameSlots;                                  // 0x64(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                Timestamp;                                         // 0x68(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x30 (0x38 - 0x8)
// ScriptStruct PlayFab.AdminRefundPurchaseRequest
struct FAdminRefundPurchaseRequest : public FPlayFabRequestCommon
{
public:
	class FString                                OrderID;                                           // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                PlayFabId;                                         // 0x18(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                Reason;                                            // 0x28(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x28 (0x30 - 0x8)
// ScriptStruct PlayFab.AdminRemovePlayerTagRequest
struct FAdminRemovePlayerTagRequest : public FPlayFabRequestCommon
{
public:
	class UPlayFabJsonObject*                    CustomTags;                                        // 0x8(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                PlayFabId;                                         // 0x10(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                TagName;                                           // 0x20(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x18 - 0x8)
// ScriptStruct PlayFab.AdminRemoveVirtualCurrencyTypesRequest
struct FAdminRemoveVirtualCurrencyTypesRequest : public FPlayFabRequestCommon
{
public:
	TArray<class UPlayFabJsonObject*>            VirtualCurrencies;                                 // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x28 (0x30 - 0x8)
// ScriptStruct PlayFab.AdminResetCharacterStatisticsRequest
struct FAdminResetCharacterStatisticsRequest : public FPlayFabRequestCommon
{
public:
	class FString                                CharacterId;                                       // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabJsonObject*                    CustomTags;                                        // 0x18(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                PlayFabId;                                         // 0x20(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x28 (0x30 - 0x8)
// ScriptStruct PlayFab.AdminResetPasswordRequest
struct FAdminResetPasswordRequest : public FPlayFabRequestCommon
{
public:
	class UPlayFabJsonObject*                    CustomTags;                                        // 0x8(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                Password;                                          // 0x10(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                Token;                                             // 0x20(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x20 - 0x8)
// ScriptStruct PlayFab.AdminResetUserStatisticsRequest
struct FAdminResetUserStatisticsRequest : public FPlayFabRequestCommon
{
public:
	class UPlayFabJsonObject*                    CustomTags;                                        // 0x8(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                PlayFabId;                                         // 0x10(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x38 (0x40 - 0x8)
// ScriptStruct PlayFab.AdminResolvePurchaseDisputeRequest
struct FAdminResolvePurchaseDisputeRequest : public FPlayFabRequestCommon
{
public:
	class FString                                OrderID;                                           // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EResolutionOutcome                Outcome;                                           // 0x18(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_382A[0x7];                                     // Fixing Size After Last Property
	class FString                                PlayFabId;                                         // 0x20(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                Reason;                                            // 0x30(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x18 - 0x8)
// ScriptStruct PlayFab.AdminRevokeAllBansForUserRequest
struct FAdminRevokeAllBansForUserRequest : public FPlayFabRequestCommon
{
public:
	class FString                                PlayFabId;                                         // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x18 - 0x8)
// ScriptStruct PlayFab.AdminRevokeBansRequest
struct FAdminRevokeBansRequest : public FPlayFabRequestCommon
{
public:
	class FString                                BanIds;                                            // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x30 (0x38 - 0x8)
// ScriptStruct PlayFab.AdminRevokeInventoryItemRequest
struct FAdminRevokeInventoryItemRequest : public FPlayFabRequestCommon
{
public:
	class FString                                CharacterId;                                       // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                ItemInstanceId;                                    // 0x18(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                PlayFabId;                                         // 0x28(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x18 - 0x8)
// ScriptStruct PlayFab.AdminRevokeInventoryItemsRequest
struct FAdminRevokeInventoryItemsRequest : public FPlayFabRequestCommon
{
public:
	TArray<class UPlayFabJsonObject*>            Items;                                             // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x10 (0x18 - 0x8)
// ScriptStruct PlayFab.AdminRunTaskRequest
struct FAdminRunTaskRequest : public FPlayFabRequestCommon
{
public:
	class UPlayFabJsonObject*                    CustomTags;                                        // 0x8(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabJsonObject*                    Identifier;                                        // 0x10(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x28 (0x30 - 0x8)
// ScriptStruct PlayFab.AdminSendAccountRecoveryEmailRequest
struct FAdminSendAccountRecoveryEmailRequest : public FPlayFabRequestCommon
{
public:
	class UPlayFabJsonObject*                    CustomTags;                                        // 0x8(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                Email;                                             // 0x10(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                EmailTemplateId;                                   // 0x20(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x30 (0x38 - 0x8)
// ScriptStruct PlayFab.AdminUpdateCatalogItemsRequest
struct FAdminUpdateCatalogItemsRequest : public FPlayFabRequestCommon
{
public:
	TArray<class UPlayFabJsonObject*>            Catalog;                                           // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	class FString                                CatalogVersion;                                    // 0x18(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabJsonObject*                    CustomTags;                                        // 0x28(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         SetAsDefaultCatalog;                               // 0x30(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_382B[0x7];                                     // Fixing Size Of Struct
};

// 0x38 (0x40 - 0x8)
// ScriptStruct PlayFab.AdminSetMembershipOverrideRequest
struct FAdminSetMembershipOverrideRequest : public FPlayFabRequestCommon
{
public:
	class UPlayFabJsonObject*                    CustomTags;                                        // 0x8(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                ExpirationTime;                                    // 0x10(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                MembershipId;                                      // 0x20(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                PlayFabId;                                         // 0x30(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x28 - 0x8)
// ScriptStruct PlayFab.AdminSetPlayerSecretRequest
struct FAdminSetPlayerSecretRequest : public FPlayFabRequestCommon
{
public:
	class FString                                PlayerSecret;                                      // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                PlayFabId;                                         // 0x18(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x18 - 0x8)
// ScriptStruct PlayFab.AdminSetPublishedRevisionRequest
struct FAdminSetPublishedRevisionRequest : public FPlayFabRequestCommon
{
public:
	class UPlayFabJsonObject*                    CustomTags;                                        // 0x8(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        Revision;                                          // 0x10(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        Version;                                           // 0x14(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x28 - 0x8)
// ScriptStruct PlayFab.AdminSetPublisherDataRequest
struct FAdminSetPublisherDataRequest : public FPlayFabRequestCommon
{
public:
	class FString                                Key;                                               // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                Value;                                             // 0x18(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x40 (0x48 - 0x8)
// ScriptStruct PlayFab.AdminUpdateStoreItemsRequest
struct FAdminUpdateStoreItemsRequest : public FPlayFabRequestCommon
{
public:
	class FString                                CatalogVersion;                                    // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabJsonObject*                    CustomTags;                                        // 0x18(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabJsonObject*                    MarketingData;                                     // 0x20(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UPlayFabJsonObject*>            Store;                                             // 0x28(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	class FString                                StoreId;                                           // 0x38(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x28 - 0x8)
// ScriptStruct PlayFab.AdminSetTitleDataRequest
struct FAdminSetTitleDataRequest : public FPlayFabRequestCommon
{
public:
	class FString                                Key;                                               // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                Value;                                             // 0x18(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x28 - 0x8)
// ScriptStruct PlayFab.AdminSetTitleDataAndOverridesRequest
struct FAdminSetTitleDataAndOverridesRequest : public FPlayFabRequestCommon
{
public:
	TArray<class UPlayFabJsonObject*>            KeyValues;                                         // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	class FString                                OverrideLabel;                                     // 0x18(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x38 (0x40 - 0x8)
// ScriptStruct PlayFab.AdminSetupPushNotificationRequest
struct FAdminSetupPushNotificationRequest : public FPlayFabRequestCommon
{
public:
	class FString                                Credential;                                        // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                Key;                                               // 0x18(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                Name;                                              // 0x28(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         OverwriteOldARN;                                   // 0x38(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EPushSetupPlatform                Platform;                                          // 0x39(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_382F[0x6];                                     // Fixing Size Of Struct
};

// 0x30 (0x38 - 0x8)
// ScriptStruct PlayFab.AdminSubtractUserVirtualCurrencyRequest
struct FAdminSubtractUserVirtualCurrencyRequest : public FPlayFabRequestCommon
{
public:
	int32                                        Amount;                                            // 0x8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3830[0x4];                                     // Fixing Size After Last Property
	class UPlayFabJsonObject*                    CustomTags;                                        // 0x10(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                PlayFabId;                                         // 0x18(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                VirtualCurrency;                                   // 0x28(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x18 - 0x8)
// ScriptStruct PlayFab.AdminUpdateBansRequest
struct FAdminUpdateBansRequest : public FPlayFabRequestCommon
{
public:
	TArray<class UPlayFabJsonObject*>            Bans;                                              // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x30 (0x38 - 0x8)
// ScriptStruct PlayFab.AdminUpdateCloudScriptRequest
struct FAdminUpdateCloudScriptRequest : public FPlayFabRequestCommon
{
public:
	class UPlayFabJsonObject*                    CustomTags;                                        // 0x8(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                DeveloperPlayFabId;                                // 0x10(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UPlayFabJsonObject*>            Files;                                             // 0x20(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                         Publish;                                           // 0x30(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3832[0x7];                                     // Fixing Size Of Struct
};

// 0x48 (0x50 - 0x8)
// ScriptStruct PlayFab.AdminUpdateOpenIdConnectionRequest
struct FAdminUpdateOpenIdConnectionRequest : public FPlayFabRequestCommon
{
public:
	class FString                                ClientId;                                          // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                ClientSecret;                                      // 0x18(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                ConnectionId;                                      // 0x28(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                IssuerDiscoveryUrl;                                // 0x38(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabJsonObject*                    IssuerInformation;                                 // 0x48(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x28 (0x30 - 0x8)
// ScriptStruct PlayFab.AdminUpdatePlayerSharedSecretRequest
struct FAdminUpdatePlayerSharedSecretRequest : public FPlayFabRequestCommon
{
public:
	bool                                         Disabled;                                          // 0x8(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3834[0x7];                                     // Fixing Size After Last Property
	class FString                                FriendlyName;                                      // 0x10(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                SecretKey;                                         // 0x20(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x28 - 0x8)
// ScriptStruct PlayFab.AdminUpdatePlayerStatisticDefinitionRequest
struct FAdminUpdatePlayerStatisticDefinitionRequest : public FPlayFabRequestCommon
{
public:
	enum class EStatisticAggregationMethod       AggregationMethod;                                 // 0x8(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3835[0x7];                                     // Fixing Size After Last Property
	class FString                                StatisticName;                                     // 0x10(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EStatisticResetIntervalOption     VersionChangeInterval;                             // 0x20(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3836[0x7];                                     // Fixing Size Of Struct
};

// 0x30 (0x38 - 0x8)
// ScriptStruct PlayFab.AdminUpdatePolicyRequest
struct FAdminUpdatePolicyRequest : public FPlayFabRequestCommon
{
public:
	bool                                         OverwritePolicy;                                   // 0x8(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3838[0x7];                                     // Fixing Size After Last Property
	class FString                                PolicyName;                                        // 0x10(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        PolicyVersion;                                     // 0x20(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3839[0x4];                                     // Fixing Size After Last Property
	TArray<class UPlayFabJsonObject*>            Statements;                                        // 0x28(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x28 (0x30 - 0x8)
// ScriptStruct PlayFab.AdminUpdateRandomResultTablesRequest
struct FAdminUpdateRandomResultTablesRequest : public FPlayFabRequestCommon
{
public:
	class FString                                CatalogVersion;                                    // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabJsonObject*                    CustomTags;                                        // 0x18(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UPlayFabJsonObject*>            Tables;                                            // 0x20(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x8 (0x10 - 0x8)
// ScriptStruct PlayFab.AdminUpdateSegmentRequest
struct FAdminUpdateSegmentRequest : public FPlayFabRequestCommon
{
public:
	class UPlayFabJsonObject*                    SegmentModel;                                      // 0x8(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x58 (0x60 - 0x8)
// ScriptStruct PlayFab.AdminUpdateTaskRequest
struct FAdminUpdateTaskRequest : public FPlayFabRequestCommon
{
public:
	class UPlayFabJsonObject*                    CustomTags;                                        // 0x8(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                Description;                                       // 0x10(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabJsonObject*                    Identifier;                                        // 0x20(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         IsActive;                                          // 0x28(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_383B[0x7];                                     // Fixing Size After Last Property
	class FString                                Name;                                              // 0x30(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabJsonObject*                    Parameter;                                         // 0x40(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                Schedule;                                          // 0x48(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EScheduledTaskType                Type;                                              // 0x58(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_383C[0x7];                                     // Fixing Size Of Struct
};

// 0x38 (0x40 - 0x8)
// ScriptStruct PlayFab.AdminUpdateUserDataRequest
struct FAdminUpdateUserDataRequest : public FPlayFabRequestCommon
{
public:
	class UPlayFabJsonObject*                    CustomTags;                                        // 0x8(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabJsonObject*                    Data;                                              // 0x10(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                KeysToRemove;                                      // 0x18(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EUserDataPermission               Permission;                                        // 0x28(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_383D[0x7];                                     // Fixing Size After Last Property
	class FString                                PlayFabId;                                         // 0x30(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x30 (0x38 - 0x8)
// ScriptStruct PlayFab.AdminUpdateUserInternalDataRequest
struct FAdminUpdateUserInternalDataRequest : public FPlayFabRequestCommon
{
public:
	class UPlayFabJsonObject*                    CustomTags;                                        // 0x8(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabJsonObject*                    Data;                                              // 0x10(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                KeysToRemove;                                      // 0x18(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                PlayFabId;                                         // 0x28(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x28 (0x30 - 0x8)
// ScriptStruct PlayFab.AdminUpdateUserTitleDisplayNameRequest
struct FAdminUpdateUserTitleDisplayNameRequest : public FPlayFabRequestCommon
{
public:
	class UPlayFabJsonObject*                    CustomTags;                                        // 0x8(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                DisplayName;                                       // 0x10(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                PlayFabId;                                         // 0x20(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x18 - 0x8)
// ScriptStruct PlayFab.AuthenticationAuthenticateCustomIdResult
struct FAuthenticationAuthenticateCustomIdResult : public FPlayFabResultCommon
{
public:
	class UPlayFabJsonObject*                    EntityToken;                                       // 0x8(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         NewlyCreated;                                      // 0x10(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_383E[0x7];                                     // Fixing Size Of Struct
};

// 0x18 (0x20 - 0x8)
// ScriptStruct PlayFab.AuthenticationAuthenticateCustomIdRequest
struct FAuthenticationAuthenticateCustomIdRequest : public FPlayFabRequestCommon
{
public:
	class FString                                CustomId;                                          // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabJsonObject*                    CustomTags;                                        // 0x18(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x8 - 0x8)
// ScriptStruct PlayFab.AuthenticationEmptyResponse
struct FAuthenticationEmptyResponse : public FPlayFabResultCommon
{
public:
};

// 0x28 (0x30 - 0x8)
// ScriptStruct PlayFab.AuthenticationGetEntityTokenResponse
struct FAuthenticationGetEntityTokenResponse : public FPlayFabResultCommon
{
public:
	class UPlayFabJsonObject*                    Entity;                                            // 0x8(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                EntityToken;                                       // 0x10(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                TokenExpiration;                                   // 0x20(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x28 (0x30 - 0x8)
// ScriptStruct PlayFab.AuthenticationValidateEntityTokenResponse
struct FAuthenticationValidateEntityTokenResponse : public FPlayFabResultCommon
{
public:
	class UPlayFabJsonObject*                    Entity;                                            // 0x8(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EIdentifiedDeviceType             IdentifiedDeviceType;                              // 0x10(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class ELoginIdentityProvider            IdentityProvider;                                  // 0x11(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_383F[0x6];                                     // Fixing Size After Last Property
	class FString                                IdentityProviderIssuedId;                          // 0x18(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabJsonObject*                    Lineage;                                           // 0x28(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x18 - 0x8)
// ScriptStruct PlayFab.AuthenticationDeleteRequest
struct FAuthenticationDeleteRequest : public FPlayFabRequestCommon
{
public:
	class UPlayFabJsonObject*                    CustomTags;                                        // 0x8(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabJsonObject*                    Entity;                                            // 0x10(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x18 - 0x8)
// ScriptStruct PlayFab.AuthenticationGetEntityTokenRequest
struct FAuthenticationGetEntityTokenRequest : public FPlayFabRequestCommon
{
public:
	class UPlayFabJsonObject*                    CustomTags;                                        // 0x8(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabJsonObject*                    Entity;                                            // 0x10(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x20 - 0x8)
// ScriptStruct PlayFab.AuthenticationValidateEntityTokenRequest
struct FAuthenticationValidateEntityTokenRequest : public FPlayFabRequestCommon
{
public:
	class UPlayFabJsonObject*                    CustomTags;                                        // 0x8(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                EntityToken;                                       // 0x10(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x10 - 0x8)
// ScriptStruct PlayFab.ClientAcceptTradeResponse
struct FClientAcceptTradeResponse : public FPlayFabResultCommon
{
public:
	class UPlayFabJsonObject*                    Trade;                                             // 0x8(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x30 (0x38 - 0x8)
// ScriptStruct PlayFab.ClientAcceptTradeRequest
struct FClientAcceptTradeRequest : public FPlayFabRequestCommon
{
public:
	class FString                                AcceptedInventoryInstanceIds;                      // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                OfferingPlayerId;                                  // 0x18(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                TradeId;                                           // 0x28(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x10 - 0x8)
// ScriptStruct PlayFab.ClientAddFriendResult
struct FClientAddFriendResult : public FPlayFabResultCommon
{
public:
	bool                                         Created;                                           // 0x8(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3840[0x7];                                     // Fixing Size Of Struct
};

// 0x40 (0x48 - 0x8)
// ScriptStruct PlayFab.ClientAddFriendRequest
struct FClientAddFriendRequest : public FPlayFabRequestCommon
{
public:
	class FString                                FriendEmail;                                       // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                FriendPlayFabId;                                   // 0x18(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                FriendTitleDisplayName;                            // 0x28(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                FriendUsername;                                    // 0x38(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x8 - 0x8)
// ScriptStruct PlayFab.ClientAddGenericIDResult
struct FClientAddGenericIDResult : public FPlayFabResultCommon
{
public:
};

// 0x8 (0x10 - 0x8)
// ScriptStruct PlayFab.ClientAddGenericIDRequest
struct FClientAddGenericIDRequest : public FPlayFabRequestCommon
{
public:
	class UPlayFabJsonObject*                    GenericId;                                         // 0x8(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x8 - 0x8)
// ScriptStruct PlayFab.ClientAddOrUpdateContactEmailResult
struct FClientAddOrUpdateContactEmailResult : public FPlayFabResultCommon
{
public:
};

// 0x18 (0x20 - 0x8)
// ScriptStruct PlayFab.ClientAddOrUpdateContactEmailRequest
struct FClientAddOrUpdateContactEmailRequest : public FPlayFabRequestCommon
{
public:
	class UPlayFabJsonObject*                    CustomTags;                                        // 0x8(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                EmailAddress;                                      // 0x10(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x8 - 0x8)
// ScriptStruct PlayFab.ClientAddSharedGroupMembersResult
struct FClientAddSharedGroupMembersResult : public FPlayFabResultCommon
{
public:
};

// 0x20 (0x28 - 0x8)
// ScriptStruct PlayFab.ClientAddSharedGroupMembersRequest
struct FClientAddSharedGroupMembersRequest : public FPlayFabRequestCommon
{
public:
	class FString                                PlayFabIds;                                        // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                SharedGroupId;                                     // 0x18(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x18 - 0x8)
// ScriptStruct PlayFab.ClientAddUsernamePasswordResult
struct FClientAddUsernamePasswordResult : public FPlayFabResultCommon
{
public:
	class FString                                Username;                                          // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x38 (0x40 - 0x8)
// ScriptStruct PlayFab.ClientAddUsernamePasswordRequest
struct FClientAddUsernamePasswordRequest : public FPlayFabRequestCommon
{
public:
	class UPlayFabJsonObject*                    CustomTags;                                        // 0x8(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                Email;                                             // 0x10(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                Password;                                          // 0x20(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                Username;                                          // 0x30(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x28 (0x30 - 0x8)
// ScriptStruct PlayFab.ClientModifyUserVirtualCurrencyResult
struct FClientModifyUserVirtualCurrencyResult : public FPlayFabResultCommon
{
public:
	int32                                        Balance;                                           // 0x8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        BalanceChange;                                     // 0xC(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                PlayFabId;                                         // 0x10(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                VirtualCurrency;                                   // 0x20(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x28 - 0x8)
// ScriptStruct PlayFab.ClientAddUserVirtualCurrencyRequest
struct FClientAddUserVirtualCurrencyRequest : public FPlayFabRequestCommon
{
public:
	int32                                        Amount;                                            // 0x8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3841[0x4];                                     // Fixing Size After Last Property
	class UPlayFabJsonObject*                    CustomTags;                                        // 0x10(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                VirtualCurrency;                                   // 0x18(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x8 - 0x8)
// ScriptStruct PlayFab.ClientAndroidDevicePushNotificationRegistrationResult
struct FClientAndroidDevicePushNotificationRegistrationResult : public FPlayFabResultCommon
{
public:
};

// 0x28 (0x30 - 0x8)
// ScriptStruct PlayFab.ClientAndroidDevicePushNotificationRegistrationRequest
struct FClientAndroidDevicePushNotificationRegistrationRequest : public FPlayFabRequestCommon
{
public:
	class FString                                ConfirmationMessage;                               // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                DeviceToken;                                       // 0x18(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         SendPushNotificationConfirmation;                  // 0x28(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3842[0x7];                                     // Fixing Size Of Struct
};

// 0x0 (0x8 - 0x8)
// ScriptStruct PlayFab.ClientAttributeInstallResult
struct FClientAttributeInstallResult : public FPlayFabResultCommon
{
public:
};

// 0x20 (0x28 - 0x8)
// ScriptStruct PlayFab.ClientAttributeInstallRequest
struct FClientAttributeInstallRequest : public FPlayFabRequestCommon
{
public:
	class FString                                Adid;                                              // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                Idfa;                                              // 0x18(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x10 - 0x8)
// ScriptStruct PlayFab.ClientCancelTradeResponse
struct FClientCancelTradeResponse : public FPlayFabResultCommon
{
public:
	class UPlayFabJsonObject*                    Trade;                                             // 0x8(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x18 - 0x8)
// ScriptStruct PlayFab.ClientCancelTradeRequest
struct FClientCancelTradeRequest : public FPlayFabRequestCommon
{
public:
	class FString                                TradeId;                                           // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x30 (0x38 - 0x8)
// ScriptStruct PlayFab.ClientConfirmPurchaseResult
struct FClientConfirmPurchaseResult : public FPlayFabResultCommon
{
public:
	TArray<class UPlayFabJsonObject*>            Items;                                             // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	class FString                                OrderID;                                           // 0x18(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                PurchaseDate;                                      // 0x28(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x20 - 0x8)
// ScriptStruct PlayFab.ClientConfirmPurchaseRequest
struct FClientConfirmPurchaseRequest : public FPlayFabRequestCommon
{
public:
	class UPlayFabJsonObject*                    CustomTags;                                        // 0x8(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                OrderID;                                           // 0x10(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x20 - 0x8)
// ScriptStruct PlayFab.ClientConsumeItemResult
struct FClientConsumeItemResult : public FPlayFabResultCommon
{
public:
	class FString                                ItemInstanceId;                                    // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        RemainingUses;                                     // 0x18(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3843[0x4];                                     // Fixing Size Of Struct
};

// 0x30 (0x38 - 0x8)
// ScriptStruct PlayFab.ClientConsumeItemRequest
struct FClientConsumeItemRequest : public FPlayFabRequestCommon
{
public:
	class FString                                CharacterId;                                       // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        ConsumeCount;                                      // 0x18(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3844[0x4];                                     // Fixing Size After Last Property
	class UPlayFabJsonObject*                    CustomTags;                                        // 0x20(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                ItemInstanceId;                                    // 0x28(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x18 - 0x8)
// ScriptStruct PlayFab.ClientConsumeMicrosoftStoreEntitlementsResponse
struct FClientConsumeMicrosoftStoreEntitlementsResponse : public FPlayFabResultCommon
{
public:
	TArray<class UPlayFabJsonObject*>            Items;                                             // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x20 (0x28 - 0x8)
// ScriptStruct PlayFab.ClientConsumeMicrosoftStoreEntitlementsRequest
struct FClientConsumeMicrosoftStoreEntitlementsRequest : public FPlayFabRequestCommon
{
public:
	class FString                                CatalogVersion;                                    // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabJsonObject*                    CustomTags;                                        // 0x18(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabJsonObject*                    MarketplaceSpecificData;                           // 0x20(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x18 - 0x8)
// ScriptStruct PlayFab.ClientConsumePS5EntitlementsResult
struct FClientConsumePS5EntitlementsResult : public FPlayFabResultCommon
{
public:
	TArray<class UPlayFabJsonObject*>            Items;                                             // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x20 (0x28 - 0x8)
// ScriptStruct PlayFab.ClientConsumePS5EntitlementsRequest
struct FClientConsumePS5EntitlementsRequest : public FPlayFabRequestCommon
{
public:
	class FString                                CatalogVersion;                                    // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabJsonObject*                    CustomTags;                                        // 0x18(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabJsonObject*                    MarketplaceSpecificData;                           // 0x20(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x18 - 0x8)
// ScriptStruct PlayFab.ClientConsumePSNEntitlementsResult
struct FClientConsumePSNEntitlementsResult : public FPlayFabResultCommon
{
public:
	TArray<class UPlayFabJsonObject*>            ItemsGranted;                                      // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x20 (0x28 - 0x8)
// ScriptStruct PlayFab.ClientConsumePSNEntitlementsRequest
struct FClientConsumePSNEntitlementsRequest : public FPlayFabRequestCommon
{
public:
	class FString                                CatalogVersion;                                    // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabJsonObject*                    CustomTags;                                        // 0x18(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        ServiceLabel;                                      // 0x20(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3845[0x4];                                     // Fixing Size Of Struct
};

// 0x10 (0x18 - 0x8)
// ScriptStruct PlayFab.ClientConsumeXboxEntitlementsResult
struct FClientConsumeXboxEntitlementsResult : public FPlayFabResultCommon
{
public:
	TArray<class UPlayFabJsonObject*>            Items;                                             // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x28 (0x30 - 0x8)
// ScriptStruct PlayFab.ClientConsumeXboxEntitlementsRequest
struct FClientConsumeXboxEntitlementsRequest : public FPlayFabRequestCommon
{
public:
	class FString                                CatalogVersion;                                    // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabJsonObject*                    CustomTags;                                        // 0x18(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                XboxToken;                                         // 0x20(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x18 - 0x8)
// ScriptStruct PlayFab.ClientCreateSharedGroupResult
struct FClientCreateSharedGroupResult : public FPlayFabResultCommon
{
public:
	class FString                                SharedGroupId;                                     // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x18 - 0x8)
// ScriptStruct PlayFab.ClientCreateSharedGroupRequest
struct FClientCreateSharedGroupRequest : public FPlayFabRequestCommon
{
public:
	class FString                                SharedGroupId;                                     // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x58 (0x60 - 0x8)
// ScriptStruct PlayFab.ClientExecuteCloudScriptResult
struct FClientExecuteCloudScriptResult : public FPlayFabResultCommon
{
public:
	int32                                        APIRequestsIssued;                                 // 0x8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3847[0x4];                                     // Fixing Size After Last Property
	class UPlayFabJsonObject*                    Error;                                             // 0x10(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        ExecutionTimeSeconds;                              // 0x18(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3848[0x4];                                     // Fixing Size After Last Property
	class FString                                FunctionName;                                      // 0x20(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabJsonObject*                    FunctionResult;                                    // 0x30(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         FunctionResultTooLarge;                            // 0x38(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3849[0x3];                                     // Fixing Size After Last Property
	int32                                        HttpRequestsIssued;                                // 0x3C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UPlayFabJsonObject*>            Logs;                                              // 0x40(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                         LogsTooLarge;                                      // 0x50(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_384A[0x3];                                     // Fixing Size After Last Property
	int32                                        MemoryConsumedBytes;                               // 0x54(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        ProcessorTimeSeconds;                              // 0x58(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        Revision;                                          // 0x5C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x10 - 0x8)
// ScriptStruct PlayFab.ClientGetAccountInfoResult
struct FClientGetAccountInfoResult : public FPlayFabResultCommon
{
public:
	class UPlayFabJsonObject*                    AccountInfo;                                       // 0x8(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x18 - 0x8)
// ScriptStruct PlayFab.ClientGetAdPlacementsResult
struct FClientGetAdPlacementsResult : public FPlayFabResultCommon
{
public:
	TArray<class UPlayFabJsonObject*>            AdPlacements;                                      // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x10 (0x18 - 0x8)
// ScriptStruct PlayFab.ClientListUsersCharactersResult
struct FClientListUsersCharactersResult : public FPlayFabResultCommon
{
public:
	TArray<class UPlayFabJsonObject*>            Characters;                                        // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x10 (0x18 - 0x8)
// ScriptStruct PlayFab.ClientGetCatalogItemsResult
struct FClientGetCatalogItemsResult : public FPlayFabResultCommon
{
public:
	TArray<class UPlayFabJsonObject*>            Catalog;                                           // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x20 (0x28 - 0x8)
// ScriptStruct PlayFab.ClientGetCharacterDataResult
struct FClientGetCharacterDataResult : public FPlayFabResultCommon
{
public:
	class FString                                CharacterId;                                       // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabJsonObject*                    Data;                                              // 0x18(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        DataVersion;                                       // 0x20(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_384C[0x4];                                     // Fixing Size Of Struct
};

// 0x30 (0x38 - 0x8)
// ScriptStruct PlayFab.ClientGetCharacterInventoryResult
struct FClientGetCharacterInventoryResult : public FPlayFabResultCommon
{
public:
	class FString                                CharacterId;                                       // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UPlayFabJsonObject*>            Inventory;                                         // 0x18(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	class UPlayFabJsonObject*                    VirtualCurrency;                                   // 0x28(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabJsonObject*                    VirtualCurrencyRechargeTimes;                      // 0x30(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x18 - 0x8)
// ScriptStruct PlayFab.ClientGetCharacterLeaderboardResult
struct FClientGetCharacterLeaderboardResult : public FPlayFabResultCommon
{
public:
	TArray<class UPlayFabJsonObject*>            Leaderboard;                                       // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x8 (0x10 - 0x8)
// ScriptStruct PlayFab.ClientGetCharacterStatisticsResult
struct FClientGetCharacterStatisticsResult : public FPlayFabResultCommon
{
public:
	class UPlayFabJsonObject*                    CharacterStatistics;                               // 0x8(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x18 - 0x8)
// ScriptStruct PlayFab.ClientGetContentDownloadUrlResult
struct FClientGetContentDownloadUrlResult : public FPlayFabResultCommon
{
public:
	class FString                                URL;                                               // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x28 - 0x8)
// ScriptStruct PlayFab.ClientCurrentGamesResult
struct FClientCurrentGamesResult : public FPlayFabResultCommon
{
public:
	int32                                        GameCount;                                         // 0x8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_384E[0x4];                                     // Fixing Size After Last Property
	TArray<class UPlayFabJsonObject*>            Games;                                             // 0x10(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                        PlayerCount;                                       // 0x20(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_384F[0x4];                                     // Fixing Size Of Struct
};

// 0x28 (0x30 - 0x8)
// ScriptStruct PlayFab.ClientGetLeaderboardResult
struct FClientGetLeaderboardResult : public FPlayFabResultCommon
{
public:
	TArray<class UPlayFabJsonObject*>            Leaderboard;                                       // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	class FString                                NextReset;                                         // 0x18(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        Version;                                           // 0x28(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3850[0x4];                                     // Fixing Size Of Struct
};

// 0x28 (0x30 - 0x8)
// ScriptStruct PlayFab.ClientGetFriendLeaderboardAroundPlayerResult
struct FClientGetFriendLeaderboardAroundPlayerResult : public FPlayFabResultCommon
{
public:
	TArray<class UPlayFabJsonObject*>            Leaderboard;                                       // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	class FString                                NextReset;                                         // 0x18(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        Version;                                           // 0x28(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3851[0x4];                                     // Fixing Size Of Struct
};

// 0x10 (0x18 - 0x8)
// ScriptStruct PlayFab.ClientGetFriendsListResult
struct FClientGetFriendsListResult : public FPlayFabResultCommon
{
public:
	TArray<class UPlayFabJsonObject*>            Friends;                                           // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x10 (0x18 - 0x8)
// ScriptStruct PlayFab.ClientGameServerRegionsResult
struct FClientGameServerRegionsResult : public FPlayFabResultCommon
{
public:
	TArray<class UPlayFabJsonObject*>            Regions;                                           // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x10 (0x18 - 0x8)
// ScriptStruct PlayFab.ClientGetLeaderboardAroundCharacterResult
struct FClientGetLeaderboardAroundCharacterResult : public FPlayFabResultCommon
{
public:
	TArray<class UPlayFabJsonObject*>            Leaderboard;                                       // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x28 (0x30 - 0x8)
// ScriptStruct PlayFab.ClientGetLeaderboardAroundPlayerResult
struct FClientGetLeaderboardAroundPlayerResult : public FPlayFabResultCommon
{
public:
	TArray<class UPlayFabJsonObject*>            Leaderboard;                                       // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	class FString                                NextReset;                                         // 0x18(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        Version;                                           // 0x28(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3853[0x4];                                     // Fixing Size Of Struct
};

// 0x10 (0x18 - 0x8)
// ScriptStruct PlayFab.ClientGetLeaderboardForUsersCharactersResult
struct FClientGetLeaderboardForUsersCharactersResult : public FPlayFabResultCommon
{
public:
	TArray<class UPlayFabJsonObject*>            Leaderboard;                                       // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x20 (0x28 - 0x8)
// ScriptStruct PlayFab.ClientGetPaymentTokenResult
struct FClientGetPaymentTokenResult : public FPlayFabResultCommon
{
public:
	class FString                                OrderID;                                           // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                ProviderToken;                                     // 0x18(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x18 - 0x8)
// ScriptStruct PlayFab.ClientGetPhotonAuthenticationTokenResult
struct FClientGetPhotonAuthenticationTokenResult : public FPlayFabResultCommon
{
public:
	class FString                                PhotonCustomAuthenticationToken;                   // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x20 - 0x8)
// ScriptStruct PlayFab.ClientGetPlayerCombinedInfoResult
struct FClientGetPlayerCombinedInfoResult : public FPlayFabResultCommon
{
public:
	class UPlayFabJsonObject*                    InfoResultPayload;                                 // 0x8(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                PlayFabId;                                         // 0x10(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x10 - 0x8)
// ScriptStruct PlayFab.ClientGetPlayerProfileResult
struct FClientGetPlayerProfileResult : public FPlayFabResultCommon
{
public:
	class UPlayFabJsonObject*                    PlayerProfile;                                     // 0x8(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x18 - 0x8)
// ScriptStruct PlayFab.ClientGetPlayerSegmentsResult
struct FClientGetPlayerSegmentsResult : public FPlayFabResultCommon
{
public:
	TArray<class UPlayFabJsonObject*>            Segments;                                          // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x10 (0x18 - 0x8)
// ScriptStruct PlayFab.ClientGetPlayerStatisticsResult
struct FClientGetPlayerStatisticsResult : public FPlayFabResultCommon
{
public:
	TArray<class UPlayFabJsonObject*>            Statistics;                                        // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x10 (0x18 - 0x8)
// ScriptStruct PlayFab.ClientGetPlayerStatisticVersionsResult
struct FClientGetPlayerStatisticVersionsResult : public FPlayFabResultCommon
{
public:
	TArray<class UPlayFabJsonObject*>            StatisticVersions;                                 // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x20 (0x28 - 0x8)
// ScriptStruct PlayFab.ClientGetPlayerTagsResult
struct FClientGetPlayerTagsResult : public FPlayFabResultCommon
{
public:
	class FString                                PlayFabId;                                         // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                Tags;                                              // 0x18(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x28 - 0x8)
// ScriptStruct PlayFab.ClientGetPlayerTradesResponse
struct FClientGetPlayerTradesResponse : public FPlayFabResultCommon
{
public:
	TArray<class UPlayFabJsonObject*>            AcceptedTrades;                                    // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class UPlayFabJsonObject*>            OpenedTrades;                                      // 0x18(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x10 (0x18 - 0x8)
// ScriptStruct PlayFab.ClientGetPlayFabIDsFromFacebookIDsResult
struct FClientGetPlayFabIDsFromFacebookIDsResult : public FPlayFabResultCommon
{
public:
	TArray<class UPlayFabJsonObject*>            Data;                                              // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x10 (0x18 - 0x8)
// ScriptStruct PlayFab.ClientGetPlayFabIDsFromFacebookInstantGamesIdsResult
struct FClientGetPlayFabIDsFromFacebookInstantGamesIdsResult : public FPlayFabResultCommon
{
public:
	TArray<class UPlayFabJsonObject*>            Data;                                              // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x10 (0x18 - 0x8)
// ScriptStruct PlayFab.ClientGetPlayFabIDsFromGameCenterIDsResult
struct FClientGetPlayFabIDsFromGameCenterIDsResult : public FPlayFabResultCommon
{
public:
	TArray<class UPlayFabJsonObject*>            Data;                                              // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x10 (0x18 - 0x8)
// ScriptStruct PlayFab.ClientGetPlayFabIDsFromGenericIDsResult
struct FClientGetPlayFabIDsFromGenericIDsResult : public FPlayFabResultCommon
{
public:
	TArray<class UPlayFabJsonObject*>            Data;                                              // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x10 (0x18 - 0x8)
// ScriptStruct PlayFab.ClientGetPlayFabIDsFromGoogleIDsResult
struct FClientGetPlayFabIDsFromGoogleIDsResult : public FPlayFabResultCommon
{
public:
	TArray<class UPlayFabJsonObject*>            Data;                                              // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x10 (0x18 - 0x8)
// ScriptStruct PlayFab.ClientGetPlayFabIDsFromGooglePlayGamesPlayerIDsResult
struct FClientGetPlayFabIDsFromGooglePlayGamesPlayerIDsResult : public FPlayFabResultCommon
{
public:
	TArray<class UPlayFabJsonObject*>            Data;                                              // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x10 (0x18 - 0x8)
// ScriptStruct PlayFab.ClientGetPlayFabIDsFromKongregateIDsResult
struct FClientGetPlayFabIDsFromKongregateIDsResult : public FPlayFabResultCommon
{
public:
	TArray<class UPlayFabJsonObject*>            Data;                                              // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x10 (0x18 - 0x8)
// ScriptStruct PlayFab.ClientGetPlayFabIDsFromNintendoServiceAccountIdsResult
struct FClientGetPlayFabIDsFromNintendoServiceAccountIdsResult : public FPlayFabResultCommon
{
public:
	TArray<class UPlayFabJsonObject*>            Data;                                              // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x10 (0x18 - 0x8)
// ScriptStruct PlayFab.ClientGetPlayFabIDsFromNintendoSwitchDeviceIdsResult
struct FClientGetPlayFabIDsFromNintendoSwitchDeviceIdsResult : public FPlayFabResultCommon
{
public:
	TArray<class UPlayFabJsonObject*>            Data;                                              // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x10 (0x18 - 0x8)
// ScriptStruct PlayFab.ClientGetPlayFabIDsFromPSNAccountIDsResult
struct FClientGetPlayFabIDsFromPSNAccountIDsResult : public FPlayFabResultCommon
{
public:
	TArray<class UPlayFabJsonObject*>            Data;                                              // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x10 (0x18 - 0x8)
// ScriptStruct PlayFab.ClientGetPlayFabIDsFromSteamIDsResult
struct FClientGetPlayFabIDsFromSteamIDsResult : public FPlayFabResultCommon
{
public:
	TArray<class UPlayFabJsonObject*>            Data;                                              // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x10 (0x18 - 0x8)
// ScriptStruct PlayFab.ClientGetPlayFabIDsFromTwitchIDsResult
struct FClientGetPlayFabIDsFromTwitchIDsResult : public FPlayFabResultCommon
{
public:
	TArray<class UPlayFabJsonObject*>            Data;                                              // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x10 (0x18 - 0x8)
// ScriptStruct PlayFab.ClientGetPlayFabIDsFromXboxLiveIDsResult
struct FClientGetPlayFabIDsFromXboxLiveIDsResult : public FPlayFabResultCommon
{
public:
	TArray<class UPlayFabJsonObject*>            Data;                                              // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x8 (0x10 - 0x8)
// ScriptStruct PlayFab.ClientGetPublisherDataResult
struct FClientGetPublisherDataResult : public FPlayFabResultCommon
{
public:
	class UPlayFabJsonObject*                    Data;                                              // 0x8(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x50 (0x58 - 0x8)
// ScriptStruct PlayFab.ClientGetPurchaseResult
struct FClientGetPurchaseResult : public FPlayFabResultCommon
{
public:
	class FString                                OrderID;                                           // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                PaymentProvider;                                   // 0x18(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                PurchaseDate;                                      // 0x28(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                TransactionId;                                     // 0x38(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                TransactionStatus;                                 // 0x48(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x20 - 0x8)
// ScriptStruct PlayFab.ClientGetSharedGroupDataResult
struct FClientGetSharedGroupDataResult : public FPlayFabResultCommon
{
public:
	class UPlayFabJsonObject*                    Data;                                              // 0x8(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                Members;                                           // 0x10(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x40 (0x48 - 0x8)
// ScriptStruct PlayFab.ClientGetStoreItemsResult
struct FClientGetStoreItemsResult : public FPlayFabResultCommon
{
public:
	class FString                                CatalogVersion;                                    // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabJsonObject*                    MarketingData;                                     // 0x18(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EPfSourceType                     Source;                                            // 0x20(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3854[0x7];                                     // Fixing Size After Last Property
	TArray<class UPlayFabJsonObject*>            Store;                                             // 0x28(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	class FString                                StoreId;                                           // 0x38(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x18 - 0x8)
// ScriptStruct PlayFab.ClientGetTimeResult
struct FClientGetTimeResult : public FPlayFabResultCommon
{
public:
	class FString                                Time;                                              // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x10 - 0x8)
// ScriptStruct PlayFab.ClientGetTitleDataResult
struct FClientGetTitleDataResult : public FPlayFabResultCommon
{
public:
	class UPlayFabJsonObject*                    Data;                                              // 0x8(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x18 - 0x8)
// ScriptStruct PlayFab.ClientGetTitleNewsResult
struct FClientGetTitleNewsResult : public FPlayFabResultCommon
{
public:
	TArray<class UPlayFabJsonObject*>            News;                                              // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x10 (0x18 - 0x8)
// ScriptStruct PlayFab.ClientGetTitlePublicKeyResult
struct FClientGetTitlePublicKeyResult : public FPlayFabResultCommon
{
public:
	class FString                                RSAPublicKey;                                      // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x10 - 0x8)
// ScriptStruct PlayFab.ClientGetTradeStatusResponse
struct FClientGetTradeStatusResponse : public FPlayFabResultCommon
{
public:
	class UPlayFabJsonObject*                    Trade;                                             // 0x8(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x18 - 0x8)
// ScriptStruct PlayFab.ClientGetUserDataResult
struct FClientGetUserDataResult : public FPlayFabResultCommon
{
public:
	class UPlayFabJsonObject*                    Data;                                              // 0x8(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        DataVersion;                                       // 0x10(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3855[0x4];                                     // Fixing Size Of Struct
};

// 0x20 (0x28 - 0x8)
// ScriptStruct PlayFab.ClientGetUserInventoryResult
struct FClientGetUserInventoryResult : public FPlayFabResultCommon
{
public:
	TArray<class UPlayFabJsonObject*>            Inventory;                                         // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	class UPlayFabJsonObject*                    VirtualCurrency;                                   // 0x18(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabJsonObject*                    VirtualCurrencyRechargeTimes;                      // 0x20(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x28 (0x30 - 0x8)
// ScriptStruct PlayFab.ClientGrantCharacterToUserResult
struct FClientGrantCharacterToUserResult : public FPlayFabResultCommon
{
public:
	class FString                                CharacterId;                                       // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                CharacterType;                                     // 0x18(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         Result;                                            // 0x28(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3856[0x7];                                     // Fixing Size Of Struct
};

// 0x0 (0x8 - 0x8)
// ScriptStruct PlayFab.ClientLinkAndroidDeviceIDResult
struct FClientLinkAndroidDeviceIDResult : public FPlayFabResultCommon
{
public:
};

// 0x0 (0x8 - 0x8)
// ScriptStruct PlayFab.ClientEmptyResult
struct FClientEmptyResult : public FPlayFabResultCommon
{
public:
};

// 0x0 (0x8 - 0x8)
// ScriptStruct PlayFab.ClientLinkCustomIDResult
struct FClientLinkCustomIDResult : public FPlayFabResultCommon
{
public:
};

// 0x0 (0x8 - 0x8)
// ScriptStruct PlayFab.ClientLinkFacebookAccountResult
struct FClientLinkFacebookAccountResult : public FPlayFabResultCommon
{
public:
};

// 0x0 (0x8 - 0x8)
// ScriptStruct PlayFab.ClientLinkFacebookInstantGamesIdResult
struct FClientLinkFacebookInstantGamesIdResult : public FPlayFabResultCommon
{
public:
};

// 0x0 (0x8 - 0x8)
// ScriptStruct PlayFab.ClientLinkGameCenterAccountResult
struct FClientLinkGameCenterAccountResult : public FPlayFabResultCommon
{
public:
};

// 0x0 (0x8 - 0x8)
// ScriptStruct PlayFab.ClientLinkGoogleAccountResult
struct FClientLinkGoogleAccountResult : public FPlayFabResultCommon
{
public:
};

// 0x0 (0x8 - 0x8)
// ScriptStruct PlayFab.ClientLinkGooglePlayGamesServicesAccountResult
struct FClientLinkGooglePlayGamesServicesAccountResult : public FPlayFabResultCommon
{
public:
};

// 0x0 (0x8 - 0x8)
// ScriptStruct PlayFab.ClientLinkIOSDeviceIDResult
struct FClientLinkIOSDeviceIDResult : public FPlayFabResultCommon
{
public:
};

// 0x0 (0x8 - 0x8)
// ScriptStruct PlayFab.ClientLinkKongregateAccountResult
struct FClientLinkKongregateAccountResult : public FPlayFabResultCommon
{
public:
};

// 0x0 (0x8 - 0x8)
// ScriptStruct PlayFab.ClientLinkNintendoSwitchDeviceIdResult
struct FClientLinkNintendoSwitchDeviceIdResult : public FPlayFabResultCommon
{
public:
};

// 0x0 (0x8 - 0x8)
// ScriptStruct PlayFab.ClientLinkPSNAccountResult
struct FClientLinkPSNAccountResult : public FPlayFabResultCommon
{
public:
};

// 0x0 (0x8 - 0x8)
// ScriptStruct PlayFab.ClientLinkSteamAccountResult
struct FClientLinkSteamAccountResult : public FPlayFabResultCommon
{
public:
};

// 0x0 (0x8 - 0x8)
// ScriptStruct PlayFab.ClientLinkTwitchAccountResult
struct FClientLinkTwitchAccountResult : public FPlayFabResultCommon
{
public:
};

// 0x0 (0x8 - 0x8)
// ScriptStruct PlayFab.ClientLinkXboxAccountResult
struct FClientLinkXboxAccountResult : public FPlayFabResultCommon
{
public:
};

// 0x8 (0x10 - 0x8)
// ScriptStruct PlayFab.PlayFabLoginResultCommon
struct FPlayFabLoginResultCommon : public FPlayFabResultCommon
{
public:
	class UPlayFabAuthenticationContext*         AuthenticationContext;                             // 0x8(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x58 (0x68 - 0x10)
// ScriptStruct PlayFab.ClientLoginResult
struct FClientLoginResult : public FPlayFabLoginResultCommon
{
public:
	class UPlayFabJsonObject*                    EntityToken;                                       // 0x10(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabJsonObject*                    InfoResultPayload;                                 // 0x18(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                LastLoginTime;                                     // 0x20(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         NewlyCreated;                                      // 0x30(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3857[0x7];                                     // Fixing Size After Last Property
	class FString                                PlayFabId;                                         // 0x38(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                SessionTicket;                                     // 0x48(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabJsonObject*                    SettingsForUser;                                   // 0x58(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabJsonObject*                    TreatmentAssignment;                               // 0x60(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x78 (0x80 - 0x8)
// ScriptStruct PlayFab.ClientMatchmakeResult
struct FClientMatchmakeResult : public FPlayFabResultCommon
{
public:
	class FString                                Expires;                                           // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                LobbyId;                                           // 0x18(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        PollWaitTimeMS;                                    // 0x28(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3858[0x4];                                     // Fixing Size After Last Property
	class FString                                ServerIPV4Address;                                 // 0x30(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                ServerIPV6Address;                                 // 0x40(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        ServerPort;                                        // 0x50(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3859[0x4];                                     // Fixing Size After Last Property
	class FString                                ServerPublicDNSName;                               // 0x58(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EMatchmakeStatus                  Status;                                            // 0x68(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_385A[0x7];                                     // Fixing Size After Last Property
	class FString                                Ticket;                                            // 0x70(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x10 - 0x8)
// ScriptStruct PlayFab.ClientOpenTradeResponse
struct FClientOpenTradeResponse : public FPlayFabResultCommon
{
public:
	class UPlayFabJsonObject*                    Trade;                                             // 0x8(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x70 (0x78 - 0x8)
// ScriptStruct PlayFab.ClientPayForPurchaseResult
struct FClientPayForPurchaseResult : public FPlayFabResultCommon
{
public:
	int32                                        CreditApplied;                                     // 0x8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_385B[0x4];                                     // Fixing Size After Last Property
	class FString                                OrderID;                                           // 0x10(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                ProviderData;                                      // 0x20(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                ProviderToken;                                     // 0x30(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                PurchaseConfirmationPageURL;                       // 0x40(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                PurchaseCurrency;                                  // 0x50(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        PurchasePrice;                                     // 0x60(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class ETransactionStatus                Status;                                            // 0x64(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_385C[0x3];                                     // Fixing Size After Last Property
	class UPlayFabJsonObject*                    VCAmount;                                          // 0x68(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabJsonObject*                    VirtualCurrency;                                   // 0x70(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x18 - 0x8)
// ScriptStruct PlayFab.ClientPurchaseItemResult
struct FClientPurchaseItemResult : public FPlayFabResultCommon
{
public:
	TArray<class UPlayFabJsonObject*>            Items;                                             // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x10 (0x18 - 0x8)
// ScriptStruct PlayFab.ClientRedeemCouponResult
struct FClientRedeemCouponResult : public FPlayFabResultCommon
{
public:
	TArray<class UPlayFabJsonObject*>            GrantedItems;                                      // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x0 (0x8 - 0x8)
// ScriptStruct PlayFab.ClientEmptyResponse
struct FClientEmptyResponse : public FPlayFabResultCommon
{
public:
};

// 0x0 (0x8 - 0x8)
// ScriptStruct PlayFab.ClientRegisterForIOSPushNotificationResult
struct FClientRegisterForIOSPushNotificationResult : public FPlayFabResultCommon
{
public:
};

// 0x40 (0x48 - 0x8)
// ScriptStruct PlayFab.ClientRegisterPlayFabUserResult
struct FClientRegisterPlayFabUserResult : public FPlayFabResultCommon
{
public:
	class UPlayFabJsonObject*                    EntityToken;                                       // 0x8(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                PlayFabId;                                         // 0x10(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                SessionTicket;                                     // 0x20(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabJsonObject*                    SettingsForUser;                                   // 0x30(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                Username;                                          // 0x38(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x8 - 0x8)
// ScriptStruct PlayFab.ClientRemoveContactEmailResult
struct FClientRemoveContactEmailResult : public FPlayFabResultCommon
{
public:
};

// 0x0 (0x8 - 0x8)
// ScriptStruct PlayFab.ClientRemoveFriendResult
struct FClientRemoveFriendResult : public FPlayFabResultCommon
{
public:
};

// 0x0 (0x8 - 0x8)
// ScriptStruct PlayFab.ClientRemoveGenericIDResult
struct FClientRemoveGenericIDResult : public FPlayFabResultCommon
{
public:
};

// 0x0 (0x8 - 0x8)
// ScriptStruct PlayFab.ClientRemoveSharedGroupMembersResult
struct FClientRemoveSharedGroupMembersResult : public FPlayFabResultCommon
{
public:
};

// 0x0 (0x8 - 0x8)
// ScriptStruct PlayFab.ClientReportAdActivityResult
struct FClientReportAdActivityResult : public FPlayFabResultCommon
{
public:
};

// 0x8 (0x10 - 0x8)
// ScriptStruct PlayFab.ClientReportPlayerClientResult
struct FClientReportPlayerClientResult : public FPlayFabResultCommon
{
public:
	int32                                        SubmissionsRemaining;                              // 0x8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_385D[0x4];                                     // Fixing Size Of Struct
};

// 0x10 (0x18 - 0x8)
// ScriptStruct PlayFab.ClientRestoreIOSPurchasesResult
struct FClientRestoreIOSPurchasesResult : public FPlayFabResultCommon
{
public:
	TArray<class UPlayFabJsonObject*>            Fulfillments;                                      // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x50 (0x58 - 0x8)
// ScriptStruct PlayFab.ClientRewardAdActivityResult
struct FClientRewardAdActivityResult : public FPlayFabResultCommon
{
public:
	class FString                                AdActivityEventId;                                 // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                DebugResults;                                      // 0x18(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                PlacementId;                                       // 0x28(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                PlacementName;                                     // 0x38(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        PlacementViewsRemaining;                           // 0x48(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        PlacementViewsResetMinutes;                        // 0x4C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabJsonObject*                    RewardResults;                                     // 0x50(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x8 - 0x8)
// ScriptStruct PlayFab.ClientSendAccountRecoveryEmailResult
struct FClientSendAccountRecoveryEmailResult : public FPlayFabResultCommon
{
public:
};

// 0x0 (0x8 - 0x8)
// ScriptStruct PlayFab.ClientSetFriendTagsResult
struct FClientSetFriendTagsResult : public FPlayFabResultCommon
{
public:
};

// 0x0 (0x8 - 0x8)
// ScriptStruct PlayFab.ClientSetPlayerSecretResult
struct FClientSetPlayerSecretResult : public FPlayFabResultCommon
{
public:
};

// 0x38 (0x40 - 0x8)
// ScriptStruct PlayFab.ClientStartPurchaseResult
struct FClientStartPurchaseResult : public FPlayFabResultCommon
{
public:
	TArray<class UPlayFabJsonObject*>            Contents;                                          // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	class FString                                OrderID;                                           // 0x18(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UPlayFabJsonObject*>            PaymentOptions;                                    // 0x28(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	class UPlayFabJsonObject*                    VirtualCurrencyBalances;                           // 0x38(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x8 - 0x8)
// ScriptStruct PlayFab.ClientUnlinkAndroidDeviceIDResult
struct FClientUnlinkAndroidDeviceIDResult : public FPlayFabResultCommon
{
public:
};

// 0x0 (0x8 - 0x8)
// ScriptStruct PlayFab.ClientUnlinkCustomIDResult
struct FClientUnlinkCustomIDResult : public FPlayFabResultCommon
{
public:
};

// 0x0 (0x8 - 0x8)
// ScriptStruct PlayFab.ClientUnlinkFacebookAccountResult
struct FClientUnlinkFacebookAccountResult : public FPlayFabResultCommon
{
public:
};

// 0x0 (0x8 - 0x8)
// ScriptStruct PlayFab.ClientUnlinkFacebookInstantGamesIdResult
struct FClientUnlinkFacebookInstantGamesIdResult : public FPlayFabResultCommon
{
public:
};

// 0x0 (0x8 - 0x8)
// ScriptStruct PlayFab.ClientUnlinkGameCenterAccountResult
struct FClientUnlinkGameCenterAccountResult : public FPlayFabResultCommon
{
public:
};

// 0x0 (0x8 - 0x8)
// ScriptStruct PlayFab.ClientUnlinkGoogleAccountResult
struct FClientUnlinkGoogleAccountResult : public FPlayFabResultCommon
{
public:
};

// 0x0 (0x8 - 0x8)
// ScriptStruct PlayFab.ClientUnlinkGooglePlayGamesServicesAccountResult
struct FClientUnlinkGooglePlayGamesServicesAccountResult : public FPlayFabResultCommon
{
public:
};

// 0x0 (0x8 - 0x8)
// ScriptStruct PlayFab.ClientUnlinkIOSDeviceIDResult
struct FClientUnlinkIOSDeviceIDResult : public FPlayFabResultCommon
{
public:
};

// 0x0 (0x8 - 0x8)
// ScriptStruct PlayFab.ClientUnlinkKongregateAccountResult
struct FClientUnlinkKongregateAccountResult : public FPlayFabResultCommon
{
public:
};

// 0x0 (0x8 - 0x8)
// ScriptStruct PlayFab.ClientUnlinkNintendoSwitchDeviceIdResult
struct FClientUnlinkNintendoSwitchDeviceIdResult : public FPlayFabResultCommon
{
public:
};

// 0x0 (0x8 - 0x8)
// ScriptStruct PlayFab.ClientUnlinkPSNAccountResult
struct FClientUnlinkPSNAccountResult : public FPlayFabResultCommon
{
public:
};

// 0x0 (0x8 - 0x8)
// ScriptStruct PlayFab.ClientUnlinkSteamAccountResult
struct FClientUnlinkSteamAccountResult : public FPlayFabResultCommon
{
public:
};

// 0x0 (0x8 - 0x8)
// ScriptStruct PlayFab.ClientUnlinkTwitchAccountResult
struct FClientUnlinkTwitchAccountResult : public FPlayFabResultCommon
{
public:
};

// 0x0 (0x8 - 0x8)
// ScriptStruct PlayFab.ClientUnlinkXboxAccountResult
struct FClientUnlinkXboxAccountResult : public FPlayFabResultCommon
{
public:
};

// 0x38 (0x40 - 0x8)
// ScriptStruct PlayFab.ClientUnlockContainerItemResult
struct FClientUnlockContainerItemResult : public FPlayFabResultCommon
{
public:
	TArray<class UPlayFabJsonObject*>            GrantedItems;                                      // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	class FString                                UnlockedItemInstanceId;                            // 0x18(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                UnlockedWithItemInstanceId;                        // 0x28(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabJsonObject*                    VirtualCurrency;                                   // 0x38(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x10 - 0x8)
// ScriptStruct PlayFab.ClientUpdateCharacterDataResult
struct FClientUpdateCharacterDataResult : public FPlayFabResultCommon
{
public:
	int32                                        DataVersion;                                       // 0x8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_385F[0x4];                                     // Fixing Size Of Struct
};

// 0x0 (0x8 - 0x8)
// ScriptStruct PlayFab.ClientUpdateCharacterStatisticsResult
struct FClientUpdateCharacterStatisticsResult : public FPlayFabResultCommon
{
public:
};

// 0x0 (0x8 - 0x8)
// ScriptStruct PlayFab.ClientUpdatePlayerStatisticsResult
struct FClientUpdatePlayerStatisticsResult : public FPlayFabResultCommon
{
public:
};

// 0x0 (0x8 - 0x8)
// ScriptStruct PlayFab.ClientUpdateSharedGroupDataResult
struct FClientUpdateSharedGroupDataResult : public FPlayFabResultCommon
{
public:
};

// 0x8 (0x10 - 0x8)
// ScriptStruct PlayFab.ClientUpdateUserDataResult
struct FClientUpdateUserDataResult : public FPlayFabResultCommon
{
public:
	int32                                        DataVersion;                                       // 0x8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3860[0x4];                                     // Fixing Size Of Struct
};

// 0x10 (0x18 - 0x8)
// ScriptStruct PlayFab.ClientUpdateUserTitleDisplayNameResult
struct FClientUpdateUserTitleDisplayNameResult : public FPlayFabResultCommon
{
public:
	class FString                                DisplayName;                                       // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x18 - 0x8)
// ScriptStruct PlayFab.ClientValidateAmazonReceiptResult
struct FClientValidateAmazonReceiptResult : public FPlayFabResultCommon
{
public:
	TArray<class UPlayFabJsonObject*>            Fulfillments;                                      // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x10 (0x18 - 0x8)
// ScriptStruct PlayFab.ClientValidateGooglePlayPurchaseResult
struct FClientValidateGooglePlayPurchaseResult : public FPlayFabResultCommon
{
public:
	TArray<class UPlayFabJsonObject*>            Fulfillments;                                      // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x10 (0x18 - 0x8)
// ScriptStruct PlayFab.ClientValidateIOSReceiptResult
struct FClientValidateIOSReceiptResult : public FPlayFabResultCommon
{
public:
	TArray<class UPlayFabJsonObject*>            Fulfillments;                                      // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x10 (0x18 - 0x8)
// ScriptStruct PlayFab.ClientValidateWindowsReceiptResult
struct FClientValidateWindowsReceiptResult : public FPlayFabResultCommon
{
public:
	TArray<class UPlayFabJsonObject*>            Fulfillments;                                      // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x10 (0x18 - 0x8)
// ScriptStruct PlayFab.ClientWriteEventResponse
struct FClientWriteEventResponse : public FPlayFabResultCommon
{
public:
	class FString                                EventId;                                           // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x28 (0x30 - 0x8)
// ScriptStruct PlayFab.ClientExecuteCloudScriptRequest
struct FClientExecuteCloudScriptRequest : public FPlayFabRequestCommon
{
public:
	class UPlayFabJsonObject*                    CustomTags;                                        // 0x8(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                FunctionName;                                      // 0x10(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabJsonObject*                    FunctionParameter;                                 // 0x20(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         GeneratePlayStreamEvent;                           // 0x28(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class ECloudScriptRevisionOption        RevisionSelection;                                 // 0x29(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3862[0x2];                                     // Fixing Size After Last Property
	int32                                        SpecificRevision;                                  // 0x2C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x40 (0x48 - 0x8)
// ScriptStruct PlayFab.ClientGetAccountInfoRequest
struct FClientGetAccountInfoRequest : public FPlayFabRequestCommon
{
public:
	class FString                                Email;                                             // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                PlayFabId;                                         // 0x18(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                TitleDisplayName;                                  // 0x28(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                Username;                                          // 0x38(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x20 - 0x8)
// ScriptStruct PlayFab.ClientGetAdPlacementsRequest
struct FClientGetAdPlacementsRequest : public FPlayFabRequestCommon
{
public:
	class FString                                AppID;                                             // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabJsonObject*                    Identifier;                                        // 0x18(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x18 - 0x8)
// ScriptStruct PlayFab.ClientListUsersCharactersRequest
struct FClientListUsersCharactersRequest : public FPlayFabRequestCommon
{
public:
	class FString                                PlayFabId;                                         // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x18 - 0x8)
// ScriptStruct PlayFab.ClientGetCatalogItemsRequest
struct FClientGetCatalogItemsRequest : public FPlayFabRequestCommon
{
public:
	class FString                                CatalogVersion;                                    // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x38 (0x40 - 0x8)
// ScriptStruct PlayFab.ClientGetCharacterDataRequest
struct FClientGetCharacterDataRequest : public FPlayFabRequestCommon
{
public:
	class FString                                CharacterId;                                       // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        IfChangedFromDataVersion;                          // 0x18(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3863[0x4];                                     // Fixing Size After Last Property
	class FString                                Keys;                                              // 0x20(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                PlayFabId;                                         // 0x30(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x28 (0x30 - 0x8)
// ScriptStruct PlayFab.ClientGetCharacterInventoryRequest
struct FClientGetCharacterInventoryRequest : public FPlayFabRequestCommon
{
public:
	class FString                                CatalogVersion;                                    // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                CharacterId;                                       // 0x18(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabJsonObject*                    CustomTags;                                        // 0x28(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x20 - 0x8)
// ScriptStruct PlayFab.ClientGetCharacterLeaderboardRequest
struct FClientGetCharacterLeaderboardRequest : public FPlayFabRequestCommon
{
public:
	int32                                        MaxResultsCount;                                   // 0x8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        StartPosition;                                     // 0xC(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                StatisticName;                                     // 0x10(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x18 - 0x8)
// ScriptStruct PlayFab.ClientGetCharacterStatisticsRequest
struct FClientGetCharacterStatisticsRequest : public FPlayFabRequestCommon
{
public:
	class FString                                CharacterId;                                       // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x28 (0x30 - 0x8)
// ScriptStruct PlayFab.ClientGetContentDownloadUrlRequest
struct FClientGetContentDownloadUrlRequest : public FPlayFabRequestCommon
{
public:
	class FString                                HttpMethod;                                        // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                Key;                                               // 0x18(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ThruCDN;                                           // 0x28(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3864[0x7];                                     // Fixing Size Of Struct
};

// 0x40 (0x48 - 0x8)
// ScriptStruct PlayFab.ClientCurrentGamesRequest
struct FClientCurrentGamesRequest : public FPlayFabRequestCommon
{
public:
	class FString                                BuildVersion;                                      // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                GameMode;                                          // 0x18(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class ERegion                           Region;                                            // 0x28(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3865[0x7];                                     // Fixing Size After Last Property
	class FString                                StatisticName;                                     // 0x30(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabJsonObject*                    TagFilter;                                         // 0x40(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x48 (0x50 - 0x8)
// ScriptStruct PlayFab.ClientGetFriendLeaderboardRequest
struct FClientGetFriendLeaderboardRequest : public FPlayFabRequestCommon
{
public:
	class UPlayFabJsonObject*                    CustomTags;                                        // 0x8(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EExternalFriendSources            ExternalPlatformFriends;                           // 0x10(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3866[0x3];                                     // Fixing Size After Last Property
	int32                                        MaxResultsCount;                                   // 0x14(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabJsonObject*                    ProfileConstraints;                                // 0x18(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        StartPosition;                                     // 0x20(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3868[0x4];                                     // Fixing Size After Last Property
	class FString                                StatisticName;                                     // 0x28(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         UseSpecificVersion;                                // 0x38(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3869[0x3];                                     // Fixing Size After Last Property
	int32                                        Version;                                           // 0x3C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                XboxToken;                                         // 0x40(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x50 (0x58 - 0x8)
// ScriptStruct PlayFab.ClientGetFriendLeaderboardAroundPlayerRequest
struct FClientGetFriendLeaderboardAroundPlayerRequest : public FPlayFabRequestCommon
{
public:
	class UPlayFabJsonObject*                    CustomTags;                                        // 0x8(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EExternalFriendSources            ExternalPlatformFriends;                           // 0x10(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_386B[0x3];                                     // Fixing Size After Last Property
	int32                                        MaxResultsCount;                                   // 0x14(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                PlayFabId;                                         // 0x18(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabJsonObject*                    ProfileConstraints;                                // 0x28(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                StatisticName;                                     // 0x30(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         UseSpecificVersion;                                // 0x40(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_386C[0x3];                                     // Fixing Size After Last Property
	int32                                        Version;                                           // 0x44(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                XboxToken;                                         // 0x48(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x28 (0x30 - 0x8)
// ScriptStruct PlayFab.ClientGetFriendsListRequest
struct FClientGetFriendsListRequest : public FPlayFabRequestCommon
{
public:
	class UPlayFabJsonObject*                    CustomTags;                                        // 0x8(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EExternalFriendSources            ExternalPlatformFriends;                           // 0x10(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_386D[0x7];                                     // Fixing Size After Last Property
	class UPlayFabJsonObject*                    ProfileConstraints;                                // 0x18(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                XboxToken;                                         // 0x20(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x18 - 0x8)
// ScriptStruct PlayFab.ClientGameServerRegionsRequest
struct FClientGameServerRegionsRequest : public FPlayFabRequestCommon
{
public:
	class FString                                BuildVersion;                                      // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x38 (0x40 - 0x8)
// ScriptStruct PlayFab.ClientGetLeaderboardRequest
struct FClientGetLeaderboardRequest : public FPlayFabRequestCommon
{
public:
	class UPlayFabJsonObject*                    CustomTags;                                        // 0x8(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        MaxResultsCount;                                   // 0x10(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_386F[0x4];                                     // Fixing Size After Last Property
	class UPlayFabJsonObject*                    ProfileConstraints;                                // 0x18(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        StartPosition;                                     // 0x20(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3870[0x4];                                     // Fixing Size After Last Property
	class FString                                StatisticName;                                     // 0x28(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         UseSpecificVersion;                                // 0x38(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3872[0x3];                                     // Fixing Size After Last Property
	int32                                        Version;                                           // 0x3C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x28 (0x30 - 0x8)
// ScriptStruct PlayFab.ClientGetLeaderboardAroundCharacterRequest
struct FClientGetLeaderboardAroundCharacterRequest : public FPlayFabRequestCommon
{
public:
	class FString                                CharacterId;                                       // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        MaxResultsCount;                                   // 0x18(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3873[0x4];                                     // Fixing Size After Last Property
	class FString                                StatisticName;                                     // 0x20(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x40 (0x48 - 0x8)
// ScriptStruct PlayFab.ClientGetLeaderboardAroundPlayerRequest
struct FClientGetLeaderboardAroundPlayerRequest : public FPlayFabRequestCommon
{
public:
	class UPlayFabJsonObject*                    CustomTags;                                        // 0x8(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        MaxResultsCount;                                   // 0x10(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3874[0x4];                                     // Fixing Size After Last Property
	class FString                                PlayFabId;                                         // 0x18(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabJsonObject*                    ProfileConstraints;                                // 0x28(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                StatisticName;                                     // 0x30(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         UseSpecificVersion;                                // 0x40(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3875[0x3];                                     // Fixing Size After Last Property
	int32                                        Version;                                           // 0x44(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x18 - 0x8)
// ScriptStruct PlayFab.ClientGetLeaderboardForUsersCharactersRequest
struct FClientGetLeaderboardForUsersCharactersRequest : public FPlayFabRequestCommon
{
public:
	class FString                                StatisticName;                                     // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x18 - 0x8)
// ScriptStruct PlayFab.ClientGetPaymentTokenRequest
struct FClientGetPaymentTokenRequest : public FPlayFabRequestCommon
{
public:
	class FString                                TokenProvider;                                     // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x18 - 0x8)
// ScriptStruct PlayFab.ClientGetPhotonAuthenticationTokenRequest
struct FClientGetPhotonAuthenticationTokenRequest : public FPlayFabRequestCommon
{
public:
	class FString                                PhotonApplicationId;                               // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x28 - 0x8)
// ScriptStruct PlayFab.ClientGetPlayerCombinedInfoRequest
struct FClientGetPlayerCombinedInfoRequest : public FPlayFabRequestCommon
{
public:
	class UPlayFabJsonObject*                    CustomTags;                                        // 0x8(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabJsonObject*                    InfoRequestParameters;                             // 0x10(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                PlayFabId;                                         // 0x18(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x28 - 0x8)
// ScriptStruct PlayFab.ClientGetPlayerProfileRequest
struct FClientGetPlayerProfileRequest : public FPlayFabRequestCommon
{
public:
	class UPlayFabJsonObject*                    CustomTags;                                        // 0x8(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                PlayFabId;                                         // 0x10(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabJsonObject*                    ProfileConstraints;                                // 0x20(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x8 - 0x8)
// ScriptStruct PlayFab.ClientGetPlayerSegmentsRequest
struct FClientGetPlayerSegmentsRequest : public FPlayFabRequestCommon
{
public:
};

// 0x28 (0x30 - 0x8)
// ScriptStruct PlayFab.ClientGetPlayerStatisticsRequest
struct FClientGetPlayerStatisticsRequest : public FPlayFabRequestCommon
{
public:
	class UPlayFabJsonObject*                    CustomTags;                                        // 0x8(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                StatisticNames;                                    // 0x10(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UPlayFabJsonObject*>            StatisticNameVersions;                             // 0x20(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x18 (0x20 - 0x8)
// ScriptStruct PlayFab.ClientGetPlayerStatisticVersionsRequest
struct FClientGetPlayerStatisticVersionsRequest : public FPlayFabRequestCommon
{
public:
	class UPlayFabJsonObject*                    CustomTags;                                        // 0x8(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                StatisticName;                                     // 0x10(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x28 (0x30 - 0x8)
// ScriptStruct PlayFab.ClientGetPlayerTagsRequest
struct FClientGetPlayerTagsRequest : public FPlayFabRequestCommon
{
public:
	class UPlayFabJsonObject*                    CustomTags;                                        // 0x8(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                Namespace;                                         // 0x10(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                PlayFabId;                                         // 0x20(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x10 - 0x8)
// ScriptStruct PlayFab.ClientGetPlayerTradesRequest
struct FClientGetPlayerTradesRequest : public FPlayFabRequestCommon
{
public:
	enum class ETradeStatus                      StatusFilter;                                      // 0x8(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3877[0x7];                                     // Fixing Size Of Struct
};

// 0x10 (0x18 - 0x8)
// ScriptStruct PlayFab.ClientGetPlayFabIDsFromFacebookIDsRequest
struct FClientGetPlayFabIDsFromFacebookIDsRequest : public FPlayFabRequestCommon
{
public:
	class FString                                FacebookIDs;                                       // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x18 - 0x8)
// ScriptStruct PlayFab.ClientGetPlayFabIDsFromFacebookInstantGamesIdsRequest
struct FClientGetPlayFabIDsFromFacebookInstantGamesIdsRequest : public FPlayFabRequestCommon
{
public:
	class FString                                FacebookInstantGamesIds;                           // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x18 - 0x8)
// ScriptStruct PlayFab.ClientGetPlayFabIDsFromGameCenterIDsRequest
struct FClientGetPlayFabIDsFromGameCenterIDsRequest : public FPlayFabRequestCommon
{
public:
	class FString                                GameCenterIDs;                                     // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x18 - 0x8)
// ScriptStruct PlayFab.ClientGetPlayFabIDsFromGenericIDsRequest
struct FClientGetPlayFabIDsFromGenericIDsRequest : public FPlayFabRequestCommon
{
public:
	TArray<class UPlayFabJsonObject*>            GenericIDs;                                        // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x10 (0x18 - 0x8)
// ScriptStruct PlayFab.ClientGetPlayFabIDsFromGoogleIDsRequest
struct FClientGetPlayFabIDsFromGoogleIDsRequest : public FPlayFabRequestCommon
{
public:
	class FString                                GoogleIDs;                                         // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x18 - 0x8)
// ScriptStruct PlayFab.ClientGetPlayFabIDsFromGooglePlayGamesPlayerIDsRequest
struct FClientGetPlayFabIDsFromGooglePlayGamesPlayerIDsRequest : public FPlayFabRequestCommon
{
public:
	class FString                                GooglePlayGamesPlayerIDs;                          // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x18 - 0x8)
// ScriptStruct PlayFab.ClientGetPlayFabIDsFromKongregateIDsRequest
struct FClientGetPlayFabIDsFromKongregateIDsRequest : public FPlayFabRequestCommon
{
public:
	class FString                                KongregateIDs;                                     // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x18 - 0x8)
// ScriptStruct PlayFab.ClientGetPlayFabIDsFromNintendoServiceAccountIdsRequest
struct FClientGetPlayFabIDsFromNintendoServiceAccountIdsRequest : public FPlayFabRequestCommon
{
public:
	class FString                                NintendoAccountIds;                                // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x18 - 0x8)
// ScriptStruct PlayFab.ClientGetPlayFabIDsFromNintendoSwitchDeviceIdsRequest
struct FClientGetPlayFabIDsFromNintendoSwitchDeviceIdsRequest : public FPlayFabRequestCommon
{
public:
	class FString                                NintendoSwitchDeviceIds;                           // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x20 - 0x8)
// ScriptStruct PlayFab.ClientGetPlayFabIDsFromPSNAccountIDsRequest
struct FClientGetPlayFabIDsFromPSNAccountIDsRequest : public FPlayFabRequestCommon
{
public:
	int32                                        IssuerId;                                          // 0x8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3878[0x4];                                     // Fixing Size After Last Property
	class FString                                PSNAccountIDs;                                     // 0x10(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x18 - 0x8)
// ScriptStruct PlayFab.ClientGetPlayFabIDsFromSteamIDsRequest
struct FClientGetPlayFabIDsFromSteamIDsRequest : public FPlayFabRequestCommon
{
public:
	class FString                                SteamStringIDs;                                    // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x18 - 0x8)
// ScriptStruct PlayFab.ClientGetPlayFabIDsFromTwitchIDsRequest
struct FClientGetPlayFabIDsFromTwitchIDsRequest : public FPlayFabRequestCommon
{
public:
	class FString                                TwitchIds;                                         // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x28 - 0x8)
// ScriptStruct PlayFab.ClientGetPlayFabIDsFromXboxLiveIDsRequest
struct FClientGetPlayFabIDsFromXboxLiveIDsRequest : public FPlayFabRequestCommon
{
public:
	class FString                                Sandbox;                                           // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                XboxLiveAccountIDs;                                // 0x18(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x18 - 0x8)
// ScriptStruct PlayFab.ClientGetPublisherDataRequest
struct FClientGetPublisherDataRequest : public FPlayFabRequestCommon
{
public:
	class FString                                Keys;                                              // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x18 - 0x8)
// ScriptStruct PlayFab.ClientGetPurchaseRequest
struct FClientGetPurchaseRequest : public FPlayFabRequestCommon
{
public:
	class FString                                OrderID;                                           // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x28 (0x30 - 0x8)
// ScriptStruct PlayFab.ClientGetSharedGroupDataRequest
struct FClientGetSharedGroupDataRequest : public FPlayFabRequestCommon
{
public:
	bool                                         GetMembers;                                        // 0x8(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_387A[0x7];                                     // Fixing Size After Last Property
	class FString                                Keys;                                              // 0x10(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                SharedGroupId;                                     // 0x20(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x28 - 0x8)
// ScriptStruct PlayFab.ClientGetStoreItemsRequest
struct FClientGetStoreItemsRequest : public FPlayFabRequestCommon
{
public:
	class FString                                CatalogVersion;                                    // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                StoreId;                                           // 0x18(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x8 - 0x8)
// ScriptStruct PlayFab.ClientGetTimeRequest
struct FClientGetTimeRequest : public FPlayFabRequestCommon
{
public:
};

// 0x20 (0x28 - 0x8)
// ScriptStruct PlayFab.ClientGetTitleDataRequest
struct FClientGetTitleDataRequest : public FPlayFabRequestCommon
{
public:
	class FString                                Keys;                                              // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                OverrideLabel;                                     // 0x18(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x10 - 0x8)
// ScriptStruct PlayFab.ClientGetTitleNewsRequest
struct FClientGetTitleNewsRequest : public FPlayFabRequestCommon
{
public:
	int32                                        Count;                                             // 0x8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_387B[0x4];                                     // Fixing Size Of Struct
};

// 0x10 (0x18 - 0x8)
// ScriptStruct PlayFab.ClientGetTitlePublicKeyRequest
struct FClientGetTitlePublicKeyRequest : public FPlayFabRequestCommon
{
public:
	class FString                                TitleSharedSecret;                                 // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x28 - 0x8)
// ScriptStruct PlayFab.ClientGetTradeStatusRequest
struct FClientGetTradeStatusRequest : public FPlayFabRequestCommon
{
public:
	class FString                                OfferingPlayerId;                                  // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                TradeId;                                           // 0x18(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x28 (0x30 - 0x8)
// ScriptStruct PlayFab.ClientGetUserDataRequest
struct FClientGetUserDataRequest : public FPlayFabRequestCommon
{
public:
	int32                                        IfChangedFromDataVersion;                          // 0x8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_387C[0x4];                                     // Fixing Size After Last Property
	class FString                                Keys;                                              // 0x10(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                PlayFabId;                                         // 0x20(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x10 - 0x8)
// ScriptStruct PlayFab.ClientGetUserInventoryRequest
struct FClientGetUserInventoryRequest : public FPlayFabRequestCommon
{
public:
	class UPlayFabJsonObject*                    CustomTags;                                        // 0x8(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x38 (0x40 - 0x8)
// ScriptStruct PlayFab.ClientGrantCharacterToUserRequest
struct FClientGrantCharacterToUserRequest : public FPlayFabRequestCommon
{
public:
	class FString                                CatalogVersion;                                    // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                CharacterName;                                     // 0x18(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabJsonObject*                    CustomTags;                                        // 0x28(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                ItemId;                                            // 0x30(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x40 (0x48 - 0x8)
// ScriptStruct PlayFab.ClientLinkAndroidDeviceIDRequest
struct FClientLinkAndroidDeviceIDRequest : public FPlayFabRequestCommon
{
public:
	class FString                                AndroidDevice;                                     // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                AndroidDeviceId;                                   // 0x18(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabJsonObject*                    CustomTags;                                        // 0x28(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ForceLink;                                         // 0x30(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_387D[0x7];                                     // Fixing Size After Last Property
	class FString                                OS;                                                // 0x38(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x28 - 0x8)
// ScriptStruct PlayFab.ClientLinkAppleRequest
struct FClientLinkAppleRequest : public FPlayFabRequestCommon
{
public:
	class UPlayFabJsonObject*                    CustomTags;                                        // 0x8(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ForceLink;                                         // 0x10(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_387E[0x7];                                     // Fixing Size After Last Property
	class FString                                IdentityToken;                                     // 0x18(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x28 - 0x8)
// ScriptStruct PlayFab.ClientLinkCustomIDRequest
struct FClientLinkCustomIDRequest : public FPlayFabRequestCommon
{
public:
	class FString                                CustomId;                                          // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabJsonObject*                    CustomTags;                                        // 0x18(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ForceLink;                                         // 0x20(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_387F[0x7];                                     // Fixing Size Of Struct
};

// 0x20 (0x28 - 0x8)
// ScriptStruct PlayFab.ClientLinkFacebookAccountRequest
struct FClientLinkFacebookAccountRequest : public FPlayFabRequestCommon
{
public:
	class FString                                AccessToken;                                       // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabJsonObject*                    CustomTags;                                        // 0x18(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ForceLink;                                         // 0x20(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3880[0x7];                                     // Fixing Size Of Struct
};

// 0x20 (0x28 - 0x8)
// ScriptStruct PlayFab.ClientLinkFacebookInstantGamesIdRequest
struct FClientLinkFacebookInstantGamesIdRequest : public FPlayFabRequestCommon
{
public:
	class UPlayFabJsonObject*                    CustomTags;                                        // 0x8(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                FacebookInstantGamesSignature;                     // 0x10(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ForceLink;                                         // 0x20(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3881[0x7];                                     // Fixing Size Of Struct
};

// 0x60 (0x68 - 0x8)
// ScriptStruct PlayFab.ClientLinkGameCenterAccountRequest
struct FClientLinkGameCenterAccountRequest : public FPlayFabRequestCommon
{
public:
	class UPlayFabJsonObject*                    CustomTags;                                        // 0x8(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ForceLink;                                         // 0x10(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3882[0x7];                                     // Fixing Size After Last Property
	class FString                                GameCenterId;                                      // 0x18(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                PublicKeyUrl;                                      // 0x28(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                Salt;                                              // 0x38(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                Signature;                                         // 0x48(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                Timestamp;                                         // 0x58(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x28 - 0x8)
// ScriptStruct PlayFab.ClientLinkGoogleAccountRequest
struct FClientLinkGoogleAccountRequest : public FPlayFabRequestCommon
{
public:
	class UPlayFabJsonObject*                    CustomTags;                                        // 0x8(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ForceLink;                                         // 0x10(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3884[0x7];                                     // Fixing Size After Last Property
	class FString                                ServerAuthCode;                                    // 0x18(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x28 - 0x8)
// ScriptStruct PlayFab.ClientLinkGooglePlayGamesServicesAccountRequest
struct FClientLinkGooglePlayGamesServicesAccountRequest : public FPlayFabRequestCommon
{
public:
	class UPlayFabJsonObject*                    CustomTags;                                        // 0x8(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ForceLink;                                         // 0x10(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3885[0x7];                                     // Fixing Size After Last Property
	class FString                                ServerAuthCode;                                    // 0x18(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x40 (0x48 - 0x8)
// ScriptStruct PlayFab.ClientLinkIOSDeviceIDRequest
struct FClientLinkIOSDeviceIDRequest : public FPlayFabRequestCommon
{
public:
	class UPlayFabJsonObject*                    CustomTags;                                        // 0x8(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                DeviceID;                                          // 0x10(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                DeviceModel;                                       // 0x20(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ForceLink;                                         // 0x30(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3886[0x7];                                     // Fixing Size After Last Property
	class FString                                OS;                                                // 0x38(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x30 (0x38 - 0x8)
// ScriptStruct PlayFab.ClientLinkKongregateAccountRequest
struct FClientLinkKongregateAccountRequest : public FPlayFabRequestCommon
{
public:
	class FString                                AuthTicket;                                        // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabJsonObject*                    CustomTags;                                        // 0x18(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ForceLink;                                         // 0x20(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3887[0x7];                                     // Fixing Size After Last Property
	class FString                                KongregateId;                                      // 0x28(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x28 - 0x8)
// ScriptStruct PlayFab.ClientLinkNintendoServiceAccountRequest
struct FClientLinkNintendoServiceAccountRequest : public FPlayFabRequestCommon
{
public:
	class UPlayFabJsonObject*                    CustomTags;                                        // 0x8(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ForceLink;                                         // 0x10(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3888[0x7];                                     // Fixing Size After Last Property
	class FString                                IdentityToken;                                     // 0x18(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x28 - 0x8)
// ScriptStruct PlayFab.ClientLinkNintendoSwitchDeviceIdRequest
struct FClientLinkNintendoSwitchDeviceIdRequest : public FPlayFabRequestCommon
{
public:
	class UPlayFabJsonObject*                    CustomTags;                                        // 0x8(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ForceLink;                                         // 0x10(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3889[0x7];                                     // Fixing Size After Last Property
	class FString                                NintendoSwitchDeviceId;                            // 0x18(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x30 (0x38 - 0x8)
// ScriptStruct PlayFab.ClientLinkOpenIdConnectRequest
struct FClientLinkOpenIdConnectRequest : public FPlayFabRequestCommon
{
public:
	class FString                                ConnectionId;                                      // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabJsonObject*                    CustomTags;                                        // 0x18(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ForceLink;                                         // 0x20(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_388A[0x7];                                     // Fixing Size After Last Property
	class FString                                IdToken;                                           // 0x28(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x30 (0x38 - 0x8)
// ScriptStruct PlayFab.ClientLinkPSNAccountRequest
struct FClientLinkPSNAccountRequest : public FPlayFabRequestCommon
{
public:
	class FString                                AuthCode;                                          // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabJsonObject*                    CustomTags;                                        // 0x18(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ForceLink;                                         // 0x20(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_388B[0x3];                                     // Fixing Size After Last Property
	int32                                        IssuerId;                                          // 0x24(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                RedirectUri;                                       // 0x28(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x28 (0x30 - 0x8)
// ScriptStruct PlayFab.ClientLinkSteamAccountRequest
struct FClientLinkSteamAccountRequest : public FPlayFabRequestCommon
{
public:
	class UPlayFabJsonObject*                    CustomTags;                                        // 0x8(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ForceLink;                                         // 0x10(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_388D[0x7];                                     // Fixing Size After Last Property
	class FString                                SteamTicket;                                       // 0x18(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         TicketIsServiceSpecific;                           // 0x28(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
