#pragma once

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

#include "../SDK.hpp"

namespace SDK
{
namespace Params
{
//---------------------------------------------------------------------------------------------------------------------
// PARAMETERS
//---------------------------------------------------------------------------------------------------------------------

// 0x60 (0x60 - 0x0)
// Function PlayFab.PlayFabAdminAPI.UpdateUserTitleDisplayName
struct UPlayFabAdminAPI_UpdateUserTitleDisplayName_Params
{
public:
	struct FAdminUpdateUserTitleDisplayNameRequest Request;                                           // 0x0(0x30)(Parm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x30(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x40(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x50(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                      ReturnValue;                                       // 0x58(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x70 (0x70 - 0x0)
// Function PlayFab.PlayFabAdminAPI.UpdateUserReadOnlyData
struct UPlayFabAdminAPI_UpdateUserReadOnlyData_Params
{
public:
	struct FAdminUpdateUserDataRequest           Request;                                           // 0x0(0x40)(Parm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x40(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x50(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x60(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                      ReturnValue;                                       // 0x68(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x70 (0x70 - 0x0)
// Function PlayFab.PlayFabAdminAPI.UpdateUserPublisherReadOnlyData
struct UPlayFabAdminAPI_UpdateUserPublisherReadOnlyData_Params
{
public:
	struct FAdminUpdateUserDataRequest           Request;                                           // 0x0(0x40)(Parm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x40(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x50(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x60(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                      ReturnValue;                                       // 0x68(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x68 (0x68 - 0x0)
// Function PlayFab.PlayFabAdminAPI.UpdateUserPublisherInternalData
struct UPlayFabAdminAPI_UpdateUserPublisherInternalData_Params
{
public:
	struct FAdminUpdateUserInternalDataRequest   Request;                                           // 0x0(0x38)(Parm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x38(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x48(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x58(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                      ReturnValue;                                       // 0x60(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x70 (0x70 - 0x0)
// Function PlayFab.PlayFabAdminAPI.UpdateUserPublisherData
struct UPlayFabAdminAPI_UpdateUserPublisherData_Params
{
public:
	struct FAdminUpdateUserDataRequest           Request;                                           // 0x0(0x40)(Parm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x40(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x50(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x60(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                      ReturnValue;                                       // 0x68(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x68 (0x68 - 0x0)
// Function PlayFab.PlayFabAdminAPI.UpdateUserInternalData
struct UPlayFabAdminAPI_UpdateUserInternalData_Params
{
public:
	struct FAdminUpdateUserInternalDataRequest   Request;                                           // 0x0(0x38)(Parm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x38(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x48(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x58(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                      ReturnValue;                                       // 0x60(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x70 (0x70 - 0x0)
// Function PlayFab.PlayFabAdminAPI.UpdateUserData
struct UPlayFabAdminAPI_UpdateUserData_Params
{
public:
	struct FAdminUpdateUserDataRequest           Request;                                           // 0x0(0x40)(Parm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x40(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x50(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x60(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                      ReturnValue;                                       // 0x68(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x90 (0x90 - 0x0)
// Function PlayFab.PlayFabAdminAPI.UpdateTask
struct UPlayFabAdminAPI_UpdateTask_Params
{
public:
	struct FAdminUpdateTaskRequest               Request;                                           // 0x0(0x60)(Parm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x60(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x70(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x80(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                      ReturnValue;                                       // 0x88(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x78 (0x78 - 0x0)
// Function PlayFab.PlayFabAdminAPI.UpdateStoreItems
struct UPlayFabAdminAPI_UpdateStoreItems_Params
{
public:
	struct FAdminUpdateStoreItemsRequest         Request;                                           // 0x0(0x48)(Parm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x48(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x58(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x68(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                      ReturnValue;                                       // 0x70(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x40 (0x40 - 0x0)
// Function PlayFab.PlayFabAdminAPI.UpdateSegment
struct UPlayFabAdminAPI_UpdateSegment_Params
{
public:
	struct FAdminUpdateSegmentRequest            Request;                                           // 0x0(0x10)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x10(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x20(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x30(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                      ReturnValue;                                       // 0x38(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x60 (0x60 - 0x0)
// Function PlayFab.PlayFabAdminAPI.UpdateRandomResultTables
struct UPlayFabAdminAPI_UpdateRandomResultTables_Params
{
public:
	struct FAdminUpdateRandomResultTablesRequest Request;                                           // 0x0(0x30)(Parm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x30(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x40(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x50(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                      ReturnValue;                                       // 0x58(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x68 (0x68 - 0x0)
// Function PlayFab.PlayFabAdminAPI.UpdatePolicy
struct UPlayFabAdminAPI_UpdatePolicy_Params
{
public:
	struct FAdminUpdatePolicyRequest             Request;                                           // 0x0(0x38)(Parm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x38(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x48(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x58(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                      ReturnValue;                                       // 0x60(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x58 (0x58 - 0x0)
// Function PlayFab.PlayFabAdminAPI.UpdatePlayerStatisticDefinition
struct UPlayFabAdminAPI_UpdatePlayerStatisticDefinition_Params
{
public:
	struct FAdminUpdatePlayerStatisticDefinitionRequest Request;                                           // 0x0(0x28)(Parm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x28(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x38(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x48(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                      ReturnValue;                                       // 0x50(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x60 (0x60 - 0x0)
// Function PlayFab.PlayFabAdminAPI.UpdatePlayerSharedSecret
struct UPlayFabAdminAPI_UpdatePlayerSharedSecret_Params
{
public:
	struct FAdminUpdatePlayerSharedSecretRequest Request;                                           // 0x0(0x30)(Parm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x30(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x40(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x50(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                      ReturnValue;                                       // 0x58(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x80 (0x80 - 0x0)
// Function PlayFab.PlayFabAdminAPI.UpdateOpenIdConnection
struct UPlayFabAdminAPI_UpdateOpenIdConnection_Params
{
public:
	struct FAdminUpdateOpenIdConnectionRequest   Request;                                           // 0x0(0x50)(Parm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x50(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x60(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x70(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                      ReturnValue;                                       // 0x78(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x68 (0x68 - 0x0)
// Function PlayFab.PlayFabAdminAPI.UpdateCloudScript
struct UPlayFabAdminAPI_UpdateCloudScript_Params
{
public:
	struct FAdminUpdateCloudScriptRequest        Request;                                           // 0x0(0x38)(Parm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x38(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x48(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x58(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                      ReturnValue;                                       // 0x60(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x68 (0x68 - 0x0)
// Function PlayFab.PlayFabAdminAPI.UpdateCatalogItems
struct UPlayFabAdminAPI_UpdateCatalogItems_Params
{
public:
	struct FAdminUpdateCatalogItemsRequest       Request;                                           // 0x0(0x38)(Parm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x38(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x48(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x58(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                      ReturnValue;                                       // 0x60(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x48 (0x48 - 0x0)
// Function PlayFab.PlayFabAdminAPI.UpdateBans
struct UPlayFabAdminAPI_UpdateBans_Params
{
public:
	struct FAdminUpdateBansRequest               Request;                                           // 0x0(0x18)(Parm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x18(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x28(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x38(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                      ReturnValue;                                       // 0x40(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x68 (0x68 - 0x0)
// Function PlayFab.PlayFabAdminAPI.SubtractUserVirtualCurrency
struct UPlayFabAdminAPI_SubtractUserVirtualCurrency_Params
{
public:
	struct FAdminSubtractUserVirtualCurrencyRequest Request;                                           // 0x0(0x38)(Parm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x38(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x48(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x58(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                      ReturnValue;                                       // 0x60(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x70 (0x70 - 0x0)
// Function PlayFab.PlayFabAdminAPI.SetupPushNotification
struct UPlayFabAdminAPI_SetupPushNotification_Params
{
public:
	struct FAdminSetupPushNotificationRequest    Request;                                           // 0x0(0x40)(Parm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x40(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x50(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x60(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                      ReturnValue;                                       // 0x68(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x58 (0x58 - 0x0)
// Function PlayFab.PlayFabAdminAPI.SetTitleInternalData
struct UPlayFabAdminAPI_SetTitleInternalData_Params
{
public:
	struct FAdminSetTitleDataRequest             Request;                                           // 0x0(0x28)(Parm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x28(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x38(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x48(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                      ReturnValue;                                       // 0x50(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x58 (0x58 - 0x0)
// Function PlayFab.PlayFabAdminAPI.SetTitleDataAndOverrides
struct UPlayFabAdminAPI_SetTitleDataAndOverrides_Params
{
public:
	struct FAdminSetTitleDataAndOverridesRequest Request;                                           // 0x0(0x28)(Parm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x28(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x38(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x48(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                      ReturnValue;                                       // 0x50(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x58 (0x58 - 0x0)
// Function PlayFab.PlayFabAdminAPI.SetTitleData
struct UPlayFabAdminAPI_SetTitleData_Params
{
public:
	struct FAdminSetTitleDataRequest             Request;                                           // 0x0(0x28)(Parm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x28(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x38(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x48(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                      ReturnValue;                                       // 0x50(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x78 (0x78 - 0x0)
// Function PlayFab.PlayFabAdminAPI.SetStoreItems
struct UPlayFabAdminAPI_SetStoreItems_Params
{
public:
	struct FAdminUpdateStoreItemsRequest         Request;                                           // 0x0(0x48)(Parm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x48(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x58(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x68(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                      ReturnValue;                                       // 0x70(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x58 (0x58 - 0x0)
// Function PlayFab.PlayFabAdminAPI.SetPublisherData
struct UPlayFabAdminAPI_SetPublisherData_Params
{
public:
	struct FAdminSetPublisherDataRequest         Request;                                           // 0x0(0x28)(Parm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x28(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x38(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x48(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                      ReturnValue;                                       // 0x50(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x48 (0x48 - 0x0)
// Function PlayFab.PlayFabAdminAPI.SetPublishedRevision
struct UPlayFabAdminAPI_SetPublishedRevision_Params
{
public:
	struct FAdminSetPublishedRevisionRequest     Request;                                           // 0x0(0x18)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x18(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x28(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x38(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                      ReturnValue;                                       // 0x40(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x58 (0x58 - 0x0)
// Function PlayFab.PlayFabAdminAPI.SetPlayerSecret
struct UPlayFabAdminAPI_SetPlayerSecret_Params
{
public:
	struct FAdminSetPlayerSecretRequest          Request;                                           // 0x0(0x28)(Parm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x28(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x38(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x48(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                      ReturnValue;                                       // 0x50(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x70 (0x70 - 0x0)
// Function PlayFab.PlayFabAdminAPI.SetMembershipOverride
struct UPlayFabAdminAPI_SetMembershipOverride_Params
{
public:
	struct FAdminSetMembershipOverrideRequest    Request;                                           // 0x0(0x40)(Parm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x40(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x50(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x60(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                      ReturnValue;                                       // 0x68(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x68 (0x68 - 0x0)
// Function PlayFab.PlayFabAdminAPI.SetCatalogItems
struct UPlayFabAdminAPI_SetCatalogItems_Params
{
public:
	struct FAdminUpdateCatalogItemsRequest       Request;                                           // 0x0(0x38)(Parm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x38(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x48(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x58(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                      ReturnValue;                                       // 0x60(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x60 (0x60 - 0x0)
// Function PlayFab.PlayFabAdminAPI.SendAccountRecoveryEmail
struct UPlayFabAdminAPI_SendAccountRecoveryEmail_Params
{
public:
	struct FAdminSendAccountRecoveryEmailRequest Request;                                           // 0x0(0x30)(Parm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x30(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x40(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x50(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                      ReturnValue;                                       // 0x58(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x48 (0x48 - 0x0)
// Function PlayFab.PlayFabAdminAPI.RunTask
struct UPlayFabAdminAPI_RunTask_Params
{
public:
	struct FAdminRunTaskRequest                  Request;                                           // 0x0(0x18)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x18(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x28(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x38(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                      ReturnValue;                                       // 0x40(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x48 (0x48 - 0x0)
// Function PlayFab.PlayFabAdminAPI.RevokeInventoryItems
struct UPlayFabAdminAPI_RevokeInventoryItems_Params
{
public:
	struct FAdminRevokeInventoryItemsRequest     Request;                                           // 0x0(0x18)(Parm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x18(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x28(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x38(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                      ReturnValue;                                       // 0x40(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x68 (0x68 - 0x0)
// Function PlayFab.PlayFabAdminAPI.RevokeInventoryItem
struct UPlayFabAdminAPI_RevokeInventoryItem_Params
{
public:
	struct FAdminRevokeInventoryItemRequest      Request;                                           // 0x0(0x38)(Parm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x38(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x48(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x58(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                      ReturnValue;                                       // 0x60(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x48 (0x48 - 0x0)
// Function PlayFab.PlayFabAdminAPI.RevokeBans
struct UPlayFabAdminAPI_RevokeBans_Params
{
public:
	struct FAdminRevokeBansRequest               Request;                                           // 0x0(0x18)(Parm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x18(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x28(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x38(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                      ReturnValue;                                       // 0x40(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x48 (0x48 - 0x0)
// Function PlayFab.PlayFabAdminAPI.RevokeAllBansForUser
struct UPlayFabAdminAPI_RevokeAllBansForUser_Params
{
public:
	struct FAdminRevokeAllBansForUserRequest     Request;                                           // 0x0(0x18)(Parm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x18(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x28(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x38(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                      ReturnValue;                                       // 0x40(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x70 (0x70 - 0x0)
// Function PlayFab.PlayFabAdminAPI.ResolvePurchaseDispute
struct UPlayFabAdminAPI_ResolvePurchaseDispute_Params
{
public:
	struct FAdminResolvePurchaseDisputeRequest   Request;                                           // 0x0(0x40)(Parm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x40(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x50(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x60(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                      ReturnValue;                                       // 0x68(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x50 (0x50 - 0x0)
// Function PlayFab.PlayFabAdminAPI.ResetUserStatistics
struct UPlayFabAdminAPI_ResetUserStatistics_Params
{
public:
	struct FAdminResetUserStatisticsRequest      Request;                                           // 0x0(0x20)(Parm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x20(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x30(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x40(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                      ReturnValue;                                       // 0x48(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x60 (0x60 - 0x0)
// Function PlayFab.PlayFabAdminAPI.ResetPassword
struct UPlayFabAdminAPI_ResetPassword_Params
{
public:
	struct FAdminResetPasswordRequest            Request;                                           // 0x0(0x30)(Parm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x30(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x40(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x50(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                      ReturnValue;                                       // 0x58(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x60 (0x60 - 0x0)
// Function PlayFab.PlayFabAdminAPI.ResetCharacterStatistics
struct UPlayFabAdminAPI_ResetCharacterStatistics_Params
{
public:
	struct FAdminResetCharacterStatisticsRequest Request;                                           // 0x0(0x30)(Parm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x30(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x40(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x50(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                      ReturnValue;                                       // 0x58(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x48 (0x48 - 0x0)
// Function PlayFab.PlayFabAdminAPI.RemoveVirtualCurrencyTypes
struct UPlayFabAdminAPI_RemoveVirtualCurrencyTypes_Params
{
public:
	struct FAdminRemoveVirtualCurrencyTypesRequest Request;                                           // 0x0(0x18)(Parm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x18(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x28(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x38(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                      ReturnValue;                                       // 0x40(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x60 (0x60 - 0x0)
// Function PlayFab.PlayFabAdminAPI.RemovePlayerTag
struct UPlayFabAdminAPI_RemovePlayerTag_Params
{
public:
	struct FAdminRemovePlayerTagRequest          Request;                                           // 0x0(0x30)(Parm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x30(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x40(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x50(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                      ReturnValue;                                       // 0x58(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x68 (0x68 - 0x0)
// Function PlayFab.PlayFabAdminAPI.RefundPurchase
struct UPlayFabAdminAPI_RefundPurchase_Params
{
public:
	struct FAdminRefundPurchaseRequest           Request;                                           // 0x0(0x38)(Parm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x38(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x48(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x58(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                      ReturnValue;                                       // 0x60(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xA8 (0xA8 - 0x0)
// Function PlayFab.PlayFabAdminAPI.ModifyServerBuild
struct UPlayFabAdminAPI_ModifyServerBuild_Params
{
public:
	struct FAdminModifyServerBuildRequest        Request;                                           // 0x0(0x78)(Parm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x78(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x88(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x98(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                      ReturnValue;                                       // 0xA0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x38 (0x38 - 0x0)
// Function PlayFab.PlayFabAdminAPI.ListVirtualCurrencyTypes
struct UPlayFabAdminAPI_ListVirtualCurrencyTypes_Params
{
public:
	struct FAdminListVirtualCurrencyTypesRequest Request;                                           // 0x0(0x8)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x8(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x18(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x28(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                      ReturnValue;                                       // 0x30(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x38 (0x38 - 0x0)
// Function PlayFab.PlayFabAdminAPI.ListOpenIdConnection
struct UPlayFabAdminAPI_ListOpenIdConnection_Params
{
public:
	struct FAdminListOpenIdConnectionRequest     Request;                                           // 0x0(0x8)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x8(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x18(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x28(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                      ReturnValue;                                       // 0x30(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x50 (0x50 - 0x0)
// Function PlayFab.PlayFabAdminAPI.IncrementPlayerStatisticVersion
struct UPlayFabAdminAPI_IncrementPlayerStatisticVersion_Params
{
public:
	struct FAdminIncrementPlayerStatisticVersionRequest Request;                                           // 0x0(0x20)(Parm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x20(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x30(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x40(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                      ReturnValue;                                       // 0x48(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x68 (0x68 - 0x0)
// Function PlayFab.PlayFabAdminAPI.IncrementLimitedEditionItemAvailability
struct UPlayFabAdminAPI_IncrementLimitedEditionItemAvailability_Params
{
public:
	struct FAdminIncrementLimitedEditionItemAvailabilityRequest Request;                                           // 0x0(0x38)(Parm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x38(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x48(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x58(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                      ReturnValue;                                       // 0x60(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x50 (0x50 - 0x0)
// Function PlayFab.PlayFabAdminAPI.HelperUpdateUserTitleDisplayName
struct UPlayFabAdminAPI_HelperUpdateUserTitleDisplayName_Params
{
public:
	struct FPlayFabBaseModel                     Response;                                          // 0x0(0x40)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x40(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         Successful;                                        // 0x48(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1471[0x7];                                     // Fixing Size Of Struct
};

// 0x50 (0x50 - 0x0)
// Function PlayFab.PlayFabAdminAPI.HelperUpdateUserReadOnlyData
struct UPlayFabAdminAPI_HelperUpdateUserReadOnlyData_Params
{
public:
	struct FPlayFabBaseModel                     Response;                                          // 0x0(0x40)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x40(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         Successful;                                        // 0x48(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1473[0x7];                                     // Fixing Size Of Struct
};

// 0x50 (0x50 - 0x0)
// Function PlayFab.PlayFabAdminAPI.HelperUpdateUserPublisherReadOnlyData
struct UPlayFabAdminAPI_HelperUpdateUserPublisherReadOnlyData_Params
{
public:
	struct FPlayFabBaseModel                     Response;                                          // 0x0(0x40)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x40(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         Successful;                                        // 0x48(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1476[0x7];                                     // Fixing Size Of Struct
};

// 0x50 (0x50 - 0x0)
// Function PlayFab.PlayFabAdminAPI.HelperUpdateUserPublisherInternalData
struct UPlayFabAdminAPI_HelperUpdateUserPublisherInternalData_Params
{
public:
	struct FPlayFabBaseModel                     Response;                                          // 0x0(0x40)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x40(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         Successful;                                        // 0x48(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1479[0x7];                                     // Fixing Size Of Struct
};

// 0x50 (0x50 - 0x0)
// Function PlayFab.PlayFabAdminAPI.HelperUpdateUserPublisherData
struct UPlayFabAdminAPI_HelperUpdateUserPublisherData_Params
{
public:
	struct FPlayFabBaseModel                     Response;                                          // 0x0(0x40)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x40(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         Successful;                                        // 0x48(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_147E[0x7];                                     // Fixing Size Of Struct
};

// 0x50 (0x50 - 0x0)
// Function PlayFab.PlayFabAdminAPI.HelperUpdateUserInternalData
struct UPlayFabAdminAPI_HelperUpdateUserInternalData_Params
{
public:
	struct FPlayFabBaseModel                     Response;                                          // 0x0(0x40)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x40(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         Successful;                                        // 0x48(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1481[0x7];                                     // Fixing Size Of Struct
};

// 0x50 (0x50 - 0x0)
// Function PlayFab.PlayFabAdminAPI.HelperUpdateUserData
struct UPlayFabAdminAPI_HelperUpdateUserData_Params
{
public:
	struct FPlayFabBaseModel                     Response;                                          // 0x0(0x40)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x40(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         Successful;                                        // 0x48(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1483[0x7];                                     // Fixing Size Of Struct
};

// 0x50 (0x50 - 0x0)
// Function PlayFab.PlayFabAdminAPI.HelperUpdateTask
struct UPlayFabAdminAPI_HelperUpdateTask_Params
{
public:
	struct FPlayFabBaseModel                     Response;                                          // 0x0(0x40)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x40(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         Successful;                                        // 0x48(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1485[0x7];                                     // Fixing Size Of Struct
};

// 0x50 (0x50 - 0x0)
// Function PlayFab.PlayFabAdminAPI.HelperUpdateStoreItems
struct UPlayFabAdminAPI_HelperUpdateStoreItems_Params
{
public:
	struct FPlayFabBaseModel                     Response;                                          // 0x0(0x40)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x40(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         Successful;                                        // 0x48(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1486[0x7];                                     // Fixing Size Of Struct
};

// 0x50 (0x50 - 0x0)
// Function PlayFab.PlayFabAdminAPI.HelperUpdateSegment
struct UPlayFabAdminAPI_HelperUpdateSegment_Params
{
public:
	struct FPlayFabBaseModel                     Response;                                          // 0x0(0x40)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x40(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         Successful;                                        // 0x48(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1488[0x7];                                     // Fixing Size Of Struct
};

// 0x50 (0x50 - 0x0)
// Function PlayFab.PlayFabAdminAPI.HelperUpdateRandomResultTables
struct UPlayFabAdminAPI_HelperUpdateRandomResultTables_Params
{
public:
	struct FPlayFabBaseModel                     Response;                                          // 0x0(0x40)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x40(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         Successful;                                        // 0x48(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1489[0x7];                                     // Fixing Size Of Struct
};

// 0x50 (0x50 - 0x0)
// Function PlayFab.PlayFabAdminAPI.HelperUpdatePolicy
struct UPlayFabAdminAPI_HelperUpdatePolicy_Params
{
public:
	struct FPlayFabBaseModel                     Response;                                          // 0x0(0x40)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x40(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         Successful;                                        // 0x48(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_148D[0x7];                                     // Fixing Size Of Struct
};

// 0x50 (0x50 - 0x0)
// Function PlayFab.PlayFabAdminAPI.HelperUpdatePlayerStatisticDefinition
struct UPlayFabAdminAPI_HelperUpdatePlayerStatisticDefinition_Params
{
public:
	struct FPlayFabBaseModel                     Response;                                          // 0x0(0x40)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x40(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         Successful;                                        // 0x48(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1490[0x7];                                     // Fixing Size Of Struct
};

// 0x50 (0x50 - 0x0)
// Function PlayFab.PlayFabAdminAPI.HelperUpdatePlayerSharedSecret
struct UPlayFabAdminAPI_HelperUpdatePlayerSharedSecret_Params
{
public:
	struct FPlayFabBaseModel                     Response;                                          // 0x0(0x40)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x40(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         Successful;                                        // 0x48(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1498[0x7];                                     // Fixing Size Of Struct
};

// 0x50 (0x50 - 0x0)
// Function PlayFab.PlayFabAdminAPI.HelperUpdateOpenIdConnection
struct UPlayFabAdminAPI_HelperUpdateOpenIdConnection_Params
{
public:
	struct FPlayFabBaseModel                     Response;                                          // 0x0(0x40)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x40(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         Successful;                                        // 0x48(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_149A[0x7];                                     // Fixing Size Of Struct
};

// 0x50 (0x50 - 0x0)
// Function PlayFab.PlayFabAdminAPI.HelperUpdateCloudScript
struct UPlayFabAdminAPI_HelperUpdateCloudScript_Params
{
public:
	struct FPlayFabBaseModel                     Response;                                          // 0x0(0x40)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x40(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         Successful;                                        // 0x48(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_149D[0x7];                                     // Fixing Size Of Struct
};

// 0x50 (0x50 - 0x0)
// Function PlayFab.PlayFabAdminAPI.HelperUpdateCatalogItems
struct UPlayFabAdminAPI_HelperUpdateCatalogItems_Params
{
public:
	struct FPlayFabBaseModel                     Response;                                          // 0x0(0x40)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x40(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         Successful;                                        // 0x48(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_14B1[0x7];                                     // Fixing Size Of Struct
};

// 0x50 (0x50 - 0x0)
// Function PlayFab.PlayFabAdminAPI.HelperUpdateBans
struct UPlayFabAdminAPI_HelperUpdateBans_Params
{
public:
	struct FPlayFabBaseModel                     Response;                                          // 0x0(0x40)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x40(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         Successful;                                        // 0x48(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_14B9[0x7];                                     // Fixing Size Of Struct
};

// 0x50 (0x50 - 0x0)
// Function PlayFab.PlayFabAdminAPI.HelperSubtractUserVirtualCurrency
struct UPlayFabAdminAPI_HelperSubtractUserVirtualCurrency_Params
{
public:
	struct FPlayFabBaseModel                     Response;                                          // 0x0(0x40)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x40(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         Successful;                                        // 0x48(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_14BF[0x7];                                     // Fixing Size Of Struct
};

// 0x50 (0x50 - 0x0)
// Function PlayFab.PlayFabAdminAPI.HelperSetupPushNotification
struct UPlayFabAdminAPI_HelperSetupPushNotification_Params
{
public:
	struct FPlayFabBaseModel                     Response;                                          // 0x0(0x40)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x40(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         Successful;                                        // 0x48(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_14C2[0x7];                                     // Fixing Size Of Struct
};

// 0x50 (0x50 - 0x0)
// Function PlayFab.PlayFabAdminAPI.HelperSetTitleInternalData
struct UPlayFabAdminAPI_HelperSetTitleInternalData_Params
{
public:
	struct FPlayFabBaseModel                     Response;                                          // 0x0(0x40)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x40(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         Successful;                                        // 0x48(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_14C6[0x7];                                     // Fixing Size Of Struct
};

// 0x50 (0x50 - 0x0)
// Function PlayFab.PlayFabAdminAPI.HelperSetTitleDataAndOverrides
struct UPlayFabAdminAPI_HelperSetTitleDataAndOverrides_Params
{
public:
	struct FPlayFabBaseModel                     Response;                                          // 0x0(0x40)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x40(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         Successful;                                        // 0x48(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_14CB[0x7];                                     // Fixing Size Of Struct
};

// 0x50 (0x50 - 0x0)
// Function PlayFab.PlayFabAdminAPI.HelperSetTitleData
struct UPlayFabAdminAPI_HelperSetTitleData_Params
{
public:
	struct FPlayFabBaseModel                     Response;                                          // 0x0(0x40)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x40(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         Successful;                                        // 0x48(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_14D8[0x7];                                     // Fixing Size Of Struct
};

// 0x50 (0x50 - 0x0)
// Function PlayFab.PlayFabAdminAPI.HelperSetStoreItems
struct UPlayFabAdminAPI_HelperSetStoreItems_Params
{
public:
	struct FPlayFabBaseModel                     Response;                                          // 0x0(0x40)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x40(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         Successful;                                        // 0x48(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_14DD[0x7];                                     // Fixing Size Of Struct
};

// 0x50 (0x50 - 0x0)
// Function PlayFab.PlayFabAdminAPI.HelperSetPublisherData
struct UPlayFabAdminAPI_HelperSetPublisherData_Params
{
public:
	struct FPlayFabBaseModel                     Response;                                          // 0x0(0x40)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x40(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         Successful;                                        // 0x48(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_14EC[0x7];                                     // Fixing Size Of Struct
};

// 0x50 (0x50 - 0x0)
// Function PlayFab.PlayFabAdminAPI.HelperSetPublishedRevision
struct UPlayFabAdminAPI_HelperSetPublishedRevision_Params
{
public:
	struct FPlayFabBaseModel                     Response;                                          // 0x0(0x40)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x40(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         Successful;                                        // 0x48(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_14F2[0x7];                                     // Fixing Size Of Struct
};

// 0x50 (0x50 - 0x0)
// Function PlayFab.PlayFabAdminAPI.HelperSetPlayerSecret
struct UPlayFabAdminAPI_HelperSetPlayerSecret_Params
{
public:
	struct FPlayFabBaseModel                     Response;                                          // 0x0(0x40)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x40(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         Successful;                                        // 0x48(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_14F6[0x7];                                     // Fixing Size Of Struct
};

// 0x50 (0x50 - 0x0)
// Function PlayFab.PlayFabAdminAPI.HelperSetMembershipOverride
struct UPlayFabAdminAPI_HelperSetMembershipOverride_Params
{
public:
	struct FPlayFabBaseModel                     Response;                                          // 0x0(0x40)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x40(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         Successful;                                        // 0x48(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_14F9[0x7];                                     // Fixing Size Of Struct
};

// 0x50 (0x50 - 0x0)
// Function PlayFab.PlayFabAdminAPI.HelperSetCatalogItems
struct UPlayFabAdminAPI_HelperSetCatalogItems_Params
{
public:
	struct FPlayFabBaseModel                     Response;                                          // 0x0(0x40)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x40(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         Successful;                                        // 0x48(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_14FD[0x7];                                     // Fixing Size Of Struct
};

// 0x50 (0x50 - 0x0)
// Function PlayFab.PlayFabAdminAPI.HelperSendAccountRecoveryEmail
struct UPlayFabAdminAPI_HelperSendAccountRecoveryEmail_Params
{
public:
	struct FPlayFabBaseModel                     Response;                                          // 0x0(0x40)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x40(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         Successful;                                        // 0x48(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1501[0x7];                                     // Fixing Size Of Struct
};

// 0x50 (0x50 - 0x0)
// Function PlayFab.PlayFabAdminAPI.HelperRunTask
struct UPlayFabAdminAPI_HelperRunTask_Params
{
public:
	struct FPlayFabBaseModel                     Response;                                          // 0x0(0x40)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x40(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         Successful;                                        // 0x48(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1507[0x7];                                     // Fixing Size Of Struct
};

// 0x50 (0x50 - 0x0)
// Function PlayFab.PlayFabAdminAPI.HelperRevokeInventoryItems
struct UPlayFabAdminAPI_HelperRevokeInventoryItems_Params
{
public:
	struct FPlayFabBaseModel                     Response;                                          // 0x0(0x40)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x40(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         Successful;                                        // 0x48(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_150B[0x7];                                     // Fixing Size Of Struct
};

// 0x50 (0x50 - 0x0)
// Function PlayFab.PlayFabAdminAPI.HelperRevokeInventoryItem
struct UPlayFabAdminAPI_HelperRevokeInventoryItem_Params
{
public:
	struct FPlayFabBaseModel                     Response;                                          // 0x0(0x40)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x40(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         Successful;                                        // 0x48(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1512[0x7];                                     // Fixing Size Of Struct
};

// 0x50 (0x50 - 0x0)
// Function PlayFab.PlayFabAdminAPI.HelperRevokeBans
struct UPlayFabAdminAPI_HelperRevokeBans_Params
{
public:
	struct FPlayFabBaseModel                     Response;                                          // 0x0(0x40)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x40(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         Successful;                                        // 0x48(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_151B[0x7];                                     // Fixing Size Of Struct
};

// 0x50 (0x50 - 0x0)
// Function PlayFab.PlayFabAdminAPI.HelperRevokeAllBansForUser
struct UPlayFabAdminAPI_HelperRevokeAllBansForUser_Params
{
public:
	struct FPlayFabBaseModel                     Response;                                          // 0x0(0x40)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x40(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         Successful;                                        // 0x48(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1525[0x7];                                     // Fixing Size Of Struct
};

// 0x50 (0x50 - 0x0)
// Function PlayFab.PlayFabAdminAPI.HelperResolvePurchaseDispute
struct UPlayFabAdminAPI_HelperResolvePurchaseDispute_Params
{
public:
	struct FPlayFabBaseModel                     Response;                                          // 0x0(0x40)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x40(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         Successful;                                        // 0x48(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_152E[0x7];                                     // Fixing Size Of Struct
};

// 0x50 (0x50 - 0x0)
// Function PlayFab.PlayFabAdminAPI.HelperResetUserStatistics
struct UPlayFabAdminAPI_HelperResetUserStatistics_Params
{
public:
	struct FPlayFabBaseModel                     Response;                                          // 0x0(0x40)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x40(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         Successful;                                        // 0x48(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1538[0x7];                                     // Fixing Size Of Struct
};

// 0x50 (0x50 - 0x0)
// Function PlayFab.PlayFabAdminAPI.HelperResetPassword
struct UPlayFabAdminAPI_HelperResetPassword_Params
{
public:
	struct FPlayFabBaseModel                     Response;                                          // 0x0(0x40)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x40(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         Successful;                                        // 0x48(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1541[0x7];                                     // Fixing Size Of Struct
};

// 0x50 (0x50 - 0x0)
// Function PlayFab.PlayFabAdminAPI.HelperResetCharacterStatistics
struct UPlayFabAdminAPI_HelperResetCharacterStatistics_Params
{
public:
	struct FPlayFabBaseModel                     Response;                                          // 0x0(0x40)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x40(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         Successful;                                        // 0x48(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1547[0x7];                                     // Fixing Size Of Struct
};

// 0x50 (0x50 - 0x0)
// Function PlayFab.PlayFabAdminAPI.HelperRemoveVirtualCurrencyTypes
struct UPlayFabAdminAPI_HelperRemoveVirtualCurrencyTypes_Params
{
public:
	struct FPlayFabBaseModel                     Response;                                          // 0x0(0x40)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x40(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         Successful;                                        // 0x48(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1552[0x7];                                     // Fixing Size Of Struct
};

// 0x50 (0x50 - 0x0)
// Function PlayFab.PlayFabAdminAPI.HelperRemovePlayerTag
struct UPlayFabAdminAPI_HelperRemovePlayerTag_Params
{
public:
	struct FPlayFabBaseModel                     Response;                                          // 0x0(0x40)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x40(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         Successful;                                        // 0x48(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_155B[0x7];                                     // Fixing Size Of Struct
};

// 0x50 (0x50 - 0x0)
// Function PlayFab.PlayFabAdminAPI.HelperRefundPurchase
struct UPlayFabAdminAPI_HelperRefundPurchase_Params
{
public:
	struct FPlayFabBaseModel                     Response;                                          // 0x0(0x40)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x40(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         Successful;                                        // 0x48(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1563[0x7];                                     // Fixing Size Of Struct
};

// 0x50 (0x50 - 0x0)
// Function PlayFab.PlayFabAdminAPI.HelperModifyServerBuild
struct UPlayFabAdminAPI_HelperModifyServerBuild_Params
{
public:
	struct FPlayFabBaseModel                     Response;                                          // 0x0(0x40)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x40(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         Successful;                                        // 0x48(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1571[0x7];                                     // Fixing Size Of Struct
};

// 0x50 (0x50 - 0x0)
// Function PlayFab.PlayFabAdminAPI.HelperListVirtualCurrencyTypes
struct UPlayFabAdminAPI_HelperListVirtualCurrencyTypes_Params
{
public:
	struct FPlayFabBaseModel                     Response;                                          // 0x0(0x40)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x40(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         Successful;                                        // 0x48(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1576[0x7];                                     // Fixing Size Of Struct
};

// 0x50 (0x50 - 0x0)
// Function PlayFab.PlayFabAdminAPI.HelperListOpenIdConnection
struct UPlayFabAdminAPI_HelperListOpenIdConnection_Params
{
public:
	struct FPlayFabBaseModel                     Response;                                          // 0x0(0x40)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x40(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         Successful;                                        // 0x48(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1580[0x7];                                     // Fixing Size Of Struct
};

// 0x50 (0x50 - 0x0)
// Function PlayFab.PlayFabAdminAPI.HelperIncrementPlayerStatisticVersion
struct UPlayFabAdminAPI_HelperIncrementPlayerStatisticVersion_Params
{
public:
	struct FPlayFabBaseModel                     Response;                                          // 0x0(0x40)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x40(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         Successful;                                        // 0x48(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_158B[0x7];                                     // Fixing Size Of Struct
};

// 0x50 (0x50 - 0x0)
// Function PlayFab.PlayFabAdminAPI.HelperIncrementLimitedEditionItemAvailability
struct UPlayFabAdminAPI_HelperIncrementLimitedEditionItemAvailability_Params
{
public:
	struct FPlayFabBaseModel                     Response;                                          // 0x0(0x40)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x40(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         Successful;                                        // 0x48(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1591[0x7];                                     // Fixing Size Of Struct
};

// 0x50 (0x50 - 0x0)
// Function PlayFab.PlayFabAdminAPI.HelperGrantItemsToUsers
struct UPlayFabAdminAPI_HelperGrantItemsToUsers_Params
{
public:
	struct FPlayFabBaseModel                     Response;                                          // 0x0(0x40)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x40(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         Successful;                                        // 0x48(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1599[0x7];                                     // Fixing Size Of Struct
};

// 0x50 (0x50 - 0x0)
// Function PlayFab.PlayFabAdminAPI.HelperGetUserReadOnlyData
struct UPlayFabAdminAPI_HelperGetUserReadOnlyData_Params
{
public:
	struct FPlayFabBaseModel                     Response;                                          // 0x0(0x40)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x40(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         Successful;                                        // 0x48(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_15A1[0x7];                                     // Fixing Size Of Struct
};

// 0x50 (0x50 - 0x0)
// Function PlayFab.PlayFabAdminAPI.HelperGetUserPublisherReadOnlyData
struct UPlayFabAdminAPI_HelperGetUserPublisherReadOnlyData_Params
{
public:
	struct FPlayFabBaseModel                     Response;                                          // 0x0(0x40)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x40(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         Successful;                                        // 0x48(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_15AC[0x7];                                     // Fixing Size Of Struct
};

// 0x50 (0x50 - 0x0)
// Function PlayFab.PlayFabAdminAPI.HelperGetUserPublisherInternalData
struct UPlayFabAdminAPI_HelperGetUserPublisherInternalData_Params
{
public:
	struct FPlayFabBaseModel                     Response;                                          // 0x0(0x40)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x40(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         Successful;                                        // 0x48(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_15B0[0x7];                                     // Fixing Size Of Struct
};

// 0x50 (0x50 - 0x0)
// Function PlayFab.PlayFabAdminAPI.HelperGetUserPublisherData
struct UPlayFabAdminAPI_HelperGetUserPublisherData_Params
{
public:
	struct FPlayFabBaseModel                     Response;                                          // 0x0(0x40)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x40(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         Successful;                                        // 0x48(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_15B4[0x7];                                     // Fixing Size Of Struct
};

// 0x50 (0x50 - 0x0)
// Function PlayFab.PlayFabAdminAPI.HelperGetUserInventory
struct UPlayFabAdminAPI_HelperGetUserInventory_Params
{
public:
	struct FPlayFabBaseModel                     Response;                                          // 0x0(0x40)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x40(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         Successful;                                        // 0x48(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_15B7[0x7];                                     // Fixing Size Of Struct
};

// 0x50 (0x50 - 0x0)
// Function PlayFab.PlayFabAdminAPI.HelperGetUserInternalData
struct UPlayFabAdminAPI_HelperGetUserInternalData_Params
{
public:
	struct FPlayFabBaseModel                     Response;                                          // 0x0(0x40)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x40(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         Successful;                                        // 0x48(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_15BB[0x7];                                     // Fixing Size Of Struct
};

// 0x50 (0x50 - 0x0)
// Function PlayFab.PlayFabAdminAPI.HelperGetUserData
struct UPlayFabAdminAPI_HelperGetUserData_Params
{
public:
	struct FPlayFabBaseModel                     Response;                                          // 0x0(0x40)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x40(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         Successful;                                        // 0x48(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_15BC[0x7];                                     // Fixing Size Of Struct
};

// 0x50 (0x50 - 0x0)
// Function PlayFab.PlayFabAdminAPI.HelperGetUserBans
struct UPlayFabAdminAPI_HelperGetUserBans_Params
{
public:
	struct FPlayFabBaseModel                     Response;                                          // 0x0(0x40)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x40(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         Successful;                                        // 0x48(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_15C5[0x7];                                     // Fixing Size Of Struct
};

// 0x50 (0x50 - 0x0)
// Function PlayFab.PlayFabAdminAPI.HelperGetUserAccountInfo
struct UPlayFabAdminAPI_HelperGetUserAccountInfo_Params
{
public:
	struct FPlayFabBaseModel                     Response;                                          // 0x0(0x40)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x40(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         Successful;                                        // 0x48(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_15CD[0x7];                                     // Fixing Size Of Struct
};

// 0x50 (0x50 - 0x0)
// Function PlayFab.PlayFabAdminAPI.HelperGetTitleInternalData
struct UPlayFabAdminAPI_HelperGetTitleInternalData_Params
{
public:
	struct FPlayFabBaseModel                     Response;                                          // 0x0(0x40)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x40(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         Successful;                                        // 0x48(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_15D1[0x7];                                     // Fixing Size Of Struct
};

// 0x50 (0x50 - 0x0)
// Function PlayFab.PlayFabAdminAPI.HelperGetTitleData
struct UPlayFabAdminAPI_HelperGetTitleData_Params
{
public:
	struct FPlayFabBaseModel                     Response;                                          // 0x0(0x40)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x40(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         Successful;                                        // 0x48(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_15D6[0x7];                                     // Fixing Size Of Struct
};

// 0x50 (0x50 - 0x0)
// Function PlayFab.PlayFabAdminAPI.HelperGetTasks
struct UPlayFabAdminAPI_HelperGetTasks_Params
{
public:
	struct FPlayFabBaseModel                     Response;                                          // 0x0(0x40)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x40(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         Successful;                                        // 0x48(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_15DB[0x7];                                     // Fixing Size Of Struct
};

// 0x50 (0x50 - 0x0)
// Function PlayFab.PlayFabAdminAPI.HelperGetTaskInstances
struct UPlayFabAdminAPI_HelperGetTaskInstances_Params
{
public:
	struct FPlayFabBaseModel                     Response;                                          // 0x0(0x40)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x40(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         Successful;                                        // 0x48(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_15E2[0x7];                                     // Fixing Size Of Struct
};

// 0x50 (0x50 - 0x0)
// Function PlayFab.PlayFabAdminAPI.HelperGetStoreItems
struct UPlayFabAdminAPI_HelperGetStoreItems_Params
{
public:
	struct FPlayFabBaseModel                     Response;                                          // 0x0(0x40)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x40(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         Successful;                                        // 0x48(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_15E7[0x7];                                     // Fixing Size Of Struct
};

// 0x50 (0x50 - 0x0)
// Function PlayFab.PlayFabAdminAPI.HelperGetSegments
struct UPlayFabAdminAPI_HelperGetSegments_Params
{
public:
	struct FPlayFabBaseModel                     Response;                                          // 0x0(0x40)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x40(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         Successful;                                        // 0x48(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_16E1[0x7];                                     // Fixing Size Of Struct
};

// 0x50 (0x50 - 0x0)
// Function PlayFab.PlayFabAdminAPI.HelperGetSegmentExport
struct UPlayFabAdminAPI_HelperGetSegmentExport_Params
{
public:
	struct FPlayFabBaseModel                     Response;                                          // 0x0(0x40)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x40(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         Successful;                                        // 0x48(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_170B[0x7];                                     // Fixing Size Of Struct
};

// 0x50 (0x50 - 0x0)
// Function PlayFab.PlayFabAdminAPI.HelperGetRandomResultTables
struct UPlayFabAdminAPI_HelperGetRandomResultTables_Params
{
public:
	struct FPlayFabBaseModel                     Response;                                          // 0x0(0x40)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x40(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         Successful;                                        // 0x48(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_170E[0x7];                                     // Fixing Size Of Struct
};

// 0x50 (0x50 - 0x0)
// Function PlayFab.PlayFabAdminAPI.HelperGetPublisherData
struct UPlayFabAdminAPI_HelperGetPublisherData_Params
{
public:
	struct FPlayFabBaseModel                     Response;                                          // 0x0(0x40)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x40(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         Successful;                                        // 0x48(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1714[0x7];                                     // Fixing Size Of Struct
};

// 0x50 (0x50 - 0x0)
// Function PlayFab.PlayFabAdminAPI.HelperGetPolicy
struct UPlayFabAdminAPI_HelperGetPolicy_Params
{
public:
	struct FPlayFabBaseModel                     Response;                                          // 0x0(0x40)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x40(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         Successful;                                        // 0x48(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_171A[0x7];                                     // Fixing Size Of Struct
};

// 0x50 (0x50 - 0x0)
// Function PlayFab.PlayFabAdminAPI.HelperGetPlayerTags
struct UPlayFabAdminAPI_HelperGetPlayerTags_Params
{
public:
	struct FPlayFabBaseModel                     Response;                                          // 0x0(0x40)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x40(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         Successful;                                        // 0x48(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_171F[0x7];                                     // Fixing Size Of Struct
};

// 0x50 (0x50 - 0x0)
// Function PlayFab.PlayFabAdminAPI.HelperGetPlayerStatisticVersions
struct UPlayFabAdminAPI_HelperGetPlayerStatisticVersions_Params
{
public:
	struct FPlayFabBaseModel                     Response;                                          // 0x0(0x40)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x40(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         Successful;                                        // 0x48(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1748[0x7];                                     // Fixing Size Of Struct
};

// 0x50 (0x50 - 0x0)
// Function PlayFab.PlayFabAdminAPI.HelperGetPlayerStatisticDefinitions
struct UPlayFabAdminAPI_HelperGetPlayerStatisticDefinitions_Params
{
public:
	struct FPlayFabBaseModel                     Response;                                          // 0x0(0x40)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x40(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         Successful;                                        // 0x48(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_174F[0x7];                                     // Fixing Size Of Struct
};

// 0x50 (0x50 - 0x0)
// Function PlayFab.PlayFabAdminAPI.HelperGetPlayersInSegment
struct UPlayFabAdminAPI_HelperGetPlayersInSegment_Params
{
public:
	struct FPlayFabBaseModel                     Response;                                          // 0x0(0x40)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x40(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         Successful;                                        // 0x48(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_175A[0x7];                                     // Fixing Size Of Struct
};

// 0x50 (0x50 - 0x0)
// Function PlayFab.PlayFabAdminAPI.HelperGetPlayerSharedSecrets
struct UPlayFabAdminAPI_HelperGetPlayerSharedSecrets_Params
{
public:
	struct FPlayFabBaseModel                     Response;                                          // 0x0(0x40)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x40(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         Successful;                                        // 0x48(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1763[0x7];                                     // Fixing Size Of Struct
};

// 0x50 (0x50 - 0x0)
// Function PlayFab.PlayFabAdminAPI.HelperGetPlayerSegments
struct UPlayFabAdminAPI_HelperGetPlayerSegments_Params
{
public:
	struct FPlayFabBaseModel                     Response;                                          // 0x0(0x40)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x40(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         Successful;                                        // 0x48(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_176B[0x7];                                     // Fixing Size Of Struct
};

// 0x50 (0x50 - 0x0)
// Function PlayFab.PlayFabAdminAPI.HelperGetPlayerProfile
struct UPlayFabAdminAPI_HelperGetPlayerProfile_Params
{
public:
	struct FPlayFabBaseModel                     Response;                                          // 0x0(0x40)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x40(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         Successful;                                        // 0x48(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1775[0x7];                                     // Fixing Size Of Struct
};

// 0x50 (0x50 - 0x0)
// Function PlayFab.PlayFabAdminAPI.HelperGetPlayerIdFromAuthToken
struct UPlayFabAdminAPI_HelperGetPlayerIdFromAuthToken_Params
{
public:
	struct FPlayFabBaseModel                     Response;                                          // 0x0(0x40)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x40(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         Successful;                                        // 0x48(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1781[0x7];                                     // Fixing Size Of Struct
};

// 0x50 (0x50 - 0x0)
// Function PlayFab.PlayFabAdminAPI.HelperGetPlayedTitleList
struct UPlayFabAdminAPI_HelperGetPlayedTitleList_Params
{
public:
	struct FPlayFabBaseModel                     Response;                                          // 0x0(0x40)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x40(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         Successful;                                        // 0x48(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1792[0x7];                                     // Fixing Size Of Struct
};

// 0x50 (0x50 - 0x0)
// Function PlayFab.PlayFabAdminAPI.HelperGetMatchmakerGameModes
struct UPlayFabAdminAPI_HelperGetMatchmakerGameModes_Params
{
public:
	struct FPlayFabBaseModel                     Response;                                          // 0x0(0x40)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x40(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         Successful;                                        // 0x48(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_179E[0x7];                                     // Fixing Size Of Struct
};

// 0x50 (0x50 - 0x0)
// Function PlayFab.PlayFabAdminAPI.HelperGetMatchmakerGameInfo
struct UPlayFabAdminAPI_HelperGetMatchmakerGameInfo_Params
{
public:
	struct FPlayFabBaseModel                     Response;                                          // 0x0(0x40)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x40(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         Successful;                                        // 0x48(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_17A2[0x7];                                     // Fixing Size Of Struct
};

// 0x50 (0x50 - 0x0)
// Function PlayFab.PlayFabAdminAPI.HelperGetDataReport
struct UPlayFabAdminAPI_HelperGetDataReport_Params
{
public:
	struct FPlayFabBaseModel                     Response;                                          // 0x0(0x40)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x40(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         Successful;                                        // 0x48(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_17A6[0x7];                                     // Fixing Size Of Struct
};

// 0x50 (0x50 - 0x0)
// Function PlayFab.PlayFabAdminAPI.HelperGetContentUploadUrl
struct UPlayFabAdminAPI_HelperGetContentUploadUrl_Params
{
public:
	struct FPlayFabBaseModel                     Response;                                          // 0x0(0x40)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x40(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         Successful;                                        // 0x48(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_17AB[0x7];                                     // Fixing Size Of Struct
};

// 0x50 (0x50 - 0x0)
// Function PlayFab.PlayFabAdminAPI.HelperGetContentList
struct UPlayFabAdminAPI_HelperGetContentList_Params
{
public:
	struct FPlayFabBaseModel                     Response;                                          // 0x0(0x40)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x40(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         Successful;                                        // 0x48(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_17B1[0x7];                                     // Fixing Size Of Struct
};

// 0x50 (0x50 - 0x0)
// Function PlayFab.PlayFabAdminAPI.HelperGetCloudScriptVersions
struct UPlayFabAdminAPI_HelperGetCloudScriptVersions_Params
{
public:
	struct FPlayFabBaseModel                     Response;                                          // 0x0(0x40)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x40(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         Successful;                                        // 0x48(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_17B8[0x7];                                     // Fixing Size Of Struct
};

// 0x50 (0x50 - 0x0)
// Function PlayFab.PlayFabAdminAPI.HelperGetCloudScriptTaskInstance
struct UPlayFabAdminAPI_HelperGetCloudScriptTaskInstance_Params
{
public:
	struct FPlayFabBaseModel                     Response;                                          // 0x0(0x40)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x40(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         Successful;                                        // 0x48(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_17BE[0x7];                                     // Fixing Size Of Struct
};

// 0x50 (0x50 - 0x0)
// Function PlayFab.PlayFabAdminAPI.HelperGetCloudScriptRevision
struct UPlayFabAdminAPI_HelperGetCloudScriptRevision_Params
{
public:
	struct FPlayFabBaseModel                     Response;                                          // 0x0(0x40)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x40(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         Successful;                                        // 0x48(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_17C4[0x7];                                     // Fixing Size Of Struct
};

// 0x50 (0x50 - 0x0)
// Function PlayFab.PlayFabAdminAPI.HelperGetCatalogItems
struct UPlayFabAdminAPI_HelperGetCatalogItems_Params
{
public:
	struct FPlayFabBaseModel                     Response;                                          // 0x0(0x40)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x40(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         Successful;                                        // 0x48(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_17C8[0x7];                                     // Fixing Size Of Struct
};

// 0x50 (0x50 - 0x0)
// Function PlayFab.PlayFabAdminAPI.HelperGetAllSegments
struct UPlayFabAdminAPI_HelperGetAllSegments_Params
{
public:
	struct FPlayFabBaseModel                     Response;                                          // 0x0(0x40)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x40(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         Successful;                                        // 0x48(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_17D0[0x7];                                     // Fixing Size Of Struct
};

// 0x50 (0x50 - 0x0)
// Function PlayFab.PlayFabAdminAPI.HelperGetActionsOnPlayersInSegmentTaskInstance
struct UPlayFabAdminAPI_HelperGetActionsOnPlayersInSegmentTaskInstance_Params
{
public:
	struct FPlayFabBaseModel                     Response;                                          // 0x0(0x40)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x40(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         Successful;                                        // 0x48(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_17D4[0x7];                                     // Fixing Size Of Struct
};

// 0x50 (0x50 - 0x0)
// Function PlayFab.PlayFabAdminAPI.HelperExportPlayersInSegment
struct UPlayFabAdminAPI_HelperExportPlayersInSegment_Params
{
public:
	struct FPlayFabBaseModel                     Response;                                          // 0x0(0x40)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x40(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         Successful;                                        // 0x48(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_17D8[0x7];                                     // Fixing Size Of Struct
};

// 0x50 (0x50 - 0x0)
// Function PlayFab.PlayFabAdminAPI.HelperExportMasterPlayerData
struct UPlayFabAdminAPI_HelperExportMasterPlayerData_Params
{
public:
	struct FPlayFabBaseModel                     Response;                                          // 0x0(0x40)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x40(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         Successful;                                        // 0x48(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_17DF[0x7];                                     // Fixing Size Of Struct
};

// 0x50 (0x50 - 0x0)
// Function PlayFab.PlayFabAdminAPI.HelperDeleteTitleDataOverride
struct UPlayFabAdminAPI_HelperDeleteTitleDataOverride_Params
{
public:
	struct FPlayFabBaseModel                     Response;                                          // 0x0(0x40)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x40(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         Successful;                                        // 0x48(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_17E3[0x7];                                     // Fixing Size Of Struct
};

// 0x50 (0x50 - 0x0)
// Function PlayFab.PlayFabAdminAPI.HelperDeleteTitle
struct UPlayFabAdminAPI_HelperDeleteTitle_Params
{
public:
	struct FPlayFabBaseModel                     Response;                                          // 0x0(0x40)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x40(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         Successful;                                        // 0x48(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_17E5[0x7];                                     // Fixing Size Of Struct
};

// 0x50 (0x50 - 0x0)
// Function PlayFab.PlayFabAdminAPI.HelperDeleteTask
struct UPlayFabAdminAPI_HelperDeleteTask_Params
{
public:
	struct FPlayFabBaseModel                     Response;                                          // 0x0(0x40)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x40(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         Successful;                                        // 0x48(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_17EC[0x7];                                     // Fixing Size Of Struct
};

// 0x50 (0x50 - 0x0)
// Function PlayFab.PlayFabAdminAPI.HelperDeleteStore
struct UPlayFabAdminAPI_HelperDeleteStore_Params
{
public:
	struct FPlayFabBaseModel                     Response;                                          // 0x0(0x40)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x40(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         Successful;                                        // 0x48(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_17F4[0x7];                                     // Fixing Size Of Struct
};

// 0x50 (0x50 - 0x0)
// Function PlayFab.PlayFabAdminAPI.HelperDeleteSegment
struct UPlayFabAdminAPI_HelperDeleteSegment_Params
{
public:
	struct FPlayFabBaseModel                     Response;                                          // 0x0(0x40)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x40(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         Successful;                                        // 0x48(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_17FB[0x7];                                     // Fixing Size Of Struct
};

// 0x50 (0x50 - 0x0)
// Function PlayFab.PlayFabAdminAPI.HelperDeletePlayerSharedSecret
struct UPlayFabAdminAPI_HelperDeletePlayerSharedSecret_Params
{
public:
	struct FPlayFabBaseModel                     Response;                                          // 0x0(0x40)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x40(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         Successful;                                        // 0x48(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1806[0x7];                                     // Fixing Size Of Struct
};

// 0x50 (0x50 - 0x0)
// Function PlayFab.PlayFabAdminAPI.HelperDeletePlayer
struct UPlayFabAdminAPI_HelperDeletePlayer_Params
{
public:
	struct FPlayFabBaseModel                     Response;                                          // 0x0(0x40)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x40(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         Successful;                                        // 0x48(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1819[0x7];                                     // Fixing Size Of Struct
};

// 0x50 (0x50 - 0x0)
// Function PlayFab.PlayFabAdminAPI.HelperDeleteOpenIdConnection
struct UPlayFabAdminAPI_HelperDeleteOpenIdConnection_Params
{
public:
	struct FPlayFabBaseModel                     Response;                                          // 0x0(0x40)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x40(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         Successful;                                        // 0x48(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1823[0x7];                                     // Fixing Size Of Struct
};

// 0x50 (0x50 - 0x0)
// Function PlayFab.PlayFabAdminAPI.HelperDeleteMembershipSubscription
struct UPlayFabAdminAPI_HelperDeleteMembershipSubscription_Params
{
public:
	struct FPlayFabBaseModel                     Response;                                          // 0x0(0x40)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x40(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         Successful;                                        // 0x48(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_182E[0x7];                                     // Fixing Size Of Struct
};

// 0x50 (0x50 - 0x0)
// Function PlayFab.PlayFabAdminAPI.HelperDeleteMasterPlayerAccount
struct UPlayFabAdminAPI_HelperDeleteMasterPlayerAccount_Params
{
public:
	struct FPlayFabBaseModel                     Response;                                          // 0x0(0x40)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x40(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         Successful;                                        // 0x48(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1833[0x7];                                     // Fixing Size Of Struct
};

// 0x50 (0x50 - 0x0)
// Function PlayFab.PlayFabAdminAPI.HelperDeleteContent
struct UPlayFabAdminAPI_HelperDeleteContent_Params
{
public:
	struct FPlayFabBaseModel                     Response;                                          // 0x0(0x40)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x40(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         Successful;                                        // 0x48(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1840[0x7];                                     // Fixing Size Of Struct
};

// 0x50 (0x50 - 0x0)
// Function PlayFab.PlayFabAdminAPI.HelperCreateSegment
struct UPlayFabAdminAPI_HelperCreateSegment_Params
{
public:
	struct FPlayFabBaseModel                     Response;                                          // 0x0(0x40)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x40(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         Successful;                                        // 0x48(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_18F9[0x7];                                     // Fixing Size Of Struct
};

// 0x50 (0x50 - 0x0)
// Function PlayFab.PlayFabAdminAPI.HelperCreatePlayerStatisticDefinition
struct UPlayFabAdminAPI_HelperCreatePlayerStatisticDefinition_Params
{
public:
	struct FPlayFabBaseModel                     Response;                                          // 0x0(0x40)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x40(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         Successful;                                        // 0x48(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_18FF[0x7];                                     // Fixing Size Of Struct
};

// 0x50 (0x50 - 0x0)
// Function PlayFab.PlayFabAdminAPI.HelperCreatePlayerSharedSecret
struct UPlayFabAdminAPI_HelperCreatePlayerSharedSecret_Params
{
public:
	struct FPlayFabBaseModel                     Response;                                          // 0x0(0x40)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x40(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         Successful;                                        // 0x48(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1908[0x7];                                     // Fixing Size Of Struct
};

// 0x50 (0x50 - 0x0)
// Function PlayFab.PlayFabAdminAPI.HelperCreateOpenIdConnection
struct UPlayFabAdminAPI_HelperCreateOpenIdConnection_Params
{
public:
	struct FPlayFabBaseModel                     Response;                                          // 0x0(0x40)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x40(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         Successful;                                        // 0x48(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1913[0x7];                                     // Fixing Size Of Struct
};

// 0x50 (0x50 - 0x0)
// Function PlayFab.PlayFabAdminAPI.HelperCreateInsightsScheduledScalingTask
struct UPlayFabAdminAPI_HelperCreateInsightsScheduledScalingTask_Params
{
public:
	struct FPlayFabBaseModel                     Response;                                          // 0x0(0x40)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x40(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         Successful;                                        // 0x48(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1916[0x7];                                     // Fixing Size Of Struct
};

// 0x50 (0x50 - 0x0)
// Function PlayFab.PlayFabAdminAPI.HelperCreateCloudScriptTask
struct UPlayFabAdminAPI_HelperCreateCloudScriptTask_Params
{
public:
	struct FPlayFabBaseModel                     Response;                                          // 0x0(0x40)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x40(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         Successful;                                        // 0x48(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1918[0x7];                                     // Fixing Size Of Struct
};

// 0x50 (0x50 - 0x0)
// Function PlayFab.PlayFabAdminAPI.HelperCreateActionsOnPlayersInSegmentTask
struct UPlayFabAdminAPI_HelperCreateActionsOnPlayersInSegmentTask_Params
{
public:
	struct FPlayFabBaseModel                     Response;                                          // 0x0(0x40)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x40(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         Successful;                                        // 0x48(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_191C[0x7];                                     // Fixing Size Of Struct
};

// 0x50 (0x50 - 0x0)
// Function PlayFab.PlayFabAdminAPI.HelperCheckLimitedEditionItemAvailability
struct UPlayFabAdminAPI_HelperCheckLimitedEditionItemAvailability_Params
{
public:
	struct FPlayFabBaseModel                     Response;                                          // 0x0(0x40)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x40(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         Successful;                                        // 0x48(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_191E[0x7];                                     // Fixing Size Of Struct
};

// 0x50 (0x50 - 0x0)
// Function PlayFab.PlayFabAdminAPI.HelperBanUsers
struct UPlayFabAdminAPI_HelperBanUsers_Params
{
public:
	struct FPlayFabBaseModel                     Response;                                          // 0x0(0x40)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x40(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         Successful;                                        // 0x48(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1922[0x7];                                     // Fixing Size Of Struct
};

// 0x50 (0x50 - 0x0)
// Function PlayFab.PlayFabAdminAPI.HelperAddVirtualCurrencyTypes
struct UPlayFabAdminAPI_HelperAddVirtualCurrencyTypes_Params
{
public:
	struct FPlayFabBaseModel                     Response;                                          // 0x0(0x40)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x40(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         Successful;                                        // 0x48(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1928[0x7];                                     // Fixing Size Of Struct
};

// 0x50 (0x50 - 0x0)
// Function PlayFab.PlayFabAdminAPI.HelperAddUserVirtualCurrency
struct UPlayFabAdminAPI_HelperAddUserVirtualCurrency_Params
{
public:
	struct FPlayFabBaseModel                     Response;                                          // 0x0(0x40)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x40(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         Successful;                                        // 0x48(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_192C[0x7];                                     // Fixing Size Of Struct
};

// 0x50 (0x50 - 0x0)
// Function PlayFab.PlayFabAdminAPI.HelperAddPlayerTag
struct UPlayFabAdminAPI_HelperAddPlayerTag_Params
{
public:
	struct FPlayFabBaseModel                     Response;                                          // 0x0(0x40)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x40(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         Successful;                                        // 0x48(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_192F[0x7];                                     // Fixing Size Of Struct
};

// 0x50 (0x50 - 0x0)
// Function PlayFab.PlayFabAdminAPI.HelperAddNews
struct UPlayFabAdminAPI_HelperAddNews_Params
{
public:
	struct FPlayFabBaseModel                     Response;                                          // 0x0(0x40)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x40(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         Successful;                                        // 0x48(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1931[0x7];                                     // Fixing Size Of Struct
};

// 0x50 (0x50 - 0x0)
// Function PlayFab.PlayFabAdminAPI.HelperAddLocalizedNews
struct UPlayFabAdminAPI_HelperAddLocalizedNews_Params
{
public:
	struct FPlayFabBaseModel                     Response;                                          // 0x0(0x40)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x40(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         Successful;                                        // 0x48(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1933[0x7];                                     // Fixing Size Of Struct
};

// 0x50 (0x50 - 0x0)
// Function PlayFab.PlayFabAdminAPI.HelperAbortTaskInstance
struct UPlayFabAdminAPI_HelperAbortTaskInstance_Params
{
public:
	struct FPlayFabBaseModel                     Response;                                          // 0x0(0x40)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x40(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         Successful;                                        // 0x48(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1935[0x7];                                     // Fixing Size Of Struct
};

// 0x60 (0x60 - 0x0)
// Function PlayFab.PlayFabAdminAPI.GrantItemsToUsers
struct UPlayFabAdminAPI_GrantItemsToUsers_Params
{
public:
	struct FAdminGrantItemsToUsersRequest        Request;                                           // 0x0(0x30)(Parm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x30(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x40(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x50(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                      ReturnValue;                                       // 0x58(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x60 (0x60 - 0x0)
// Function PlayFab.PlayFabAdminAPI.GetUserReadOnlyData
struct UPlayFabAdminAPI_GetUserReadOnlyData_Params
{
public:
	struct FAdminGetUserDataRequest              Request;                                           // 0x0(0x30)(Parm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x30(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x40(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x50(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                      ReturnValue;                                       // 0x58(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x60 (0x60 - 0x0)
// Function PlayFab.PlayFabAdminAPI.GetUserPublisherReadOnlyData
struct UPlayFabAdminAPI_GetUserPublisherReadOnlyData_Params
{
public:
	struct FAdminGetUserDataRequest              Request;                                           // 0x0(0x30)(Parm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x30(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x40(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x50(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                      ReturnValue;                                       // 0x58(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x60 (0x60 - 0x0)
// Function PlayFab.PlayFabAdminAPI.GetUserPublisherInternalData
struct UPlayFabAdminAPI_GetUserPublisherInternalData_Params
{
public:
	struct FAdminGetUserDataRequest              Request;                                           // 0x0(0x30)(Parm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x30(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x40(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x50(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                      ReturnValue;                                       // 0x58(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x60 (0x60 - 0x0)
// Function PlayFab.PlayFabAdminAPI.GetUserPublisherData
struct UPlayFabAdminAPI_GetUserPublisherData_Params
{
public:
	struct FAdminGetUserDataRequest              Request;                                           // 0x0(0x30)(Parm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x30(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x40(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x50(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                      ReturnValue;                                       // 0x58(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x50 (0x50 - 0x0)
// Function PlayFab.PlayFabAdminAPI.GetUserInventory
struct UPlayFabAdminAPI_GetUserInventory_Params
{
public:
	struct FAdminGetUserInventoryRequest         Request;                                           // 0x0(0x20)(Parm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x20(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x30(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x40(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                      ReturnValue;                                       // 0x48(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x60 (0x60 - 0x0)
// Function PlayFab.PlayFabAdminAPI.GetUserInternalData
struct UPlayFabAdminAPI_GetUserInternalData_Params
{
public:
	struct FAdminGetUserDataRequest              Request;                                           // 0x0(0x30)(Parm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x30(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x40(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x50(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                      ReturnValue;                                       // 0x58(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x60 (0x60 - 0x0)
// Function PlayFab.PlayFabAdminAPI.GetUserData
struct UPlayFabAdminAPI_GetUserData_Params
{
public:
	struct FAdminGetUserDataRequest              Request;                                           // 0x0(0x30)(Parm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x30(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x40(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x50(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                      ReturnValue;                                       // 0x58(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x48 (0x48 - 0x0)
// Function PlayFab.PlayFabAdminAPI.GetUserBans
struct UPlayFabAdminAPI_GetUserBans_Params
{
public:
	struct FAdminGetUserBansRequest              Request;                                           // 0x0(0x18)(Parm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x18(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x28(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x38(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                      ReturnValue;                                       // 0x40(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x78 (0x78 - 0x0)
// Function PlayFab.PlayFabAdminAPI.GetUserAccountInfo
struct UPlayFabAdminAPI_GetUserAccountInfo_Params
{
public:
	struct FAdminLookupUserAccountInfoRequest    Request;                                           // 0x0(0x48)(Parm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x48(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x58(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x68(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                      ReturnValue;                                       // 0x70(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x58 (0x58 - 0x0)
// Function PlayFab.PlayFabAdminAPI.GetTitleInternalData
struct UPlayFabAdminAPI_GetTitleInternalData_Params
{
public:
	struct FAdminGetTitleDataRequest             Request;                                           // 0x0(0x28)(Parm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x28(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x38(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x48(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                      ReturnValue;                                       // 0x50(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x58 (0x58 - 0x0)
// Function PlayFab.PlayFabAdminAPI.GetTitleData
struct UPlayFabAdminAPI_GetTitleData_Params
{
public:
	struct FAdminGetTitleDataRequest             Request;                                           // 0x0(0x28)(Parm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x28(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x38(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x48(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                      ReturnValue;                                       // 0x50(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x40 (0x40 - 0x0)
// Function PlayFab.PlayFabAdminAPI.GetTasks
struct UPlayFabAdminAPI_GetTasks_Params
{
public:
	struct FAdminGetTasksRequest                 Request;                                           // 0x0(0x10)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x10(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x20(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x30(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                      ReturnValue;                                       // 0x38(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x68 (0x68 - 0x0)
// Function PlayFab.PlayFabAdminAPI.GetTaskInstances
struct UPlayFabAdminAPI_GetTaskInstances_Params
{
public:
	struct FAdminGetTaskInstancesRequest         Request;                                           // 0x0(0x38)(Parm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x38(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x48(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x58(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                      ReturnValue;                                       // 0x60(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x58 (0x58 - 0x0)
// Function PlayFab.PlayFabAdminAPI.GetStoreItems
struct UPlayFabAdminAPI_GetStoreItems_Params
{
public:
	struct FAdminGetStoreItemsRequest            Request;                                           // 0x0(0x28)(Parm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x28(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x38(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x48(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                      ReturnValue;                                       // 0x50(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x48 (0x48 - 0x0)
// Function PlayFab.PlayFabAdminAPI.GetSegments
struct UPlayFabAdminAPI_GetSegments_Params
{
public:
	struct FAdminGetSegmentsRequest              Request;                                           // 0x0(0x18)(Parm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x18(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x28(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x38(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                      ReturnValue;                                       // 0x40(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x48 (0x48 - 0x0)
// Function PlayFab.PlayFabAdminAPI.GetSegmentExport
struct UPlayFabAdminAPI_GetSegmentExport_Params
{
public:
	struct FAdminGetPlayersInSegmentExportRequest Request;                                           // 0x0(0x18)(Parm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x18(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x28(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x38(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                      ReturnValue;                                       // 0x40(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x48 (0x48 - 0x0)
// Function PlayFab.PlayFabAdminAPI.GetRandomResultTables
struct UPlayFabAdminAPI_GetRandomResultTables_Params
{
public:
	struct FAdminGetRandomResultTablesRequest    Request;                                           // 0x0(0x18)(Parm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x18(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x28(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x38(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                      ReturnValue;                                       // 0x40(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x48 (0x48 - 0x0)
// Function PlayFab.PlayFabAdminAPI.GetPublisherData
struct UPlayFabAdminAPI_GetPublisherData_Params
{
public:
	struct FAdminGetPublisherDataRequest         Request;                                           // 0x0(0x18)(Parm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x18(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x28(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x38(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                      ReturnValue;                                       // 0x40(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x48 (0x48 - 0x0)
// Function PlayFab.PlayFabAdminAPI.GetPolicy
struct UPlayFabAdminAPI_GetPolicy_Params
{
public:
	struct FAdminGetPolicyRequest                Request;                                           // 0x0(0x18)(Parm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x18(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x28(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x38(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                      ReturnValue;                                       // 0x40(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x60 (0x60 - 0x0)
// Function PlayFab.PlayFabAdminAPI.GetPlayerTags
struct UPlayFabAdminAPI_GetPlayerTags_Params
{
public:
	struct FAdminGetPlayerTagsRequest            Request;                                           // 0x0(0x30)(Parm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x30(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x40(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x50(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                      ReturnValue;                                       // 0x58(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x50 (0x50 - 0x0)
// Function PlayFab.PlayFabAdminAPI.GetPlayerStatisticVersions
struct UPlayFabAdminAPI_GetPlayerStatisticVersions_Params
{
public:
	struct FAdminGetPlayerStatisticVersionsRequest Request;                                           // 0x0(0x20)(Parm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x20(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x30(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x40(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                      ReturnValue;                                       // 0x48(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x38 (0x38 - 0x0)
// Function PlayFab.PlayFabAdminAPI.GetPlayerStatisticDefinitions
struct UPlayFabAdminAPI_GetPlayerStatisticDefinitions_Params
{
public:
	struct FAdminGetPlayerStatisticDefinitionsRequest Request;                                           // 0x0(0x8)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x8(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x18(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x28(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                      ReturnValue;                                       // 0x30(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x70 (0x70 - 0x0)
// Function PlayFab.PlayFabAdminAPI.GetPlayersInSegment
struct UPlayFabAdminAPI_GetPlayersInSegment_Params
{
public:
	struct FAdminGetPlayersInSegmentRequest      Request;                                           // 0x0(0x40)(Parm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x40(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x50(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x60(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                      ReturnValue;                                       // 0x68(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x38 (0x38 - 0x0)
// Function PlayFab.PlayFabAdminAPI.GetPlayerSharedSecrets
struct UPlayFabAdminAPI_GetPlayerSharedSecrets_Params
{
public:
	struct FAdminGetPlayerSharedSecretsRequest   Request;                                           // 0x0(0x8)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x8(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x18(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x28(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                      ReturnValue;                                       // 0x30(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x50 (0x50 - 0x0)
// Function PlayFab.PlayFabAdminAPI.GetPlayerSegments
struct UPlayFabAdminAPI_GetPlayerSegments_Params
{
public:
	struct FAdminGetPlayersSegmentsRequest       Request;                                           // 0x0(0x20)(Parm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x20(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x30(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x40(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                      ReturnValue;                                       // 0x48(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x58 (0x58 - 0x0)
// Function PlayFab.PlayFabAdminAPI.GetPlayerProfile
struct UPlayFabAdminAPI_GetPlayerProfile_Params
{
public:
	struct FAdminGetPlayerProfileRequest         Request;                                           // 0x0(0x28)(Parm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x28(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x38(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x48(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                      ReturnValue;                                       // 0x50(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x50 (0x50 - 0x0)
// Function PlayFab.PlayFabAdminAPI.GetPlayerIdFromAuthToken
struct UPlayFabAdminAPI_GetPlayerIdFromAuthToken_Params
{
public:
	struct FAdminGetPlayerIdFromAuthTokenRequest Request;                                           // 0x0(0x20)(Parm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x20(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x30(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x40(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                      ReturnValue;                                       // 0x48(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x48 (0x48 - 0x0)
// Function PlayFab.PlayFabAdminAPI.GetPlayedTitleList
struct UPlayFabAdminAPI_GetPlayedTitleList_Params
{
public:
	struct FAdminGetPlayedTitleListRequest       Request;                                           // 0x0(0x18)(Parm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x18(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x28(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x38(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                      ReturnValue;                                       // 0x40(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x48 (0x48 - 0x0)
// Function PlayFab.PlayFabAdminAPI.GetMatchmakerGameModes
struct UPlayFabAdminAPI_GetMatchmakerGameModes_Params
{
public:
	struct FAdminGetMatchmakerGameModesRequest   Request;                                           // 0x0(0x18)(Parm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x18(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x28(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x38(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                      ReturnValue;                                       // 0x40(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x48 (0x48 - 0x0)
// Function PlayFab.PlayFabAdminAPI.GetMatchmakerGameInfo
struct UPlayFabAdminAPI_GetMatchmakerGameInfo_Params
{
public:
	struct FAdminGetMatchmakerGameInfoRequest    Request;                                           // 0x0(0x18)(Parm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x18(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x28(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x38(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                      ReturnValue;                                       // 0x40(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x58 (0x58 - 0x0)
// Function PlayFab.PlayFabAdminAPI.GetDataReport
struct UPlayFabAdminAPI_GetDataReport_Params
{
public:
	struct FAdminGetDataReportRequest            Request;                                           // 0x0(0x28)(Parm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x28(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x38(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x48(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                      ReturnValue;                                       // 0x50(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x58 (0x58 - 0x0)
// Function PlayFab.PlayFabAdminAPI.GetContentUploadUrl
struct UPlayFabAdminAPI_GetContentUploadUrl_Params
{
public:
	struct FAdminGetContentUploadUrlRequest      Request;                                           // 0x0(0x28)(Parm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x28(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x38(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x48(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                      ReturnValue;                                       // 0x50(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x48 (0x48 - 0x0)
// Function PlayFab.PlayFabAdminAPI.GetContentList
struct UPlayFabAdminAPI_GetContentList_Params
{
public:
	struct FAdminGetContentListRequest           Request;                                           // 0x0(0x18)(Parm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x18(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x28(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x38(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                      ReturnValue;                                       // 0x40(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x38 (0x38 - 0x0)
// Function PlayFab.PlayFabAdminAPI.GetCloudScriptVersions
struct UPlayFabAdminAPI_GetCloudScriptVersions_Params
{
public:
	struct FAdminGetCloudScriptVersionsRequest   Request;                                           // 0x0(0x8)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x8(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x18(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x28(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                      ReturnValue;                                       // 0x30(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x48 (0x48 - 0x0)
// Function PlayFab.PlayFabAdminAPI.GetCloudScriptTaskInstance
struct UPlayFabAdminAPI_GetCloudScriptTaskInstance_Params
{
public:
	struct FAdminGetTaskInstanceRequest          Request;                                           // 0x0(0x18)(Parm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x18(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x28(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x38(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                      ReturnValue;                                       // 0x40(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x40 (0x40 - 0x0)
// Function PlayFab.PlayFabAdminAPI.GetCloudScriptRevision
struct UPlayFabAdminAPI_GetCloudScriptRevision_Params
{
public:
	struct FAdminGetCloudScriptRevisionRequest   Request;                                           // 0x0(0x10)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x10(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x20(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x30(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                      ReturnValue;                                       // 0x38(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x48 (0x48 - 0x0)
// Function PlayFab.PlayFabAdminAPI.GetCatalogItems
struct UPlayFabAdminAPI_GetCatalogItems_Params
{
public:
	struct FAdminGetCatalogItemsRequest          Request;                                           // 0x0(0x18)(Parm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x18(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x28(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x38(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                      ReturnValue;                                       // 0x40(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x38 (0x38 - 0x0)
// Function PlayFab.PlayFabAdminAPI.GetAllSegments
struct UPlayFabAdminAPI_GetAllSegments_Params
{
public:
	struct FAdminGetAllSegmentsRequest           Request;                                           // 0x0(0x8)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x8(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x18(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x28(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                      ReturnValue;                                       // 0x30(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x48 (0x48 - 0x0)
// Function PlayFab.PlayFabAdminAPI.GetActionsOnPlayersInSegmentTaskInstance
struct UPlayFabAdminAPI_GetActionsOnPlayersInSegmentTaskInstance_Params
{
public:
	struct FAdminGetTaskInstanceRequest          Request;                                           // 0x0(0x18)(Parm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x18(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x28(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x38(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                      ReturnValue;                                       // 0x40(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x48 (0x48 - 0x0)
// Function PlayFab.PlayFabAdminAPI.ExportPlayersInSegment
struct UPlayFabAdminAPI_ExportPlayersInSegment_Params
{
public:
	struct FAdminExportPlayersInSegmentRequest   Request;                                           // 0x0(0x18)(Parm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x18(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x28(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x38(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                      ReturnValue;                                       // 0x40(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x48 (0x48 - 0x0)
// Function PlayFab.PlayFabAdminAPI.ExportMasterPlayerData
struct UPlayFabAdminAPI_ExportMasterPlayerData_Params
{
public:
	struct FAdminExportMasterPlayerDataRequest   Request;                                           // 0x0(0x18)(Parm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x18(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x28(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x38(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                      ReturnValue;                                       // 0x40(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x48 (0x48 - 0x0)
// Function PlayFab.PlayFabAdminAPI.DeleteTitleDataOverride
struct UPlayFabAdminAPI_DeleteTitleDataOverride_Params
{
public:
	struct FAdminDeleteTitleDataOverrideRequest  Request;                                           // 0x0(0x18)(Parm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x18(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x28(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x38(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                      ReturnValue;                                       // 0x40(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x38 (0x38 - 0x0)
// Function PlayFab.PlayFabAdminAPI.DeleteTitle
struct UPlayFabAdminAPI_DeleteTitle_Params
{
public:
	struct FAdminDeleteTitleRequest              Request;                                           // 0x0(0x8)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x8(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x18(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x28(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                      ReturnValue;                                       // 0x30(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x40 (0x40 - 0x0)
// Function PlayFab.PlayFabAdminAPI.DeleteTask
struct UPlayFabAdminAPI_DeleteTask_Params
{
public:
	struct FAdminDeleteTaskRequest               Request;                                           // 0x0(0x10)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x10(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x20(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x30(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                      ReturnValue;                                       // 0x38(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x60 (0x60 - 0x0)
// Function PlayFab.PlayFabAdminAPI.DeleteStore
struct UPlayFabAdminAPI_DeleteStore_Params
{
public:
	struct FAdminDeleteStoreRequest              Request;                                           // 0x0(0x30)(Parm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x30(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x40(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x50(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                      ReturnValue;                                       // 0x58(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x48 (0x48 - 0x0)
// Function PlayFab.PlayFabAdminAPI.DeleteSegment
struct UPlayFabAdminAPI_DeleteSegment_Params
{
public:
	struct FAdminDeleteSegmentRequest            Request;                                           // 0x0(0x18)(Parm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x18(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x28(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x38(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                      ReturnValue;                                       // 0x40(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x48 (0x48 - 0x0)
// Function PlayFab.PlayFabAdminAPI.DeletePlayerSharedSecret
struct UPlayFabAdminAPI_DeletePlayerSharedSecret_Params
{
public:
	struct FAdminDeletePlayerSharedSecretRequest Request;                                           // 0x0(0x18)(Parm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x18(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x28(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x38(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                      ReturnValue;                                       // 0x40(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x48 (0x48 - 0x0)
// Function PlayFab.PlayFabAdminAPI.DeletePlayer
struct UPlayFabAdminAPI_DeletePlayer_Params
{
public:
	struct FAdminDeletePlayerRequest             Request;                                           // 0x0(0x18)(Parm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x18(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x28(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x38(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                      ReturnValue;                                       // 0x40(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x48 (0x48 - 0x0)
// Function PlayFab.PlayFabAdminAPI.DeleteOpenIdConnection
struct UPlayFabAdminAPI_DeleteOpenIdConnection_Params
{
public:
	struct FAdminDeleteOpenIdConnectionRequest   Request;                                           // 0x0(0x18)(Parm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x18(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x28(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x38(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                      ReturnValue;                                       // 0x40(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x70 (0x70 - 0x0)
// Function PlayFab.PlayFabAdminAPI.DeleteMembershipSubscription
struct UPlayFabAdminAPI_DeleteMembershipSubscription_Params
{
public:
	struct FAdminDeleteMembershipSubscriptionRequest Request;                                           // 0x0(0x40)(Parm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x40(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x50(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x60(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                      ReturnValue;                                       // 0x68(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x58 (0x58 - 0x0)
// Function PlayFab.PlayFabAdminAPI.DeleteMasterPlayerAccount
struct UPlayFabAdminAPI_DeleteMasterPlayerAccount_Params
{
public:
	struct FAdminDeleteMasterPlayerAccountRequest Request;                                           // 0x0(0x28)(Parm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x28(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x38(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x48(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                      ReturnValue;                                       // 0x50(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x48 (0x48 - 0x0)
// Function PlayFab.PlayFabAdminAPI.DeleteContent
struct UPlayFabAdminAPI_DeleteContent_Params
{
public:
	struct FAdminDeleteContentRequest            Request;                                           // 0x0(0x18)(Parm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x18(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x28(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x38(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                      ReturnValue;                                       // 0x40(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// DelegateFunction PlayFab.PlayFabAdminAPI.DelegateOnSuccessUpdateUserTitleDisplayName__DelegateSignature
struct UPlayFabAdminAPI_DelegateOnSuccessUpdateUserTitleDisplayName__DelegateSignature_Params
{
public:
	struct FAdminUpdateUserTitleDisplayNameResult Result;                                            // 0x0(0x18)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x18(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// DelegateFunction PlayFab.PlayFabAdminAPI.DelegateOnSuccessUpdateUserReadOnlyData__DelegateSignature
struct UPlayFabAdminAPI_DelegateOnSuccessUpdateUserReadOnlyData__DelegateSignature_Params
{
public:
	struct FAdminUpdateUserDataResult            Result;                                            // 0x0(0x10)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x10(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// DelegateFunction PlayFab.PlayFabAdminAPI.DelegateOnSuccessUpdateUserPublisherReadOnlyData__DelegateSignature
struct UPlayFabAdminAPI_DelegateOnSuccessUpdateUserPublisherReadOnlyData__DelegateSignature_Params
{
public:
	struct FAdminUpdateUserDataResult            Result;                                            // 0x0(0x10)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x10(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// DelegateFunction PlayFab.PlayFabAdminAPI.DelegateOnSuccessUpdateUserPublisherInternalData__DelegateSignature
struct UPlayFabAdminAPI_DelegateOnSuccessUpdateUserPublisherInternalData__DelegateSignature_Params
{
public:
	struct FAdminUpdateUserDataResult            Result;                                            // 0x0(0x10)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x10(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// DelegateFunction PlayFab.PlayFabAdminAPI.DelegateOnSuccessUpdateUserPublisherData__DelegateSignature
struct UPlayFabAdminAPI_DelegateOnSuccessUpdateUserPublisherData__DelegateSignature_Params
{
public:
	struct FAdminUpdateUserDataResult            Result;                                            // 0x0(0x10)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x10(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// DelegateFunction PlayFab.PlayFabAdminAPI.DelegateOnSuccessUpdateUserInternalData__DelegateSignature
struct UPlayFabAdminAPI_DelegateOnSuccessUpdateUserInternalData__DelegateSignature_Params
{
public:
	struct FAdminUpdateUserDataResult            Result;                                            // 0x0(0x10)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x10(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// DelegateFunction PlayFab.PlayFabAdminAPI.DelegateOnSuccessUpdateUserData__DelegateSignature
struct UPlayFabAdminAPI_DelegateOnSuccessUpdateUserData__DelegateSignature_Params
{
public:
	struct FAdminUpdateUserDataResult            Result;                                            // 0x0(0x10)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x10(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction PlayFab.PlayFabAdminAPI.DelegateOnSuccessUpdateTask__DelegateSignature
struct UPlayFabAdminAPI_DelegateOnSuccessUpdateTask__DelegateSignature_Params
{
public:
	struct FAdminEmptyResponse                   Result;                                            // 0x0(0x8)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x8(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction PlayFab.PlayFabAdminAPI.DelegateOnSuccessUpdateStoreItems__DelegateSignature
struct UPlayFabAdminAPI_DelegateOnSuccessUpdateStoreItems__DelegateSignature_Params
{
public:
	struct FAdminUpdateStoreItemsResult          Result;                                            // 0x0(0x8)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x8(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x30 (0x30 - 0x0)
// DelegateFunction PlayFab.PlayFabAdminAPI.DelegateOnSuccessUpdateSegment__DelegateSignature
struct UPlayFabAdminAPI_DelegateOnSuccessUpdateSegment__DelegateSignature_Params
{
public:
	struct FAdminUpdateSegmentResponse           Result;                                            // 0x0(0x28)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x28(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction PlayFab.PlayFabAdminAPI.DelegateOnSuccessUpdateRandomResultTables__DelegateSignature
struct UPlayFabAdminAPI_DelegateOnSuccessUpdateRandomResultTables__DelegateSignature_Params
{
public:
	struct FAdminUpdateRandomResultTablesResult  Result;                                            // 0x0(0x8)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x8(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x30 (0x30 - 0x0)
// DelegateFunction PlayFab.PlayFabAdminAPI.DelegateOnSuccessUpdatePolicy__DelegateSignature
struct UPlayFabAdminAPI_DelegateOnSuccessUpdatePolicy__DelegateSignature_Params
{
public:
	struct FAdminUpdatePolicyResponse            Result;                                            // 0x0(0x28)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x28(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// DelegateFunction PlayFab.PlayFabAdminAPI.DelegateOnSuccessUpdatePlayerStatisticDefinition__DelegateSignature
struct UPlayFabAdminAPI_DelegateOnSuccessUpdatePlayerStatisticDefinition__DelegateSignature_Params
{
public:
	struct FAdminUpdatePlayerStatisticDefinitionResult Result;                                            // 0x0(0x10)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x10(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction PlayFab.PlayFabAdminAPI.DelegateOnSuccessUpdatePlayerSharedSecret__DelegateSignature
struct UPlayFabAdminAPI_DelegateOnSuccessUpdatePlayerSharedSecret__DelegateSignature_Params
{
public:
	struct FAdminUpdatePlayerSharedSecretResult  Result;                                            // 0x0(0x8)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x8(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction PlayFab.PlayFabAdminAPI.DelegateOnSuccessUpdateOpenIdConnection__DelegateSignature
struct UPlayFabAdminAPI_DelegateOnSuccessUpdateOpenIdConnection__DelegateSignature_Params
{
public:
	struct FAdminEmptyResponse                   Result;                                            // 0x0(0x8)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x8(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// DelegateFunction PlayFab.PlayFabAdminAPI.DelegateOnSuccessUpdateCloudScript__DelegateSignature
struct UPlayFabAdminAPI_DelegateOnSuccessUpdateCloudScript__DelegateSignature_Params
{
public:
	struct FAdminUpdateCloudScriptResult         Result;                                            // 0x0(0x10)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x10(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction PlayFab.PlayFabAdminAPI.DelegateOnSuccessUpdateCatalogItems__DelegateSignature
struct UPlayFabAdminAPI_DelegateOnSuccessUpdateCatalogItems__DelegateSignature_Params
{
public:
	struct FAdminUpdateCatalogItemsResult        Result;                                            // 0x0(0x8)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x8(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// DelegateFunction PlayFab.PlayFabAdminAPI.DelegateOnSuccessUpdateBans__DelegateSignature
struct UPlayFabAdminAPI_DelegateOnSuccessUpdateBans__DelegateSignature_Params
{
public:
	struct FAdminUpdateBansResult                Result;                                            // 0x0(0x18)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x18(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x38 (0x38 - 0x0)
// DelegateFunction PlayFab.PlayFabAdminAPI.DelegateOnSuccessSubtractUserVirtualCurrency__DelegateSignature
struct UPlayFabAdminAPI_DelegateOnSuccessSubtractUserVirtualCurrency__DelegateSignature_Params
{
public:
	struct FAdminModifyUserVirtualCurrencyResult Result;                                            // 0x0(0x30)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x30(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// DelegateFunction PlayFab.PlayFabAdminAPI.DelegateOnSuccessSetupPushNotification__DelegateSignature
struct UPlayFabAdminAPI_DelegateOnSuccessSetupPushNotification__DelegateSignature_Params
{
public:
	struct FAdminSetupPushNotificationResult     Result;                                            // 0x0(0x18)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x18(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction PlayFab.PlayFabAdminAPI.DelegateOnSuccessSetTitleInternalData__DelegateSignature
struct UPlayFabAdminAPI_DelegateOnSuccessSetTitleInternalData__DelegateSignature_Params
{
public:
	struct FAdminSetTitleDataResult              Result;                                            // 0x0(0x8)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x8(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction PlayFab.PlayFabAdminAPI.DelegateOnSuccessSetTitleDataAndOverrides__DelegateSignature
struct UPlayFabAdminAPI_DelegateOnSuccessSetTitleDataAndOverrides__DelegateSignature_Params
{
public:
	struct FAdminSetTitleDataAndOverridesResult  Result;                                            // 0x0(0x8)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x8(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction PlayFab.PlayFabAdminAPI.DelegateOnSuccessSetTitleData__DelegateSignature
struct UPlayFabAdminAPI_DelegateOnSuccessSetTitleData__DelegateSignature_Params
{
public:
	struct FAdminSetTitleDataResult              Result;                                            // 0x0(0x8)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x8(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction PlayFab.PlayFabAdminAPI.DelegateOnSuccessSetStoreItems__DelegateSignature
struct UPlayFabAdminAPI_DelegateOnSuccessSetStoreItems__DelegateSignature_Params
{
public:
	struct FAdminUpdateStoreItemsResult          Result;                                            // 0x0(0x8)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x8(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction PlayFab.PlayFabAdminAPI.DelegateOnSuccessSetPublisherData__DelegateSignature
struct UPlayFabAdminAPI_DelegateOnSuccessSetPublisherData__DelegateSignature_Params
{
public:
	struct FAdminSetPublisherDataResult          Result;                                            // 0x0(0x8)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x8(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction PlayFab.PlayFabAdminAPI.DelegateOnSuccessSetPublishedRevision__DelegateSignature
struct UPlayFabAdminAPI_DelegateOnSuccessSetPublishedRevision__DelegateSignature_Params
{
public:
	struct FAdminSetPublishedRevisionResult      Result;                                            // 0x0(0x8)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x8(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction PlayFab.PlayFabAdminAPI.DelegateOnSuccessSetPlayerSecret__DelegateSignature
struct UPlayFabAdminAPI_DelegateOnSuccessSetPlayerSecret__DelegateSignature_Params
{
public:
	struct FAdminSetPlayerSecretResult           Result;                                            // 0x0(0x8)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x8(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction PlayFab.PlayFabAdminAPI.DelegateOnSuccessSetMembershipOverride__DelegateSignature
struct UPlayFabAdminAPI_DelegateOnSuccessSetMembershipOverride__DelegateSignature_Params
{
public:
	struct FAdminSetMembershipOverrideResult     Result;                                            // 0x0(0x8)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x8(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction PlayFab.PlayFabAdminAPI.DelegateOnSuccessSetCatalogItems__DelegateSignature
struct UPlayFabAdminAPI_DelegateOnSuccessSetCatalogItems__DelegateSignature_Params
{
public:
	struct FAdminUpdateCatalogItemsResult        Result;                                            // 0x0(0x8)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x8(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction PlayFab.PlayFabAdminAPI.DelegateOnSuccessSendAccountRecoveryEmail__DelegateSignature
struct UPlayFabAdminAPI_DelegateOnSuccessSendAccountRecoveryEmail__DelegateSignature_Params
{
public:
	struct FAdminSendAccountRecoveryEmailResult  Result;                                            // 0x0(0x8)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x8(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// DelegateFunction PlayFab.PlayFabAdminAPI.DelegateOnSuccessRunTask__DelegateSignature
struct UPlayFabAdminAPI_DelegateOnSuccessRunTask__DelegateSignature_Params
{
public:
	struct FAdminRunTaskResult                   Result;                                            // 0x0(0x18)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x18(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// DelegateFunction PlayFab.PlayFabAdminAPI.DelegateOnSuccessRevokeInventoryItems__DelegateSignature
struct UPlayFabAdminAPI_DelegateOnSuccessRevokeInventoryItems__DelegateSignature_Params
{
public:
	struct FAdminRevokeInventoryItemsResult      Result;                                            // 0x0(0x18)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x18(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction PlayFab.PlayFabAdminAPI.DelegateOnSuccessRevokeInventoryItem__DelegateSignature
struct UPlayFabAdminAPI_DelegateOnSuccessRevokeInventoryItem__DelegateSignature_Params
{
public:
	struct FAdminRevokeInventoryResult           Result;                                            // 0x0(0x8)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x8(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// DelegateFunction PlayFab.PlayFabAdminAPI.DelegateOnSuccessRevokeBans__DelegateSignature
struct UPlayFabAdminAPI_DelegateOnSuccessRevokeBans__DelegateSignature_Params
{
public:
	struct FAdminRevokeBansResult                Result;                                            // 0x0(0x18)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x18(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// DelegateFunction PlayFab.PlayFabAdminAPI.DelegateOnSuccessRevokeAllBansForUser__DelegateSignature
struct UPlayFabAdminAPI_DelegateOnSuccessRevokeAllBansForUser__DelegateSignature_Params
{
public:
	struct FAdminRevokeAllBansForUserResult      Result;                                            // 0x0(0x18)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x18(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// DelegateFunction PlayFab.PlayFabAdminAPI.DelegateOnSuccessResolvePurchaseDispute__DelegateSignature
struct UPlayFabAdminAPI_DelegateOnSuccessResolvePurchaseDispute__DelegateSignature_Params
{
public:
	struct FAdminResolvePurchaseDisputeResponse  Result;                                            // 0x0(0x18)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x18(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction PlayFab.PlayFabAdminAPI.DelegateOnSuccessResetUserStatistics__DelegateSignature
struct UPlayFabAdminAPI_DelegateOnSuccessResetUserStatistics__DelegateSignature_Params
{
public:
	struct FAdminResetUserStatisticsResult       Result;                                            // 0x0(0x8)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x8(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction PlayFab.PlayFabAdminAPI.DelegateOnSuccessResetPassword__DelegateSignature
struct UPlayFabAdminAPI_DelegateOnSuccessResetPassword__DelegateSignature_Params
{
public:
	struct FAdminResetPasswordResult             Result;                                            // 0x0(0x8)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x8(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction PlayFab.PlayFabAdminAPI.DelegateOnSuccessResetCharacterStatistics__DelegateSignature
struct UPlayFabAdminAPI_DelegateOnSuccessResetCharacterStatistics__DelegateSignature_Params
{
public:
	struct FAdminResetCharacterStatisticsResult  Result;                                            // 0x0(0x8)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x8(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction PlayFab.PlayFabAdminAPI.DelegateOnSuccessRemoveVirtualCurrencyTypes__DelegateSignature
struct UPlayFabAdminAPI_DelegateOnSuccessRemoveVirtualCurrencyTypes__DelegateSignature_Params
{
public:
	struct FAdminBlankResult                     Result;                                            // 0x0(0x8)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x8(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction PlayFab.PlayFabAdminAPI.DelegateOnSuccessRemovePlayerTag__DelegateSignature
struct UPlayFabAdminAPI_DelegateOnSuccessRemovePlayerTag__DelegateSignature_Params
{
public:
	struct FAdminRemovePlayerTagResult           Result;                                            // 0x0(0x8)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x8(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// DelegateFunction PlayFab.PlayFabAdminAPI.DelegateOnSuccessRefundPurchase__DelegateSignature
struct UPlayFabAdminAPI_DelegateOnSuccessRefundPurchase__DelegateSignature_Params
{
public:
	struct FAdminRefundPurchaseResponse          Result;                                            // 0x0(0x18)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x18(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x90 (0x90 - 0x0)
// DelegateFunction PlayFab.PlayFabAdminAPI.DelegateOnSuccessModifyServerBuild__DelegateSignature
struct UPlayFabAdminAPI_DelegateOnSuccessModifyServerBuild__DelegateSignature_Params
{
public:
	struct FAdminModifyServerBuildResult         Result;                                            // 0x0(0x88)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x88(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// DelegateFunction PlayFab.PlayFabAdminAPI.DelegateOnSuccessListVirtualCurrencyTypes__DelegateSignature
struct UPlayFabAdminAPI_DelegateOnSuccessListVirtualCurrencyTypes__DelegateSignature_Params
{
public:
	struct FAdminListVirtualCurrencyTypesResult  Result;                                            // 0x0(0x18)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x18(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// DelegateFunction PlayFab.PlayFabAdminAPI.DelegateOnSuccessListOpenIdConnection__DelegateSignature
struct UPlayFabAdminAPI_DelegateOnSuccessListOpenIdConnection__DelegateSignature_Params
{
public:
	struct FAdminListOpenIdConnectionResponse    Result;                                            // 0x0(0x18)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x18(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// DelegateFunction PlayFab.PlayFabAdminAPI.DelegateOnSuccessIncrementPlayerStatisticVersion__DelegateSignature
struct UPlayFabAdminAPI_DelegateOnSuccessIncrementPlayerStatisticVersion__DelegateSignature_Params
{
public:
	struct FAdminIncrementPlayerStatisticVersionResult Result;                                            // 0x0(0x10)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x10(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction PlayFab.PlayFabAdminAPI.DelegateOnSuccessIncrementLimitedEditionItemAvailability__DelegateSignature
struct UPlayFabAdminAPI_DelegateOnSuccessIncrementLimitedEditionItemAvailability__DelegateSignature_Params
{
public:
	struct FAdminIncrementLimitedEditionItemAvailabilityResult Result;                                            // 0x0(0x8)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x8(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// DelegateFunction PlayFab.PlayFabAdminAPI.DelegateOnSuccessGrantItemsToUsers__DelegateSignature
struct UPlayFabAdminAPI_DelegateOnSuccessGrantItemsToUsers__DelegateSignature_Params
{
public:
	struct FAdminGrantItemsToUsersResult         Result;                                            // 0x0(0x18)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x18(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x30 (0x30 - 0x0)
// DelegateFunction PlayFab.PlayFabAdminAPI.DelegateOnSuccessGetUserReadOnlyData__DelegateSignature
struct UPlayFabAdminAPI_DelegateOnSuccessGetUserReadOnlyData__DelegateSignature_Params
{
public:
	struct FAdminGetUserDataResult               Result;                                            // 0x0(0x28)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x28(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x30 (0x30 - 0x0)
// DelegateFunction PlayFab.PlayFabAdminAPI.DelegateOnSuccessGetUserPublisherReadOnlyData__DelegateSignature
struct UPlayFabAdminAPI_DelegateOnSuccessGetUserPublisherReadOnlyData__DelegateSignature_Params
{
public:
	struct FAdminGetUserDataResult               Result;                                            // 0x0(0x28)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x28(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x30 (0x30 - 0x0)
// DelegateFunction PlayFab.PlayFabAdminAPI.DelegateOnSuccessGetUserPublisherInternalData__DelegateSignature
struct UPlayFabAdminAPI_DelegateOnSuccessGetUserPublisherInternalData__DelegateSignature_Params
{
public:
	struct FAdminGetUserDataResult               Result;                                            // 0x0(0x28)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x28(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x30 (0x30 - 0x0)
// DelegateFunction PlayFab.PlayFabAdminAPI.DelegateOnSuccessGetUserPublisherData__DelegateSignature
struct UPlayFabAdminAPI_DelegateOnSuccessGetUserPublisherData__DelegateSignature_Params
{
public:
	struct FAdminGetUserDataResult               Result;                                            // 0x0(0x28)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x28(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x40 (0x40 - 0x0)
// DelegateFunction PlayFab.PlayFabAdminAPI.DelegateOnSuccessGetUserInventory__DelegateSignature
struct UPlayFabAdminAPI_DelegateOnSuccessGetUserInventory__DelegateSignature_Params
{
public:
	struct FAdminGetUserInventoryResult          Result;                                            // 0x0(0x38)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x38(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x30 (0x30 - 0x0)
// DelegateFunction PlayFab.PlayFabAdminAPI.DelegateOnSuccessGetUserInternalData__DelegateSignature
struct UPlayFabAdminAPI_DelegateOnSuccessGetUserInternalData__DelegateSignature_Params
{
public:
	struct FAdminGetUserDataResult               Result;                                            // 0x0(0x28)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x28(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x30 (0x30 - 0x0)
// DelegateFunction PlayFab.PlayFabAdminAPI.DelegateOnSuccessGetUserData__DelegateSignature
struct UPlayFabAdminAPI_DelegateOnSuccessGetUserData__DelegateSignature_Params
{
public:
	struct FAdminGetUserDataResult               Result;                                            // 0x0(0x28)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x28(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// DelegateFunction PlayFab.PlayFabAdminAPI.DelegateOnSuccessGetUserBans__DelegateSignature
struct UPlayFabAdminAPI_DelegateOnSuccessGetUserBans__DelegateSignature_Params
{
public:
	struct FAdminGetUserBansResult               Result;                                            // 0x0(0x18)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x18(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// DelegateFunction PlayFab.PlayFabAdminAPI.DelegateOnSuccessGetUserAccountInfo__DelegateSignature
struct UPlayFabAdminAPI_DelegateOnSuccessGetUserAccountInfo__DelegateSignature_Params
{
public:
	struct FAdminLookupUserAccountInfoResult     Result;                                            // 0x0(0x10)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x10(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// DelegateFunction PlayFab.PlayFabAdminAPI.DelegateOnSuccessGetTitleInternalData__DelegateSignature
struct UPlayFabAdminAPI_DelegateOnSuccessGetTitleInternalData__DelegateSignature_Params
{
public:
	struct FAdminGetTitleDataResult              Result;                                            // 0x0(0x10)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x10(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// DelegateFunction PlayFab.PlayFabAdminAPI.DelegateOnSuccessGetTitleData__DelegateSignature
struct UPlayFabAdminAPI_DelegateOnSuccessGetTitleData__DelegateSignature_Params
{
public:
	struct FAdminGetTitleDataResult              Result;                                            // 0x0(0x10)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x10(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// DelegateFunction PlayFab.PlayFabAdminAPI.DelegateOnSuccessGetTasks__DelegateSignature
struct UPlayFabAdminAPI_DelegateOnSuccessGetTasks__DelegateSignature_Params
{
public:
	struct FAdminGetTasksResult                  Result;                                            // 0x0(0x18)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x18(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// DelegateFunction PlayFab.PlayFabAdminAPI.DelegateOnSuccessGetTaskInstances__DelegateSignature
struct UPlayFabAdminAPI_DelegateOnSuccessGetTaskInstances__DelegateSignature_Params
{
public:
	struct FAdminGetTaskInstancesResult          Result;                                            // 0x0(0x18)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x18(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x50 (0x50 - 0x0)
// DelegateFunction PlayFab.PlayFabAdminAPI.DelegateOnSuccessGetStoreItems__DelegateSignature
struct UPlayFabAdminAPI_DelegateOnSuccessGetStoreItems__DelegateSignature_Params
{
public:
	struct FAdminGetStoreItemsResult             Result;                                            // 0x0(0x48)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x48(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x30 (0x30 - 0x0)
// DelegateFunction PlayFab.PlayFabAdminAPI.DelegateOnSuccessGetSegments__DelegateSignature
struct UPlayFabAdminAPI_DelegateOnSuccessGetSegments__DelegateSignature_Params
{
public:
	struct FAdminGetSegmentsResponse             Result;                                            // 0x0(0x28)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x28(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x30 (0x30 - 0x0)
// DelegateFunction PlayFab.PlayFabAdminAPI.DelegateOnSuccessGetSegmentExport__DelegateSignature
struct UPlayFabAdminAPI_DelegateOnSuccessGetSegmentExport__DelegateSignature_Params
{
public:
	struct FAdminGetPlayersInSegmentExportResponse Result;                                            // 0x0(0x28)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x28(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// DelegateFunction PlayFab.PlayFabAdminAPI.DelegateOnSuccessGetRandomResultTables__DelegateSignature
struct UPlayFabAdminAPI_DelegateOnSuccessGetRandomResultTables__DelegateSignature_Params
{
public:
	struct FAdminGetRandomResultTablesResult     Result;                                            // 0x0(0x10)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x10(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// DelegateFunction PlayFab.PlayFabAdminAPI.DelegateOnSuccessGetPublisherData__DelegateSignature
struct UPlayFabAdminAPI_DelegateOnSuccessGetPublisherData__DelegateSignature_Params
{
public:
	struct FAdminGetPublisherDataResult          Result;                                            // 0x0(0x10)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x10(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x38 (0x38 - 0x0)
// DelegateFunction PlayFab.PlayFabAdminAPI.DelegateOnSuccessGetPolicy__DelegateSignature
struct UPlayFabAdminAPI_DelegateOnSuccessGetPolicy__DelegateSignature_Params
{
public:
	struct FAdminGetPolicyResponse               Result;                                            // 0x0(0x30)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x30(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x30 (0x30 - 0x0)
// DelegateFunction PlayFab.PlayFabAdminAPI.DelegateOnSuccessGetPlayerTags__DelegateSignature
struct UPlayFabAdminAPI_DelegateOnSuccessGetPlayerTags__DelegateSignature_Params
{
public:
	struct FAdminGetPlayerTagsResult             Result;                                            // 0x0(0x28)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x28(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// DelegateFunction PlayFab.PlayFabAdminAPI.DelegateOnSuccessGetPlayerStatisticVersions__DelegateSignature
struct UPlayFabAdminAPI_DelegateOnSuccessGetPlayerStatisticVersions__DelegateSignature_Params
{
public:
	struct FAdminGetPlayerStatisticVersionsResult Result;                                            // 0x0(0x18)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x18(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// DelegateFunction PlayFab.PlayFabAdminAPI.DelegateOnSuccessGetPlayerStatisticDefinitions__DelegateSignature
struct UPlayFabAdminAPI_DelegateOnSuccessGetPlayerStatisticDefinitions__DelegateSignature_Params
{
public:
	struct FAdminGetPlayerStatisticDefinitionsResult Result;                                            // 0x0(0x18)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x18(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x38 (0x38 - 0x0)
// DelegateFunction PlayFab.PlayFabAdminAPI.DelegateOnSuccessGetPlayersInSegment__DelegateSignature
struct UPlayFabAdminAPI_DelegateOnSuccessGetPlayersInSegment__DelegateSignature_Params
{
public:
	struct FAdminGetPlayersInSegmentResult       Result;                                            // 0x0(0x30)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x30(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// DelegateFunction PlayFab.PlayFabAdminAPI.DelegateOnSuccessGetPlayerSharedSecrets__DelegateSignature
struct UPlayFabAdminAPI_DelegateOnSuccessGetPlayerSharedSecrets__DelegateSignature_Params
{
public:
	struct FAdminGetPlayerSharedSecretsResult    Result;                                            // 0x0(0x18)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x18(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// DelegateFunction PlayFab.PlayFabAdminAPI.DelegateOnSuccessGetPlayerSegments__DelegateSignature
struct UPlayFabAdminAPI_DelegateOnSuccessGetPlayerSegments__DelegateSignature_Params
{
public:
	struct FAdminGetPlayerSegmentsResult         Result;                                            // 0x0(0x18)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x18(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// DelegateFunction PlayFab.PlayFabAdminAPI.DelegateOnSuccessGetPlayerProfile__DelegateSignature
struct UPlayFabAdminAPI_DelegateOnSuccessGetPlayerProfile__DelegateSignature_Params
{
public:
	struct FAdminGetPlayerProfileResult          Result;                                            // 0x0(0x10)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x10(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// DelegateFunction PlayFab.PlayFabAdminAPI.DelegateOnSuccessGetPlayerIdFromAuthToken__DelegateSignature
struct UPlayFabAdminAPI_DelegateOnSuccessGetPlayerIdFromAuthToken__DelegateSignature_Params
{
public:
	struct FAdminGetPlayerIdFromAuthTokenResult  Result;                                            // 0x0(0x18)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x18(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// DelegateFunction PlayFab.PlayFabAdminAPI.DelegateOnSuccessGetPlayedTitleList__DelegateSignature
struct UPlayFabAdminAPI_DelegateOnSuccessGetPlayedTitleList__DelegateSignature_Params
{
public:
	struct FAdminGetPlayedTitleListResult        Result;                                            // 0x0(0x18)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x18(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// DelegateFunction PlayFab.PlayFabAdminAPI.DelegateOnSuccessGetMatchmakerGameModes__DelegateSignature
struct UPlayFabAdminAPI_DelegateOnSuccessGetMatchmakerGameModes__DelegateSignature_Params
{
public:
	struct FAdminGetMatchmakerGameModesResult    Result;                                            // 0x0(0x18)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x18(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xC0 (0xC0 - 0x0)
// DelegateFunction PlayFab.PlayFabAdminAPI.DelegateOnSuccessGetMatchmakerGameInfo__DelegateSignature
struct UPlayFabAdminAPI_DelegateOnSuccessGetMatchmakerGameInfo__DelegateSignature_Params
{
public:
	struct FAdminGetMatchmakerGameInfoResult     Result;                                            // 0x0(0xB8)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0xB8(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// DelegateFunction PlayFab.PlayFabAdminAPI.DelegateOnSuccessGetDataReport__DelegateSignature
struct UPlayFabAdminAPI_DelegateOnSuccessGetDataReport__DelegateSignature_Params
{
public:
	struct FAdminGetDataReportResult             Result;                                            // 0x0(0x18)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x18(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// DelegateFunction PlayFab.PlayFabAdminAPI.DelegateOnSuccessGetContentUploadUrl__DelegateSignature
struct UPlayFabAdminAPI_DelegateOnSuccessGetContentUploadUrl__DelegateSignature_Params
{
public:
	struct FAdminGetContentUploadUrlResult       Result;                                            // 0x0(0x18)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x18(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x28 (0x28 - 0x0)
// DelegateFunction PlayFab.PlayFabAdminAPI.DelegateOnSuccessGetContentList__DelegateSignature
struct UPlayFabAdminAPI_DelegateOnSuccessGetContentList__DelegateSignature_Params
{
public:
	struct FAdminGetContentListResult            Result;                                            // 0x0(0x20)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x20(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// DelegateFunction PlayFab.PlayFabAdminAPI.DelegateOnSuccessGetCloudScriptVersions__DelegateSignature
struct UPlayFabAdminAPI_DelegateOnSuccessGetCloudScriptVersions__DelegateSignature_Params
{
public:
	struct FAdminGetCloudScriptVersionsResult    Result;                                            // 0x0(0x18)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x18(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// DelegateFunction PlayFab.PlayFabAdminAPI.DelegateOnSuccessGetCloudScriptTaskInstance__DelegateSignature
struct UPlayFabAdminAPI_DelegateOnSuccessGetCloudScriptTaskInstance__DelegateSignature_Params
{
public:
	struct FAdminGetCloudScriptTaskInstanceResult Result;                                            // 0x0(0x18)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x18(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x40 (0x40 - 0x0)
// DelegateFunction PlayFab.PlayFabAdminAPI.DelegateOnSuccessGetCloudScriptRevision__DelegateSignature
struct UPlayFabAdminAPI_DelegateOnSuccessGetCloudScriptRevision__DelegateSignature_Params
{
public:
	struct FAdminGetCloudScriptRevisionResult    Result;                                            // 0x0(0x38)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x38(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// DelegateFunction PlayFab.PlayFabAdminAPI.DelegateOnSuccessGetCatalogItems__DelegateSignature
struct UPlayFabAdminAPI_DelegateOnSuccessGetCatalogItems__DelegateSignature_Params
{
public:
	struct FAdminGetCatalogItemsResult           Result;                                            // 0x0(0x18)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x18(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// DelegateFunction PlayFab.PlayFabAdminAPI.DelegateOnSuccessGetAllSegments__DelegateSignature
struct UPlayFabAdminAPI_DelegateOnSuccessGetAllSegments__DelegateSignature_Params
{
public:
	struct FAdminGetAllSegmentsResult            Result;                                            // 0x0(0x18)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x18(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// DelegateFunction PlayFab.PlayFabAdminAPI.DelegateOnSuccessGetActionsOnPlayersInSegmentTaskInstance__DelegateSignature
struct UPlayFabAdminAPI_DelegateOnSuccessGetActionsOnPlayersInSegmentTaskInstance__DelegateSignature_Params
{
public:
	struct FAdminGetActionsOnPlayersInSegmentTaskInstanceResult Result;                                            // 0x0(0x18)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x18(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x30 (0x30 - 0x0)
// DelegateFunction PlayFab.PlayFabAdminAPI.DelegateOnSuccessExportPlayersInSegment__DelegateSignature
struct UPlayFabAdminAPI_DelegateOnSuccessExportPlayersInSegment__DelegateSignature_Params
{
public:
	struct FAdminExportPlayersInSegmentResult    Result;                                            // 0x0(0x28)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x28(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// DelegateFunction PlayFab.PlayFabAdminAPI.DelegateOnSuccessExportMasterPlayerData__DelegateSignature
struct UPlayFabAdminAPI_DelegateOnSuccessExportMasterPlayerData__DelegateSignature_Params
{
public:
	struct FAdminExportMasterPlayerDataResult    Result;                                            // 0x0(0x18)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x18(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction PlayFab.PlayFabAdminAPI.DelegateOnSuccessDeleteTitleDataOverride__DelegateSignature
struct UPlayFabAdminAPI_DelegateOnSuccessDeleteTitleDataOverride__DelegateSignature_Params
{
public:
	struct FAdminDeleteTitleDataOverrideResult   Result;                                            // 0x0(0x8)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x8(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction PlayFab.PlayFabAdminAPI.DelegateOnSuccessDeleteTitle__DelegateSignature
struct UPlayFabAdminAPI_DelegateOnSuccessDeleteTitle__DelegateSignature_Params
{
public:
	struct FAdminDeleteTitleResult               Result;                                            // 0x0(0x8)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x8(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction PlayFab.PlayFabAdminAPI.DelegateOnSuccessDeleteTask__DelegateSignature
struct UPlayFabAdminAPI_DelegateOnSuccessDeleteTask__DelegateSignature_Params
{
public:
	struct FAdminEmptyResponse                   Result;                                            // 0x0(0x8)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x8(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction PlayFab.PlayFabAdminAPI.DelegateOnSuccessDeleteStore__DelegateSignature
struct UPlayFabAdminAPI_DelegateOnSuccessDeleteStore__DelegateSignature_Params
{
public:
	struct FAdminDeleteStoreResult               Result;                                            // 0x0(0x8)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x8(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// DelegateFunction PlayFab.PlayFabAdminAPI.DelegateOnSuccessDeleteSegment__DelegateSignature
struct UPlayFabAdminAPI_DelegateOnSuccessDeleteSegment__DelegateSignature_Params
{
public:
	struct FAdminDeleteSegmentsResponse          Result;                                            // 0x0(0x18)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x18(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction PlayFab.PlayFabAdminAPI.DelegateOnSuccessDeletePlayerSharedSecret__DelegateSignature
struct UPlayFabAdminAPI_DelegateOnSuccessDeletePlayerSharedSecret__DelegateSignature_Params
{
public:
	struct FAdminDeletePlayerSharedSecretResult  Result;                                            // 0x0(0x8)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x8(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction PlayFab.PlayFabAdminAPI.DelegateOnSuccessDeletePlayer__DelegateSignature
struct UPlayFabAdminAPI_DelegateOnSuccessDeletePlayer__DelegateSignature_Params
{
public:
	struct FAdminDeletePlayerResult              Result;                                            // 0x0(0x8)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x8(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction PlayFab.PlayFabAdminAPI.DelegateOnSuccessDeleteOpenIdConnection__DelegateSignature
struct UPlayFabAdminAPI_DelegateOnSuccessDeleteOpenIdConnection__DelegateSignature_Params
{
public:
	struct FAdminEmptyResponse                   Result;                                            // 0x0(0x8)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x8(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction PlayFab.PlayFabAdminAPI.DelegateOnSuccessDeleteMembershipSubscription__DelegateSignature
struct UPlayFabAdminAPI_DelegateOnSuccessDeleteMembershipSubscription__DelegateSignature_Params
{
public:
	struct FAdminDeleteMembershipSubscriptionResult Result;                                            // 0x0(0x8)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x8(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x30 (0x30 - 0x0)
// DelegateFunction PlayFab.PlayFabAdminAPI.DelegateOnSuccessDeleteMasterPlayerAccount__DelegateSignature
struct UPlayFabAdminAPI_DelegateOnSuccessDeleteMasterPlayerAccount__DelegateSignature_Params
{
public:
	struct FAdminDeleteMasterPlayerAccountResult Result;                                            // 0x0(0x28)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x28(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction PlayFab.PlayFabAdminAPI.DelegateOnSuccessDeleteContent__DelegateSignature
struct UPlayFabAdminAPI_DelegateOnSuccessDeleteContent__DelegateSignature_Params
{
public:
	struct FAdminBlankResult                     Result;                                            // 0x0(0x8)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x8(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x30 (0x30 - 0x0)
// DelegateFunction PlayFab.PlayFabAdminAPI.DelegateOnSuccessCreateSegment__DelegateSignature
struct UPlayFabAdminAPI_DelegateOnSuccessCreateSegment__DelegateSignature_Params
{
public:
	struct FAdminCreateSegmentResponse           Result;                                            // 0x0(0x28)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x28(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// DelegateFunction PlayFab.PlayFabAdminAPI.DelegateOnSuccessCreatePlayerStatisticDefinition__DelegateSignature
struct UPlayFabAdminAPI_DelegateOnSuccessCreatePlayerStatisticDefinition__DelegateSignature_Params
{
public:
	struct FAdminCreatePlayerStatisticDefinitionResult Result;                                            // 0x0(0x10)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x10(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// DelegateFunction PlayFab.PlayFabAdminAPI.DelegateOnSuccessCreatePlayerSharedSecret__DelegateSignature
struct UPlayFabAdminAPI_DelegateOnSuccessCreatePlayerSharedSecret__DelegateSignature_Params
{
public:
	struct FAdminCreatePlayerSharedSecretResult  Result;                                            // 0x0(0x18)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x18(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction PlayFab.PlayFabAdminAPI.DelegateOnSuccessCreateOpenIdConnection__DelegateSignature
struct UPlayFabAdminAPI_DelegateOnSuccessCreateOpenIdConnection__DelegateSignature_Params
{
public:
	struct FAdminEmptyResponse                   Result;                                            // 0x0(0x8)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x8(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// DelegateFunction PlayFab.PlayFabAdminAPI.DelegateOnSuccessCreateInsightsScheduledScalingTask__DelegateSignature
struct UPlayFabAdminAPI_DelegateOnSuccessCreateInsightsScheduledScalingTask__DelegateSignature_Params
{
public:
	struct FAdminCreateTaskResult                Result;                                            // 0x0(0x18)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x18(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// DelegateFunction PlayFab.PlayFabAdminAPI.DelegateOnSuccessCreateCloudScriptTask__DelegateSignature
struct UPlayFabAdminAPI_DelegateOnSuccessCreateCloudScriptTask__DelegateSignature_Params
{
public:
	struct FAdminCreateTaskResult                Result;                                            // 0x0(0x18)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x18(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// DelegateFunction PlayFab.PlayFabAdminAPI.DelegateOnSuccessCreateActionsOnPlayersInSegmentTask__DelegateSignature
struct UPlayFabAdminAPI_DelegateOnSuccessCreateActionsOnPlayersInSegmentTask__DelegateSignature_Params
{
public:
	struct FAdminCreateTaskResult                Result;                                            // 0x0(0x18)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x18(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// DelegateFunction PlayFab.PlayFabAdminAPI.DelegateOnSuccessCheckLimitedEditionItemAvailability__DelegateSignature
struct UPlayFabAdminAPI_DelegateOnSuccessCheckLimitedEditionItemAvailability__DelegateSignature_Params
{
public:
	struct FAdminCheckLimitedEditionItemAvailabilityResult Result;                                            // 0x0(0x10)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x10(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// DelegateFunction PlayFab.PlayFabAdminAPI.DelegateOnSuccessBanUsers__DelegateSignature
struct UPlayFabAdminAPI_DelegateOnSuccessBanUsers__DelegateSignature_Params
{
public:
	struct FAdminBanUsersResult                  Result;                                            // 0x0(0x18)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x18(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction PlayFab.PlayFabAdminAPI.DelegateOnSuccessAddVirtualCurrencyTypes__DelegateSignature
struct UPlayFabAdminAPI_DelegateOnSuccessAddVirtualCurrencyTypes__DelegateSignature_Params
{
public:
	struct FAdminBlankResult                     Result;                                            // 0x0(0x8)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x8(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x38 (0x38 - 0x0)
// DelegateFunction PlayFab.PlayFabAdminAPI.DelegateOnSuccessAddUserVirtualCurrency__DelegateSignature
struct UPlayFabAdminAPI_DelegateOnSuccessAddUserVirtualCurrency__DelegateSignature_Params
{
public:
	struct FAdminModifyUserVirtualCurrencyResult Result;                                            // 0x0(0x30)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x30(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction PlayFab.PlayFabAdminAPI.DelegateOnSuccessAddPlayerTag__DelegateSignature
struct UPlayFabAdminAPI_DelegateOnSuccessAddPlayerTag__DelegateSignature_Params
{
public:
	struct FAdminAddPlayerTagResult              Result;                                            // 0x0(0x8)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x8(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// DelegateFunction PlayFab.PlayFabAdminAPI.DelegateOnSuccessAddNews__DelegateSignature
struct UPlayFabAdminAPI_DelegateOnSuccessAddNews__DelegateSignature_Params
{
public:
	struct FAdminAddNewsResult                   Result;                                            // 0x0(0x18)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x18(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction PlayFab.PlayFabAdminAPI.DelegateOnSuccessAddLocalizedNews__DelegateSignature
struct UPlayFabAdminAPI_DelegateOnSuccessAddLocalizedNews__DelegateSignature_Params
{
public:
	struct FAdminAddLocalizedNewsResult          Result;                                            // 0x0(0x8)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x8(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction PlayFab.PlayFabAdminAPI.DelegateOnSuccessAbortTaskInstance__DelegateSignature
struct UPlayFabAdminAPI_DelegateOnSuccessAbortTaskInstance__DelegateSignature_Params
{
public:
	struct FAdminEmptyResponse                   Result;                                            // 0x0(0x8)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x8(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x40 (0x40 - 0x0)
// DelegateFunction PlayFab.PlayFabAdminAPI.DelegateOnFailurePlayFabError__DelegateSignature
struct UPlayFabAdminAPI_DelegateOnFailurePlayFabError__DelegateSignature_Params
{
public:
	struct FPlayFabError                         Error;                                             // 0x0(0x38)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x38(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x40 (0x40 - 0x0)
// Function PlayFab.PlayFabAdminAPI.CreateSegment
struct UPlayFabAdminAPI_CreateSegment_Params
{
public:
	struct FAdminCreateSegmentRequest            Request;                                           // 0x0(0x10)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x10(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x20(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x30(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                      ReturnValue;                                       // 0x38(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x60 (0x60 - 0x0)
// Function PlayFab.PlayFabAdminAPI.CreatePlayerStatisticDefinition
struct UPlayFabAdminAPI_CreatePlayerStatisticDefinition_Params
{
public:
	struct FAdminCreatePlayerStatisticDefinitionRequest Request;                                           // 0x0(0x30)(Parm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x30(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x40(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x50(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                      ReturnValue;                                       // 0x58(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x48 (0x48 - 0x0)
// Function PlayFab.PlayFabAdminAPI.CreatePlayerSharedSecret
struct UPlayFabAdminAPI_CreatePlayerSharedSecret_Params
{
public:
	struct FAdminCreatePlayerSharedSecretRequest Request;                                           // 0x0(0x18)(Parm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x18(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x28(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x38(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                      ReturnValue;                                       // 0x40(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x88 (0x88 - 0x0)
// Function PlayFab.PlayFabAdminAPI.CreateOpenIdConnection
struct UPlayFabAdminAPI_CreateOpenIdConnection_Params
{
public:
	struct FAdminCreateOpenIdConnectionRequest   Request;                                           // 0x0(0x58)(Parm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x58(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x68(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x78(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                      ReturnValue;                                       // 0x80(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x80 (0x80 - 0x0)
// Function PlayFab.PlayFabAdminAPI.CreateInsightsScheduledScalingTask
struct UPlayFabAdminAPI_CreateInsightsScheduledScalingTask_Params
{
public:
	struct FAdminCreateInsightsScheduledScalingTaskRequest Request;                                           // 0x0(0x50)(Parm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x50(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x60(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x70(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                      ReturnValue;                                       // 0x78(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x80 (0x80 - 0x0)
// Function PlayFab.PlayFabAdminAPI.CreateCloudScriptTask
struct UPlayFabAdminAPI_CreateCloudScriptTask_Params
{
public:
	struct FAdminCreateCloudScriptTaskRequest    Request;                                           // 0x0(0x50)(Parm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x50(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x60(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x70(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                      ReturnValue;                                       // 0x78(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x80 (0x80 - 0x0)
// Function PlayFab.PlayFabAdminAPI.CreateActionsOnPlayersInSegmentTask
struct UPlayFabAdminAPI_CreateActionsOnPlayersInSegmentTask_Params
{
public:
	struct FAdminCreateActionsOnPlayerSegmentTaskRequest Request;                                           // 0x0(0x50)(Parm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x50(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x60(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x70(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                      ReturnValue;                                       // 0x78(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x58 (0x58 - 0x0)
// Function PlayFab.PlayFabAdminAPI.CheckLimitedEditionItemAvailability
struct UPlayFabAdminAPI_CheckLimitedEditionItemAvailability_Params
{
public:
	struct FAdminCheckLimitedEditionItemAvailabilityRequest Request;                                           // 0x0(0x28)(Parm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x28(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x38(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x48(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                      ReturnValue;                                       // 0x50(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x50 (0x50 - 0x0)
// Function PlayFab.PlayFabAdminAPI.BanUsers
struct UPlayFabAdminAPI_BanUsers_Params
{
public:
	struct FAdminBanUsersRequest                 Request;                                           // 0x0(0x20)(Parm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x20(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x30(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x40(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                      ReturnValue;                                       // 0x48(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x48 (0x48 - 0x0)
// Function PlayFab.PlayFabAdminAPI.AddVirtualCurrencyTypes
struct UPlayFabAdminAPI_AddVirtualCurrencyTypes_Params
{
public:
	struct FAdminAddVirtualCurrencyTypesRequest  Request;                                           // 0x0(0x18)(Parm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x18(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x28(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x38(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                      ReturnValue;                                       // 0x40(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x68 (0x68 - 0x0)
// Function PlayFab.PlayFabAdminAPI.AddUserVirtualCurrency
struct UPlayFabAdminAPI_AddUserVirtualCurrency_Params
{
public:
	struct FAdminAddUserVirtualCurrencyRequest   Request;                                           // 0x0(0x38)(Parm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x38(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x48(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x58(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                      ReturnValue;                                       // 0x60(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x60 (0x60 - 0x0)
// Function PlayFab.PlayFabAdminAPI.AddPlayerTag
struct UPlayFabAdminAPI_AddPlayerTag_Params
{
public:
	struct FAdminAddPlayerTagRequest             Request;                                           // 0x0(0x30)(Parm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x30(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x40(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x50(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                      ReturnValue;                                       // 0x58(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x70 (0x70 - 0x0)
// Function PlayFab.PlayFabAdminAPI.AddNews
struct UPlayFabAdminAPI_AddNews_Params
{
public:
	struct FAdminAddNewsRequest                  Request;                                           // 0x0(0x40)(Parm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x40(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x50(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x60(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                      ReturnValue;                                       // 0x68(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x80 (0x80 - 0x0)
// Function PlayFab.PlayFabAdminAPI.AddLocalizedNews
struct UPlayFabAdminAPI_AddLocalizedNews_Params
{
public:
	struct FAdminAddLocalizedNewsRequest         Request;                                           // 0x0(0x50)(Parm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x50(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x60(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x70(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                      ReturnValue;                                       // 0x78(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x50 (0x50 - 0x0)
// Function PlayFab.PlayFabAdminAPI.AbortTaskInstance
struct UPlayFabAdminAPI_AbortTaskInstance_Params
{
public:
	struct FAdminAbortTaskInstanceRequest        Request;                                           // 0x0(0x20)(Parm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x20(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x30(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                               CustomData;                                        // 0x40(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                      ReturnValue;                                       // 0x48(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// Function PlayFab.PlayFabAdminModelDecoder.decodeUpdateUserTitleDisplayNameResultResponse
struct UPlayFabAdminModelDecoder_DecodeUpdateUserTitleDisplayNameResultResponse_Params
{
public:
	class UPlayFabJsonObject*                    Response;                                          // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAdminUpdateUserTitleDisplayNameResult ReturnValue;                                       // 0x8(0x18)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function PlayFab.PlayFabAdminModelDecoder.decodeUpdateUserDataResultResponse
struct UPlayFabAdminModelDecoder_DecodeUpdateUserDataResultResponse_Params
{
public:
	class UPlayFabJsonObject*                    Response;                                          // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAdminUpdateUserDataResult            ReturnValue;                                       // 0x8(0x10)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function PlayFab.PlayFabAdminModelDecoder.decodeUpdateStoreItemsResultResponse
struct UPlayFabAdminModelDecoder_DecodeUpdateStoreItemsResultResponse_Params
{
public:
	class UPlayFabJsonObject*                    Response;                                          // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAdminUpdateStoreItemsResult          ReturnValue;                                       // 0x8(0x8)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};

// 0x30 (0x30 - 0x0)
// Function PlayFab.PlayFabAdminModelDecoder.decodeUpdateSegmentResponseResponse
struct UPlayFabAdminModelDecoder_DecodeUpdateSegmentResponseResponse_Params
{
public:
	class UPlayFabJsonObject*                    Response;                                          // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAdminUpdateSegmentResponse           ReturnValue;                                       // 0x8(0x28)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function PlayFab.PlayFabAdminModelDecoder.decodeUpdateRandomResultTablesResultResponse
struct UPlayFabAdminModelDecoder_DecodeUpdateRandomResultTablesResultResponse_Params
{
public:
	class UPlayFabJsonObject*                    Response;                                          // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAdminUpdateRandomResultTablesResult  ReturnValue;                                       // 0x8(0x8)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};

// 0x30 (0x30 - 0x0)
// Function PlayFab.PlayFabAdminModelDecoder.decodeUpdatePolicyResponseResponse
struct UPlayFabAdminModelDecoder_DecodeUpdatePolicyResponseResponse_Params
{
public:
	class UPlayFabJsonObject*                    Response;                                          // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAdminUpdatePolicyResponse            ReturnValue;                                       // 0x8(0x28)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function PlayFab.PlayFabAdminModelDecoder.decodeUpdatePlayerStatisticDefinitionResultResponse
struct UPlayFabAdminModelDecoder_DecodeUpdatePlayerStatisticDefinitionResultResponse_Params
{
public:
	class UPlayFabJsonObject*                    Response;                                          // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAdminUpdatePlayerStatisticDefinitionResult ReturnValue;                                       // 0x8(0x10)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function PlayFab.PlayFabAdminModelDecoder.decodeUpdatePlayerSharedSecretResultResponse
struct UPlayFabAdminModelDecoder_DecodeUpdatePlayerSharedSecretResultResponse_Params
{
public:
	class UPlayFabJsonObject*                    Response;                                          // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAdminUpdatePlayerSharedSecretResult  ReturnValue;                                       // 0x8(0x8)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function PlayFab.PlayFabAdminModelDecoder.decodeUpdateCloudScriptResultResponse
struct UPlayFabAdminModelDecoder_DecodeUpdateCloudScriptResultResponse_Params
{
public:
	class UPlayFabJsonObject*                    Response;                                          // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAdminUpdateCloudScriptResult         ReturnValue;                                       // 0x8(0x10)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function PlayFab.PlayFabAdminModelDecoder.decodeUpdateCatalogItemsResultResponse
struct UPlayFabAdminModelDecoder_DecodeUpdateCatalogItemsResultResponse_Params
{
public:
	class UPlayFabJsonObject*                    Response;                                          // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAdminUpdateCatalogItemsResult        ReturnValue;                                       // 0x8(0x8)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// Function PlayFab.PlayFabAdminModelDecoder.decodeUpdateBansResultResponse
struct UPlayFabAdminModelDecoder_DecodeUpdateBansResultResponse_Params
{
public:
	class UPlayFabJsonObject*                    Response;                                          // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAdminUpdateBansResult                ReturnValue;                                       // 0x8(0x18)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// Function PlayFab.PlayFabAdminModelDecoder.decodeSetupPushNotificationResultResponse
struct UPlayFabAdminModelDecoder_DecodeSetupPushNotificationResultResponse_Params
{
public:
	class UPlayFabJsonObject*                    Response;                                          // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAdminSetupPushNotificationResult     ReturnValue;                                       // 0x8(0x18)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function PlayFab.PlayFabAdminModelDecoder.decodeSetTitleDataResultResponse
struct UPlayFabAdminModelDecoder_DecodeSetTitleDataResultResponse_Params
{
public:
	class UPlayFabJsonObject*                    Response;                                          // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAdminSetTitleDataResult              ReturnValue;                                       // 0x8(0x8)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function PlayFab.PlayFabAdminModelDecoder.decodeSetTitleDataAndOverridesResultResponse
struct UPlayFabAdminModelDecoder_DecodeSetTitleDataAndOverridesResultResponse_Params
{
public:
	class UPlayFabJsonObject*                    Response;                                          // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAdminSetTitleDataAndOverridesResult  ReturnValue;                                       // 0x8(0x8)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function PlayFab.PlayFabAdminModelDecoder.decodeSetPublisherDataResultResponse
struct UPlayFabAdminModelDecoder_DecodeSetPublisherDataResultResponse_Params
{
public:
	class UPlayFabJsonObject*                    Response;                                          // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAdminSetPublisherDataResult          ReturnValue;                                       // 0x8(0x8)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function PlayFab.PlayFabAdminModelDecoder.decodeSetPublishedRevisionResultResponse
struct UPlayFabAdminModelDecoder_DecodeSetPublishedRevisionResultResponse_Params
{
public:
	class UPlayFabJsonObject*                    Response;                                          // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAdminSetPublishedRevisionResult      ReturnValue;                                       // 0x8(0x8)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function PlayFab.PlayFabAdminModelDecoder.decodeSetPlayerSecretResultResponse
struct UPlayFabAdminModelDecoder_DecodeSetPlayerSecretResultResponse_Params
{
public:
	class UPlayFabJsonObject*                    Response;                                          // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAdminSetPlayerSecretResult           ReturnValue;                                       // 0x8(0x8)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function PlayFab.PlayFabAdminModelDecoder.decodeSetMembershipOverrideResultResponse
struct UPlayFabAdminModelDecoder_DecodeSetMembershipOverrideResultResponse_Params
{
public:
	class UPlayFabJsonObject*                    Response;                                          // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAdminSetMembershipOverrideResult     ReturnValue;                                       // 0x8(0x8)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function PlayFab.PlayFabAdminModelDecoder.decodeSendAccountRecoveryEmailResultResponse
struct UPlayFabAdminModelDecoder_DecodeSendAccountRecoveryEmailResultResponse_Params
{
public:
	class UPlayFabJsonObject*                    Response;                                          // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAdminSendAccountRecoveryEmailResult  ReturnValue;                                       // 0x8(0x8)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// Function PlayFab.PlayFabAdminModelDecoder.decodeRunTaskResultResponse
struct UPlayFabAdminModelDecoder_DecodeRunTaskResultResponse_Params
{
public:
