#pragma once

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

#include "../SDK.hpp"

namespace SDK
{
namespace Params
{
//---------------------------------------------------------------------------------------------------------------------
// PARAMETERS
//---------------------------------------------------------------------------------------------------------------------

// 0x49 (0x49 - 0x0)
// Function UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage.UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C.OnPlayFabResponse_79EDD2204B16AA0EA88C69B711302AEA
struct UUI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_OnPlayFabResponse_79EDD2204B16AA0EA88C69B711302AEA_Params
{
public:
	struct FPlayFabBaseModel                     Response;                                          // 0x0(0x40)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UObject*                               CustomData;                                        // 0x40(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                         Successful;                                        // 0x48(0x1)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x49 (0x49 - 0x0)
// Function UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage.UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C.OnPlayFabResponse_91B17B844944375F48C46495290C3871
struct UUI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_OnPlayFabResponse_91B17B844944375F48C46495290C3871_Params
{
public:
	struct FPlayFabBaseModel                     Response;                                          // 0x0(0x40)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UObject*                               CustomData;                                        // 0x40(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                         Successful;                                        // 0x48(0x1)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x49 (0x49 - 0x0)
// Function UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage.UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C.OnPlayFabResponse_9D4CB70B444DEABEAC023897329A259A
struct UUI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_OnPlayFabResponse_9D4CB70B444DEABEAC023897329A259A_Params
{
public:
	struct FPlayFabBaseModel                     Response;                                          // 0x0(0x40)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UObject*                               CustomData;                                        // 0x40(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                         Successful;                                        // 0x48(0x1)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x49 (0x49 - 0x0)
// Function UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage.UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C.OnPlayFabResponse_47E1A245465E405069DB68A0FB4D256A
struct UUI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_OnPlayFabResponse_47E1A245465E405069DB68A0FB4D256A_Params
{
public:
	struct FPlayFabBaseModel                     Response;                                          // 0x0(0x40)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UObject*                               CustomData;                                        // 0x40(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                         Successful;                                        // 0x48(0x1)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x49 (0x49 - 0x0)
// Function UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage.UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C.OnPlayFabResponse_4DA677C9456C74A537D3D4AE02ED21D8
struct UUI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_OnPlayFabResponse_4DA677C9456C74A537D3D4AE02ED21D8_Params
{
public:
	struct FPlayFabBaseModel                     Response;                                          // 0x0(0x40)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UObject*                               CustomData;                                        // 0x40(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                         Successful;                                        // 0x48(0x1)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x0 (0x0 - 0x0)
// Function UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage.UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C.BndEvt__UI_MainMenu_Offers_StarterPack_BuyPage_Button_Close_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature
struct UUI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_BndEvt__UI_MainMenu_Offers_StarterPack_BuyPage_Button_Close_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage.UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C.BndEvt__UI_MainMenu_Offers_StarterPack_BuyPage_Button_Close_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature
struct UUI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_BndEvt__UI_MainMenu_Offers_StarterPack_BuyPage_Button_Close_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage.UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C.BndEvt__UI_MainMenu_Offers_StarterPack_BuyPage_Button_Close_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature
struct UUI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_BndEvt__UI_MainMenu_Offers_StarterPack_BuyPage_Button_Close_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage.UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C.BndEvt__UI_MainMenu_Offers_StarterPack_BuyPage_Button_Details_K2Node_ComponentBoundEvent_3_OnButtonPressedEvent__DelegateSignature
struct UUI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_BndEvt__UI_MainMenu_Offers_StarterPack_BuyPage_Button_Details_K2Node_ComponentBoundEvent_3_OnButtonPressedEvent__DelegateSignature_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage.UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C.BndEvt__UI_MainMenu_Offers_StarterPack_BuyPage_Button_Details_K2Node_ComponentBoundEvent_4_OnButtonHoverEvent__DelegateSignature
struct UUI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_BndEvt__UI_MainMenu_Offers_StarterPack_BuyPage_Button_Details_K2Node_ComponentBoundEvent_4_OnButtonHoverEvent__DelegateSignature_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage.UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C.BndEvt__UI_MainMenu_Offers_StarterPack_BuyPage_Button_Details_K2Node_ComponentBoundEvent_5_OnButtonHoverEvent__DelegateSignature
struct UUI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_BndEvt__UI_MainMenu_Offers_StarterPack_BuyPage_Button_Details_K2Node_ComponentBoundEvent_5_OnButtonHoverEvent__DelegateSignature_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage.UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C.BndEvt__UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_Button_Buy_K2Node_ComponentBoundEvent_6_OnButtonPressedEvent__DelegateSignature
struct UUI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_BndEvt__UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_Button_Buy_K2Node_ComponentBoundEvent_6_OnButtonPressedEvent__DelegateSignature_Params
{
public:
};

// 0x48 (0x48 - 0x0)
// Function UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage.UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C.Purchase_Success
struct UUI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_Purchase_Success_Params
{
public:
	struct FClientStartPurchaseResult            Result;                                            // 0x0(0x40)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UObject*                               CustomData;                                        // 0x40(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

// 0x40 (0x40 - 0x0)
// Function UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage.UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C.Purchase_Failure
struct UUI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_Purchase_Failure_Params
{
public:
	struct FPlayFabError                         Error;                                             // 0x0(0x38)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UObject*                               CustomData;                                        // 0x38(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

// 0x80 (0x80 - 0x0)
// Function UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage.UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C.PayForPurchase_Success
struct UUI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_PayForPurchase_Success_Params
{
public:
	struct FClientPayForPurchaseResult           Result;                                            // 0x0(0x78)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UObject*                               CustomData;                                        // 0x78(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

// 0x40 (0x40 - 0x0)
// Function UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage.UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C.PayForPurchase_Failure
struct UUI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_PayForPurchase_Failure_Params
{
public:
	struct FPlayFabError                         Error;                                             // 0x0(0x38)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UObject*                               CustomData;                                        // 0x38(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

// 0x40 (0x40 - 0x0)
// Function UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage.UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C.ConfirmPurchase_Success
struct UUI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_ConfirmPurchase_Success_Params
{
public:
	struct FClientConfirmPurchaseResult          Result;                                            // 0x0(0x38)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UObject*                               CustomData;                                        // 0x38(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

// 0x40 (0x40 - 0x0)
// Function UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage.UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C.ConfirmPurchase_Failure
struct UUI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_ConfirmPurchase_Failure_Params
{
public:
	struct FPlayFabError                         Error;                                             // 0x0(0x38)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UObject*                               CustomData;                                        // 0x38(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

// 0x20 (0x20 - 0x0)
// Function UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage.UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C.WritePlayerEvent_Success
struct UUI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_WritePlayerEvent_Success_Params
{
public:
	struct FClientWriteEventResponse             Result;                                            // 0x0(0x18)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UObject*                               CustomData;                                        // 0x18(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

// 0x40 (0x40 - 0x0)
// Function UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage.UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C.WritePlayerEvent_Failure
struct UUI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_WritePlayerEvent_Failure_Params
{
public:
	struct FPlayFabError                         Error;                                             // 0x0(0x38)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UObject*                               CustomData;                                        // 0x38(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

// 0x18 (0x18 - 0x0)
// Function UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage.UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C.SetOfferAsPurchased_Success
struct UUI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_SetOfferAsPurchased_Success_Params
{
public:
	struct FClientUpdateUserDataResult           Result;                                            // 0x0(0x10)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	class UObject*                               CustomData;                                        // 0x10(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

// 0x40 (0x40 - 0x0)
// Function UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage.UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C.SetOfferAsPurchased_Failure
struct UUI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_SetOfferAsPurchased_Failure_Params
{
public:
	struct FPlayFabError                         Error;                                             // 0x0(0x38)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UObject*                               CustomData;                                        // 0x38(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

// 0x3C (0x3C - 0x0)
// Function UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage.UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C.Tick
struct UUI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_Tick_Params
{
public:
	struct FGeometry                             MyGeometry;                                        // 0x0(0x38)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                        InDeltaTime;                                       // 0x38(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x0 (0x0 - 0x0)
// Function UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage.UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C.Construct
struct UUI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_Construct_Params
{
public:
};

// 0x20 (0x20 - 0x0)
// Function UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage.UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C.MicroTxnAuthorizationResponse_Event
struct UUI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_MicroTxnAuthorizationResponse_Event_Params
{
public:
	struct FMicroTxnAuthorizationResponse        Data;                                              // 0x0(0x20)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};

// 0x9DC (0x9DC - 0x0)
// Function UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage.UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C.ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage
struct UUI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_Params
{
public:
	int32                                        EntryPoint;                                        // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Temp_bool_Variable;                                // 0x4(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2B31[0x3];                                     // Fixing Size After Last Property
	struct FPlayFabBaseModel                     K2Node_CustomEvent_response_3;                     // 0x8(0x40)()
	class UObject*                               K2Node_CustomEvent_customData_13;                  // 0x48(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                         K2Node_CustomEvent_successful_3;                   // 0x50(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2B32[0x3];                                     // Fixing Size After Last Property
	FDelegateProperty_                           K2Node_CreateDelegate_OutputDelegate;              // 0x54(0x10)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                         Temp_bool_Variable_1;                              // 0x64(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2B35[0x3];                                     // Fixing Size After Last Property
	class UObject*                               Temp_object_Variable;                              // 0x68(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPlayFabBaseModel                     Temp_struct_Variable;                              // 0x70(0x40)()
	FDelegateProperty_                           K2Node_CreateDelegate_OutputDelegate_1;            // 0xB0(0x10)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPlayFabBaseModel                     K2Node_CustomEvent_response_2;                     // 0xC0(0x40)()
	class UObject*                               K2Node_CustomEvent_customData_12;                  // 0x100(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                         K2Node_CustomEvent_successful_2;                   // 0x108(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Temp_bool_Variable_2;                              // 0x109(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2B38[0x6];                                     // Fixing Size After Last Property
	class UObject*                               Temp_object_Variable_1;                            // 0x110(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPlayFabBaseModel                     Temp_struct_Variable_1;                            // 0x118(0x40)()
	FDelegateProperty_                           K2Node_CreateDelegate_OutputDelegate_2;            // 0x158(0x10)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	FDelegateProperty_                           K2Node_CreateDelegate_OutputDelegate_3;            // 0x168(0x10)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	FDelegateProperty_                           K2Node_CreateDelegate_OutputDelegate_4;            // 0x178(0x10)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPlayFabBaseModel                     K2Node_CustomEvent_response_1;                     // 0x188(0x40)()
	class UObject*                               K2Node_CustomEvent_customData_11;                  // 0x1C8(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                         K2Node_CustomEvent_successful_1;                   // 0x1D0(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Temp_bool_Variable_3;                              // 0x1D1(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2B3C[0x6];                                     // Fixing Size After Last Property
	class UObject*                               Temp_object_Variable_2;                            // 0x1D8(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPlayFabBaseModel                     Temp_struct_Variable_2;                            // 0x1E0(0x40)()
	FDelegateProperty_                           K2Node_CreateDelegate_OutputDelegate_5;            // 0x220(0x10)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	FDelegateProperty_                           K2Node_CreateDelegate_OutputDelegate_6;            // 0x230(0x10)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	FDelegateProperty_                           K2Node_CreateDelegate_OutputDelegate_7;            // 0x240(0x10)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPlayFabBaseModel                     K2Node_CustomEvent_response;                       // 0x250(0x40)()
	class UObject*                               K2Node_CustomEvent_customData_10;                  // 0x290(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                         K2Node_CustomEvent_successful;                     // 0x298(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Temp_bool_Variable_4;                              // 0x299(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2B41[0x6];                                     // Fixing Size After Last Property
	class UObject*                               Temp_object_Variable_3;                            // 0x2A0(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPlayFabBaseModel                     Temp_struct_Variable_3;                            // 0x2A8(0x40)()
	FDelegateProperty_                           K2Node_CreateDelegate_OutputDelegate_8;            // 0x2E8(0x10)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUser*                                 CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x2F8(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	FDelegateProperty_                           K2Node_CreateDelegate_OutputDelegate_9;            // 0x300(0x10)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUI_Shop_SteamOverlayIsDisabled_C*     CallFunc_Create_ReturnValue;                       // 0x310(0x8)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	FDelegateProperty_                           K2Node_CreateDelegate_OutputDelegate_10;           // 0x318(0x10)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUI_Shop_MicroTxnError_C*              CallFunc_Create_ReturnValue_1;                     // 0x328(0x8)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUI_Shop_MicroTxnError_C*              CallFunc_Create_ReturnValue_2;                     // 0x330(0x8)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUI_Shop_MicroTxnError_C*              CallFunc_Create_ReturnValue_3;                     // 0x338(0x8)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                        Temp_int_Loop_Counter_Variable;                    // 0x340(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        CallFunc_Add_IntInt_ReturnValue;                   // 0x344(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Temp_bool_True_if_break_was_hit_Variable;          // 0x348(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2B47[0x3];                                     // Fixing Size After Last Property
	int32                                        Temp_int_Array_Index_Variable;                     // 0x34C(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         CallFunc_Not_PreBool_ReturnValue;                  // 0x350(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Temp_bool_Variable_5;                              // 0x351(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         CallFunc_Not_PreBool_ReturnValue_1;                // 0x352(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2B4A[0x5];                                     // Fixing Size After Last Property
	class UPlayFabJsonObject*                    CallFunc_ConstructJsonObject_ReturnValue;          // 0x358(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayFabJsonObject*                    K2Node_LowEntry_LocalVariable_Value__Object;       // 0x360(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UPlayFabJsonObject*>            K2Node_MakeArray_Array;                            // 0x368(0x10)(ReferenceParm)
	FDelegateProperty_                           K2Node_CreateDelegate_OutputDelegate_11;           // 0x378(0x10)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FClientStartPurchaseRequest           K2Node_MakeStruct_ClientStartPurchaseRequest;      // 0x388(0x40)()
	FDelegateProperty_                           K2Node_CreateDelegate_OutputDelegate_12;           // 0x3C8(0x10)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FClientStartPurchaseResult            K2Node_CustomEvent_result_4;                       // 0x3D8(0x40)()
	class UObject*                               K2Node_CustomEvent_customData_9;                   // 0x418(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPlayFabError                         K2Node_CustomEvent_error_4;                        // 0x420(0x38)()
	class UObject*                               K2Node_CustomEvent_customData_8;                   // 0x458(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FClientPayForPurchaseResult           K2Node_CustomEvent_result_3;                       // 0x460(0x78)()
	class UObject*                               K2Node_CustomEvent_customData_7;                   // 0x4D8(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPlayFabError                         K2Node_CustomEvent_error_3;                        // 0x4E0(0x38)()
	class UObject*                               K2Node_CustomEvent_customData_6;                   // 0x518(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FClientConfirmPurchaseResult          K2Node_CustomEvent_result_2;                       // 0x520(0x38)()
	class UObject*                               K2Node_CustomEvent_customData_5;                   // 0x558(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPlayFabError                         K2Node_CustomEvent_error_2;                        // 0x560(0x38)()
	class UObject*                               K2Node_CustomEvent_customData_4;                   // 0x598(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayerController*                     CallFunc_GetPlayerController_ReturnValue;          // 0x5A0(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                         CallFunc_NotEqual_IntInt_ReturnValue;              // 0x5A8(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2B58[0x7];                                     // Fixing Size After Last Property
	class UPG_PlayerState_Menu*                  K2Node_DynamicCast_AsPG_Player_State_Menu;         // 0x5B0(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                         K2Node_DynamicCast_bSuccess;                       // 0x5B8(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2B59[0x7];                                     // Fixing Size After Last Property
	struct FClientPayForPurchaseRequest          K2Node_MakeStruct_ClientPayForPurchaseRequest;     // 0x5C0(0x50)()
	class UPlayFabJsonObject*                    CallFunc_GetPlayerCombinedInfo_ReturnValue;        // 0x610(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayFabClientAPI*                     CallFunc_PayForPurchase_ReturnValue;               // 0x618(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayFabJsonObject*                    CallFunc_GetObjectField_ReturnValue;               // 0x620(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_GetNumberField_ReturnValue;               // 0x628(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2B5C[0x4];                                     // Fixing Size After Last Property
	double                                       CallFunc_Add_DoubleDouble_ReturnValue;             // 0x630(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         CallFunc_IsValid_ReturnValue;                      // 0x638(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2B5F[0x7];                                     // Fixing Size After Last Property
	class UPlayFabJsonObject*                    CallFunc_GetPlayerCombinedInfo_ReturnValue_1;      // 0x640(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayFabJsonObject*                    CallFunc_GetObjectField_ReturnValue_1;             // 0x648(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FClientConfirmPurchaseRequest         K2Node_MakeStruct_ClientConfirmPurchaseRequest;    // 0x650(0x20)()
	float                                        CallFunc_GetNumberField_ReturnValue_1;             // 0x670(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2B61[0x4];                                     // Fixing Size After Last Property
	class UPlayFabClientAPI*                     CallFunc_ConfirmPurchase_ReturnValue;              // 0x678(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                       CallFunc_Add_DoubleDouble_ReturnValue_1;           // 0x680(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         CallFunc_IsValid_ReturnValue_1;                    // 0x688(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2B63[0x3];                                     // Fixing Size After Last Property
	FDelegateProperty_                           K2Node_CreateDelegate_OutputDelegate_13;           // 0x68C(0x10)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2B65[0x4];                                     // Fixing Size After Last Property
	TArray<enum class EModifiedData>             K2Node_MakeArray_Array_1;                          // 0x6A0(0x10)(ConstParm, ReferenceParm)
	FDelegateProperty_                           K2Node_CreateDelegate_OutputDelegate_14;           // 0x6B0(0x10)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayFabClientAPI*                     CallFunc_StartPurchase_ReturnValue;                // 0x6C0(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                         CallFunc_IsValid_ReturnValue_2;                    // 0x6C8(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2B68[0x7];                                     // Fixing Size After Last Property
	struct FPlayFabBaseModel                     Temp_struct_Variable_4;                            // 0x6D0(0x40)()
	class UObject*                               Temp_object_Variable_4;                            // 0x710(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayerController*                     CallFunc_GetPlayerController_ReturnValue_1;        // 0x718(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	enum class EUMGSequencePlayMode              Temp_byte_Variable;                                // 0x720(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2B6C[0x7];                                     // Fixing Size After Last Property
	class UBP_PG_PlayerController_Menu_C*        K2Node_DynamicCast_AsBP_PG_Player_Controller_Menu; // 0x728(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                         K2Node_DynamicCast_bSuccess_1;                     // 0x730(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2B6E[0x7];                                     // Fixing Size After Last Property
	struct FClientWriteClientPlayerEventRequest  K2Node_MakeStruct_ClientWriteClientPlayerEventRequest; // 0x738(0x38)()
	class UPlayFabClientAPI*                     CallFunc_WritePlayerEvent_ReturnValue;             // 0x770(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                         CallFunc_IsValid_ReturnValue_3;                    // 0x778(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2B6F[0x7];                                     // Fixing Size After Last Property
	struct FClientWriteEventResponse             K2Node_CustomEvent_result_1;                       // 0x780(0x18)()
	class UObject*                               K2Node_CustomEvent_customData_3;                   // 0x798(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPlayFabError                         K2Node_CustomEvent_error_1;                        // 0x7A0(0x38)()
	class UObject*                               K2Node_CustomEvent_customData_2;                   // 0x7D8(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FClientUpdateUserDataResult           K2Node_CustomEvent_result;                         // 0x7E0(0x10)(NoDestructor)
	class UObject*                               K2Node_CustomEvent_customData_1;                   // 0x7F0(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPlayFabError                         K2Node_CustomEvent_error;                          // 0x7F8(0x38)()
	class UObject*                               K2Node_CustomEvent_customData;                     // 0x830(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayFabJsonObject*                    CallFunc_ConstructJsonObject_ReturnValue_1;        // 0x838(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                         Temp_bool_Variable_6;                              // 0x840(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2B72[0x7];                                     // Fixing Size After Last Property
	class UPlayFabJsonObject*                    K2Node_LowEntry_LocalVariable_Value__1_Object;     // 0x848(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FClientUpdateUserDataRequest          K2Node_MakeStruct_ClientUpdateUserDataRequest;     // 0x850(0x30)()
	class UPlayFabClientAPI*                     CallFunc_UpdateUserData_ReturnValue;               // 0x880(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayerController*                     CallFunc_GetPlayerController_ReturnValue_2;        // 0x888(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_PG_PlayerController_Menu_C*        K2Node_DynamicCast_AsBP_PG_Player_Controller_Menu_1; // 0x890(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                         K2Node_DynamicCast_bSuccess_2;                     // 0x898(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         CallFunc_IsValid_ReturnValue_4;                    // 0x899(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class EUMGSequencePlayMode              Temp_byte_Variable_1;                              // 0x89A(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class EUMGSequencePlayMode              K2Node_Select_Default;                             // 0x89B(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2B79[0x4];                                     // Fixing Size After Last Property
	TArray<class UWidget*>                       CallFunc_GetAllChildren_ReturnValue;               // 0x8A0(0x10)(ReferenceParm, ContainsInstancedReference)
	class UUMGSequencePlayer*                    CallFunc_PlayAnimation_ReturnValue;                // 0x8B0(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidget*                               CallFunc_Array_Get_Item;                           // 0x8B8(0x8)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                        CallFunc_Array_Length_ReturnValue;                 // 0x8C0(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2B7B[0x4];                                     // Fixing Size After Last Property
	class UUI_MainMenu_Shop_Premium_Offers_StarterPack_C* K2Node_DynamicCast_AsUI_Main_Menu_Shop_Premium_Offers_Starter_Pack; // 0x8C8(0x8)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                         K2Node_DynamicCast_bSuccess_3;                     // 0x8D0(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         CallFunc_Less_IntInt_ReturnValue;                  // 0x8D1(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         CallFunc_BooleanAND_ReturnValue;                   // 0x8D2(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2B7D[0x5];                                     // Fixing Size After Last Property
	class UClass*                                CallFunc_GetObjectClass_ReturnValue;               // 0x8D8(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                         CallFunc_EqualEqual_ClassClass_ReturnValue;        // 0x8E0(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2B7E[0x7];                                     // Fixing Size After Last Property
	struct FPlayFabBaseModel                     K2Node_CustomEvent_response_4;                     // 0x8E8(0x40)()
	class UObject*                               K2Node_CustomEvent_customData_14;                  // 0x928(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                         K2Node_CustomEvent_successful_4;                   // 0x930(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2B80[0x3];                                     // Fixing Size After Last Property
	struct FGeometry                             K2Node_Event_MyGeometry;                           // 0x934(0x38)(IsPlainOldData, NoDestructor)
	float                                        K2Node_Event_InDeltaTime;                          // 0x96C(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FDelegateProperty_                           K2Node_CreateDelegate_OutputDelegate_15;           // 0x970(0x10)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                  CallFunc_GetText_ReturnValue;                      // 0x980(0x18)()
	struct FMicroTxnAuthorizationResponse        K2Node_CustomEvent_Data;                           // 0x998(0x20)(ConstParm)
	bool                                         CallFunc_IsOverlayEnabled_ReturnValue;             // 0x9B8(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2B84[0x7];                                     // Fixing Size After Last Property
	double                                       CallFunc_Add_DoubleDouble_A_ImplicitCast;          // 0x9C0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_SetNumberField_Number_ImplicitCast;       // 0x9C8(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2B85[0x4];                                     // Fixing Size After Last Property
	double                                       CallFunc_Add_DoubleDouble_A_ImplicitCast_1;        // 0x9D0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_SetNumberField_Number_ImplicitCast_1;     // 0x9D8(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}
}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
