#pragma once

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0xD8 (0x358 - 0x280)
// WidgetBlueprintGeneratedClass UI_Shop_Crowns_Item.UI_Shop_Crowns_Item_C
class UUI_Shop_Crowns_Item_C : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0x280(0x8)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                      Hover;                                             // 0x288(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                               Border_Bonus;                                      // 0x290(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                               Border_Price;                                      // 0x298(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                               Button;                                            // 0x2A0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNamedSlot*                            NamedSlot_Icon;                                    // 0x2A8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                              Overlay_Discount;                                  // 0x2B0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                              Overlay_Loading;                                   // 0x2B8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                            TextBlock_Bonus;                                   // 0x2C0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                            TextBlock_CrownsWithoutBonus;                      // 0x2C8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                            TextBlock_DiscountPercent;                         // 0x2D0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                            TextBlock_Price;                                   // 0x2D8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                            TextBlock_Price_Discount_1;                        // 0x2E0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                            TextBlock_Price_Discount_2;                        // 0x2E8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                            TextBlock_Price_WithoutDiscount;                   // 0x2F0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                            TextBlock_TotalCrownsNumber;                       // 0x2F8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                       WidgetSwitcher_Discount;                           // 0x300(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FString                                ItemId;                                            // 0x308(0x10)(Edit, BlueprintVisible, ZeroConstructor, ExposeOnSpawn, HasGetValueTypeHash)
	int32                                        TotalCrownsNumber;                                 // 0x318(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	int32                                        CrownsWithoutBonus;                                // 0x31C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	int32                                        Bonus;                                             // 0x320(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                        Pad_1CF8[0x4];                                     // Fixing Size After Last Property
	double                                       Price;                                             // 0x328(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	int32                                        DiscountPercent;                                   // 0x330(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                        Pad_1CFA[0x4];                                     // Fixing Size After Last Property
	double                                       DiscountPrice;                                     // 0x338(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UUI_Shop_Crowns_C*                     UI_Shop_Crowns;                                    // 0x340(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FString                                Order_Id;                                          // 0x348(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("UI_Shop_Crowns_Item_C");
		return Clss;
	}

	void SetDiscount(bool L_IsDiscount, bool Temp_bool_Variable, int32 Temp_int_Variable, int32 Temp_int_Variable_1, bool Temp_bool_Variable_1, enum class ESlateVisibility Temp_byte_Variable, enum class ESlateVisibility Temp_byte_Variable_1, enum class ESlateVisibility K2Node_Select_Default, class FText CallFunc_Conv_IntToText_ReturnValue, class FText CallFunc_Conv_DoubleToText_ReturnValue, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData, TArray<struct FFormatArgumentData>& K2Node_MakeArray_Array, class FText CallFunc_Format_ReturnValue, int32 K2Node_Select_Default_1, bool CallFunc_Greater_IntInt_ReturnValue);
	void SetBonus(bool CallFunc_Greater_IntInt_ReturnValue, class FText CallFunc_Conv_IntToText_ReturnValue, class FText CallFunc_Conv_IntToText_ReturnValue_1);
	void OnPlayFabResponse_8FF17DFE47662354390851B40CE7A6A6(const struct FPlayFabBaseModel& Response, class UObject* CustomData, bool Successful);
	void OnPlayFabResponse_E7BE812F4BBB1C03839795A8891966FB(const struct FPlayFabBaseModel& Response, class UObject* CustomData, bool Successful);
	void OnPlayFabResponse_8E7A22C04F75F649687D6193EC60EAD0(const struct FPlayFabBaseModel& Response, class UObject* CustomData, bool Successful);
	void OnPlayFabResponse_505E19444069D91671DEA5A093837AA7(const struct FPlayFabBaseModel& Response, class UObject* CustomData, bool Successful);
	void PreConstruct(bool IsDesignTime);
	void BndEvt__UI_Shop_Crowns_Item_Button_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__UI_Shop_Crowns_Item_Button_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__UI_Shop_Crowns_Item_Button_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature();
	void StartPurchase_Success(const struct FClientStartPurchaseResult& Result, class UObject* CustomData);
	void StartPurchase_Failure(const struct FPlayFabError& Error, class UObject* CustomData);
	void PayForPurchase_Success(const struct FClientPayForPurchaseResult& Result, class UObject* CustomData);
	void PayForPurchase_Failure(const struct FPlayFabError& Error, class UObject* CustomData);
	void ConfirmPurchase_Success(const struct FClientConfirmPurchaseResult& Result, class UObject* CustomData);
	void ConfirmPurchase_Failure(const struct FPlayFabError& Error, class UObject* CustomData);
	void WriteEvent_Error(int32 Stage, struct FPlayFabError& PlayFabError);
	void WritePlayerEvent_Error_Success(const struct FClientWriteEventResponse& Result, class UObject* CustomData);
	void WritePlayerEvent_Error_Failure(const struct FPlayFabError& Error, class UObject* CustomData);
	void Construct();
	void MicroTxnAuthorizationResponse_Event(struct FMicroTxnAuthorizationResponse& Data);
	void ExecuteUbergraph_UI_Shop_Crowns_Item(int32 EntryPoint, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate, const struct FPlayFabBaseModel& Temp_struct_Variable, const struct FPlayFabBaseModel& K2Node_CustomEvent_response_1, class UObject* K2Node_CustomEvent_customData_9, bool K2Node_CustomEvent_successful_1, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_1, bool Temp_bool_Variable, class UObject* Temp_object_Variable, const struct FPlayFabBaseModel& Temp_struct_Variable_1, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_2, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_3, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_4, const struct FPlayFabBaseModel& K2Node_CustomEvent_response, class UObject* K2Node_CustomEvent_customData_8, bool K2Node_CustomEvent_successful, bool Temp_bool_Variable_1, class UObject* Temp_object_Variable_1, const struct FPlayFabBaseModel& Temp_struct_Variable_2, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_5, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_6, const struct FClientPayForPurchaseRequest& K2Node_MakeStruct_ClientPayForPurchaseRequest, class UUser* CallFunc_GetGameInstanceSubsystem_ReturnValue, class UUI_Shop_SteamOverlayIsDisabled_C* CallFunc_Create_ReturnValue, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_7, class UUI_Shop_MicroTxnError_C* CallFunc_Create_ReturnValue_1, class UUI_Shop_MicroTxnError_C* CallFunc_Create_ReturnValue_2, class UUI_Shop_MicroTxnError_C* CallFunc_Create_ReturnValue_3, bool K2Node_Event_IsDesignTime, class FText CallFunc_Conv_IntToText_ReturnValue, class FText CallFunc_Conv_DoubleToText_ReturnValue, class UPlayFabJsonObject* CallFunc_ConstructJsonObject_ReturnValue, class UObject* Temp_object_Variable_2, class UPlayFabJsonObject* K2Node_LowEntry_LocalVariable_Value__Object, bool Temp_bool_Variable_2, TArray<class UPlayFabJsonObject*>& K2Node_MakeArray_Array, const struct FClientStartPurchaseRequest& K2Node_MakeStruct_ClientStartPurchaseRequest, const struct FClientStartPurchaseResult& K2Node_CustomEvent_result_3, class UObject* K2Node_CustomEvent_customData_7, const struct FPlayFabError& K2Node_CustomEvent_error_3, class UObject* K2Node_CustomEvent_customData_6, const struct FClientPayForPurchaseResult& K2Node_CustomEvent_result_2, class UObject* K2Node_CustomEvent_customData_5, const struct FPlayFabError& K2Node_CustomEvent_error_2, class UObject* K2Node_CustomEvent_customData_4, const struct FClientConfirmPurchaseResult& K2Node_CustomEvent_result_1, class UObject* K2Node_CustomEvent_customData_3, const struct FPlayFabError& K2Node_CustomEvent_error_1, class UObject* K2Node_CustomEvent_customData_2, class UPlayerController* CallFunc_GetPlayerController_ReturnValue, bool CallFunc_NotEqual_IntInt_ReturnValue, class UPG_PlayerState_Menu* K2Node_DynamicCast_AsPG_Player_State_Menu, bool K2Node_DynamicCast_bSuccess, class UPlayFabJsonObject* CallFunc_GetPlayerCombinedInfo_ReturnValue, const struct FPlayFabBaseModel& K2Node_CustomEvent_response_2, class UObject* K2Node_CustomEvent_customData_10, bool K2Node_CustomEvent_successful_2, class UPlayFabJsonObject* CallFunc_GetObjectField_ReturnValue, float CallFunc_GetNumberField_ReturnValue, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_8, double CallFunc_Conv_IntToDouble_ReturnValue, class UUMGSequencePlayer* CallFunc_PlayAnimationForward_ReturnValue, double CallFunc_Add_DoubleDouble_ReturnValue, class UUMGSequencePlayer* CallFunc_PlayAnimationReverse_ReturnValue, class UPlayFabJsonObject* CallFunc_ConstructJsonObject_ReturnValue_1, int32 K2Node_CustomEvent_Stage, const struct FPlayFabError& K2Node_CustomEvent_PlayFabError, class UPlayFabJsonObject* K2Node_LowEntry_LocalVariable_Value__1_Object, const struct FClientWriteClientPlayerEventRequest& K2Node_MakeStruct_ClientWriteClientPlayerEventRequest, class UPlayFabClientAPI* CallFunc_WritePlayerEvent_ReturnValue, bool CallFunc_IsEmpty_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue, bool CallFunc_IsValid_ReturnValue, bool CallFunc_IsEmpty_ReturnValue_1, bool CallFunc_Not_PreBool_ReturnValue_1, bool CallFunc_IsEmpty_ReturnValue_2, bool CallFunc_Not_PreBool_ReturnValue_2, double CallFunc_Conv_IntToDouble_ReturnValue_1, double CallFunc_Conv_IntToDouble_ReturnValue_2, const struct FClientWriteEventResponse& K2Node_CustomEvent_result, class UObject* K2Node_CustomEvent_customData_1, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_9, const struct FPlayFabError& K2Node_CustomEvent_error, class UObject* K2Node_CustomEvent_customData, class UPlayerController* CallFunc_GetPlayerController_ReturnValue_1, class UBP_PG_PlayerController_Menu_C* K2Node_DynamicCast_AsBP_PG_Player_Controller_Menu, bool K2Node_DynamicCast_bSuccess_1, TArray<enum class EModifiedData>& K2Node_MakeArray_Array_1, bool CallFunc_GetIsEnabled_ReturnValue, const struct FMicroTxnAuthorizationResponse& K2Node_CustomEvent_Data, bool CallFunc_IsOverlayEnabled_ReturnValue, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_10, class UPlayFabClientAPI* CallFunc_StartPurchase_ReturnValue, bool CallFunc_IsValid_ReturnValue_1, const struct FClientConfirmPurchaseRequest& K2Node_MakeStruct_ClientConfirmPurchaseRequest, class UPlayFabClientAPI* CallFunc_ConfirmPurchase_ReturnValue, bool CallFunc_IsValid_ReturnValue_2, const struct FPlayFabError& K2Node_MakeStruct_PlayFabError, const struct FPlayFabError& K2Node_MakeStruct_PlayFabError_1, const struct FPlayFabBaseModel& Temp_struct_Variable_3, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_11, class UObject* Temp_object_Variable_3, class UPlayFabClientAPI* CallFunc_PayForPurchase_ReturnValue, bool CallFunc_IsValid_ReturnValue_3, bool Temp_bool_Variable_3, const struct FPlayFabBaseModel& K2Node_CustomEvent_response_3, class UObject* K2Node_CustomEvent_customData_11, bool K2Node_CustomEvent_successful_3, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_12, double CallFunc_Add_DoubleDouble_A_ImplicitCast, float CallFunc_SetNumberField_Number_ImplicitCast, float CallFunc_SetNumberField_Number_ImplicitCast_1, float CallFunc_SetNumberField_Number_ImplicitCast_2);
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
