#pragma once

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

#include "../SDK.hpp"

namespace SDK
{
namespace Params
{
//---------------------------------------------------------------------------------------------------------------------
// PARAMETERS
//---------------------------------------------------------------------------------------------------------------------

// 0x0 (0x0 - 0x0)
// Function UI_Shop_Featured.UI_Shop_Featured_C.BndEvt__UI_Shop_BestOffers_Button_BattlePass_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature
struct UUI_Shop_Featured_C_BndEvt__UI_Shop_BestOffers_Button_BattlePass_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function UI_Shop_Featured.UI_Shop_Featured_C.BndEvt__UI_Shop_BestOffers_Button_BattlePass_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature
struct UUI_Shop_Featured_C_BndEvt__UI_Shop_BestOffers_Button_BattlePass_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function UI_Shop_Featured.UI_Shop_Featured_C.BndEvt__UI_Shop_BestOffers_Button_BattlePass_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature
struct UUI_Shop_Featured_C_BndEvt__UI_Shop_BestOffers_Button_BattlePass_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function UI_Shop_Featured.UI_Shop_Featured_C.BndEvt__UI_Shop_BestOffers_Button_VIP_K2Node_ComponentBoundEvent_3_OnButtonHoverEvent__DelegateSignature
struct UUI_Shop_Featured_C_BndEvt__UI_Shop_BestOffers_Button_VIP_K2Node_ComponentBoundEvent_3_OnButtonHoverEvent__DelegateSignature_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function UI_Shop_Featured.UI_Shop_Featured_C.BndEvt__UI_Shop_BestOffers_Button_VIP_K2Node_ComponentBoundEvent_4_OnButtonHoverEvent__DelegateSignature
struct UUI_Shop_Featured_C_BndEvt__UI_Shop_BestOffers_Button_VIP_K2Node_ComponentBoundEvent_4_OnButtonHoverEvent__DelegateSignature_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function UI_Shop_Featured.UI_Shop_Featured_C.BndEvt__UI_Shop_BestOffers_Button_VIP_K2Node_ComponentBoundEvent_5_OnButtonClickedEvent__DelegateSignature
struct UUI_Shop_Featured_C_BndEvt__UI_Shop_BestOffers_Button_VIP_K2Node_ComponentBoundEvent_5_OnButtonClickedEvent__DelegateSignature_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function UI_Shop_Featured.UI_Shop_Featured_C.BndEvt__UI_Shop_BestOffers_Button_Crowns_K2Node_ComponentBoundEvent_6_OnButtonHoverEvent__DelegateSignature
struct UUI_Shop_Featured_C_BndEvt__UI_Shop_BestOffers_Button_Crowns_K2Node_ComponentBoundEvent_6_OnButtonHoverEvent__DelegateSignature_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function UI_Shop_Featured.UI_Shop_Featured_C.BndEvt__UI_Shop_BestOffers_Button_Crowns_K2Node_ComponentBoundEvent_7_OnButtonHoverEvent__DelegateSignature
struct UUI_Shop_Featured_C_BndEvt__UI_Shop_BestOffers_Button_Crowns_K2Node_ComponentBoundEvent_7_OnButtonHoverEvent__DelegateSignature_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function UI_Shop_Featured.UI_Shop_Featured_C.BndEvt__UI_Shop_BestOffers_Button_Crowns_K2Node_ComponentBoundEvent_8_OnButtonClickedEvent__DelegateSignature
struct UUI_Shop_Featured_C_BndEvt__UI_Shop_BestOffers_Button_Crowns_K2Node_ComponentBoundEvent_8_OnButtonClickedEvent__DelegateSignature_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function UI_Shop_Featured.UI_Shop_Featured_C.BndEvt__UI_Shop_BestOffers_Button_Safari_K2Node_ComponentBoundEvent_9_OnButtonClickedEvent__DelegateSignature
struct UUI_Shop_Featured_C_BndEvt__UI_Shop_BestOffers_Button_Safari_K2Node_ComponentBoundEvent_9_OnButtonClickedEvent__DelegateSignature_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function UI_Shop_Featured.UI_Shop_Featured_C.BndEvt__UI_Shop_BestOffers_Button_Safari_K2Node_ComponentBoundEvent_11_OnButtonHoverEvent__DelegateSignature
struct UUI_Shop_Featured_C_BndEvt__UI_Shop_BestOffers_Button_Safari_K2Node_ComponentBoundEvent_11_OnButtonHoverEvent__DelegateSignature_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function UI_Shop_Featured.UI_Shop_Featured_C.BndEvt__UI_Shop_BestOffers_Button_Safari_K2Node_ComponentBoundEvent_12_OnButtonHoverEvent__DelegateSignature
struct UUI_Shop_Featured_C_BndEvt__UI_Shop_BestOffers_Button_Safari_K2Node_ComponentBoundEvent_12_OnButtonHoverEvent__DelegateSignature_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function UI_Shop_Featured.UI_Shop_Featured_C.BndEvt__UI_Shop_BestOffers_Button_Jokey_K2Node_ComponentBoundEvent_10_OnButtonHoverEvent__DelegateSignature
struct UUI_Shop_Featured_C_BndEvt__UI_Shop_BestOffers_Button_Jokey_K2Node_ComponentBoundEvent_10_OnButtonHoverEvent__DelegateSignature_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function UI_Shop_Featured.UI_Shop_Featured_C.BndEvt__UI_Shop_BestOffers_Button_Jokey_K2Node_ComponentBoundEvent_13_OnButtonHoverEvent__DelegateSignature
struct UUI_Shop_Featured_C_BndEvt__UI_Shop_BestOffers_Button_Jokey_K2Node_ComponentBoundEvent_13_OnButtonHoverEvent__DelegateSignature_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function UI_Shop_Featured.UI_Shop_Featured_C.BndEvt__UI_Shop_BestOffers_Button_Base_K2Node_ComponentBoundEvent_14_OnButtonHoverEvent__DelegateSignature
struct UUI_Shop_Featured_C_BndEvt__UI_Shop_BestOffers_Button_Base_K2Node_ComponentBoundEvent_14_OnButtonHoverEvent__DelegateSignature_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function UI_Shop_Featured.UI_Shop_Featured_C.BndEvt__UI_Shop_BestOffers_Button_Base_K2Node_ComponentBoundEvent_15_OnButtonHoverEvent__DelegateSignature
struct UUI_Shop_Featured_C_BndEvt__UI_Shop_BestOffers_Button_Base_K2Node_ComponentBoundEvent_15_OnButtonHoverEvent__DelegateSignature_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function UI_Shop_Featured.UI_Shop_Featured_C.BndEvt__UI_Shop_BestOffers_Button_Jokey_K2Node_ComponentBoundEvent_16_OnButtonClickedEvent__DelegateSignature
struct UUI_Shop_Featured_C_BndEvt__UI_Shop_BestOffers_Button_Jokey_K2Node_ComponentBoundEvent_16_OnButtonClickedEvent__DelegateSignature_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function UI_Shop_Featured.UI_Shop_Featured_C.BndEvt__UI_Shop_BestOffers_Button_Base_K2Node_ComponentBoundEvent_17_OnButtonClickedEvent__DelegateSignature
struct UUI_Shop_Featured_C_BndEvt__UI_Shop_BestOffers_Button_Base_K2Node_ComponentBoundEvent_17_OnButtonClickedEvent__DelegateSignature_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function UI_Shop_Featured.UI_Shop_Featured_C.Construct
struct UUI_Shop_Featured_C_Construct_Params
{
public:
};

// 0x491 (0x491 - 0x0)
// Function UI_Shop_Featured.UI_Shop_Featured_C.ExecuteUbergraph_UI_Shop_Featured
struct UUI_Shop_Featured_C_ExecuteUbergraph_UI_Shop_Featured_Params
{
public:
	int32                                        EntryPoint;                                        // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_10D5[0x4];                                     // Fixing Size After Last Property
	class UUI_Menu_GeneralMenuScreen_C*          CallFunc_FindParentWidgetOfType_ReturnValue;       // 0x8(0x8)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                    CallFunc_PlayAnimationForward_ReturnValue;         // 0x10(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                    CallFunc_PlayAnimationReverse_ReturnValue;         // 0x18(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                    CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x20(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                    CallFunc_PlayAnimationReverse_ReturnValue_1;       // 0x28(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                           K2Node_MakeStruct_SlateColor;                      // 0x30(0x14)()
	struct FMargin                               K2Node_MakeStruct_Margin;                          // 0x44(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_10D9[0xC];                                     // Fixing Size After Last Property
	struct FSlateBrush                           K2Node_MakeStruct_SlateBrush;                      // 0x60(0xD0)()
	struct FSlateColor                           K2Node_MakeStruct_SlateColor_1;                    // 0x130(0x14)()
	struct FMargin                               K2Node_MakeStruct_Margin_1;                        // 0x144(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_10DB[0xC];                                     // Fixing Size After Last Property
	struct FSlateBrush                           K2Node_MakeStruct_SlateBrush_1;                    // 0x160(0xD0)()
	struct FSlateColor                           K2Node_MakeStruct_SlateColor_2;                    // 0x230(0x14)()
	struct FMargin                               K2Node_MakeStruct_Margin_2;                        // 0x244(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_10DC[0xC];                                     // Fixing Size After Last Property
	struct FSlateBrush                           K2Node_MakeStruct_SlateBrush_2;                    // 0x260(0xD0)()
	class UUMGSequencePlayer*                    CallFunc_PlayAnimationForward_ReturnValue_2;       // 0x330(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                           K2Node_MakeStruct_SlateColor_3;                    // 0x338(0x14)()
	struct FMargin                               K2Node_MakeStruct_Margin_3;                        // 0x34C(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_10DE[0x4];                                     // Fixing Size After Last Property
	struct FSlateBrush                           K2Node_MakeStruct_SlateBrush_3;                    // 0x360(0xD0)()
	class UUMGSequencePlayer*                    CallFunc_PlayAnimationReverse_ReturnValue_2;       // 0x430(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayerController*                     CallFunc_GetPlayerController_ReturnValue;          // 0x438(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_PG_PlayerController_Menu_C*        K2Node_DynamicCast_AsBP_PG_Player_Controller_Menu; // 0x440(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                         K2Node_DynamicCast_bSuccess;                       // 0x448(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_10E2[0x7];                                     // Fixing Size After Last Property
	class UUMGSequencePlayer*                    CallFunc_PlayAnimationReverse_ReturnValue_3;       // 0x450(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                    CallFunc_PlayAnimationForward_ReturnValue_3;       // 0x458(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                    CallFunc_PlayAnimationReverse_ReturnValue_4;       // 0x460(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                    CallFunc_PlayAnimationForward_ReturnValue_4;       // 0x468(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                    CallFunc_PlayAnimationReverse_ReturnValue_5;       // 0x470(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                    CallFunc_PlayAnimationForward_ReturnValue_5;       // 0x478(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayerController*                     CallFunc_GetPlayerController_ReturnValue_1;        // 0x480(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_PG_PlayerController_Menu_C*        K2Node_DynamicCast_AsBP_PG_Player_Controller_Menu_1; // 0x488(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                         K2Node_DynamicCast_bSuccess_1;                     // 0x490(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}
}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
