#pragma once

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x348 (0xF70 - 0xC28)
// BlueprintGeneratedClass BP_GrindingComponent.BP_GrindingComponent_C
class UBP_GrindingComponent_C : public UFortPawnComponent_GrindRail
{
public:
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0xC28(0x8)(ZeroConstructor, Transient, DuplicateTransient)
	class UPlayerPawn_Athena_C*                  Player;                                            // 0xC30(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UCharacterMovementComponent*           MovementComponent;                                 // 0xC38(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                         Grinding;                                          // 0xC40(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_A2A3[0x3];                                     // Fixing Size After Last Property
	float                                        Delta_Seconds;                                     // 0xC44(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTacticalSprintEnergyComponent_C*      SprintComponent;                                   // 0xC48(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                          GC_Sprint;                                         // 0xC50(0x4)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_A2A4[0x4];                                     // Fixing Size After Last Property
	class USkeletalMeshComponent*                PlayerMesh;                                        // 0xC58(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                         CurrentlyADS;                                      // 0xC60(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         AnimLayerActive;                                   // 0xC61(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_A2A5[0x6];                                     // Fixing Size After Last Property
	double                                       LastRailSwitchTime;                                // 0xC68(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_            JumpedOff;                                         // 0xC70(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UBGA_GrindRail_C*                      CurrentRail;                                       // 0xC80(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                       MaximumAngleForSideJump;                           // 0xC88(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        SideJump_NumberOfNewLocationsToTry;                // 0xC90(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_A2A6[0x4];                                     // Fixing Size After Last Property
	double                                       SideJump_MinSpeedPercentToMaintain;                // 0xC98(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       SideJump_MaxSpeedWithoutAnchor;                    // 0xCA0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         DrawAnchorDebug;                                   // 0xCA8(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_A2A7[0x7];                                     // Fixing Size After Last Property
	struct FScalableFloat                        SF_Sprinting_EnergyToUsePerSecond;                 // 0xCB0(0x28)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                        SF_Sprinting_EnergyToUsePerSecond_Creative;        // 0xCD8(0x28)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                        SF_LandingSpeedBoost;                              // 0xD00(0x28)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                        SF_SameRailAnchoring_MaxForwardDistanceMultiplier; // 0xD28(0x28)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                        SF_SameRailAnchoring_MaxAngle;                     // 0xD50(0x28)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                        SF_InfluenceOfMomentumOnAnchorJump;                // 0xD78(0x28)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                        SF_NoAnchorJumpDistanceMultiplier;                 // 0xDA0(0x28)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                        SF_MinJumpOffSpeed;                                // 0xDC8(0x28)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                        SF_JumpHeight;                                     // 0xDF0(0x28)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                        SF_JumpDistanceMultiplier;                         // 0xE18(0x28)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                        SF_SpeedMultiplierWhenImpactedPlayer;              // 0xE40(0x28)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                        SF_SideJump_HorizontalAngleMultiplier;             // 0xE68(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_A2A8[0x4];                                     // Fixing Size After Last Property
	double                                       LastJumpedTime;                                    // 0xE70(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class EGrindRailBoosterMode             _new__PreviousBoosterMode;                         // 0xE78(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         _new__GenerallyAccelerating;                       // 0xE79(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_A2A9[0x2];                                     // Fixing Size After Last Property
	struct FGameplayTag                          GC_GenerallyAccelerating;                          // 0xE7C(0x4)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                 BeginGrindBlockTags;                               // 0xE80(0x20)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FVector                               CameraLocationOnStartedGrinding;                   // 0xEA0(0x18)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortGrindRail*                        WaitingForCamera_SavedGrindRail;                   // 0xEB8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                         WaitingForCamera;                                  // 0xEC0(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_A2AA[0x7];                                     // Fixing Size After Last Property
	class UCameraModifier_Grinding_C*            CameraModifier;                                    // 0xEC8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                         StartedGrindFromLand;                              // 0xED0(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_A2AB[0x7];                                     // Fixing Size After Last Property
	FMulticastInlineDelegateProperty_            OnFeetLanded;                                      // 0xED8(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FScalableFloat                        SF_MinBounceOffPlayerSpeed;                        // 0xEE8(0x28)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                         IgnoreStaticPlacedBuilding;                        // 0xF10(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         UseNativizedGrindingIgnoreActors;                  // 0xF11(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         UseNativizedSprintInput;                           // 0xF12(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_A2AC[0x1];                                     // Fixing Size After Last Property
	struct FGameplayTag                          Start_Grinding_Event_Tag;                          // 0xF14(0x4)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                          Stop_Grinding_Event_Tag;                           // 0xF18(0x4)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                          Start_Sprinting_Event_Tag;                         // 0xF1C(0x4)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                         AudioLandedPlayed;                                 // 0xF20(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         SoundLibraryAdded;                                 // 0xF21(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_A2AD[0x6];                                     // Fixing Size After Last Property
	double                                       CurrentMaxSpeed;                                   // 0xF28(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         HitObstacle;                                       // 0xF30(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_A2AE[0x7];                                     // Fixing Size After Last Property
	class UAudioComponent*                       JumpOnAudio;                                       // 0xF38(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                          RemoveIsGrindingTimer;                             // 0xF40(0x8)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                        SF_RemoveGASmashAfterDelay;                        // 0xF48(0x28)(Edit, BlueprintVisible, DisableEditOnInstance)

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("BP_GrindingComponent_C");
		return Clss;
	}

	void ApplyDamageToDevice(class UBuildingActor* BuildingActor, double TemporaryMoveIgnoreDuration, class UAbilitySystemComponent* CallFunc_GetAbilitySystemComponent_ReturnValue, bool CallFunc_IsValid_ReturnValue, class UAbilitySystemComponent* CallFunc_GetAbilitySystemComponent_ReturnValue_1, const struct FGameplayEffectContextHandle& CallFunc_MakeEffectContext_ReturnValue, const struct FGameplayEffectSpecHandle& CallFunc_MakeOutgoingSpec_ReturnValue, const struct FActiveGameplayEffectHandle& CallFunc_BP_ApplyGameplayEffectSpecToTarget_ReturnValue, float CallFunc_AddTemporaryMoveIgnoreActor_IgnoreDuration_ImplicitCast);
