#pragma once

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x1A8 (0xB68 - 0x9C0)
// BlueprintGeneratedClass CameraModifier_Grinding.CameraModifier_Grinding_C
class UCameraModifier_Grinding_C : public UFortCameraModifier_Grinding
{
public:
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0x9C0(0x8)(ZeroConstructor, Transient, DuplicateTransient)
	class UBP_GrindingComponent_C*               GrindingComp;                                      // 0x9C8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                       CurrentForward;                                    // 0x9D0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       CurrentRight;                                      // 0x9D8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       CurrentLean;                                       // 0x9E0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       CurrentFOV;                                        // 0x9E8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       CurrentOffset;                                     // 0x9F0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                               CurrentOffset_Vec;                                 // 0x9F8(0x18)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       CurrentUp;                                         // 0xA10(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                               SavedLocation;                                     // 0xA18(0x18)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         LocationLocked;                                    // 0xA30(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2F9C[0x7];                                     // Fixing Size After Last Property
	double                                       TimeWhenLocked;                                    // 0xA38(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       TimeWhenUnlocked;                                  // 0xA40(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        ADS_Alpha;                                         // 0xA48(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2F9E[0x4];                                     // Fixing Size After Last Property
	class UCurveFloat*                           AlphaCurve;                                        // 0xA50(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FVector                               StartingLocation;                                  // 0xA58(0x18)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         TurningOff;                                        // 0xA70(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         SF_SnapToGrindingLocation;                         // 0xA71(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2F9F[0x6];                                     // Fixing Size After Last Property
	struct FScalableFloat                        BaseRightOffsetMultiplier;                         // 0xA78(0x28)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                        SprintingRightOffsetMultiplier;                    // 0xAA0(0x28)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                        BoostedRightOffsetMultiplier;                      // 0xAC8(0x28)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                        BaseUpOffsetMultiplier;                            // 0xAF0(0x28)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                        SprintingUpOffsetMultiplier;                       // 0xB18(0x28)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                        BoostedUpOffsetMultiplier;                         // 0xB40(0x28)(Edit, BlueprintVisible, DisableEditOnInstance)

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("CameraModifier_Grinding_C");
		return Clss;
	}

	void SetStartingLocation(const struct FVector& StartingLocation);
	void BlueprintModifyCamera(float DeltaTime, const struct FVector& ViewLocation, const struct FRotator& ViewRotation, float FOV, struct FVector* NewViewLocation, struct FRotator* NewViewRotation, float* NewFOV, double CurrentStraightness, double UpSpeed, double RightSpeed, double ForwardSpeed, const struct FVector& CallFunc_Conv_DoubleToVector_ReturnValue, float CallFunc_GetFloatValue_ReturnValue, const struct FVector& CallFunc_Conv_DoubleToVector_ReturnValue_1, float CallFunc_GetFloatValue_ReturnValue_1, const struct FVector& CallFunc_Conv_DoubleToVector_ReturnValue_2, float CallFunc_GetFloatValue_ReturnValue_2, double CallFunc_BreakVector2D_X, double CallFunc_BreakVector2D_Y, const struct FVector& CallFunc_Conv_DoubleToVector_ReturnValue_3, double CallFunc_Subtract_DoubleDouble_ReturnValue, double CallFunc_BreakVector2D_X_1, double CallFunc_BreakVector2D_Y_1, double CallFunc_BreakVector2D_X_2, double CallFunc_BreakVector2D_Y_2, double CallFunc_Subtract_DoubleDouble_ReturnValue_1, double CallFunc_Subtract_DoubleDouble_ReturnValue_2, double CallFunc_BreakVector2D_X_3, double CallFunc_BreakVector2D_Y_3, const struct FVector& CallFunc_Conv_DoubleToVector_ReturnValue_4, double CallFunc_Subtract_DoubleDouble_ReturnValue_3, double CallFunc_BreakVector2D_X_4, double CallFunc_BreakVector2D_Y_4, double CallFunc_BreakVector2D_X_5, double CallFunc_BreakVector2D_Y_5, double CallFunc_Subtract_DoubleDouble_ReturnValue_4, double CallFunc_Subtract_DoubleDouble_ReturnValue_5, double CallFunc_BreakVector2D_X_6, double CallFunc_BreakVector2D_Y_6, double CallFunc_BreakVector2D_X_7, double CallFunc_BreakVector2D_Y_7, double CallFunc_Subtract_DoubleDouble_ReturnValue_6, double CallFunc_Subtract_DoubleDouble_ReturnValue_7, double CallFunc_BreakVector2D_X_8, double CallFunc_BreakVector2D_Y_8, double CallFunc_BreakVector2D_X_9, double CallFunc_BreakVector2D_Y_9, double CallFunc_Subtract_DoubleDouble_ReturnValue_8, double CallFunc_Subtract_DoubleDouble_ReturnValue_9, double CallFunc_BreakVector2D_X_10, double CallFunc_BreakVector2D_Y_10, double CallFunc_BreakVector2D_X_11, double CallFunc_BreakVector2D_Y_11, double CallFunc_Subtract_DoubleDouble_ReturnValue_10, double CallFunc_Subtract_DoubleDouble_ReturnValue_11, double CallFunc_BreakVector2D_X_12, double CallFunc_BreakVector2D_Y_12, double CallFunc_BreakVector2D_X_13, double CallFunc_BreakVector2D_Y_13, double CallFunc_Subtract_DoubleDouble_ReturnValue_12, double CallFunc_Subtract_DoubleDouble_ReturnValue_13, double CallFunc_BreakVector2D_X_14, double CallFunc_BreakVector2D_Y_14, double CallFunc_BreakVector2D_X_15, double CallFunc_BreakVector2D_Y_15, double CallFunc_Subtract_DoubleDouble_ReturnValue_14, double CallFunc_Subtract_DoubleDouble_ReturnValue_15, double CallFunc_BreakVector2D_X_16, double CallFunc_BreakVector2D_Y_16, double CallFunc_BreakVector2D_X_17, double CallFunc_BreakVector2D_Y_17, double CallFunc_Subtract_DoubleDouble_ReturnValue_16, double CallFunc_Subtract_DoubleDouble_ReturnValue_17, double CallFunc_BreakVector2D_X_18, double CallFunc_BreakVector2D_Y_18, double CallFunc_BreakVector2D_X_19, double CallFunc_BreakVector2D_Y_19, double CallFunc_Subtract_DoubleDouble_ReturnValue_18, double CallFunc_Subtract_DoubleDouble_ReturnValue_19, double CallFunc_BreakVector2D_X_20, double CallFunc_BreakVector2D_Y_20, double CallFunc_Subtract_DoubleDouble_ReturnValue_20, float CallFunc_GetValueAtLevel_ReturnValue, float CallFunc_GetValueAtLevel_ReturnValue_1, float CallFunc_GetValueAtLevel_ReturnValue_2, float CallFunc_GetValueAtLevel_ReturnValue_3, float CallFunc_GetValueAtLevel_ReturnValue_4, float CallFunc_GetValueAtLevel_ReturnValue_5, bool CallFunc_EqualEqual_ByteByte_ReturnValue, double CallFunc_SelectFloat_ReturnValue, double CallFunc_SelectFloat_ReturnValue_1, bool CallFunc_EqualEqual_ByteByte_ReturnValue_1, double CallFunc_SelectFloat_ReturnValue_2, double CallFunc_SelectFloat_ReturnValue_3, bool CallFunc_BooleanOR_ReturnValue, double CallFunc_Multiply_DoubleDouble_ReturnValue, const struct FVector& CallFunc_GetForwardVector_ReturnValue, bool CallFunc_IsGrinding_ReturnValue, double CallFunc_Dot_VectorVector_ReturnValue, double CallFunc_Abs_ReturnValue, double CallFunc_Abs_ReturnValue_1, double CallFunc_Subtract_DoubleDouble_ReturnValue_21, double CallFunc_Divide_DoubleDouble_ReturnValue, double CallFunc_Subtract_DoubleDouble_ReturnValue_22, double CallFunc_FClamp_ReturnValue, double CallFunc_Divide_DoubleDouble_ReturnValue_1, double CallFunc_SelectFloat_ReturnValue_4, double CallFunc_FClamp_ReturnValue_1, double CallFunc_FClamp_ReturnValue_2, double CallFunc_SelectFloat_ReturnValue_5, double CallFunc_SelectFloat_ReturnValue_6, double CallFunc_FClamp_ReturnValue_3, double CallFunc_Multiply_DoubleDouble_ReturnValue_1, double CallFunc_SelectFloat_ReturnValue_7, double CallFunc_Add_DoubleDouble_ReturnValue, double CallFunc_Multiply_DoubleDouble_ReturnValue_2, double CallFunc_Add_DoubleDouble_ReturnValue_1, double CallFunc_Abs_ReturnValue_2, double CallFunc_Subtract_DoubleDouble_ReturnValue_23, double CallFunc_Abs_ReturnValue_3, double CallFunc_Divide_DoubleDouble_ReturnValue_2, double CallFunc_Subtract_DoubleDouble_ReturnValue_24, double CallFunc_FClamp_ReturnValue_4, double CallFunc_Divide_DoubleDouble_ReturnValue_3, double CallFunc_SelectFloat_ReturnValue_8, double CallFunc_FClamp_ReturnValue_5, double CallFunc_FClamp_ReturnValue_6, double CallFunc_SelectFloat_ReturnValue_9, double CallFunc_SelectFloat_ReturnValue_10, double CallFunc_FClamp_ReturnValue_7, double CallFunc_Multiply_DoubleDouble_ReturnValue_3, double CallFunc_SelectFloat_ReturnValue_11, double CallFunc_Add_DoubleDouble_ReturnValue_2, double CallFunc_Multiply_DoubleDouble_ReturnValue_4, double CallFunc_Add_DoubleDouble_ReturnValue_3, bool CallFunc_EqualEqual_ByteByte_ReturnValue_2, double CallFunc_SelectFloat_ReturnValue_12, double CallFunc_SelectFloat_ReturnValue_13, bool CallFunc_EqualEqual_ByteByte_ReturnValue_3, double CallFunc_SelectFloat_ReturnValue_14, double CallFunc_SelectFloat_ReturnValue_15, const struct FVector& CallFunc_GetRightVector_ReturnValue, const struct FVector& CallFunc_GetUpVector_ReturnValue, const struct FVector& CallFunc_Multiply_VectorVector_ReturnValue, const struct FVector& CallFunc_Multiply_VectorVector_ReturnValue_1, const struct FVector& CallFunc_GetForwardVector_ReturnValue_1, bool CallFunc_NativeIsShooting_ReturnValue, double CallFunc_Subtract_DoubleDouble_ReturnValue_25, double CallFunc_SelectFloat_ReturnValue_16, double CallFunc_FInterpTo_ReturnValue, double CallFunc_Subtract_DoubleDouble_ReturnValue_26, const struct FVector& CallFunc_Conv_DoubleToVector_ReturnValue_5, const struct FVector& CallFunc_Conv_DoubleToVector_ReturnValue_6, const struct FVector& CallFunc_Multiply_VectorVector_ReturnValue_2, const struct FVector& CallFunc_Multiply_VectorVector_ReturnValue_3, double CallFunc_Subtract_DoubleDouble_ReturnValue_27, double CallFunc_Subtract_DoubleDouble_ReturnValue_28, double CallFunc_Divide_DoubleDouble_ReturnValue_4, const struct FVector& CallFunc_Conv_DoubleToVector_ReturnValue_7, double CallFunc_FClamp_ReturnValue_8, const struct FVector& CallFunc_Multiply_VectorVector_ReturnValue_4, double CallFunc_SelectFloat_ReturnValue_17, double CallFunc_FClamp_ReturnValue_9, double CallFunc_SelectFloat_ReturnValue_18, double CallFunc_Multiply_DoubleDouble_ReturnValue_5, const struct FVector& CallFunc_Conv_DoubleToVector_ReturnValue_8, double CallFunc_Add_DoubleDouble_ReturnValue_4, double CallFunc_Multiply_DoubleDouble_ReturnValue_6, double CallFunc_FInterpTo_ReturnValue_1, const struct FVector& CallFunc_Cross_VectorVector_ReturnValue, const struct FVector& CallFunc_Multiply_VectorVector_ReturnValue_5, const struct FVector& CallFunc_Multiply_VectorVector_ReturnValue_6, const struct FVector& CallFunc_Add_VectorVector_ReturnValue, const struct FVector& CallFunc_Add_VectorVector_ReturnValue_1, const struct FVector& CallFunc_Add_VectorVector_ReturnValue_2, const struct FVector& CallFunc_Multiply_VectorVector_ReturnValue_7, const struct FVector& CallFunc_Subtract_VectorVector_ReturnValue, double CallFunc_Abs_ReturnValue_4, const struct FVector& CallFunc_VLerp_ReturnValue, double CallFunc_Subtract_DoubleDouble_ReturnValue_29, const struct FVector& CallFunc_SelectVector_ReturnValue, double CallFunc_Divide_DoubleDouble_ReturnValue_5, double CallFunc_FClamp_ReturnValue_10, double CallFunc_Abs_ReturnValue_5, double CallFunc_SelectFloat_ReturnValue_19, double CallFunc_Subtract_DoubleDouble_ReturnValue_30, double CallFunc_FClamp_ReturnValue_11, double CallFunc_Divide_DoubleDouble_ReturnValue_6, double CallFunc_SelectFloat_ReturnValue_20, double CallFunc_FClamp_ReturnValue_12, double CallFunc_Multiply_DoubleDouble_ReturnValue_7, double CallFunc_SelectFloat_ReturnValue_21, double CallFunc_Add_DoubleDouble_ReturnValue_5, double CallFunc_FClamp_ReturnValue_13, double CallFunc_FInterpTo_ReturnValue_2, double CallFunc_SelectFloat_ReturnValue_22, double CallFunc_Multiply_DoubleDouble_ReturnValue_8, double CallFunc_Add_DoubleDouble_ReturnValue_6, double CallFunc_Multiply_DoubleDouble_ReturnValue_9, double CallFunc_Multiply_DoubleDouble_ReturnValue_10, double CallFunc_Multiply_DoubleDouble_ReturnValue_11, const struct FVector2D& CallFunc_MakeVector2D_ReturnValue, double CallFunc_BreakVector2D_X_21, double CallFunc_BreakVector2D_Y_21, double CallFunc_Subtract_DoubleDouble_ReturnValue_31, double CallFunc_Abs_ReturnValue_6, double CallFunc_Subtract_DoubleDouble_ReturnValue_32, double CallFunc_Divide_DoubleDouble_ReturnValue_7, double CallFunc_Multiply_DoubleDouble_ReturnValue_12, double CallFunc_FClamp_ReturnValue_14, double CallFunc_Subtract_DoubleDouble_ReturnValue_33, double CallFunc_SelectFloat_ReturnValue_23, double CallFunc_Divide_DoubleDouble_ReturnValue_8, double CallFunc_FClamp_ReturnValue_15, double CallFunc_FClamp_ReturnValue_16, double CallFunc_SelectFloat_ReturnValue_24, double CallFunc_SelectFloat_ReturnValue_25, double CallFunc_Multiply_DoubleDouble_ReturnValue_13, double CallFunc_FClamp_ReturnValue_17, double CallFunc_Add_DoubleDouble_ReturnValue_7, double CallFunc_SelectFloat_ReturnValue_26, double CallFunc_Multiply_DoubleDouble_ReturnValue_14, double CallFunc_Multiply_DoubleDouble_ReturnValue_15, double CallFunc_FInterpTo_ReturnValue_3, double CallFunc_Add_DoubleDouble_ReturnValue_8, double CallFunc_SelectFloat_ReturnValue_27, double CallFunc_FInterpTo_ReturnValue_4, double CallFunc_Add_DoubleDouble_ReturnValue_9, const struct FVector& CallFunc_Conv_DoubleToVector_ReturnValue_9, const struct FVector& CallFunc_GetRightVector_ReturnValue_1, const struct FVector& CallFunc_Multiply_VectorVector_ReturnValue_8, double CallFunc_Subtract_DoubleDouble_ReturnValue_34, double CallFunc_Divide_DoubleDouble_ReturnValue_9, double CallFunc_FClamp_ReturnValue_18, double CallFunc_Subtract_DoubleDouble_ReturnValue_35, double CallFunc_SelectFloat_ReturnValue_28, double CallFunc_Divide_DoubleDouble_ReturnValue_10, double CallFunc_FClamp_ReturnValue_19, double CallFunc_FClamp_ReturnValue_20, double CallFunc_SelectFloat_ReturnValue_29, double CallFunc_SelectFloat_ReturnValue_30, double CallFunc_Multiply_DoubleDouble_ReturnValue_16, double CallFunc_FClamp_ReturnValue_21, double CallFunc_Add_DoubleDouble_ReturnValue_10, double CallFunc_SelectFloat_ReturnValue_31, double CallFunc_Add_DoubleDouble_ReturnValue_11, double CallFunc_Multiply_DoubleDouble_ReturnValue_17, double CallFunc_Multiply_DoubleDouble_ReturnValue_18, double CallFunc_Add_DoubleDouble_ReturnValue_12, double CallFunc_Multiply_DoubleDouble_ReturnValue_19, double CallFunc_Multiply_DoubleDouble_ReturnValue_20, double CallFunc_FInterpTo_ReturnValue_5, double CallFunc_Multiply_DoubleDouble_ReturnValue_21, double CallFunc_Add_DoubleDouble_ReturnValue_13, const struct FVector& CallFunc_GetRightVector_ReturnValue_2, double CallFunc_Add_DoubleDouble_ReturnValue_14, const struct FVector& CallFunc_GetForwardVector_ReturnValue_2, const struct FVector& CallFunc_GetForwardVector_ReturnValue_3, const struct FVector& CallFunc_Conv_DoubleToVector_ReturnValue_10, const struct FVector& CallFunc_Multiply_VectorVector_ReturnValue_9, const struct FVector& CallFunc_Add_VectorVector_ReturnValue_3, double CallFunc_FInterpTo_ReturnValue_6, const struct FVector& CallFunc_Add_VectorVector_ReturnValue_4, const struct FVector& CallFunc_Add_VectorVector_ReturnValue_5, const struct FVector& CallFunc_VInterpTo_ReturnValue, const struct FVector& CallFunc_Multiply_VectorVector_ReturnValue_10, bool CallFunc_IsValid_ReturnValue, class UPlayerController* CallFunc_GetOwningPlayerController_ReturnValue, double CallFunc_Abs_ReturnValue_7, class UFortPlayerController* K2Node_DynamicCast_AsFort_Player_Controller, bool K2Node_DynamicCast_bSuccess, const struct FVector& CallFunc_Conv_DoubleToVector_ReturnValue_11, class UFortPlayerPawn* CallFunc_GetPlayerPawn_ReturnValue, class UBP_GrindingComponent_C* CallFunc_GetComponentByClass_ReturnValue, const struct FVector& CallFunc_Multiply_VectorVector_ReturnValue_11, double CallFunc_Dot_VectorVector_ReturnValue_1, double CallFunc_Dot_VectorVector_ReturnValue_2, double CallFunc_Dot_VectorVector_ReturnValue_3, double CallFunc_FInterpTo_DeltaTime_ImplicitCast, float K2Node_FunctionResult_NewFOV_ImplicitCast, double CallFunc_Conv_DoubleToVector_InDouble_ImplicitCast, double CallFunc_Multiply_DoubleDouble_B_ImplicitCast, double CallFunc_Conv_DoubleToVector_InDouble_ImplicitCast_1, double CallFunc_SelectFloat_A_ImplicitCast, double CallFunc_SelectFloat_A_ImplicitCast_1, double CallFunc_SelectFloat_B_ImplicitCast, double CallFunc_SelectFloat_A_ImplicitCast_2, double CallFunc_SelectFloat_A_ImplicitCast_3, double CallFunc_SelectFloat_B_ImplicitCast_1, double CallFunc_FInterpTo_Current_ImplicitCast, double CallFunc_Subtract_DoubleDouble_B_ImplicitCast, double CallFunc_Subtract_DoubleDouble_B_ImplicitCast_1, float K2Node_VariableSet_ADS_Alpha_ImplicitCast, double CallFunc_FInterpTo_DeltaTime_ImplicitCast_1, double CallFunc_FInterpTo_DeltaTime_ImplicitCast_2, double CallFunc_Abs_A_ImplicitCast, double CallFunc_FInterpTo_DeltaTime_ImplicitCast_3, double CallFunc_FInterpTo_DeltaTime_ImplicitCast_4, double CallFunc_Abs_A_ImplicitCast_1, double CallFunc_Multiply_DoubleDouble_B_ImplicitCast_1, double CallFunc_FInterpTo_DeltaTime_ImplicitCast_5, double CallFunc_Add_DoubleDouble_A_ImplicitCast, double CallFunc_FInterpTo_DeltaTime_ImplicitCast_6, double CallFunc_Abs_A_ImplicitCast_2);
	void TurnOff();
	void TurnOn();
	void ExecuteUbergraph_CameraModifier_Grinding(int32 EntryPoint);
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
