#pragma once

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0xB770 (0xD080 - 0x1910)
// AnimBlueprintGeneratedClass Fortnite_M_Avg_Player_AnimBlueprint.Fortnite_M_Avg_Player_AnimBlueprint_C
class UFortnite_M_Avg_Player_AnimBlueprint_C : public UFortPlayerAnimInstance
{
public:
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0x1910(0x8)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimBlueprintGeneratedMutableData    __AnimBlueprintMutables;                           // 0x1918(0x154)(HasGetValueTypeHash)
	uint8                                        Pad_7A81[0x4];                                     // Fixing Size After Last Property
	struct FAnimSubsystemInstance                AnimBlueprintExtension_Tag;                        // 0x1A70(0x8)()
	struct FAnimSubsystem_SharedLinkedAnimLayers AnimBlueprintExtension_SharedLinkedAnimLayers;     // 0x1A78(0x28)()
	struct FAnimSubsystemInstance                AnimBlueprintExtension_PropertyAccess;             // 0x1AA0(0x8)()
	struct FAnimSubsystemInstance                AnimBlueprintExtension_Base;                       // 0x1AA8(0x8)()
	struct FAnimNode_LinkedInputPose             AnimGraphNode_LinkedInputPose_37;                  // 0x1AB0(0xC0)()
	struct FAnimNode_LinkedInputPose             AnimGraphNode_LinkedInputPose_36;                  // 0x1B70(0xC0)()
	struct FAnimNode_Root                        AnimGraphNode_Root_44;                             // 0x1C30(0x20)()
	struct FAnimNode_LinkedInputPose             AnimGraphNode_LinkedInputPose_35;                  // 0x1C50(0xC0)()
	struct FAnimNode_Root                        AnimGraphNode_Root_43;                             // 0x1D10(0x20)()
	struct FAnimNode_LinkedInputPose             AnimGraphNode_LinkedInputPose_34;                  // 0x1D30(0xC0)()
	struct FAnimNode_Root                        AnimGraphNode_Root_42;                             // 0x1DF0(0x20)()
	struct FAnimNode_LinkedInputPose             AnimGraphNode_LinkedInputPose_33;                  // 0x1E10(0xC0)()
	struct FAnimNode_Root                        AnimGraphNode_Root_41;                             // 0x1ED0(0x20)()
	struct FAnimNode_LinkedInputPose             AnimGraphNode_LinkedInputPose_32;                  // 0x1EF0(0xC0)()
	struct FAnimNode_Root                        AnimGraphNode_Root_40;                             // 0x1FB0(0x20)()
	struct FAnimNode_LinkedInputPose             AnimGraphNode_LinkedInputPose_31;                  // 0x1FD0(0xC0)()
	struct FAnimNode_LinkedInputPose             AnimGraphNode_LinkedInputPose_30;                  // 0x2090(0xC0)()
	struct FAnimNode_Root                        AnimGraphNode_Root_39;                             // 0x2150(0x20)()
	struct FAnimNode_LinkedInputPose             AnimGraphNode_LinkedInputPose_29;                  // 0x2170(0xC0)()
	struct FAnimNode_Root                        AnimGraphNode_Root_38;                             // 0x2230(0x20)()
	struct FAnimNode_LinkedInputPose             AnimGraphNode_LinkedInputPose_28;                  // 0x2250(0xC0)()
	struct FAnimNode_Root                        AnimGraphNode_Root_37;                             // 0x2310(0x20)()
	struct FAnimNode_LinkedInputPose             AnimGraphNode_LinkedInputPose_27;                  // 0x2330(0xC0)()
	struct FAnimNode_Root                        AnimGraphNode_Root_36;                             // 0x23F0(0x20)()
	struct FAnimNode_LinkedInputPose             AnimGraphNode_LinkedInputPose_26;                  // 0x2410(0xC0)()
	struct FAnimNode_Root                        AnimGraphNode_Root_35;                             // 0x24D0(0x20)()
	struct FAnimNode_LinkedInputPose             AnimGraphNode_LinkedInputPose_25;                  // 0x24F0(0xC0)()
	struct FAnimNode_Root                        AnimGraphNode_Root_34;                             // 0x25B0(0x20)()
	struct FAnimNode_LinkedInputPose             AnimGraphNode_LinkedInputPose_24;                  // 0x25D0(0xC0)()
	struct FAnimNode_LinkedInputPose             AnimGraphNode_LinkedInputPose_23;                  // 0x2690(0xC0)()
	struct FAnimNode_Root                        AnimGraphNode_Root_33;                             // 0x2750(0x20)()
	struct FAnimNode_LinkedInputPose             AnimGraphNode_LinkedInputPose_22;                  // 0x2770(0xC0)()
	struct FAnimNode_Root                        AnimGraphNode_Root_32;                             // 0x2830(0x20)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_58;                   // 0x2850(0x48)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_51;                  // 0x2898(0x48)()
	struct FAnimNode_RefPose                     AnimGraphNode_IdentityPose_8;                      // 0x28E0(0x10)()
	struct FAnimNode_Root                        AnimGraphNode_Root_31;                             // 0x28F0(0x20)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_57;                   // 0x2910(0x48)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_50;                  // 0x2958(0x48)()
	struct FAnimNode_RefPose                     AnimGraphNode_IdentityPose_7;                      // 0x29A0(0x10)()
	struct FAnimNode_Root                        AnimGraphNode_Root_30;                             // 0x29B0(0x20)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_56;                   // 0x29D0(0x48)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_49;                  // 0x2A18(0x48)()
	struct FAnimNode_RefPose                     AnimGraphNode_IdentityPose_6;                      // 0x2A60(0x10)()
	struct FAnimNode_Root                        AnimGraphNode_Root_29;                             // 0x2A70(0x20)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_55;                   // 0x2A90(0x48)()
	struct FAnimNode_Root                        AnimGraphNode_Root_28;                             // 0x2AD8(0x20)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_54;                   // 0x2AF8(0x48)()
	struct FAnimNode_Root                        AnimGraphNode_Root_27;                             // 0x2B40(0x20)()
	struct FAnimNode_LinkedInputPose             AnimGraphNode_LinkedInputPose_21;                  // 0x2B60(0xC0)()
	struct FAnimNode_Root                        AnimGraphNode_Root_26;                             // 0x2C20(0x20)()
	struct FAnimNode_LinkedInputPose             AnimGraphNode_LinkedInputPose_20;                  // 0x2C40(0xC0)()
	struct FAnimNode_Root                        AnimGraphNode_Root_25;                             // 0x2D00(0x20)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_48;                  // 0x2D20(0x48)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_53;                   // 0x2D68(0x48)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_52;                   // 0x2DB0(0x48)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_51;                   // 0x2DF8(0x48)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_47;                  // 0x2E40(0x48)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_50;                   // 0x2E88(0x48)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_49;                   // 0x2ED0(0x48)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_46;                  // 0x2F18(0x48)()
	struct FAnimNode_RefPose                     AnimGraphNode_IdentityPose_5;                      // 0x2F60(0x10)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_45;                  // 0x2F70(0x48)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_48;                   // 0x2FB8(0x48)()
	struct FAnimNode_BlendListByEnum             AnimGraphNode_BlendListByEnum_11;                  // 0x3000(0x48)()
	struct FAnimNode_Root                        AnimGraphNode_Root_24;                             // 0x3048(0x20)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_44;                  // 0x3068(0x48)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_47;                   // 0x30B0(0x48)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_46;                   // 0x30F8(0x48)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_45;                   // 0x3140(0x48)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_43;                  // 0x3188(0x48)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_44;                   // 0x31D0(0x48)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_43;                   // 0x3218(0x48)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_42;                  // 0x3260(0x48)()
	struct FAnimNode_RefPose                     AnimGraphNode_IdentityPose_4;                      // 0x32A8(0x10)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_41;                  // 0x32B8(0x48)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_42;                   // 0x3300(0x48)()
	struct FAnimNode_BlendListByEnum             AnimGraphNode_BlendListByEnum_10;                  // 0x3348(0x48)()
	struct FAnimNode_Root                        AnimGraphNode_Root_23;                             // 0x3390(0x20)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_41;                   // 0x33B0(0x48)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_40;                  // 0x33F8(0x48)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_40;                   // 0x3440(0x48)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_39;                   // 0x3488(0x48)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_39;                  // 0x34D0(0x48)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_38;                   // 0x3518(0x48)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_38;                  // 0x3560(0x48)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_37;                   // 0x35A8(0x48)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_37;                  // 0x35F0(0x48)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_36;                   // 0x3638(0x48)()
	struct FAnimNode_RefPose                     AnimGraphNode_IdentityPose_3;                      // 0x3680(0x10)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_36;                  // 0x3690(0x48)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_35;                   // 0x36D8(0x48)()
	struct FAnimNode_BlendListByEnum             AnimGraphNode_BlendListByEnum_9;                   // 0x3720(0x48)()
	struct FAnimNode_Root                        AnimGraphNode_Root_22;                             // 0x3768(0x20)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_35;                  // 0x3788(0x48)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_34;                   // 0x37D0(0x48)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_33;                   // 0x3818(0x48)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_32;                   // 0x3860(0x48)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_34;                  // 0x38A8(0x48)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_31;                   // 0x38F0(0x48)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_30;                   // 0x3938(0x48)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_29;                   // 0x3980(0x48)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_33;                  // 0x39C8(0x48)()
	struct FAnimNode_BlendListByEnum             AnimGraphNode_BlendListByEnum_8;                   // 0x3A10(0x48)()
	struct FAnimNode_BlendListByEnum             AnimGraphNode_BlendListByEnum_7;                   // 0x3A58(0x48)()
	struct FAnimNode_BlendListByEnum             AnimGraphNode_BlendListByEnum_6;                   // 0x3AA0(0x48)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_28;                   // 0x3AE8(0x48)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_32;                  // 0x3B30(0x48)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_27;                   // 0x3B78(0x48)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_31;                  // 0x3BC0(0x48)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_26;                   // 0x3C08(0x48)()
	struct FAnimNode_BlendListByEnum             AnimGraphNode_BlendListByEnum_5;                   // 0x3C50(0x48)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_25;                   // 0x3C98(0x48)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_30;                  // 0x3CE0(0x48)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_24;                   // 0x3D28(0x48)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_29;                  // 0x3D70(0x48)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_23;                   // 0x3DB8(0x48)()
	struct FAnimNode_BlendListByEnum             AnimGraphNode_BlendListByEnum_4;                   // 0x3E00(0x48)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_28;                  // 0x3E48(0x48)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_22;                   // 0x3E90(0x48)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_21;                   // 0x3ED8(0x48)()
	struct FAnimNode_ModifyCurve                 AnimGraphNode_ModifyCurve;                         // 0x3F20(0x100)()
	struct FAnimNode_BlendListByEnum             AnimGraphNode_BlendListByEnum_3;                   // 0x4020(0x48)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_20;                   // 0x4068(0x48)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_27;                  // 0x40B0(0x48)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_19;                   // 0x40F8(0x48)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_18;                   // 0x4140(0x48)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_17;                   // 0x4188(0x48)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_26;                  // 0x41D0(0x48)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_16;                   // 0x4218(0x48)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_25;                  // 0x4260(0x48)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_15;                   // 0x42A8(0x48)()
	struct FAnimNode_Root                        AnimGraphNode_Root_21;                             // 0x42F0(0x20)()
	struct FAnimNode_Root                        AnimGraphNode_Root_20;                             // 0x4310(0x20)()
	struct FAnimNode_Root                        AnimGraphNode_Root_19;                             // 0x4330(0x20)()
	struct FAnimNode_Root                        AnimGraphNode_Root_18;                             // 0x4350(0x20)()
	struct FAnimNode_LinkedInputPose             AnimGraphNode_LinkedInputPose_19;                  // 0x4370(0xC0)()
	struct FAnimNode_Root                        AnimGraphNode_Root_17;                             // 0x4430(0x20)()
	struct FAnimNode_LinkedInputPose             AnimGraphNode_LinkedInputPose_18;                  // 0x4450(0xC0)()
	struct FAnimNode_Root                        AnimGraphNode_Root_16;                             // 0x4510(0x20)()
	struct FAnimNode_LinkedInputPose             AnimGraphNode_LinkedInputPose_17;                  // 0x4530(0xC0)()
	struct FAnimNode_Root                        AnimGraphNode_Root_15;                             // 0x45F0(0x20)()
	struct FAnimNode_LinkedInputPose             AnimGraphNode_LinkedInputPose_16;                  // 0x4610(0xC0)()
	struct FAnimNode_LinkedInputPose             AnimGraphNode_LinkedInputPose_15;                  // 0x46D0(0xC0)()
	struct FAnimNode_LinkedInputPose             AnimGraphNode_LinkedInputPose_14;                  // 0x4790(0xC0)()
	struct FAnimNode_Root                        AnimGraphNode_Root_14;                             // 0x4850(0x20)()
	struct FAnimNode_LinkedInputPose             AnimGraphNode_LinkedInputPose_13;                  // 0x4870(0xC0)()
	struct FAnimNode_Root                        AnimGraphNode_Root_13;                             // 0x4930(0x20)()
	struct FAnimNode_LinkedInputPose             AnimGraphNode_SubInput;                            // 0x4950(0xC0)()
	struct FAnimNode_LinkedInputPose             AnimGraphNode_LinkedInputPose_12;                  // 0x4A10(0xC0)()
	struct FAnimNode_Root                        AnimGraphNode_Root_12;                             // 0x4AD0(0x20)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_24;                  // 0x4AF0(0x48)()
	struct FAnimNode_LinkedInputPose             AnimGraphNode_LinkedInputPose_11;                  // 0x4B38(0xC0)()
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_24;                   // 0x4BF8(0x100)()
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_55;                    // 0x4CF8(0x28)()
	struct FAnimNode_LinkedAnimGraph             AnimGraphNode_LinkedAnimGraph_16;                  // 0x4D20(0xB8)()
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_54;                    // 0x4DD8(0x28)()
	struct FAnimNode_Root                        AnimGraphNode_Root_11;                             // 0x4E00(0x20)()
	struct FAnimNode_Slot                        AnimGraphNode_Slot_15;                             // 0x4E20(0x48)()
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_53;                    // 0x4E68(0x28)()
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_52;                    // 0x4E90(0x28)()
	struct FAnimNode_Slot                        AnimGraphNode_Slot_14;                             // 0x4EB8(0x48)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_36;                 // 0x4F00(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_35;                 // 0x4F28(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_34;                 // 0x4F50(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_33;                 // 0x4F78(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_32;                 // 0x4FA0(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_31;                 // 0x4FC8(0x28)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_14;                   // 0x4FF0(0x48)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_15;                      // 0x5038(0x20)()
	struct FAnimNode_LinkedAnimLayer             AnimGraphNode_LinkedAnimLayer_20;                  // 0x5058(0xC8)()
	struct FAnimNode_RefPose                     AnimGraphNode_LocalRefPose_2;                      // 0x5120(0x10)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_14;                      // 0x5130(0x20)()
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_51;                    // 0x5150(0x28)()
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_50;                    // 0x5178(0x28)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_23;                  // 0x51A0(0x48)()
	struct FAnimNode_Slot                        AnimGraphNode_Slot_13;                             // 0x51E8(0x48)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_13;                      // 0x5230(0x20)()
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine_4;                      // 0x5250(0xC8)()
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_23;                   // 0x5318(0x100)()
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_22;                   // 0x5418(0x100)()
	struct FAnimNode_LinkedAnimLayer             AnimGraphNode_LinkedAnimLayer_19;                  // 0x5518(0xC8)()
	struct FAnimNode_LinkedAnimGraph             AnimGraphNode_LinkedAnimGraph_15;                  // 0x55E0(0xB8)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_22;                  // 0x5698(0x48)()
	struct FAnimNode_LinkedAnimGraph             AnimGraphNode_LinkedAnimGraph_14;                  // 0x56E0(0xB8)()
	struct FAnimNode_LinkedAnimLayer             AnimGraphNode_LinkedAnimLayer_18;                  // 0x5798(0xC8)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_21;                  // 0x5860(0x48)()
	struct FAnimNode_LinkedAnimLayer             AnimGraphNode_LinkedAnimLayer_17;                  // 0x58A8(0xC8)()
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_21;                   // 0x5970(0x100)()
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_49;                    // 0x5A70(0x28)()
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_48;                    // 0x5A98(0x28)()
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_47;                    // 0x5AC0(0x28)()
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_11;                 // 0x5AE8(0xE0)()
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_20;                   // 0x5BC8(0x100)()
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_46;                    // 0x5CC8(0x28)()
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_45;                    // 0x5CF0(0x28)()
	struct FAnimNode_Slot                        AnimGraphNode_Slot_12;                             // 0x5D18(0x48)()
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_10;                 // 0x5D60(0xE0)()
	struct FAnimNode_LinkedAnimLayer             AnimGraphNode_Layer_2;                             // 0x5E40(0xC8)()
	struct FAnimNode_LinkedAnimLayer             AnimGraphNode_LinkedAnimLayer_16;                  // 0x5F08(0xC8)()
	struct FAnimNode_Root                        AnimGraphNode_Root_10;                             // 0x5FD0(0x20)()
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_9;                  // 0x5FF0(0xE0)()
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_6;                     // 0x60D0(0xC8)()
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_44;                    // 0x6198(0x28)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_13;                   // 0x61C0(0x48)()
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_8;                  // 0x6208(0xE0)()
	struct FAnimNode_BlendListByEnum             AnimGraphNode_BlendListByEnum_2;                   // 0x62E8(0x48)()
	struct FAnimNode_Slot                        AnimGraphNode_Slot_11;                             // 0x6330(0x48)()
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_5;                     // 0x6378(0xC8)()
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_4;                     // 0x6440(0xC8)()
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_43;                    // 0x6508(0x28)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_20;                  // 0x6530(0x48)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_12;                   // 0x6578(0x48)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_11;                   // 0x65C0(0x48)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_19;                  // 0x6608(0x48)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_18;                  // 0x6650(0x48)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_10;                   // 0x6698(0x48)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_9;                    // 0x66E0(0x48)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_8;                    // 0x6728(0x48)()
	struct FAnimNode_Root                        AnimGraphNode_Root_9;                              // 0x6770(0x20)()
	struct FAnimNode_LinkedInputPose             AnimGraphNode_LinkedInputPose_10;                  // 0x6790(0xC0)()
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_19;                   // 0x6850(0x100)()
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_42;                    // 0x6950(0x28)()
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_41;                    // 0x6978(0x28)()
	struct FAnimNode_LinkedInputPose             AnimGraphNode_LinkedInputPose_9;                   // 0x69A0(0xC0)()
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_18;                   // 0x6A60(0x100)()
	struct FAnimNode_Root                        AnimGraphNode_Root_8;                              // 0x6B60(0x20)()
	struct FAnimNode_Slot                        AnimGraphNode_Slot_10;                             // 0x6B80(0x48)()
	struct FAnimNode_Slot                        AnimGraphNode_Slot_9;                              // 0x6BC8(0x48)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_17;                  // 0x6C10(0x48)()
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_40;                    // 0x6C58(0x28)()
	struct FAnimNode_Slot                        AnimGraphNode_Slot_8;                              // 0x6C80(0x48)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_7;                    // 0x6CC8(0x48)()
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_7;                  // 0x6D10(0xE0)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_6;                    // 0x6DF0(0x48)()
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_39;                    // 0x6E38(0x28)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_16;                  // 0x6E60(0x48)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_5;                    // 0x6EA8(0x48)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_15;                  // 0x6EF0(0x48)()
	struct FAnimNode_LinkedInputPose             AnimGraphNode_LinkedInputPose_8;                   // 0x6F38(0xC0)()
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_17;                   // 0x6FF8(0x100)()
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_38;                    // 0x70F8(0x28)()
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_37;                    // 0x7120(0x28)()
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_36;                    // 0x7148(0x28)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_14;                  // 0x7170(0x48)()
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_6;                  // 0x71B8(0xE0)()
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_16;                   // 0x7298(0x100)()
	struct FAnimNode_Slot                        AnimGraphNode_Slot_7;                              // 0x7398(0x48)()
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_35;                    // 0x73E0(0x28)()
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_34;                    // 0x7408(0x28)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_13;                  // 0x7430(0x48)()
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_5;                  // 0x7478(0xE0)()
	struct FAnimNode_Root                        AnimGraphNode_Root_7;                              // 0x7558(0x20)()
	struct FAnimNode_LinkedInputPose             AnimGraphNode_LinkedInputPose_7;                   // 0x7578(0xC0)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_12;                  // 0x7638(0x48)()
	struct FAnimNode_LinkedAnimGraph             AnimGraphNode_LinkedAnimGraph_13;                  // 0x7680(0xB8)()
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_3;                     // 0x7738(0xC8)()
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_15;                   // 0x7800(0x100)()
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_33;                    // 0x7900(0x28)()
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_32;                    // 0x7928(0x28)()
	struct FAnimNode_Root                        AnimGraphNode_Root_6;                              // 0x7950(0x20)()
	struct FAnimNode_LinkedInputPose             AnimGraphNode_LinkedInputPose_6;                   // 0x7970(0xC0)()
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_14;                   // 0x7A30(0x100)()
	struct FAnimNode_LinkedAnimGraph             AnimGraphNode_LinkedAnimGraph_12;                  // 0x7B30(0xB8)()
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_31;                    // 0x7BE8(0x28)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_11;                  // 0x7C10(0x48)()
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_30;                    // 0x7C58(0x28)()
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_4;                  // 0x7C80(0xE0)()
	struct FAnimNode_Root                        AnimGraphNode_Root_5;                              // 0x7D60(0x20)()
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_3;                  // 0x7D80(0xE0)()
	struct FAnimNode_RefPose                     AnimGraphNode_IdentityPose_2;                      // 0x7E60(0x10)()
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_2;                  // 0x7E70(0xE0)()
	struct FAnimNode_RefPose                     AnimGraphNode_IdentityPose_1;                      // 0x7F50(0x10)()
	struct FAnimNode_Slot                        AnimGraphNode_Slot_6;                              // 0x7F60(0x48)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_10;                  // 0x7FA8(0x48)()
	struct FAnimNode_LinkedAnimGraph             AnimGraphNode_LinkedAnimGraph_11;                  // 0x7FF0(0xB8)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_30;                 // 0x80A8(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_29;                 // 0x80D0(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_28;                 // 0x80F8(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_27;                 // 0x8120(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_26;                 // 0x8148(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_25;                 // 0x8170(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_24;                 // 0x8198(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_23;                 // 0x81C0(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_22;                 // 0x81E8(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_21;                 // 0x8210(0x28)()
	struct FAnimNode_LinkedAnimGraph             AnimGraphNode_LinkedAnimGraph_10;                  // 0x8238(0xB8)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_12;                      // 0x82F0(0x20)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_4;                  // 0x8310(0x70)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_3;                  // 0x8380(0x70)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_9;                   // 0x83F0(0x48)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_2;                  // 0x8438(0x70)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_1;                  // 0x84A8(0x70)()
	struct FAnimNode_BlendListByEnum             AnimGraphNode_BlendListByEnum_1;                   // 0x8518(0x48)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer;                    // 0x8560(0x70)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_4;                    // 0x85D0(0x48)()
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_2;                     // 0x8618(0xC8)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_11;                      // 0x86E0(0x20)()
	struct FAnimNode_RefPose                     AnimGraphNode_IdentityPose;                        // 0x8700(0x10)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_10;                      // 0x8710(0x20)()
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine_3;                      // 0x8730(0xC8)()
	struct FAnimNode_LinkedInputPose             AnimGraphNode_LinkedInputPose_5;                   // 0x87F8(0xC0)()
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_1;                     // 0x88B8(0xC8)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_1;             // 0x8980(0x20)()
	struct FAnimNode_HandIKRetargeting           AnimGraphNode_HandIKRetargeting;                   // 0x89A0(0x110)()
	struct FAnimNode_Slot                        AnimGraphNode_Slot_5;                              // 0x8AB0(0x48)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_1;             // 0x8AF8(0x20)()
	struct FAnimNode_Root                        AnimGraphNode_Root_4;                              // 0x8B18(0x20)()
	struct FAnimNode_LinkedInputPose             AnimGraphNode_LinkedInputPose_4;                   // 0x8B38(0xC0)()
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_13;                   // 0x8BF8(0x100)()
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_29;                    // 0x8CF8(0x28)()
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_12;                   // 0x8D20(0x100)()
	struct FAnimNode_LinkedAnimGraph             AnimGraphNode_LinkedAnimGraph_9;                   // 0x8E20(0xB8)()
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_28;                    // 0x8ED8(0x28)()
	struct FAnimNode_LinkedAnimLayer             AnimGraphNode_Layer_1;                             // 0x8F00(0xC8)()
	struct FAnimNode_LinkedAnimLayer             AnimGraphNode_LinkedAnimLayer_15;                  // 0x8FC8(0xC8)()
	struct FAnimNode_LinkedAnimGraph             AnimGraphNode_LinkedAnimGraph_8;                   // 0x9090(0xB8)()
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_27;                    // 0x9148(0x28)()
	struct FAnimNode_LinkedAnimLayer             AnimGraphNode_LinkedAnimLayer_14;                  // 0x9170(0xC8)()
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_11;                   // 0x9238(0x100)()
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_26;                    // 0x9338(0x28)()
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_25;                    // 0x9360(0x28)()
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_24;                    // 0x9388(0x28)()
	struct FAnimNode_Slot                        AnimGraphNode_Slot_4;                              // 0x93B0(0x48)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_8;                   // 0x93F8(0x48)()
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_23;                    // 0x9440(0x28)()
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_22;                    // 0x9468(0x28)()
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_10;                   // 0x9490(0x100)()
	struct FAnimNode_Root                        AnimGraphNode_Root_3;                              // 0x9590(0x20)()
	struct FAnimNode_LinkedInputPose             AnimGraphNode_LinkedInputPose_3;                   // 0x95B0(0xC0)()
	struct FAnimNode_LinkedInputPose             AnimGraphNode_LinkedInputPose_2;                   // 0x9670(0xC0)()
	struct FAnimNode_RotateRootBone              AnimGraphNode_RotateRootBone;                      // 0x9730(0xB0)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_7;                   // 0x97E0(0x48)()
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_9;                    // 0x9828(0x100)()
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_21;                    // 0x9928(0x28)()
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_20;                    // 0x9950(0x28)()
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_1;                  // 0x9978(0xE0)()
	struct FAnimNode_RefPose                     AnimGraphNode_LocalRefPose_1;                      // 0x9A58(0x10)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_6;                   // 0x9A68(0x48)()
	struct FAnimNode_Root                        AnimGraphNode_Root_2;                              // 0x9AB0(0x20)()
	struct FAnimNode_LinkedInputPose             AnimGraphNode_LinkedInputPose_1;                   // 0x9AD0(0xC0)()
	struct FAnimNode_Slot                        AnimGraphNode_Slot_3;                              // 0x9B90(0x48)()
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_8;                    // 0x9BD8(0x100)()
	struct FAnimNode_Slot                        AnimGraphNode_Slot_2;                              // 0x9CD8(0x48)()
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_7;                    // 0x9D20(0x100)()
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_19;                    // 0x9E20(0x28)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_5;                   // 0x9E48(0x48)()
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_18;                    // 0x9E90(0x28)()
	struct FAnimNode_Slot                        AnimGraphNode_Slot_1;                              // 0x9EB8(0x48)()
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_17;                    // 0x9F00(0x28)()
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_16;                    // 0x9F28(0x28)()
	struct FAnimNode_LinkedAnimLayer             AnimGraphNode_LinkedAnimLayer_13;                  // 0x9F50(0xC8)()
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_6;                    // 0xA018(0x100)()
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_15;                    // 0xA118(0x28)()
	struct FAnimNode_Root                        AnimGraphNode_Root_1;                              // 0xA140(0x20)()
	struct FAnimNode_RotationOffsetBlendSpace    AnimGraphNode_RotationOffsetBlendSpace_2;          // 0xA160(0x118)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_4;                   // 0xA278(0x48)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_3;                   // 0xA2C0(0x48)()
	struct FAnimNode_RotationOffsetBlendSpace    AnimGraphNode_RotationOffsetBlendSpace_1;          // 0xA308(0x118)()
	struct FAnimNode_RotationOffsetBlendSpace    AnimGraphNode_RotationOffsetBlendSpace;            // 0xA420(0x118)()
	struct FAnimNode_LinkedInputPose             AnimGraphNode_LinkedInputPose;                     // 0xA538(0xC0)()
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_5;                    // 0xA5F8(0x100)()
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_14;                    // 0xA6F8(0x28)()
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_13;                    // 0xA720(0x28)()
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_12;                    // 0xA748(0x28)()
	struct FAnimNode_Root                        AnimGraphNode_Root;                                // 0xA770(0x20)()
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_4;                    // 0xA790(0x100)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_20;                 // 0xA890(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_19;                 // 0xA8B8(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_18;                 // 0xA8E0(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_17;                 // 0xA908(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_16;                 // 0xA930(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_15;                 // 0xA958(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_14;                 // 0xA980(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_13;                 // 0xA9A8(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_12;                 // 0xA9D0(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_11;                 // 0xA9F8(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_10;                 // 0xAA20(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_9;                  // 0xAA48(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_8;                  // 0xAA70(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_7;                  // 0xAA98(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_6;                  // 0xAAC0(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_5;                  // 0xAAE8(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_4;                  // 0xAB10(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_3;                  // 0xAB38(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_2;                  // 0xAB60(0x28)()
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_11;                    // 0xAB88(0x28)()
	struct FAnimNode_RefPose                     AnimGraphNode_LocalRefPose;                        // 0xABB0(0x10)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_2;                   // 0xABC0(0x48)()
	struct FAnimNode_LinkedAnimGraph             AnimGraphNode_LinkedAnimGraph_7;                   // 0xAC08(0xB8)()
	struct FAnimNode_LinkedAnimGraph             AnimGraphNode_LinkedAnimGraph_6;                   // 0xACC0(0xB8)()
	struct FAnimNode_TwoWayBlend                 AnimGraphNode_TwoWayBlend;                         // 0xAD78(0xC0)()
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_10;                    // 0xAE38(0x28)()
	struct FAnimNode_LinkedAnimLayer             AnimGraphNode_LinkedAnimLayer_12;                  // 0xAE60(0xC8)()
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive;                       // 0xAF28(0xC8)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_9;                       // 0xAFF0(0x20)()
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_9;                     // 0xB010(0x28)()
	struct FAnimNode_LinkedAnimGraph             AnimGraphNode_LinkedAnimGraph_5;                   // 0xB038(0xB8)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_8;                       // 0xB0F0(0x20)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_1;                  // 0xB110(0x28)()
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine_2;                      // 0xB138(0xC8)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_7;                       // 0xB200(0x20)()
	struct FAnimNode_LinkedAnimGraph             AnimGraphNode_LinkedAnimGraph_4;                   // 0xB220(0xB8)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_6;                       // 0xB2D8(0x20)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult;                    // 0xB2F8(0x28)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_3;                    // 0xB320(0x48)()
	struct FAnimNode_BlendListByEnum             AnimGraphNode_BlendListByEnum;                     // 0xB368(0x48)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_2;                    // 0xB3B0(0x48)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_5;                       // 0xB3F8(0x20)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_1;                    // 0xB418(0x48)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_4;                       // 0xB460(0x20)()
	struct FAnimNode_LinkedAnimGraph             AnimGraphNode_LinkedAnimGraph_3;                   // 0xB480(0xB8)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_3;                       // 0xB538(0x20)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer;                      // 0xB558(0x48)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_2;                       // 0xB5A0(0x20)()
	struct FAnimNode_LinkedAnimGraph             AnimGraphNode_LinkedAnimGraph_2;                   // 0xB5C0(0xB8)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_1;                       // 0xB678(0x20)()
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine_1;                      // 0xB698(0xC8)()
	struct FAnimNode_LinkedAnimLayer             AnimGraphNode_LinkedAnimLayer_11;                  // 0xB760(0xC8)()
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_3;                    // 0xB828(0x100)()
	struct FAnimNode_LinkedAnimLayer             AnimGraphNode_Layer;                               // 0xB928(0xC8)()
	struct FAnimNode_LinkedAnimLayer             AnimGraphNode_LinkedAnimLayer_10;                  // 0xB9F0(0xC8)()
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_2;                    // 0xBAB8(0x100)()
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_8;                     // 0xBBB8(0x28)()
	struct FAnimNode_LinkedAnimLayer             AnimGraphNode_LinkedAnimLayer_9;                   // 0xBBE0(0xC8)()
	struct FAnimNode_LinkedAnimGraph             AnimGraphNode_LinkedAnimGraph_1;                   // 0xBCA8(0xB8)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_1;                   // 0xBD60(0x48)()
	struct FFortAnimNode_ScaleCharacterBones     FortAnimGraphNode_ScaleCharacterBones;             // 0xBDA8(0xD8)()
	struct FAnimNode_Inertialization             AnimGraphNode_Inertialization;                     // 0xBE80(0x100)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0xBF80(0x20)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0xBFA0(0x20)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool;                     // 0xBFC0(0x48)()
	struct FAnimNode_LinkedAnimLayer             AnimGraphNode_LinkedAnimLayer_8;                   // 0xC008(0xC8)()
	struct FAnimNode_LinkedAnimLayer             AnimGraphNode_LinkedAnimLayer_7;                   // 0xC0D0(0xC8)()
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_1;                    // 0xC198(0x100)()
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_7;                     // 0xC298(0x28)()
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_6;                     // 0xC2C0(0x28)()
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_5;                     // 0xC2E8(0x28)()
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_4;                     // 0xC310(0x28)()
	struct FAnimNode_BlendListByInt              AnimGraphNode_BlendListByInt;                      // 0xC338(0x48)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult;                         // 0xC380(0x20)()
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine;                        // 0xC3A0(0xC8)()
	struct FAnimNode_LinkedAnimLayer             AnimGraphNode_LinkedAnimLayer_6;                   // 0xC468(0xC8)()
	struct FAnimNode_LinkedAnimLayer             AnimGraphNode_LinkedAnimLayer_5;                   // 0xC530(0xC8)()
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_3;                     // 0xC5F8(0x28)()
	struct FAnimNode_LinkedAnimLayer             AnimGraphNode_LinkedAnimLayer_4;                   // 0xC620(0xC8)()
	struct FAnimNode_LinkedAnimLayer             AnimGraphNode_LinkedAnimLayer_3;                   // 0xC6E8(0xC8)()
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_2;                     // 0xC7B0(0x28)()
	struct FAnimNode_LinkedAnimLayer             AnimGraphNode_LinkedAnimLayer_2;                   // 0xC7D8(0xC8)()
	struct FAnimNode_LinkedAnimGraph             AnimGraphNode_LinkedAnimGraph;                     // 0xC8A0(0xB8)()
	struct FAnimNode_LinkedAnimLayer             AnimGraphNode_LinkedAnimLayer_1;                   // 0xC958(0xC8)()
	struct FAnimNode_LinkedAnimLayer             AnimGraphNode_LinkedAnimLayer;                     // 0xCA20(0xC8)()
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose;                      // 0xCAE8(0x100)()
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_1;                     // 0xCBE8(0x28)()
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose;                       // 0xCC10(0x28)()
	struct FAnimNode_Slot                        AnimGraphNode_Slot;                                // 0xCC38(0x48)()
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend;                    // 0xCC80(0xE0)()
	struct FFortAnimInput_AdjustedAim            __CustomProperty_InputParam_68C70D6347F81F8476C87EA798A19370; // 0xCD60(0x25C)(NoDestructor)
	bool                                         __CustomProperty_ParaGlide_TriggerAnim_EE06BC0D4AF7A3598BB824A5286F89C8; // 0xCFBC(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_7A9B[0x3];                                     // Fixing Size After Last Property
	class FName                                  __CustomProperty_EmoteAnimOffsetCurveName_D066576F42932FCE06C5E8B658C15225; // 0xCFC0(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_7A9C[0x4];                                     // Fixing Size After Last Property
	struct FVector                               __CustomProperty_LeftHandOverride_D066576F42932FCE06C5E8B658C15225; // 0xCFC8(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                               __CustomProperty_RightHandOverride_D066576F42932FCE06C5E8B658C15225; // 0xCFE0(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         __CustomProperty_IsHidingInProp_D066576F42932FCE06C5E8B658C15225; // 0xCFF8(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_7A9D[0x7];                                     // Fixing Size After Last Property
	FMulticastInlineDelegateProperty_            MenuScreenDispatcher;                              // 0xD000(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	double                                       StartAnimBlendTime;                                // 0xD010(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       PivotAnimBlendTime;                                // 0xD018(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       CrouchPlayRate;                                    // 0xD020(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         IsSnowman;                                         // 0xD028(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_7A9E[0x7];                                     // Fixing Size After Last Property
	FMulticastInlineDelegateProperty_            Indigo_Boost;                                      // 0xD030(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                         ParaGlide_UseAltGliderCam;                         // 0xD040(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_7A9F[0x7];                                     // Fixing Size After Last Property
	struct FVector                               LeftHandOverride;                                  // 0xD048(0x18)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                               RightHandOverride;                                 // 0xD060(0x18)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         ParaGlide_TriggerAnim;                             // 0xD078(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_7AA1[0x3];                                     // Fixing Size After Last Property
	class FName                                  EmoteAnimOffsetCurveName;                          // 0xD07C(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("Fortnite_M_Avg_Player_AnimBlueprint_C");
		return Clss;
	}

	void MovementMode_AimOffset(const struct FPoseLink& InAimOffsetsPose, const struct FPoseLink& InSourcePosePreAimOffsets, struct FPoseLink* MovementMode_AimOffset);
	void MovementMode_FinalPoseOverride(const struct FPoseLink& InFinalPose, struct FPoseLink* MovementMode_FinalPoseOverride);
	void MovementMode_FullBodyOverride(const struct FPoseLink& InputPoseFullBody, struct FPoseLink* MovementMode_FullBodyOverride);
	void MovementMode_SourcePose(const struct FPoseLink& InSourcePoseBase, struct FPoseLink* MovementMode_SourcePose);
