#pragma once

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

#include "../SDK.hpp"

namespace SDK
{
namespace Params
{
//---------------------------------------------------------------------------------------------------------------------
// PARAMETERS
//---------------------------------------------------------------------------------------------------------------------

// 0x1 (0x1 - 0x0)
// Function FortniteUI.FortHUDElementWidget.OnVisibilitySetEvent
struct UFortHUDElementWidget_OnVisibilitySetEvent_Params
{
public:
	enum class ESlateVisibility                  InVisibility;                                      // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x28 (0x28 - 0x0)
// Function FortniteUI.FortHUDElementWidget.HasAnyTags
struct UFortHUDElementWidget_HasAnyTags_Params
{
public:
	struct FGameplayTagContainer                 InTags;                                            // 0x0(0x20)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x20(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3477[0x7];                                     // Fixing Size Of Struct
};

// 0x20 (0x20 - 0x0)
// Function FortniteUI.FortHUDElementWidget.HandleOnHUDElementVisibilityChanged
struct UFortHUDElementWidget_HandleOnHUDElementVisibilityChanged_Params
{
public:
	struct FGameplayTagContainer                 HiddenHUDElementTags;                              // 0x0(0x20)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x30 (0x30 - 0x0)
// Function FortniteUI.FortHUDElementWidget.HandleGetHUDElementWidgetsForTags
struct UFortHUDElementWidget_HandleGetHUDElementWidgetsForTags_Params
{
public:
	struct FGameplayTagContainer                 HUDElementTags;                                    // 0x0(0x20)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<class UFortHUDElementWidget*>         OutWidgets;                                        // 0x20(0x10)(Parm, OutParm, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// Function FortniteUI.FortHUDElementWidget.AppendHUDElementTags
struct UFortHUDElementWidget_AppendHUDElementTags_Params
{
public:
	struct FGameplayTagContainer                 AdditionalTags;                                    // 0x0(0x20)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaHUDFeedbackLine.OnShowEnabledUpdated
struct UAthenaHUDFeedbackLine_OnShowEnabledUpdated_Params
{
public:
	bool                                         bShowEnabled;                                      // 0x0(0x1)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function FortniteUI.AthenaHUDFeedbackLineCooldown.RegisterAbilityNotify
struct UAthenaHUDFeedbackLineCooldown_RegisterAbilityNotify_Params
{
public:
	class UFortPlayerController*                 PlayerController;                                  // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UActor*                                OldViewTarget;                                     // 0x8(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UActor*                                NewViewTarget;                                     // 0x10(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xC (0xC - 0x0)
// Function FortniteUI.AthenaHUDFeedbackLineCooldown.OnCooldownUpdated
struct UAthenaHUDFeedbackLineCooldown_OnCooldownUpdated_Params
{
public:
	float                                        CooldownDuration;                                  // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        CooldownRemaining;                                 // 0x4(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        CooldownPercentage;                                // 0x8(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaHUDFeedbackLineCooldown.OnCooldownTagChanged
struct UAthenaHUDFeedbackLineCooldown_OnCooldownTagChanged_Params
{
public:
	struct FGameplayTag                          CooldownTag;                                       // 0x0(0x4)(ConstParm, Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        Count;                                             // 0x4(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaHUDFeedbackLineCooldown.OnCooldownStarted
struct UAthenaHUDFeedbackLineCooldown_OnCooldownStarted_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaHUDFeedbackLineCooldown.OnCooldownFinished
struct UAthenaHUDFeedbackLineCooldown_OnCooldownFinished_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaMapScreenContainerTabInterface.OnTabAddedToMapScreenContainer
struct UAthenaMapScreenContainerTabInterface_OnTabAddedToMapScreenContainer_Params
{
public:
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaHUDBase.SetZoneCompleted
struct UAthenaHUDBase_SetZoneCompleted_Params
{
public:
	bool                                         bValue;                                            // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteUI.AthenaHUDBase.OnHUDScaleChanged
struct UAthenaHUDBase_OnHUDScaleChanged_Params
{
public:
	float                                        HUDScale;                                          // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaHUDBase.OnExtensionWidgetRemoved
struct UAthenaHUDBase_OnExtensionWidgetRemoved_Params
{
public:
	enum class EUIExtensionSlot                  ExtensionSlot;                                     // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3499[0x7];                                     // Fixing Size After Last Property
	class UUserWidget*                           Widget;                                            // 0x8(0x8)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaHUDBase.OnExtensionWidgetCreated
struct UAthenaHUDBase_OnExtensionWidgetCreated_Params
{
public:
	enum class EUIExtensionSlot                  ExtensionSlot;                                     // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_349C[0x7];                                     // Fixing Size After Last Property
	class UUserWidget*                           Widget;                                            // 0x8(0x8)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaHUDBase.HandleUpdateMinigameUIExtensions
struct UAthenaHUDBase_HandleUpdateMinigameUIExtensions_Params
{
public:
	class UFortMinigame*                         Minigame;                                          // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaHUDBase.HandleRecoverFromPostGame
struct UAthenaHUDBase_HandleRecoverFromPostGame_Params
{
public:
};

// 0xC (0xC - 0x0)
// Function FortniteUI.AthenaHUDBase.HandlePickerOpenRequest
struct UAthenaHUDBase_HandlePickerOpenRequest_Params
{
public:
	enum class EFortPickerMode                   Mode;                                              // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_34A3[0x3];                                     // Fixing Size After Last Property
	int32                                        InitialOption;                                     // 0x4(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIgnoreFirstAccept;                                // 0x8(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_34A4[0x3];                                     // Fixing Size Of Struct
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaHUDBase.HandleOnMutatorRemoved
struct UAthenaHUDBase_HandleOnMutatorRemoved_Params
{
public:
	class UFortGameplayMutator*                  NewMutator;                                        // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaHUDBase.HandleOnMutatorAdded
struct UAthenaHUDBase_HandleOnMutatorAdded_Params
{
public:
	class UFortGameplayMutator*                  NewMutator;                                        // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaHUDBase.HandleNewPanelFromMutator
struct UAthenaHUDBase_HandleNewPanelFromMutator_Params
{
public:
	TSubclassOf<class UUserWidget>               PanelClass;                                        // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaHUDBase.HandleMinigamePlayModeChanged
struct UAthenaHUDBase_HandleMinigamePlayModeChanged_Params
{
public:
	class UFortMinigame*                         Minigame;                                          // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIsInPlayMode;                                     // 0x8(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_34A7[0x7];                                     // Fixing Size Of Struct
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaHUDBase.HandleMinigameHideHUD
struct UAthenaHUDBase_HandleMinigameHideHUD_Params
{
public:
	bool                                         bLoading;                                          // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaHUDBase.HandleCursorModeChanging
struct UAthenaHUDBase_HandleCursorModeChanging_Params
{
public:
	bool                                         bCursorModeEnabled;                                // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_34AE[0x3];                                     // Fixing Size After Last Property
	class FName                                  ActionName;                                        // 0x4(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaHUDBase.HandleCursorModeChanged
struct UAthenaHUDBase_HandleCursorModeChanged_Params
{
public:
	bool                                         bCursorModeEnabled;                                // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_34AF[0x3];                                     // Fixing Size After Last Property
	class FName                                  ActionName;                                        // 0x4(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UUserWidget*                           CustomWidget;                                      // 0x8(0x8)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaHUDBase.GetZoneCompleted
struct UAthenaHUDBase_GetZoneCompleted_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaHUDBase.BindVolumeEvents
struct UAthenaHUDBase_BindVolumeEvents_Params
{
public:
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaQuestCategoryCompletedTracker.GetIsProgressBarEnabled
struct UAthenaQuestCategoryCompletedTracker_GetIsProgressBarEnabled_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.BattlePassEnabledInputData.GetData
struct UBattlePassEnabledInputData_GetData_Params
{
public:
	bool                                         InIsEnabled;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.BattlePassBulkBuyInputData.GetData
struct UBattlePassBulkBuyInputData_GetData_Params
{
public:
	bool                                         IsPageCompleted;                                   // 0x0(0x1)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_34B7[0x3];                                     // Fixing Size After Last Property
	int32                                        StartingPage;                                      // 0x4(0x4)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        EndingPage;                                        // 0x8(0x4)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        PurchaseCost;                                      // 0xC(0x4)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.DonutChallengeIdleGame.TryJump
struct UDonutChallengeIdleGame_TryJump_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.DonutChallengeIdleGame.StartGame
struct UDonutChallengeIdleGame_StartGame_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.DonutChallengeIdleGame.EndSuperJump
struct UDonutChallengeIdleGame_EndSuperJump_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.DonutChallengeIdleGame.EndJump
struct UDonutChallengeIdleGame_EndJump_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.DonutChallengeIdleGame.EndBumpyRide
struct UDonutChallengeIdleGame_EndBumpyRide_Params
{
public:
};

// 0x4 (0x4 - 0x0)
// Function FortniteUI.DonutChallengeIdleGame.DebugBPFloat
struct UDonutChallengeIdleGame_DebugBPFloat_Params
{
public:
	float                                        InFloat;                                           // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteUI.DonutChallengeIdleGame.BPUpdateStyle
struct UDonutChallengeIdleGame_BPUpdateStyle_Params
{
public:
	int32                                        NewStyle;                                          // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteUI.DonutChallengeIdleGame.BPUpdateSpeed
struct UDonutChallengeIdleGame_BPUpdateSpeed_Params
{
public:
	int32                                        NewSpeed;                                          // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteUI.DonutChallengeIdleGame.BPUpdateDistance
struct UDonutChallengeIdleGame_BPUpdateDistance_Params
{
public:
	int32                                        NewDistance;                                       // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteUI.DonutChallengeIdleGame.BPShowHighScore
struct UDonutChallengeIdleGame_BPShowHighScore_Params
{
public:
	int32                                        InNewHighScore;                                    // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteUI.DonutChallengeIdleGame.BPOnSpeedUpdated
struct UDonutChallengeIdleGame_BPOnSpeedUpdated_Params
{
public:
	int32                                        NewCurSpeed;                                       // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.DonutChallengeIdleGame.BPOnNextLevelReached
struct UDonutChallengeIdleGame_BPOnNextLevelReached_Params
{
public:
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.DonutChallengeIdleGame.BPOnMonsterNearChanged
struct UDonutChallengeIdleGame_BPOnMonsterNearChanged_Params
{
public:
	bool                                         bIsNearLevelMonster;                               // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.DonutChallengeIdleGame.BPOnJump
struct UDonutChallengeIdleGame_BPOnJump_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.DonutChallengeIdleGame.BPOnGameInitialized
struct UDonutChallengeIdleGame_BPOnGameInitialized_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.DonutChallengeIdleGame.BPOnFailedJumpPress
struct UDonutChallengeIdleGame_BPOnFailedJumpPress_Params
{
public:
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.DonutChallengeIdleGame.BPOnFacingDirectionChanged
struct UDonutChallengeIdleGame_BPOnFacingDirectionChanged_Params
{
public:
	bool                                         bIsLeftFacing;                                     // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.DonutChallengeIdleGame.BPOnCrash
struct UDonutChallengeIdleGame_BPOnCrash_Params
{
public:
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.DonutChallengeIdleGame.BPOnCollision
struct UDonutChallengeIdleGame_BPOnCollision_Params
{
public:
	enum class EFortDonutIdleGameObject          ObjectType;                                        // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.DonutChallengeIdleGame.BPGameOver
struct UDonutChallengeIdleGame_BPGameOver_Params
{
public:
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.FortActivatablePanel.RestoreScrollWidget
struct UFortActivatablePanel_RestoreScrollWidget_Params
{
public:
	class UWidget*                               FallbackWidget;                                    // 0x0(0x8)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.FortActivatablePanel.RestoreCenterWidget
struct UFortActivatablePanel_RestoreCenterWidget_Params
{
public:
	class UWidget*                               FallbackWidget;                                    // 0x0(0x8)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x40 (0x40 - 0x0)
// Function FortniteUI.FortActivatablePanel.AsyncPlaySound2D
struct UFortActivatablePanel_AsyncPlaySound2D_Params
{
public:
	class UObject*                               WorldContextObject;                                // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class USoundBase>             SoundToLoad;                                       // 0x8(0x28)(Parm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        VolumeMultiplier;                                  // 0x30(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        PitchMultiplier;                                   // 0x34(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        StartTime;                                         // 0x38(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_34CA[0x4];                                     // Fixing Size Of Struct
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.FortActivityBrowserAttributionsModal.OnCreditsModalInitialized
struct UFortActivityBrowserAttributionsModal_OnCreditsModalInitialized_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.FortActivityBrowserAttributionsModal.OnAttributionsModalInitialized
struct UFortActivityBrowserAttributionsModal_OnAttributionsModalInitialized_Params
{
public:
};

// 0x30 (0x30 - 0x0)
// Function FortniteUI.FortActivityBrowserAttributionsModal.GetLinkCodeTextFormat
struct UFortActivityBrowserAttributionsModal_GetLinkCodeTextFormat_Params
{
public:
	class FText                                  LinkCode;                                          // 0x0(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FText                                  ReturnValue;                                       // 0x18(0x18)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// 0x30 (0x30 - 0x0)
// Function FortniteUI.FortActivityBrowserAttributionsModal.GetCreatorTextFormat
struct UFortActivityBrowserAttributionsModal_GetCreatorTextFormat_Params
{
public:
	class FText                                  CreatorName;                                       // 0x0(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FText                                  ReturnValue;                                       // 0x18(0x18)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// 0x60 (0x60 - 0x0)
// Function FortniteUI.FortActivityBrowserAttributionsModal.GetAttributionsTextFormat
struct UFortActivityBrowserAttributionsModal_GetAttributionsTextFormat_Params
{
public:
	class FText                                  Title;                                             // 0x0(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FText                                  Author;                                            // 0x18(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FText                                  License;                                           // 0x30(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FText                                  ReturnValue;                                       // 0x48(0x18)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.BacchusHUDElement.ShowHighlight
struct UBacchusHUDElement_ShowHighlight_Params
{
public:
	bool                                         Show;                                              // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteUI.BacchusHUDElement.OnHUDStateUpdate
struct UBacchusHUDElement_OnHUDStateUpdate_Params
{
public:
	struct FFortHUDState                         NewState;                                          // 0x0(0x4)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.BacchusHUDElement.HandleInputMethodChanged
struct UBacchusHUDElement_HandleInputMethodChanged_Params
{
public:
	enum class ECommonInputType                  CurrentInputType;                                  // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.FortBangWrapperContentInterface.OnStopCallout
struct UFortBangWrapperContentInterface_OnStopCallout_Params
{
public:
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.FortBangWrapperContentInterface.OnStartCallout
struct UFortBangWrapperContentInterface_OnStartCallout_Params
{
public:
	class FName                                  TutorialObjectiveName;                             // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class ETutorialType                     TutorialType;                                      // 0x4(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_34D7[0x3];                                     // Fixing Size Of Struct
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.FortBangWrapperContentInterface.OnBangStateChanged
struct UFortBangWrapperContentInterface_OnBangStateChanged_Params
{
public:
	bool                                         bEnabled;                                          // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_34D8[0x3];                                     // Fixing Size After Last Property
	int32                                        Count;                                             // 0x4(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.FortCreativeCreateBuildModal.SetClearPersistentDataInputEnabled
struct UFortCreativeCreateBuildModal_SetClearPersistentDataInputEnabled_Params
{
public:
	bool                                         bEnabled;                                          // 0x0(0x1)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.FortCreativeCreateBuildModal.SetClearPersistentData
struct UFortCreativeCreateBuildModal_SetClearPersistentData_Params
{
public:
	bool                                         bInClearPersistentData;                            // 0x0(0x1)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.FortCreativeCreateBuildModal.OnQrCodeImageUpdated
struct UFortCreativeCreateBuildModal_OnQrCodeImageUpdated_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.FortCreativeCreateBuildModal.OnMnemonicCopied
struct UFortCreativeCreateBuildModal_OnMnemonicCopied_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.FortCreativeCreateBuildModal.OnCreateBuildSucceeded
struct UFortCreativeCreateBuildModal_OnCreateBuildSucceeded_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.FortCreativeCreateBuildModal.OnCreateBuildStarted
struct UFortCreativeCreateBuildModal_OnCreateBuildStarted_Params
{
public:
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.FortCreativeCreateBuildModal.OnCreateBuildFailed
struct UFortCreativeCreateBuildModal_OnCreateBuildFailed_Params
{
public:
	class FString                                ErrorCode;                                         // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.FortCreativeCreateBuildModal.OnContentSwitcherTransitioningChanged
struct UFortCreativeCreateBuildModal_OnContentSwitcherTransitioningChanged_Params
{
public:
	bool                                         bIsTransitioning;                                  // 0x0(0x1)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.FortCreativeCreateBuildModal.OnContentSwitcherActiveWidgetChanged
struct UFortCreativeCreateBuildModal_OnContentSwitcherActiveWidgetChanged_Params
{
public:
	class UWidget*                               ActiveWidget;                                      // 0x0(0x8)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.FortCreativeCreateBuildModal.OnClearPersistentDataSet
struct UFortCreativeCreateBuildModal_OnClearPersistentDataSet_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.FortCreativeCreateBuildModal.HandleCreatorPortalUrlButtonClicked
struct UFortCreativeCreateBuildModal_HandleCreatorPortalUrlButtonClicked_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.FortCreativeCreateBuildModal.BP_Reset
struct UFortCreativeCreateBuildModal_BP_Reset_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.FortCreativeCreatorAttributions.OnTitleCardButtonCreated
struct UFortCreativeCreatorAttributions_OnTitleCardButtonCreated_Params
{
public:
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.FortCreativeCreatorAttributions.OnTeamMemberTitleCardButtonCreated
struct UFortCreativeCreatorAttributions_OnTeamMemberTitleCardButtonCreated_Params
{
public:
	class UFortCreativeCreditsTeamTitleCard*     TeamMemberButton;                                  // 0x0(0x8)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.FortCreativeCreatorAttributions.OnSectionTitleCreated
struct UFortCreativeCreatorAttributions_OnSectionTitleCreated_Params
{
public:
	class UFortCreativeCreditsSectionTitle*      SectionTitle;                                      // 0x0(0x8)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.FortCreativeCreatorAttributions.OnCreditsButtonCreated
struct UFortCreativeCreatorAttributions_OnCreditsButtonCreated_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.FortCreativeCreatorAttributions.OnAttributionsButtonCreated
struct UFortCreativeCreatorAttributions_OnAttributionsButtonCreated_Params
{
public:
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.FortCreativeCreditsAttributions.OnAnimationUpdate
struct UFortCreativeCreditsAttributions_OnAnimationUpdate_Params
{
public:
	struct FLinearColor                          Color;                                             // 0x0(0x10)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteUI.FortCreativeCreditsAttributions.GetHoverAnimationLength
struct UFortCreativeCreditsAttributions_GetHoverAnimationLength_Params
{
public:
	float                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function FortniteUI.FortCreativeCreditsSectionTitle.SetTitleText
struct UFortCreativeCreditsSectionTitle_SetTitleText_Params
{
public:
	class FText                                  TitleText;                                         // 0x0(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.FortCreativeIslandInfoViewModel.UnbindViewModel
struct UFortCreativeIslandInfoViewModel_UnbindViewModel_Params
{
public:
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.FortCreativeIslandInfoViewModel.SetIslandDescriptionTags
struct UFortCreativeIslandInfoViewModel_SetIslandDescriptionTags_Params
{
public:
	TArray<struct FCreativeIslandDescriptionTag> IslandDescriptionTags;                             // 0x0(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.FortCreativeIslandInfoViewModel.IsPlayerInAnExperienceTheyOwn
struct UFortCreativeIslandInfoViewModel_IsPlayerInAnExperienceTheyOwn_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.FortCreativeIslandInfoViewModel.InitializeViewModel
struct UFortCreativeIslandInfoViewModel_InitializeViewModel_Params
{
public:
};

// 0x300 (0x300 - 0x0)
// Function FortniteUI.FortCreativeIslandInfoViewModel.HandleLinkDataQueryComplete
struct UFortCreativeIslandInfoViewModel_HandleLinkDataQueryComplete_Params
{
public:
	bool                                         bSuccess;                                          // 0x0(0x1)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_34E1[0x7];                                     // Fixing Size After Last Property
	class FString                                ErrorMessage;                                      // 0x8(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCreativeLoadedLinkData               LinkData;                                          // 0x18(0x2E8)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.FortCreativeIslandInfoViewModel.HandleDownloadThumbnailComplete
struct UFortCreativeIslandInfoViewModel_HandleDownloadThumbnailComplete_Params
{
public:
	bool                                         bSuccess;                                          // 0x0(0x1)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_34E2[0x7];                                     // Fixing Size After Last Property
	class UTexture2DDynamic*                     InThumbnailTexture;                                // 0x8(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function FortniteUI.FortCreativeIslandInfoViewModel.GetIslandTitle
struct UFortCreativeIslandInfoViewModel_GetIslandTitle_Params
{
public:
	class FText                                  ReturnValue;                                       // 0x0(0x18)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.FortCreativeIslandInfoViewModel.GetIslandDescriptionTags
struct UFortCreativeIslandInfoViewModel_GetIslandDescriptionTags_Params
{
public:
	TArray<struct FCreativeIslandDescriptionTag> ReturnValue;                                       // 0x0(0x10)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function FortniteUI.FortCreativeIslandInfoViewModel.GetIslandCode
struct UFortCreativeIslandInfoViewModel_GetIslandCode_Params
{
public:
	class FText                                  ReturnValue;                                       // 0x0(0x18)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function FortniteUI.FortCreativeIslandInfoViewModel.GetCreatorName
struct UFortCreativeIslandInfoViewModel_GetCreatorName_Params
{
public:
	class FText                                  ReturnValue;                                       // 0x0(0x18)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.FortMatchmakingKnobsModal.SetListDataSource
struct UFortMatchmakingKnobsModal_SetListDataSource_Params
{
public:
	enum class EUFortMatchmakingKnobsDataSource  ListType;                                          // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.FortMatchmakingKnobsModal.SetInScrimmage
struct UFortMatchmakingKnobsModal_SetInScrimmage_Params
{
public:
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.FortMatchmakingKnobsModal.SetInGameMode
struct UFortMatchmakingKnobsModal_SetInGameMode_Params
{
public:
	bool                                         bIsInGame;                                         // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.FortMatchmakingKnobsModal.RemoveFromModalLayer
struct UFortMatchmakingKnobsModal_RemoveFromModalLayer_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.FortMatchmakingKnobsModal.OnSetInGameMode
struct UFortMatchmakingKnobsModal_OnSetInGameMode_Params
{
public:
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.FortMatchmakingKnobsModal.OnSelectionUpdated
struct UFortMatchmakingKnobsModal_OnSelectionUpdated_Params
{
public:
	class UFortMatchmakingKnobsSpinnerButton*    CurrentSelection;                                  // 0x0(0x8)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.FortMatchmakingKnobsModal.OnInitForUserOptionValues
struct UFortMatchmakingKnobsModal_OnInitForUserOptionValues_Params
{
public:
	TScriptInterface<class UUserOptionValuesInterface> UserOptionValues;                                  // 0x0(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.FortMatchmakingKnobsModal.OnInitForOptionsComponent
struct UFortMatchmakingKnobsModal_OnInitForOptionsComponent_Params
{
public:
	class UFortActorOptionsComponent*            OptionsComponent;                                  // 0x0(0x8)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.FortMatchmakingKnobsModal.OnHoveredItemChanged
struct UFortMatchmakingKnobsModal_OnHoveredItemChanged_Params
{
public:
	class UObject*                               Item;                                              // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIsHovered;                                        // 0x8(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_34E5[0x7];                                     // Fixing Size Of Struct
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.FortMatchmakingKnobsModal.OnDataInitialized
struct UFortMatchmakingKnobsModal_OnDataInitialized_Params
{
public:
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.FortMatchmakingKnobsModal.OnCurrentItemSelectionChanged
struct UFortMatchmakingKnobsModal_OnCurrentItemSelectionChanged_Params
{
public:
	class UObject*                               Item;                                              // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.FortMatchmakingKnobsModal.OnAcceptAnimationComplete
struct UFortMatchmakingKnobsModal_OnAcceptAnimationComplete_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.FortMatchmakingKnobsModal.InitializeData
struct UFortMatchmakingKnobsModal_InitializeData_Params
{
public:
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.FortMatchmakingKnobsModal.InitForToyOptionsActor
struct UFortMatchmakingKnobsModal_InitForToyOptionsActor_Params
{
public:
	class UActor*                                InActor;                                           // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.FortMatchmakingKnobsModal.HasNonEventProperties
struct UFortMatchmakingKnobsModal_HasNonEventProperties_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x50 (0x50 - 0x0)
// Function FortniteUI.FortMatchmakingKnobsModal.HasMatchingTags
struct UFortMatchmakingKnobsModal_HasMatchingTags_Params
{
public:
	class UObject*                               Option;                                            // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                 CategoryTags;                                      // 0x8(0x20)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                 ContextTags;                                       // 0x28(0x20)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x48(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_34E6[0x7];                                     // Fixing Size Of Struct
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.FortMatchmakingKnobsModal.HasEventFunctionProperty
struct UFortMatchmakingKnobsModal_HasEventFunctionProperty_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.FortMatchmakingKnobsModal.HasEventDescriptorProperty
struct UFortMatchmakingKnobsModal_HasEventDescriptorProperty_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.FortMatchmakingKnobsModal.HandleRestorePropertiesClicked
struct UFortMatchmakingKnobsModal_HandleRestorePropertiesClicked_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.FortMatchmakingKnobsModal.HandleRestoreFunctionsClicked
struct UFortMatchmakingKnobsModal_HandleRestoreFunctionsClicked_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.FortMatchmakingKnobsModal.HandleRestoreEventsClicked
struct UFortMatchmakingKnobsModal_HandleRestoreEventsClicked_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.FortMatchmakingKnobsModal.HandleRestoreClicked
struct UFortMatchmakingKnobsModal_HandleRestoreClicked_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.FortMatchmakingKnobsModal.HandleCancelClicked
struct UFortMatchmakingKnobsModal_HandleCancelClicked_Params
{
public:
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.FortMatchmakingKnobsModal.GetSpinnerModificationStatus
struct UFortMatchmakingKnobsModal_GetSpinnerModificationStatus_Params
{
public:
	class UFortMatchmakingKnobsSpinnerButton*    SpinnerButton;                                     // 0x0(0x8)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EFortModifiedStatus               ReturnValue;                                       // 0x8(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_34E7[0x7];                                     // Fixing Size Of Struct
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.FortMatchmakingKnobsModal.GetScrolledOffWhitelistedPlayers
struct UFortMatchmakingKnobsModal_GetScrolledOffWhitelistedPlayers_Params
{
public:
	TArray<class FString>                        ReturnValue;                                       // 0x0(0x10)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.FortMatchmakingKnobsModal.GetModificationStatus
struct UFortMatchmakingKnobsModal_GetModificationStatus_Params
{
public:
	class UObject*                               Option;                                            // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EFortModifiedStatus               ReturnValue;                                       // 0x8(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_34E8[0x7];                                     // Fixing Size Of Struct
};

// 0x20 (0x20 - 0x0)
// Function FortniteUI.FortMatchmakingKnobsModal.DoesContainString
struct UFortMatchmakingKnobsModal_DoesContainString_Params
{
public:
	class UObject*                               Option;                                            // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                String;                                            // 0x8(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x18(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_34E9[0x7];                                     // Fixing Size Of Struct
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.FortMatchmakingKnobsModal.BP_GetUserOptionValuesInterface
struct UFortMatchmakingKnobsModal_BP_GetUserOptionValuesInterface_Params
{
public:
	TScriptInterface<class UUserOptionValuesInterface> ReturnValue;                                       // 0x0(0x10)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.FortMatchmakingKnobsModal.BP_GetOptionsComponent
struct UFortMatchmakingKnobsModal_BP_GetOptionsComponent_Params
{
public:
	class UFortActorOptionsComponent*            ReturnValue;                                       // 0x0(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.FortMatchmakingKnobsModal.BP_GetLabelOverrideInterface
struct UFortMatchmakingKnobsModal_BP_GetLabelOverrideInterface_Params
{
public:
	TScriptInterface<class UFortActorLabelOverrideInterface> ReturnValue;                                       // 0x0(0x10)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.FortMatchmakingKnobsModal.ApplyChanges
struct UFortMatchmakingKnobsModal_ApplyChanges_Params
{
public:
	bool                                         bApplySettingsFromCachedData;                      // 0x0(0x1)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteUI.FortCreativeMyIslandContentPanelInterface.BP_ShouldShowPanel
struct UFortCreativeMyIslandContentPanelInterface_BP_ShouldShowPanel_Params
{
public:
	bool                                         bOutShouldShowPanel;                               // 0x0(0x1)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EFortMinigameState                MinigameState;                                     // 0x1(0x1)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIsInReadOnlyExperience;                           // 0x2(0x1)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIsOwnerOfCurrentExperience;                       // 0x3(0x1)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xC (0xC - 0x0)
// Function FortniteUI.FortCreativeMyIslandPanel.ShouldShowTab
struct UFortCreativeMyIslandPanel_ShouldShowTab_Params
{
public:
	bool                                         bOutShouldShowTab;                                 // 0x0(0x1)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_34F4[0x3];                                     // Fixing Size After Last Property
	class FName                                  TabId;                                             // 0x4(0x4)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EFortMinigameState                MinigameState;                                     // 0x8(0x1)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIsInReadOnlyExperience;                           // 0x9(0x1)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIsOwnerOfCurrentExperience;                       // 0xA(0x1)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_34F5[0x1];                                     // Fixing Size Of Struct
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.FortCreativeMyIslandPanel.OnTabVisibilitiesUpdated
struct UFortCreativeMyIslandPanel_OnTabVisibilitiesUpdated_Params
{
public:
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.FortCreativeMyIslandPanel.OnMinigameStateChanged
struct UFortCreativeMyIslandPanel_OnMinigameStateChanged_Params
{
public:
	enum class EFortMinigameState                MinigameState;                                     // 0x0(0x1)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.FortCreativeMyIslandPanel.OnMinigameSettingsChanged
struct UFortCreativeMyIslandPanel_OnMinigameSettingsChanged_Params
{
public:
	class UFortMinigameSettingsBuilding*         MinigameSettings;                                  // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.FortCreativeMyIslandPanel.OnActiveMainContentWidgetChanged
struct UFortCreativeMyIslandPanel_OnActiveMainContentWidgetChanged_Params
{
public:
	class UWidget*                               ActiveWidget;                                      // 0x0(0x8)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        ActiveWidgetIndex;                                 // 0x8(0x4)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_34F6[0x4];                                     // Fixing Size Of Struct
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.FortCreativeMyIslandPanel.IsOwnerOfCurrentExperience
struct UFortCreativeMyIslandPanel_IsOwnerOfCurrentExperience_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.FortCreativeMyIslandPanel.HandleMinigameStateChanged
struct UFortCreativeMyIslandPanel_HandleMinigameStateChanged_Params
{
public:
	class UFortMinigame*                         Minigame;                                          // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EFortMinigameState                MinigameState;                                     // 0x8(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_34F7[0x7];                                     // Fixing Size Of Struct
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.FortCreativeMyIslandPanel.HandleMinigameSettingsMachineChanged
struct UFortCreativeMyIslandPanel_HandleMinigameSettingsMachineChanged_Params
{
public:
	class UFortMinigameVolumeComponent*          MinigameVolumeComponent;                           // 0x0(0x8)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortMinigameSettingsBuilding*         MinigameSettings;                                  // 0x8(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.FortCreativeMyIslandPanel.HandleCreativePermissionsChanged
struct UFortCreativeMyIslandPanel_HandleCreativePermissionsChanged_Params
{
public:
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.FortCreativeMyIslandPanel.GetMinigameVolumeComponent
struct UFortCreativeMyIslandPanel_GetMinigameVolumeComponent_Params
{
public:
	class UFortMinigameVolumeComponent*          ReturnValue;                                       // 0x0(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.FortCreativeMyIslandPanel.GetMinigameSettingsMachine
struct UFortCreativeMyIslandPanel_GetMinigameSettingsMachine_Params
{
public:
	class UFortMinigameSettingsBuilding*         ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.FortCreativePropertySubcategoryHeaderListItem.SetIsExpanded
struct UFortCreativePropertySubcategoryHeaderListItem_SetIsExpanded_Params
{
public:
	bool                                         bInIsExpanded;                                     // 0x0(0x1)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// DelegateFunction FortniteUI.FortCreativePropertySubcategoryHeaderListItem.OnIsExpandedChangedDynamic__DelegateSignature
struct UFortCreativePropertySubcategoryHeaderListItem_OnIsExpandedChangedDynamic__DelegateSignature_Params
{
public:
	bool                                         bIsExpanded;                                       // 0x0(0x1)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.FortCreativePropertySubcategoryHeaderListItem.IsExpanded
struct UFortCreativePropertySubcategoryHeaderListItem_IsExpanded_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteUI.FortCreativePropertySubcategoryHeaderListItem.GetSubcategoryTag
struct UFortCreativePropertySubcategoryHeaderListItem_GetSubcategoryTag_Params
{
public:
	struct FGameplayTag                          ReturnValue;                                       // 0x0(0x4)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// Function FortniteUI.FortCreativePropertySubcategoryTagToTextMap.GetSubcategoryDisplayName
struct UFortCreativePropertySubcategoryTagToTextMap_GetSubcategoryDisplayName_Params
{
public:
	struct FGameplayTag                          SubcategoryTag;                                    // 0x0(0x4)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_34FC[0x4];                                     // Fixing Size After Last Property
	class FText                                  ReturnValue;                                       // 0x8(0x18)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.FortEventDateTimeTextBlock.SetTimespanValue
struct UFortEventDateTimeTextBlock_SetTimespanValue_Params
{
public:
	struct FTimespan                             InTimespan;                                        // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EDateFormat                       InFormatStyle;                                     // 0x8(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_34FD[0x7];                                     // Fixing Size Of Struct
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.FortEventDateTimeTextBlock.SetDateTimeValue
struct UFortEventDateTimeTextBlock_SetDateTimeValue_Params
{
public:
	struct FDateTime                             InDateTime;                                        // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EDateFormat                       InFormatStyle;                                     // 0x8(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_34FE[0x3];                                     // Fixing Size After Last Property
	float                                        InRefreshDelay;                                    // 0xC(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function FortniteUI.FortEventDateTimeTextBlock.SetCountDownCompletionText
struct UFortEventDateTimeTextBlock_SetCountDownCompletionText_Params
{
public:
	class FText                                  InCompletionText;                                  // 0x0(0x18)(ConstParm, Parm, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// DelegateFunction FortniteUI.FortEventDateTimeTextBlock.OnCurrentTimeTextBlockUpdated__DelegateSignature
struct UFortEventDateTimeTextBlock_OnCurrentTimeTextBlockUpdated__DelegateSignature_Params
{
public:
	double                                       Seconds;                                           // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.FortEventDateTimeTextBlock.GetDateTime
struct UFortEventDateTimeTextBlock_GetDateTime_Params
{
public:
	struct FDateTime                             ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function FortniteUI.FortEditableFilteredCountedTextBox.ValidatePersistentID
struct UFortEditableFilteredCountedTextBox_ValidatePersistentID_Params
{
public:
	class FText                                  Text;                                              // 0x0(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.FortEditableFilteredCountedTextBox.UpdateCharacterCount
struct UFortEditableFilteredCountedTextBox_UpdateCharacterCount_Params
{
public:
};

// 0x18 (0x18 - 0x0)
// Function FortniteUI.FortEditableFilteredCountedTextBox.SetTextWithForcedSanitization
struct UFortEditableFilteredCountedTextBox_SetTextWithForcedSanitization_Params
{
public:
	class FText                                  Text;                                              // 0x0(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteUI.FortEditableFilteredCountedTextBox.SetEntryCharLimit
struct UFortEditableFilteredCountedTextBox_SetEntryCharLimit_Params
{
public:
	int32                                        InCharLimit;                                       // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x2 (0x2 - 0x0)
// Function FortniteUI.FortEditableFilteredCountedTextBox.OnDirtyTextAttempted
struct UFortEditableFilteredCountedTextBox_OnDirtyTextAttempted_Params
{
public:
	bool                                         bIsBadText;                                        // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bAdditionalValidationFailed;                       // 0x1(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// Function FortniteUI.FortEditableFilteredCountedTextBox.HandleTextCommitted
struct UFortEditableFilteredCountedTextBox_HandleTextCommitted_Params
{
public:
	class FText                                  Text;                                              // 0x0(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	enum class ETextCommit                       CommitMethod;                                      // 0x18(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3501[0x7];                                     // Fixing Size Of Struct
};

// 0x18 (0x18 - 0x0)
// Function FortniteUI.FortEditableFilteredCountedTextBox.HandleTextChanged
struct UFortEditableFilteredCountedTextBox_HandleTextChanged_Params
{
public:
	class FText                                  Text;                                              // 0x0(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.FortEditableFilteredCountedTextBox.GetIgnoreCharLimitValidation
struct UFortEditableFilteredCountedTextBox_GetIgnoreCharLimitValidation_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteUI.FortEditableFilteredCountedTextBox.GetEntryCharLimit
struct UFortEditableFilteredCountedTextBox_GetEntryCharLimit_Params
{
public:
	int32                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.FortEditableFilteredCountedTextBox.GetAllowStyleEditing
struct UFortEditableFilteredCountedTextBox_GetAllowStyleEditing_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.FortEditableFilteredCountedTextBox.GetAllowLineBreaks
struct UFortEditableFilteredCountedTextBox_GetAllowLineBreaks_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.FortEditableFilteredCountedTextBox.GetAllowedCharactersAsString
struct UFortEditableFilteredCountedTextBox_GetAllowedCharactersAsString_Params
{
public:
	class FString                                ReturnValue;                                       // 0x0(0x10)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// Function FortniteUI.FortFilteredNameEntryWidget.HandleOnTextCommitted
struct UFortFilteredNameEntryWidget_HandleOnTextCommitted_Params
{
public:
	class FText                                  Text;                                              // 0x0(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	enum class ETextCommit                       CommitMethod;                                      // 0x18(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3509[0x7];                                     // Fixing Size Of Struct
};

// 0xC (0xC - 0x0)
// Function FortniteUI.FortGlobalActionDetailsDataSource.RemoveOnChangeDelegate
struct UFortGlobalActionDetailsDataSource_RemoveOnChangeDelegate_Params
{
public:
	FDelegateProperty_                           InDelegate;                                        // 0x0(0xC)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.FortGlobalActionDetailsDataSource.GetValue
struct UFortGlobalActionDetailsDataSource_GetValue_Params
{
public:
	struct FFortGlobalActionDetails              ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};

// 0xC (0xC - 0x0)
// Function FortniteUI.FortGlobalActionDetailsDataSource.AddOnChangeDelegate
struct UFortGlobalActionDetailsDataSource_AddOnChangeDelegate_Params
{
public:
	FDelegateProperty_                           InDelegate;                                        // 0x0(0xC)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.FortHabaneroInfoEntry.OnSetGameMode
struct UFortHabaneroInfoEntry_OnSetGameMode_Params
{
public:
	class FString                                GameMode;                                          // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.FortHabaneroInfoModal.SetTimerVisibility
struct UFortHabaneroInfoModal_SetTimerVisibility_Params
{
public:
	enum class ESlateVisibility                  TimerVisibility;                                   // 0x0(0x1)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.FortHabaneroInfoModal.SetTimerText
struct UFortHabaneroInfoModal_SetTimerText_Params
{
public:
	struct FTimespan                             Timespan;                                          // 0x0(0x8)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// Function FortniteUI.FortHabaneroInfoModal.SetProgress
struct UFortHabaneroInfoModal_SetProgress_Params
{
public:
	class FString                                ProgressKey;                                       // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        CurrentHabanero;                                   // 0x10(0x4)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        CurrentPosition;                                   // 0x14(0x4)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ProgressPercent;                                   // 0x18(0x4)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_350B[0x4];                                     // Fixing Size Of Struct
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.FortHabaneroInfoModal.BP_OnScrollCompleted
struct UFortHabaneroInfoModal_BP_OnScrollCompleted_Params
{
public:
	bool                                         bScrolledDown;                                     // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xC0 (0xC0 - 0x0)
// Function FortniteUI.FortHabaneroTierWidget.UpdateWidgetDisplay
struct UFortHabaneroTierWidget_UpdateWidgetDisplay_Params
{
public:
	struct FFortHabaneroTier                     DisplayData;                                       // 0x0(0xC0)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.FortHabaneroTierWidget.StartQueryForRank
struct UFortHabaneroTierWidget_StartQueryForRank_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.FortHabaneroTierWidget.FailedToFindRank
struct UFortHabaneroTierWidget_FailedToFindRank_Params
{
public:
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.FortHabaneroLobbyWidget.UpdateProgressToNextHabanero
struct UFortHabaneroLobbyWidget_UpdateProgressToNextHabanero_Params
{
public:
	int32                                        UnrealRankPlayerPosition;                          // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ProgressPercent;                                   // 0x4(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.FortHabaneroLobbyWidget.SetBangVisible
struct UFortHabaneroLobbyWidget_SetBangVisible_Params
{
public:
	bool                                         bIsVisible;                                        // 0x0(0x1)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function FortniteUI.FortSetting.GetWarningRichText
struct UFortSetting_GetWarningRichText_Params
{
public:
	class FText                                  ReturnValue;                                       // 0x0(0x18)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function FortniteUI.FortSetting.GetDynamicDetails
struct UFortSetting_GetDynamicDetails_Params
{
public:
	class FText                                  ReturnValue;                                       // 0x0(0x18)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.FortSetting.GetDisplayNameVisibility
struct UFortSetting_GetDisplayNameVisibility_Params
{
public:
	enum class ESlateVisibility                  ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function FortniteUI.FortSetting.GetDisplayName
struct UFortSetting_GetDisplayName_Params
{
public:
	class FText                                  ReturnValue;                                       // 0x0(0x18)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.FortSetting.GetDevName
struct UFortSetting_GetDevName_Params
{
public:
	class FString                                ReturnValue;                                       // 0x0(0x10)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function FortniteUI.FortSetting.GetDescriptionRichText
struct UFortSetting_GetDescriptionRichText_Params
{
public:
	class FText                                  ReturnValue;                                       // 0x0(0x18)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.FortItemManagementMulchPanel.ShowMulchConfirmationModal
struct UFortItemManagementMulchPanel_ShowMulchConfirmationModal_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.FortItemManagementMulchPanel.NotifyPanelDeactivated
struct UFortItemManagementMulchPanel_NotifyPanelDeactivated_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.FortItemManagementMulchPanel.NotifyPanelActivated
struct UFortItemManagementMulchPanel_NotifyPanelActivated_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.FortItemManagementMulchPanel.HideMulchConfirmationModal
struct UFortItemManagementMulchPanel_HideMulchConfirmationModal_Params
{
public:
};

// 0x20 (0x20 - 0x0)
// Function FortniteUI.FortFrontendInventoryFilterFunctionLibrary.ToText
struct UFortFrontendInventoryFilterFunctionLibrary_ToText_Params
{
public:
	enum class EFortFrontendInventoryFilter      FrontendInventoryFilter;                           // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3519[0x7];                                     // Fixing Size After Last Property
	class FText                                  ReturnValue;                                       // 0x8(0x18)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// 0x30 (0x30 - 0x0)
// Function FortniteUI.ItemReceivedHeaderBase.SetBlueprintGiftBoxItem
struct UItemReceivedHeaderBase_SetBlueprintGiftBoxItem_Params
{
public:
	class UFortGiftBoxItem*                      GiftBox;                                           // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                FromUser;                                          // 0x8(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FFortReceivedItemLootInfo>     ItemDefs;                                          // 0x18(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                         bSelfGift;                                         // 0x28(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_351C[0x7];                                     // Fixing Size Of Struct
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.ItemReceivedHeaderBase.InitFromGiftBoxItem_BP
struct UItemReceivedHeaderBase_InitFromGiftBoxItem_BP_Params
{
public:
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.FortMobileEasyLootGrid.RemoveItemEntry
struct UFortMobileEasyLootGrid_RemoveItemEntry_Params
{
public:
	class UFortMobileEasyLootGridItemEntry*      Entry;                                             // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.FortMobileEasyLootGrid.OnLootFeedBack
struct UFortMobileEasyLootGrid_OnLootFeedBack_Params
{
public:
	bool                                         bEnable;                                           // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.FortMobileEasyLootGrid.OnCollapsedListPressed
struct UFortMobileEasyLootGrid_OnCollapsedListPressed_Params
{
public:
	bool                                         bShouldCollapseList;                               // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.FortMobileEasyLootGrid.OnBackpackFullChanged
struct UFortMobileEasyLootGrid_OnBackpackFullChanged_Params
{
public:
	bool                                         bFull;                                             // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.FortMobileEasyLootGrid.OnAutoPickupPressed
struct UFortMobileEasyLootGrid_OnAutoPickupPressed_Params
{
public:
	bool                                         bEnable;                                           // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function FortniteUI.FortMobileEasyLootGrid.IsEasyLootGridEnabledForActor
struct UFortMobileEasyLootGrid_IsEasyLootGridEnabledForActor_Params
{
public:
	class UFortPlayerController*                 FortPC;                                            // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UActor*                                PickUpItem;                                        // 0x8(0x8)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x10(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3522[0x7];                                     // Fixing Size Of Struct
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.FortMobileEasyLootGrid.IsEasyLootGridEnabled
struct UFortMobileEasyLootGrid_IsEasyLootGridEnabled_Params
{
public:
	class UFortPlayerController*                 FortPC;                                            // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x8(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3524[0x7];                                     // Fixing Size Of Struct
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.FortMobileEasyLootGrid.HandleCollapsedListPressed
struct UFortMobileEasyLootGrid_HandleCollapsedListPressed_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.FortMobileEasyLootGrid.HandleAutoPickUpPressed
struct UFortMobileEasyLootGrid_HandleAutoPickUpPressed_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.FortMobileEasyLootGridListEntry.SecondaryButtonClicked
struct UFortMobileEasyLootGridListEntry_SecondaryButtonClicked_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.FortMobileEasyLootGridListEntry.PrimaryButtonClicked
struct UFortMobileEasyLootGridListEntry_PrimaryButtonClicked_Params
{
public:
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.FortMobileEasyLootGridListEntry.OnItemRemoved
struct UFortMobileEasyLootGridListEntry_OnItemRemoved_Params
{
public:
	class UFortMobileEasyLootGrid*               List;                                              // 0x0(0x8)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.FortMobileEasyLootGridListEntry.OnItemAdded
struct UFortMobileEasyLootGridListEntry_OnItemAdded_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.FortItemPreviewScreen.ShowItemDetails
struct UFortItemPreviewScreen_ShowItemDetails_Params
{
public:
};

// 0x18 (0x18 - 0x0)
// Function FortniteUI.FortItemPreviewScreen.OnPreviewActionButtonUpdated
struct UFortItemPreviewScreen_OnPreviewActionButtonUpdated_Params
{
public:
	class FText                                  RowDisplayName;                                    // 0x0(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.FortItemPreviewScreen.HideItemDetails
struct UFortItemPreviewScreen_HideItemDetails_Params
{
public:
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.FortMPItemShopScreen.RequestItemPreview
struct UFortMPItemShopScreen_RequestItemPreview_Params
{
public:
	class FString                                InPreviewedItemTemplateID;                         // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.FortSocialUserViewModel.SetSocialUser
struct UFortSocialUserViewModel_SetSocialUser_Params
{
public:
	class UFortSocialUser*                       InSocialUser;                                      // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.FortSocialUserViewModel.GetSocialUser
struct UFortSocialUserViewModel_GetSocialUser_Params
{
public:
	class UFortSocialUser*                       ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteUI.FortOptionsMenuInputData.GetInputScale
struct UFortOptionsMenuInputData_GetInputScale_Params
{
public:
	float                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.FortOptionsMenuInputData.GetInputActionGroup
struct UFortOptionsMenuInputData_GetInputActionGroup_Params
{
public:
	enum class EFortInputActionGroup             ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.FortPersistentTabObject.OnTabInitialized
struct UFortPersistentTabObject_OnTabInitialized_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.FortPersistentTabObject.OnTabExited
struct UFortPersistentTabObject_OnTabExited_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.FortPersistentTabObject.OnTabEntered
struct UFortPersistentTabObject_OnTabEntered_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.FortPersistentTabObject.OnTabDestroyed
struct UFortPersistentTabObject_OnTabDestroyed_Params
{
public:
};

// 0x2 (0x2 - 0x0)
// Function FortniteUI.FortPlayerAvatar.OnOnlinePresenceChanged
struct UFortPlayerAvatar_OnOnlinePresenceChanged_Params
{
public:
	bool                                         bHidePresence;                                     // 0x0(0x1)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EPresenceIndicatorState           PresenceState;                                     // 0x1(0x1)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.FortPlayerSurveyResponseChoiceBase.SetChoiceType
struct UFortPlayerSurveyResponseChoiceBase_SetChoiceType_Params
{
public:
	enum class EFortPlayerSurveyResponseChoiceType Type;                                              // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.FortPlayerSurveyResponseChoiceBase.OnSurveyResetChoice
struct UFortPlayerSurveyResponseChoiceBase_OnSurveyResetChoice_Params
{
public:
};

// 0x50 (0x50 - 0x0)
// Function FortniteUI.FortRichTextTextureDecoratorHelpers.MakeFortRichTextTexture
struct UFortRichTextTextureDecoratorHelpers_MakeFortRichTextTexture_Params
{
public:
	TSoftObjectPtr<class UTexture2D>             InTexture;                                         // 0x0(0x28)(ConstParm, Parm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bUseDesiredSize;                                   // 0x28(0x1)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_354E[0x3];                                     // Fixing Size After Last Property
	int32                                        Width;                                             // 0x2C(0x4)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        Height;                                            // 0x30(0x4)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_354F[0x4];                                     // Fixing Size After Last Property
	class FText                                  ReturnValue;                                       // 0x38(0x18)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// 0x50 (0x50 - 0x0)
// Function FortniteUI.FortRichTextTextureDecoratorHelpers.MakeFortRichTextMaterial
struct UFortRichTextTextureDecoratorHelpers_MakeFortRichTextMaterial_Params
{
public:
	TSoftObjectPtr<class UMaterialInterface>     InMaterial;                                        // 0x0(0x28)(ConstParm, Parm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bUseDesiredSize;                                   // 0x28(0x1)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3550[0x3];                                     // Fixing Size After Last Property
	int32                                        Width;                                             // 0x2C(0x4)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        Height;                                            // 0x30(0x4)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3551[0x4];                                     // Fixing Size After Last Property
	class FText                                  ReturnValue;                                       // 0x38(0x18)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.FortSettingValueDiscrete.GetDiscreteOptions
struct UFortSettingValueDiscrete_GetDiscreteOptions_Params
{
public:
	TArray<class FText>                          ReturnValue;                                       // 0x0(0x10)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteUI.FortSettingValueDiscrete.GetDiscreteOptionInitialIndex
struct UFortSettingValueDiscrete_GetDiscreteOptionInitialIndex_Params
{
public:
	int32                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteUI.FortSettingValueDiscrete.GetDiscreteOptionIndex
struct UFortSettingValueDiscrete_GetDiscreteOptionIndex_Params
{
public:
	int32                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteUI.FortSettingValueDiscrete.GetDiscreteOptionDefaultIndex
struct UFortSettingValueDiscrete_GetDiscreteOptionDefaultIndex_Params
{
public:
	int32                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.FortSettingValueDiscrete.GetDisabledOptionsReasons
struct UFortSettingValueDiscrete_GetDisabledOptionsReasons_Params
{
public:
	TArray<class FText>                          ReturnValue;                                       // 0x0(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.FortSettingValueDiscrete.GetDisabledOptions
struct UFortSettingValueDiscrete_GetDisabledOptions_Params
{
public:
	TArray<class FText>                          ReturnValue;                                       // 0x0(0x10)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.FortSocialUserWidget.SetSocialUserFromOwningPlayer
struct UFortSocialUserWidget_SetSocialUserFromOwningPlayer_Params
{
public:
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.FortSocialUserWidget.OnSetSocialUser
struct UFortSocialUserWidget_OnSetSocialUser_Params
{
public:
	class UFortSocialUser*                       SocialUser;                                        // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.FortTabViewModel.GetLinkedUIFeature
struct UFortTabViewModel_GetLinkedUIFeature_Params
{
public:
	enum class EFortUIFeature                    ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.FortTabViewModel.GetButtonGroup
struct UFortTabViewModel_GetButtonGroup_Params
{
public:
	enum class EFFortTopBarTabButtonGroup        ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.FortTabViewModel.GetBangType
struct UFortTabViewModel_GetBangType_Params
{
public:
	enum class EFortBangType                     ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xC (0xC - 0x0)
// Function FortniteUI.FortTimespanDataSource.RemoveOnChangeDelegate
struct UFortTimespanDataSource_RemoveOnChangeDelegate_Params
{
public:
	FDelegateProperty_                           InDelegate;                                        // 0x0(0xC)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.FortTimespanDataSource.GetValue
struct UFortTimespanDataSource_GetValue_Params
{
public:
	struct FTimespan                             ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xC (0xC - 0x0)
// Function FortniteUI.FortTimespanDataSource.AddOnChangeDelegate
struct UFortTimespanDataSource_AddOnChangeDelegate_Params
{
public:
	FDelegateProperty_                           InDelegate;                                        // 0x0(0xC)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// DelegateFunction FortniteUI.FortUISpecialEventSubsystem.SpecialUIEventDelegate__DelegateSignature
struct UFortUISpecialEventSubsystem_SpecialUIEventDelegate__DelegateSignature_Params
{
public:
	enum class EFortUISpecialEvents              InEventName;                                       // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.FortUISpecialEventSubsystem.SetCurrentUISpecialEventState
struct UFortUISpecialEventSubsystem_SetCurrentUISpecialEventState_Params
{
public:
	enum class EFortUISpecialEvents              InNewEventState;                                   // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.FortUISpecialEventSubsystem.GetCurrentUIEventState
struct UFortUISpecialEventSubsystem_GetCurrentUIEventState_Params
{
public:
	enum class EFortUISpecialEvents              ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.FortUISpecialEventSubsystem.CallTemporarySpecialUIEvent
struct UFortUISpecialEventSubsystem_CallTemporarySpecialUIEvent_Params
{
public:
	enum class EFortUISpecialEvents              InNewTemporaryEvent;                               // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x30 (0x30 - 0x0)
// Function FortniteUI.FortUserChoiceWidget.SetChoices
struct UFortUserChoiceWidget_SetChoices_Params
{
public:
	struct FChoiceData                           ChoiceItems;                                       // 0x0(0x30)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.GamePhaseWidget.OnMinigameStateChanged
struct UGamePhaseWidget_OnMinigameStateChanged_Params
{
public:
	class UFortMinigame*                         Minigame;                                          // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EFortMinigameState                NewMinigameState;                                  // 0x8(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3564[0x7];                                     // Fixing Size Of Struct
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.GamePhaseWidget.OnMinigameReady
struct UGamePhaseWidget_OnMinigameReady_Params
{
public:
	class UFortMinigame*                         Minigame;                                          // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.GamePhaseWidget.MinigameStateChangedEvent
struct UGamePhaseWidget_MinigameStateChangedEvent_Params
{
public:
	class UFortMinigame*                         Minigame;                                          // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EFortMinigameState                NewMinigameState;                                  // 0x8(0x1)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3565[0x7];                                     // Fixing Size Of Struct
};

// 0x18 (0x18 - 0x0)
// Function FortniteUI.GamePhaseWidget.HandleGamePhaseStepChanged
struct UGamePhaseWidget_HandleGamePhaseStepChanged_Params
{
public:
	TScriptInterface<class UFortSafeZoneInterface> InSafeZoneInterface;                               // 0x0(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EAthenaGamePhaseStep              GamePhaseStep;                                     // 0x10(0x1)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3566[0x7];                                     // Fixing Size Of Struct
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.HudBindingCheckInterface.ShowBindWidgets
struct UHudBindingCheckInterface_ShowBindWidgets_Params
{
public:
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.HudBindingCheckInterface.ShouldShowPromptInHud
struct UHudBindingCheckInterface_ShouldShowPromptInHud_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.HudBindingCheckInterface.HideBindWidgets
struct UHudBindingCheckInterface_HideBindWidgets_Params
{
public:
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.HudBindingCheckInterface.GetBindActions
struct UHudBindingCheckInterface_GetBindActions_Params
{
public:
	TArray<class FName>                          OutActions;                                        // 0x0(0x10)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.HUDLayoutToolV2_WidgetPreview.HandleOperationDrop
struct UHUDLayoutToolV2_WidgetPreview_HandleOperationDrop_Params
{
public:
	class UDragDropOperation*                    Operation;                                         // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.RebootRallyQRCode.SetIsInvite
struct URebootRallyQRCode_SetIsInvite_Params
{
public:
	bool                                         bIsInvite;                                         // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x2C (0x2C - 0x0)
// Function FortniteUI.UIKitBlock.SetBlockTiming
struct UUIKitBlock_SetBlockTiming_Params
{
public:
	struct FUIKitBlockTiming                     Timing;                                            // 0x0(0x2C)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.UIKitBlock.RequestTransition
struct UUIKitBlock_RequestTransition_Params
{
public:
	enum class EUIKitBlockVisualState            State;                                             // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.UIKitBlock.RequestInstantTransition
struct UUIKitBlock_RequestInstantTransition_Params
{
public:
	enum class EUIKitBlockInstantTransitionState State;                                             // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.UIKitBlock.PlayTransition
struct UUIKitBlock_PlayTransition_Params
{
public:
	class UWidgetAnimation*                      Animation;                                         // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bPlayForward;                                      // 0x8(0x1)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3570[0x7];                                     // Fixing Size Of Struct
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.UIKitBlock.OnTransitionUnhoveredRequested
struct UUIKitBlock_OnTransitionUnhoveredRequested_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.UIKitBlock.OnTransitionUnfocusedRequested
struct UUIKitBlock_OnTransitionUnfocusedRequested_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.UIKitBlock.OnTransitionSelectedRequested
struct UUIKitBlock_OnTransitionSelectedRequested_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.UIKitBlock.OnTransitionReleasedRequested
struct UUIKitBlock_OnTransitionReleasedRequested_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.UIKitBlock.OnTransitionPressedRequested
struct UUIKitBlock_OnTransitionPressedRequested_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.UIKitBlock.OnTransitionHoveredRequested
struct UUIKitBlock_OnTransitionHoveredRequested_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.UIKitBlock.OnTransitionFocusedRequested
struct UUIKitBlock_OnTransitionFocusedRequested_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.UIKitBlock.OnTransitionEnabledRequested
struct UUIKitBlock_OnTransitionEnabledRequested_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.UIKitBlock.OnTransitionDisabledRequested
struct UUIKitBlock_OnTransitionDisabledRequested_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.UIKitBlock.OnTransitionDeselectedIdleRequested
struct UUIKitBlock_OnTransitionDeselectedIdleRequested_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.UIKitBlock.OnTransitionDeselectedFocusedRequested
struct UUIKitBlock_OnTransitionDeselectedFocusedRequested_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.UIKitBlock.OnInstantTransitionToUnlocked
struct UUIKitBlock_OnInstantTransitionToUnlocked_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.UIKitBlock.OnInstantTransitionToSelected
struct UUIKitBlock_OnInstantTransitionToSelected_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.UIKitBlock.OnInstantTransitionToLocked
struct UUIKitBlock_OnInstantTransitionToLocked_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.UIKitBlock.OnInstantTransitionToEnabled
struct UUIKitBlock_OnInstantTransitionToEnabled_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.UIKitBlock.OnInstantTransitionToDisabled
struct UUIKitBlock_OnInstantTransitionToDisabled_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.UIKitBlock.OnInstantTransitionToDeselected
struct UUIKitBlock_OnInstantTransitionToDeselected_Params
{
public:
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.UIKitBlock.GetTransitionTime
struct UUIKitBlock_GetTransitionTime_Params
{
public:
	enum class EUIKitBlockVisualState            State;                                             // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3571[0x3];                                     // Fixing Size After Last Property
	float                                        ReturnValue;                                       // 0x4(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function FortniteUI.UIKitBlueprintFunctionLibrary.PlayAnimationDuringTime
struct UUIKitBlueprintFunctionLibrary_PlayAnimationDuringTime_Params
{
public:
	class UUserWidget*                           Widget;                                            // 0x0(0x8)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UWidgetAnimation*                      Animation;                                         // 0x8(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        PlayTime;                                          // 0x10(0x4)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bPlayForward;                                      // 0x14(0x1)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3574[0x3];                                     // Fixing Size Of Struct
};

// 0x20 (0x20 - 0x0)
// Function FortniteUI.UIKitTabGroup.SetInputActions
struct UUIKitTabGroup_SetInputActions_Params
{
public:
	struct FDataTableRowHandle                   NextTab;                                           // 0x0(0x10)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	struct FDataTableRowHandle                   PreviousTab;                                       // 0x10(0x10)(Parm, NoDestructor, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.UIKitTabGroup.HandlePreviousTabInput
struct UUIKitTabGroup_HandlePreviousTabInput_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.UIKitTabGroup.HandleNextTabInput
struct UUIKitTabGroup_HandleNextTabInput_Params
{
public:
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.FortServerTileBase.OnLaunchButtonEnableChanged
struct UFortServerTileBase_OnLaunchButtonEnableChanged_Params
{
public:
	bool                                         bEnableValue;                                      // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.FortNamedServerActionTile.UpdateButtonText
struct UFortNamedServerActionTile_UpdateButtonText_Params
{
public:
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.FortNamedServerActionTile.IsActionIslandSelectType
struct UFortNamedServerActionTile_IsActionIslandSelectType_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteUI.FortServerInfoTileBase.RequestUpdateBackgroundImage
struct UFortServerInfoTileBase_RequestUpdateBackgroundImage_Params
{
public:
	int32                                        FriendListHash;                                    // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.FortServerInfoTileBase.OnOwnerNameUpdated
struct UFortServerInfoTileBase_OnOwnerNameUpdated_Params
{
public:
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.ApolloIntroShimBase.HandleGamePhaseChanged
struct UApolloIntroShimBase_HandleGamePhaseChanged_Params
{
public:
	enum class EAthenaGamePhase                  GamePhase;                                         // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.FortAsyncAction_CheckForStwMfaReward.CheckForStwMfaReward
struct UFortAsyncAction_CheckForStwMfaReward_CheckForStwMfaReward_Params
{
public:
	class UFortPlayerController*                 PlayerController;                                  // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortAsyncAction_CheckForStwMfaReward* ReturnValue;                                       // 0x8(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x48 (0x48 - 0x0)
// Function FortniteUI.FortAsyncAction_CreateWidgetAsync.CreateWidgetAsync
struct UFortAsyncAction_CreateWidgetAsync_CreateWidgetAsync_Params
{
public:
	class UObject*                               WorldContextObject;                                // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UUserWidget>             UserWidgetSoftClass;                               // 0x8(0x28)(Parm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayerController*                     OwningPlayer;                                      // 0x30(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bSuspendInputUntilComplete;                        // 0x38(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_358B[0x7];                                     // Fixing Size After Last Property
	class UFortAsyncAction_CreateWidgetAsync*    ReturnValue;                                       // 0x40(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x48 (0x48 - 0x0)
// Function FortniteUI.FortAsyncAction_LoadBannerAsset.AsyncLoadBannerAsset
struct UFortAsyncAction_LoadBannerAsset_AsyncLoadBannerAsset_Params
{
public:
	class UObject*                               WorldContextObject;                                // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UObject>                AssetToLoad;                                       // 0x8(0x28)(Parm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInstanceDynamic*              MIDRef;                                            // 0x30(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  BannerColorName;                                   // 0x38(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_358F[0x4];                                     // Fixing Size After Last Property
	class UFortAsyncAction_LoadBannerAsset*      ReturnValue;                                       // 0x40(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.FortAsyncAction_LoadCurrentSubgameProfiles.LoadCurrentSubgameProfiles
struct UFortAsyncAction_LoadCurrentSubgameProfiles_LoadCurrentSubgameProfiles_Params
{
public:
	class UFortPlayerController*                 PlayerController;                                  // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortAsyncAction_LoadCurrentSubgameProfiles* ReturnValue;                                       // 0x8(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x130 (0x130 - 0x0)
// Function FortniteUI.FortAsyncAction_ShowConfirmation_NUI.ShowSimpleConfirmationDialog_NUI
struct UFortAsyncAction_ShowConfirmation_NUI_ShowSimpleConfirmationDialog_NUI_Params
{
public:
	class UObject*                               InWorldContextObject;                              // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3593[0x8];                                     // Fixing Size After Last Property
	struct FSlateBrush                           Icon;                                              // 0x10(0xC0)(Parm, NativeAccessSpecifierPublic)
	class FText                                  Title;                                             // 0xD0(0x18)(Parm, NativeAccessSpecifierPublic)
	class FText                                  Message;                                           // 0xE8(0x18)(Parm, NativeAccessSpecifierPublic)
	bool                                         bShowConfirm;                                      // 0x100(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bShowDecline;                                      // 0x101(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3594[0x6];                                     // Fixing Size After Last Property
	class UWidget*                               AdditionalContent;                                 // 0x108(0x8)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UWidget*                               LeftAdditionalContent;                             // 0x110(0x8)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ULocalPlayer*                          TargetPlayer;                                      // 0x118(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortAsyncAction_ShowConfirmation_NUI* ReturnValue;                                       // 0x120(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3595[0x8];                                     // Fixing Size Of Struct
};

// 0x130 (0x130 - 0x0)
// Function FortniteUI.FortAsyncAction_ShowConfirmation_NUI.ShowSimpleConfirmationDialog_CustomInput
struct UFortAsyncAction_ShowConfirmation_NUI_ShowSimpleConfirmationDialog_CustomInput_Params
{
public:
	class UObject*                               InWorldContextObject;                              // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3598[0x8];                                     // Fixing Size After Last Property
	struct FSlateBrush                           Icon;                                              // 0x10(0xC0)(Parm, NativeAccessSpecifierPublic)
	class FText                                  Title;                                             // 0xD0(0x18)(Parm, NativeAccessSpecifierPublic)
	class FText                                  Message;                                           // 0xE8(0x18)(Parm, NativeAccessSpecifierPublic)
	class FName                                  ConfirmAction;                                     // 0x100(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  DeclineAction;                                     // 0x104(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UWidget*                               AdditionalContent;                                 // 0x108(0x8)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UWidget*                               LeftAdditionalContent;                             // 0x110(0x8)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         Cancelable;                                        // 0x118(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_359A[0x7];                                     // Fixing Size After Last Property
	class ULocalPlayer*                          TargetPlayer;                                      // 0x120(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortAsyncAction_ShowConfirmation_NUI* ReturnValue;                                       // 0x128(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x140 (0x140 - 0x0)
// Function FortniteUI.FortAsyncAction_ShowConfirmation_NUI.ShowConfirmationDialog_NUI
struct UFortAsyncAction_ShowConfirmation_NUI_ShowConfirmationDialog_NUI_Params
{
public:
	class UObject*                               InWorldContextObject;                              // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_359C[0x8];                                     // Fixing Size After Last Property
	struct FSlateBrush                           Icon;                                              // 0x10(0xC0)(Parm, NativeAccessSpecifierPublic)
	class FText                                  Title;                                             // 0xD0(0x18)(Parm, NativeAccessSpecifierPublic)
	class FText                                  Message;                                           // 0xE8(0x18)(Parm, NativeAccessSpecifierPublic)
	TArray<struct FConfirmationDialogAction>     ConfirmButtonInputActions;                         // 0x100(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	class FName                                  DeclineButtonInputAction;                          // 0x110(0x4)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_359D[0x4];                                     // Fixing Size After Last Property
	class UWidget*                               AdditionalContent;                                 // 0x118(0x8)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UWidget*                               LeftAdditionalContent;                             // 0x120(0x8)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ULocalPlayer*                          TargetPlayer;                                      // 0x128(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortAsyncAction_ShowConfirmation_NUI* ReturnValue;                                       // 0x130(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_359E[0x8];                                     // Fixing Size Of Struct
};

// 0x38 (0x38 - 0x0)
// Function FortniteUI.FortAsyncAction_PushPrimaryContent.PushPrimaryContentSoftClassAsyncForPlayer
struct UFortAsyncAction_PushPrimaryContent_PushPrimaryContentSoftClassAsyncForPlayer_Params
{
public:
	class UPlayerController*                     ContextPC;                                         // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UCommonActivatableWidget> SoftWidgetClass;                                   // 0x8(0x28)(ConstParm, Parm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortAsyncAction_PushPrimaryContent*   ReturnValue;                                       // 0x30(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x38 (0x38 - 0x0)
// Function FortniteUI.FortAsyncAction_PushPrimaryContent.PushPrimaryContentSoftClassAsync
struct UFortAsyncAction_PushPrimaryContent_PushPrimaryContentSoftClassAsync_Params
{
public:
	class UUserWidget*                           ContextWidget;                                     // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UCommonActivatableWidget> SoftWidgetClass;                                   // 0x8(0x28)(ConstParm, Parm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortAsyncAction_PushPrimaryContent*   ReturnValue;                                       // 0x30(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function FortniteUI.FortAsyncAction_PushPrimaryContent.PushPrimaryContentClassAsyncForPlayer
struct UFortAsyncAction_PushPrimaryContent_PushPrimaryContentClassAsyncForPlayer_Params
{
public:
	class UPlayerController*                     ContextPC;                                         // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UCommonActivatableWidget>  WidgetClass;                                       // 0x8(0x8)(ConstParm, Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortAsyncAction_PushPrimaryContent*   ReturnValue;                                       // 0x10(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function FortniteUI.FortAsyncAction_PushPrimaryContent.PushPrimaryContentClassAsync
struct UFortAsyncAction_PushPrimaryContent_PushPrimaryContentClassAsync_Params
{
public:
	class UUserWidget*                           ContextWidget;                                     // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UCommonActivatableWidget>  WidgetClass;                                       // 0x8(0x8)(ConstParm, Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortAsyncAction_PushPrimaryContent*   ReturnValue;                                       // 0x10(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// DelegateFunction FortniteUI.FortAsyncAction_PushPrimaryContent.OnPrimaryContentPushed__DelegateSignature
struct UFortAsyncAction_PushPrimaryContent_OnPrimaryContentPushed__DelegateSignature_Params
{
public:
	class UCommonActivatableWidget*              ActivatableWidget;                                 // 0x0(0x8)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x38 (0x38 - 0x0)
// Function FortniteUI.FortAsyncAction_QueueModalWidget.QueueModalWidgetSoftClassAsyncForPlayer
struct UFortAsyncAction_QueueModalWidget_QueueModalWidgetSoftClassAsyncForPlayer_Params
{
public:
	class UPlayerController*                     PlayerController;                                  // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UCommonActivatableWidget> SoftWidgetClass;                                   // 0x8(0x28)(ConstParm, Parm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortAsyncAction_QueueModalWidget*     ReturnValue;                                       // 0x30(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x38 (0x38 - 0x0)
// Function FortniteUI.FortAsyncAction_QueueModalWidget.QueueModalWidgetSoftClassAsyncForLocalPlayer
struct UFortAsyncAction_QueueModalWidget_QueueModalWidgetSoftClassAsyncForLocalPlayer_Params
{
public:
	class ULocalPlayer*                          LocalPlayer;                                       // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UCommonActivatableWidget> SoftWidgetClass;                                   // 0x8(0x28)(ConstParm, Parm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortAsyncAction_QueueModalWidget*     ReturnValue;                                       // 0x30(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x38 (0x38 - 0x0)
// Function FortniteUI.FortAsyncAction_QueueModalWidget.QueueModalWidgetSoftClassAsync
struct UFortAsyncAction_QueueModalWidget_QueueModalWidgetSoftClassAsync_Params
{
public:
	class UUserWidget*                           ContextWidget;                                     // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UCommonActivatableWidget> SoftWidgetClass;                                   // 0x8(0x28)(ConstParm, Parm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortAsyncAction_QueueModalWidget*     ReturnValue;                                       // 0x30(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function FortniteUI.FortAsyncAction_QueueModalWidget.QueueModalWidgetClassAsyncForPlayer
struct UFortAsyncAction_QueueModalWidget_QueueModalWidgetClassAsyncForPlayer_Params
{
public:
	class UPlayerController*                     PlayerController;                                  // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UCommonActivatableWidget>  WidgetClass;                                       // 0x8(0x8)(ConstParm, Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortAsyncAction_QueueModalWidget*     ReturnValue;                                       // 0x10(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function FortniteUI.FortAsyncAction_QueueModalWidget.QueueModalWidgetClassAsyncForLocalPlayer
struct UFortAsyncAction_QueueModalWidget_QueueModalWidgetClassAsyncForLocalPlayer_Params
{
public:
	class ULocalPlayer*                          LocalPlayer;                                       // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UCommonActivatableWidget>  WidgetClass;                                       // 0x8(0x8)(ConstParm, Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortAsyncAction_QueueModalWidget*     ReturnValue;                                       // 0x10(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function FortniteUI.FortAsyncAction_QueueModalWidget.QueueModalWidgetClassAsync
struct UFortAsyncAction_QueueModalWidget_QueueModalWidgetClassAsync_Params
{
public:
	class UUserWidget*                           ContextWidget;                                     // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UCommonActivatableWidget>  WidgetClass;                                       // 0x8(0x8)(ConstParm, Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortAsyncAction_QueueModalWidget*     ReturnValue;                                       // 0x10(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// DelegateFunction FortniteUI.FortAsyncAction_QueueModalWidget.OnModalWidgetQueued__DelegateSignature
struct UFortAsyncAction_QueueModalWidget_OnModalWidgetQueued__DelegateSignature_Params
{
public:
	class UCommonActivatableWidget*              ActivatableWidget;                                 // 0x0(0x8)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaFPSBase.HandleShowFPSChanged
struct UAthenaFPSBase_HandleShowFPSChanged_Params
{
public:
	bool                                         bInShowFPS;                                        // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaTemperatureBase.StopTimer
struct UAthenaTemperatureBase_StopTimer_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaTemperatureBase.StartTimer
struct UAthenaTemperatureBase_StartTimer_Params
{
public:
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaAIKillsBase.SetKillsSourcePlayerState
struct UAthenaAIKillsBase_SetKillsSourcePlayerState_Params
{
public:
	class UFortPlayerStateAthena*                InPlayerState;                                     // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaAIKillsBase.SetKillsSourcePlayerController
struct UAthenaAIKillsBase_SetKillsSourcePlayerController_Params
{
public:
	class UFortPlayerControllerAthena*           InPlayerController;                                // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaAvailableSquadSlotsListBase.UpdateSquadFromMinigameOptionChange
struct UAthenaAvailableSquadSlotsListBase_UpdateSquadFromMinigameOptionChange_Params
{
public:
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaAvailableSquadSlotsListBase.UpdateIsTeamMiniGameOnMinigameVolumeChanged
struct UAthenaAvailableSquadSlotsListBase_UpdateIsTeamMiniGameOnMinigameVolumeChanged_Params
{
public:
	class UFortVolume*                           Volume;                                            // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaAvailableSquadSlotsListBase.UpdateIsTeamMiniGameOnGameStateChanged
struct UAthenaAvailableSquadSlotsListBase_UpdateIsTeamMiniGameOnGameStateChanged_Params
{
public:
	class UFortMinigame*                         Minigame;                                          // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EFortMinigameState                MinigameState;                                     // 0x8(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_35B1[0x7];                                     // Fixing Size Of Struct
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaAvailableSquadSlotsListBase.HandleSquadMemberDisconnected
struct UAthenaAvailableSquadSlotsListBase_HandleSquadMemberDisconnected_Params
{
public:
	class UFortPlayerStateAthena*                Player;                                            // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x30 (0x30 - 0x0)
// Function FortniteUI.AthenaAvailableSquadSlotsListBase.HandlePlayerUniqueIdReplicated
struct UAthenaAvailableSquadSlotsListBase_HandlePlayerUniqueIdReplicated_Params
{
public:
	struct FUniqueNetIdRepl                      UniqueId;                                          // 0x0(0x30)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaAvailableSquadSlotsListBase.HandlePlayerExitVolume
struct UAthenaAvailableSquadSlotsListBase_HandlePlayerExitVolume_Params
{
public:
	class UPlayerState*                          ClientPlayerState;                                 // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortVolume*                           Volume;                                            // 0x8(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaAvailableSquadSlotsListBase.HandlePlayerEnterVolume
struct UAthenaAvailableSquadSlotsListBase_HandlePlayerEnterVolume_Params
{
public:
	class UPlayerState*                          ClientPlayerState;                                 // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortVolume*                           Volume;                                            // 0x8(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaAvailableSquadSlotsListBase.HandleGameMemberChanged
struct UAthenaAvailableSquadSlotsListBase_HandleGameMemberChanged_Params
{
public:
	uint8                                        InSquadId;                                         // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        InTeamIndex;                                       // 0x1(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_35B5[0x6];                                     // Fixing Size After Last Property
	class UFortPlayerStateAthena*                ChangedPS;                                         // 0x8(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaAvailableSquadSlotsListEntryBase.BP_OnEntryStateUpdated
struct UAthenaAvailableSquadSlotsListEntryBase_BP_OnEntryStateUpdated_Params
{
public:
	enum class EAvailableSquadSlotsListEntryState NewEntryState;                                     // 0x0(0x1)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaCareerScreen.ShowFeats
struct UAthenaCareerScreen_ShowFeats_Params
{
public:
	bool                                         bHasCompletedFeats;                                // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaChallengesWidget.IsXPSystemRequiredForChallenges
struct UAthenaChallengesWidget_IsXPSystemRequiredForChallenges_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaChallengesWidget.HandleDisplayDynamicQuestUpdate
struct UAthenaChallengesWidget_HandleDisplayDynamicQuestUpdate_Params
{
public:
	class UFortQuestObjectiveInfo*               QuestObjective;                                    // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         DisplayStatusUpdate;                               // 0x8(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         DisplayAnnouncementUpdate;                         // 0x9(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_35BB[0x6];                                     // Fixing Size Of Struct
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaChallengesWidget.BP_WidgetIsFinished
struct UAthenaChallengesWidget_BP_WidgetIsFinished_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaChallengesWidget.BP_OnWidgetActivated
struct UAthenaChallengesWidget_BP_OnWidgetActivated_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaCollectionScreenContainer.EnableTabActions
struct UAthenaCollectionScreenContainer_EnableTabActions_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaCollectionScreenContainer.DisableTabActions
struct UAthenaCollectionScreenContainer_DisableTabActions_Params
{
public:
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaCollectionScreenContainer.BP_OnShowTabsSet
struct UAthenaCollectionScreenContainer_BP_OnShowTabsSet_Params
{
public:
	bool                                         bShowTabs;                                         // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x28 (0x28 - 0x0)
// Function FortniteUI.AthenaCollectionScreenContainerTabButton.SetIcon
struct UAthenaCollectionScreenContainerTabButton_SetIcon_Params
{
public:
	TSoftObjectPtr<class UObject>                LazyObject;                                        // 0x0(0x28)(Parm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaCollectionScreenContainerTabButton.BP_ShowBang
struct UAthenaCollectionScreenContainerTabButton_BP_ShowBang_Params
{
public:
	bool                                         bShow;                                             // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaCommonPrioritizedWidget.OnStompFailed
struct UAthenaCommonPrioritizedWidget_OnStompFailed_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaCommonPrioritizedWidget.OnStompedByOtherWidget
struct UAthenaCommonPrioritizedWidget_OnStompedByOtherWidget_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaCommonPrioritizedWidget.K2_OnBecomeInactive
struct UAthenaCommonPrioritizedWidget_K2_OnBecomeInactive_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaCommonPrioritizedWidget.K2_OnBecomeActive
struct UAthenaCommonPrioritizedWidget_K2_OnBecomeActive_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaConfirmationWindow.OnShowConfirmationContent
struct UAthenaConfirmationWindow_OnShowConfirmationContent_Params
{
public:
};

// 0x20 (0x20 - 0x0)
// Function FortniteUI.AthenaConfirmationWindow.OnSetButtonText
struct UAthenaConfirmationWindow_OnSetButtonText_Params
{
public:
	class UCommonButtonBase*                     Button;                                            // 0x0(0x8)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                  Text;                                              // 0x8(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x168 (0x168 - 0x0)
// Function FortniteUI.AthenaConfirmationWindow.HandleTapToCloseZoneMouseButtonDown
struct UAthenaConfirmationWindow_HandleTapToCloseZoneMouseButtonDown_Params
{
public:
	struct FGeometry                             MyGeometry;                                        // 0x0(0x38)(Parm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FPointerEvent                         MouseEvent;                                        // 0x38(0x78)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FEventReply                           ReturnValue;                                       // 0xB0(0xB8)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.FortActorIndicatorWidget.SetIndicatedActor
struct UFortActorIndicatorWidget_SetIndicatedActor_Params
{
public:
	class UActor*                                NewIndicatorActor;                                 // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.FortActorIndicatorWidget.OnTargetActorChanged
struct UFortActorIndicatorWidget_OnTargetActorChanged_Params
{
public:
	class UActor*                                TargetedActor;                                     // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.FortActorIndicatorWidget.IsIndicatingActor
struct UFortActorIndicatorWidget_IsIndicatingActor_Params
{
public:
	class UActor*                                OtherActor;                                        // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x8(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_35D0[0x7];                                     // Fixing Size Of Struct
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.FortActorIndicatorWidget.Init
struct UFortActorIndicatorWidget_Init_Params
{
public:
	class UActor*                                TargetedActor;                                     // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.FortActorIndicatorWidget.Deinit
struct UFortActorIndicatorWidget_Deinit_Params
{
public:
};

// 0x180 (0x180 - 0x0)
// Function FortniteUI.AthenaMarkedActorIndicator.OnSetMarkerData
struct UAthenaMarkedActorIndicator_OnSetMarkerData_Params
{
public:
	struct FFortWorldMarkerData                  FortWorldMarkerData;                               // 0x0(0x180)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaContextTutorialIndicator.SwitchIndicatorSize
struct UAthenaContextTutorialIndicator_SwitchIndicatorSize_Params
{
public:
};

// 0x4 (0x4 - 0x0)
// Function FortniteUI.AthenaContextTutorialIndicator.SetScreenPercent
struct UAthenaContextTutorialIndicator_SetScreenPercent_Params
{
public:
	float                                        Percent;                                           // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function FortniteUI.AthenaContextTutorialIndicator.SetIndicatorText
struct UAthenaContextTutorialIndicator_SetIndicatorText_Params
{
public:
	class FText                                  Text;                                              // 0x0(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaContextTutorialIndicator.PlayOutAnimation
struct UAthenaContextTutorialIndicator_PlayOutAnimation_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaContextTutorialIndicator.PlayInAnimation
struct UAthenaContextTutorialIndicator_PlayInAnimation_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaContextTutorialIndicator.PlayBounceAnimation
struct UAthenaContextTutorialIndicator_PlayBounceAnimation_Params
{
public:
};

// 0x4 (0x4 - 0x0)
// Function FortniteUI.AthenaContextTutorialIndicator.GetMinTreshold
struct UAthenaContextTutorialIndicator_GetMinTreshold_Params
{
public:
	float                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteUI.AthenaContextTutorialIndicator.GetMaxTreshold
struct UAthenaContextTutorialIndicator_GetMaxTreshold_Params
{
public:
	float                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteUI.AthenaContextTutorialIndicator.GetMaxOffscreenTreshold
struct UAthenaContextTutorialIndicator_GetMaxOffscreenTreshold_Params
{
public:
	float                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteUI.AthenaContextTutorialIndicator.GetCurrentDotProduct
struct UAthenaContextTutorialIndicator_GetCurrentDotProduct_Params
{
public:
	float                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaContextualChallengesWidget.ShouldOutroAutomatically
struct UAthenaContextualChallengesWidget_ShouldOutroAutomatically_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaContextualChallengesWidget.OnResetOutroDelay
struct UAthenaContextualChallengesWidget_OnResetOutroDelay_Params
{
public:
};

// 0x18 (0x18 - 0x0)
// Function FortniteUI.AthenaContextualChallengesWidget.OnNewContextualHeader
struct UAthenaContextualChallengesWidget_OnNewContextualHeader_Params
{
public:
	class FText                                  NewText;                                           // 0x0(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaContextualChallengesWidget.HandleToggleFullscreenMap
struct UAthenaContextualChallengesWidget_HandleToggleFullscreenMap_Params
{
public:
	bool                                         bFullscreenMapVisible;                             // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaContextualChallengesWidget.HandleNewContextualObjectives
struct UAthenaContextualChallengesWidget_HandleNewContextualObjectives_Params
{
public:
	TArray<class UFortQuestItem*>                InContextualQuests;                                // 0x0(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteUI.AthenaContextualChallengesWidget.GetOutroDelay
struct UAthenaContextualChallengesWidget_GetOutroDelay_Params
{
public:
	float                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaCosmeticUnlockingInfo.ShowUnlockingInfoForCosmeticVariant
struct UAthenaCosmeticUnlockingInfo_ShowUnlockingInfoForCosmeticVariant_Params
{
public:
	class UAthenaCosmeticItemDefinition*         InCosmeticItemDef;                                 // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                          InVariantChannel;                                  // 0x8(0x4)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                          InVariant;                                         // 0xC(0x4)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaCosmeticUnlockingInfo.ShowUnlockingInfoForCosmetic
struct UAthenaCosmeticUnlockingInfo_ShowUnlockingInfoForCosmetic_Params
{
public:
	class UAthenaCosmeticItemDefinition*         InCosmeticItemDef;                                 // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaCosmeticUnlockingInfo.ShowUnlockingInfo
struct UAthenaCosmeticUnlockingInfo_ShowUnlockingInfo_Params
{
public:
	class UAthenaCosmeticItemDefinition*         UnlockItem;                                        // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortItemDefinition*                   UnlockSource;                                      // 0x8(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaCosmeticUnlockingInfo.ShowSeasonUnlockingInfo
struct UAthenaCosmeticUnlockingInfo_ShowSeasonUnlockingInfo_Params
{
public:
	int32                                        SeasonNumber;                                      // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        TierNumber;                                        // 0x4(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaCosmeticUnlockingInfo.RequestUpdateAnim
struct UAthenaCosmeticUnlockingInfo_RequestUpdateAnim_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaCosmeticUnlockingInfo.RequestOutroAnim
struct UAthenaCosmeticUnlockingInfo_RequestOutroAnim_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaCosmeticUnlockingInfo.RequestIntroAnim
struct UAthenaCosmeticUnlockingInfo_RequestIntroAnim_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaCosmeticUnlockingInfo.OutroAnimFinished
struct UAthenaCosmeticUnlockingInfo_OutroAnimFinished_Params
{
public:
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaCosmeticUnlockingInfo.OnUnlockingInfoSet
struct UAthenaCosmeticUnlockingInfo_OnUnlockingInfoSet_Params
{
public:
	bool                                         bShowProgression;                                  // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaCosmeticUnlockingInfo.HideUnlockingInfo
struct UAthenaCosmeticUnlockingInfo_HideUnlockingInfo_Params
{
public:
};

// 0x30 (0x30 - 0x0)
// Function FortniteUI.AthenaCountdownWidgetBase.OnDisplayWarningMessage
struct UAthenaCountdownWidgetBase_OnDisplayWarningMessage_Params
{
public:
	class FText                                  FirstLineText;                                     // 0x0(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FText                                  SecondLineText;                                    // 0x18(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// Function FortniteUI.AthenaCountdownWidgetBase.OnCountdownUpdate
struct UAthenaCountdownWidgetBase_OnCountdownUpdate_Params
{
public:
	int32                                        TimeRemaining;                                     // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_35DE[0x4];                                     // Fixing Size After Last Property
	class FText                                  CountdownUpdateText;                               // 0x8(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaCountdownWidgetBase.OnCountdownStopped
struct UAthenaCountdownWidgetBase_OnCountdownStopped_Params
{
public:
};

// 0x20 (0x20 - 0x0)
// Function FortniteUI.AthenaCountdownWidgetBase.OnCountdownStarted
struct UAthenaCountdownWidgetBase_OnCountdownStarted_Params
{
public:
	int32                                        TimeRemaining;                                     // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_35DF[0x4];                                     // Fixing Size After Last Property
	class FText                                  CountdownIntroText;                                // 0x8(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaCountdownWidgetBase.OnCountdownFinished
struct UAthenaCountdownWidgetBase_OnCountdownFinished_Params
{
public:
};

// 0x18 (0x18 - 0x0)
// Function FortniteUI.AthenaCountdownWidgetBase.HandleGamePhaseStepChanged
struct UAthenaCountdownWidgetBase_HandleGamePhaseStepChanged_Params
{
public:
	TScriptInterface<class UFortSafeZoneInterface> SafeZoneInterface;                                 // 0x0(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EAthenaGamePhaseStep              GamePhaseStep;                                     // 0x10(0x1)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_35E0[0x7];                                     // Fixing Size Of Struct
};

// 0x4 (0x4 - 0x0)
// Function FortniteUI.AthenaCountdownWidgetBase.HandleCountdownUpdate
struct UAthenaCountdownWidgetBase_HandleCountdownUpdate_Params
{
public:
	int32                                        TimeRemaining;                                     // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaCountdownWidgetBase.HandleCountdownStopped
struct UAthenaCountdownWidgetBase_HandleCountdownStopped_Params
{
public:
};

// 0x4 (0x4 - 0x0)
// Function FortniteUI.AthenaCountdownWidgetBase.HandleCountdownStarted
struct UAthenaCountdownWidgetBase_HandleCountdownStarted_Params
{
public:
	int32                                        TimeRemaining;                                     // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaCountdownWidgetBase.HandleCountdownFinished
struct UAthenaCountdownWidgetBase_HandleCountdownFinished_Params
{
public:
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaCurieStatusWidget.SetPlayerState
struct UAthenaCurieStatusWidget_SetPlayerState_Params
{
public:
	class UFortPlayerStateAthena*                PlayerState;                                       // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaCurieStatusWidget.OnPlayerStatePawnChanged
struct UAthenaCurieStatusWidget_OnPlayerStatePawnChanged_Params
{
public:
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaCurieStatusWidget.OnHandleSpectatingChanged
struct UAthenaCurieStatusWidget_OnHandleSpectatingChanged_Params
{
public:
	class UFortPlayerStateZone*                  NewSpectatingTarget;                               // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteUI.AthenaCurieStatusWidget.OnCurieStateRemoved
struct UAthenaCurieStatusWidget_OnCurieStateRemoved_Params
{
public:
	struct FGameplayTag                          RemovedState;                                      // 0x0(0x4)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaCurieStatusWidget.OnCurieStateDetachedFromSpectator
struct UAthenaCurieStatusWidget_OnCurieStateDetachedFromSpectator_Params
{
public:
	class UObject*                               InOwner;                                           // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCurieContainerHandle                 ContainerHandle;                                   // 0x8(0x4)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                          ElementIdentifier;                                 // 0xC(0x4)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaCurieStatusWidget.OnCurieStateAttachedToSpectator
struct UAthenaCurieStatusWidget_OnCurieStateAttachedToSpectator_Params
{
public:
	class UObject*                               InOwner;                                           // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCurieContainerHandle                 ContainerHandle;                                   // 0x8(0x4)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                          ElementIdentifier;                                 // 0xC(0x4)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteUI.AthenaCurieStatusWidget.OnCurieStateAdded
struct UAthenaCurieStatusWidget_OnCurieStateAdded_Params
{
public:
	struct FGameplayTag                          AddedState;                                        // 0x0(0x4)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaCurieStatusWidget.HasState
struct UAthenaCurieStatusWidget_HasState_Params
{
public:
	struct FGameplayTag                          CurieState;                                        // 0x0(0x4)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x4(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_35E9[0x3];                                     // Fixing Size Of Struct
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.FortItemPickerBase.TryCommitSelectedItem
struct UFortItemPickerBase_TryCommitSelectedItem_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.FortItemPickerBase.SetSelectedItem
struct UFortItemPickerBase_SetSelectedItem_Params
{
public:
	class UFortItem*                             ItemToSelect;                                      // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.FortItemPickerBase.SetSelectedIndex
struct UFortItemPickerBase_SetSelectedIndex_Params
{
public:
	int32                                        Index;                                             // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x4(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_35ED[0x3];                                     // Fixing Size Of Struct
};

// 0x8 (0x8 - 0x0)
// DelegateFunction FortniteUI.FortItemPickerBase.OnItemSelectionScriptDelegate__DelegateSignature
struct UFortItemPickerBase_OnItemSelectionScriptDelegate__DelegateSignature_Params
{
public:
	class UFortItem*                             SelectedItem;                                      // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.FortItemPickerBase.IsNullItemExplicitlySelected
struct UFortItemPickerBase_IsNullItemExplicitlySelected_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.FortItemPickerBase.GetSelectedItem
struct UFortItemPickerBase_GetSelectedItem_Params
{
public:
	class UFortItem*                             ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.FortItemPickerBase.GetListViewInterface
struct UFortItemPickerBase_GetListViewInterface_Params
{
public:
	TScriptInterface<class UFortItemListViewInterface> ReturnValue;                                       // 0x0(0x10)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.FortItemPickerBase.GetIndexForItem
struct UFortItemPickerBase_GetIndexForItem_Params
{
public:
	class UFortItem*                             Item;                                              // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        ReturnValue;                                       // 0x8(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_35EF[0x4];                                     // Fixing Size Of Struct
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.FortItemPickerBase.ClearSelection
struct UFortItemPickerBase_ClearSelection_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.FortItemPickerBase.CenterSelectedItemTileWidget
struct UFortItemPickerBase_CenterSelectedItemTileWidget_Params
{
public:
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.FortItemPickerBase.CanItemBeComitted
struct UFortItemPickerBase_CanItemBeComitted_Params
{
public:
	class UFortItem*                             ItemToCommit;                                      // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x8(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_35F0[0x7];                                     // Fixing Size Of Struct
};

// 0x4 (0x4 - 0x0)
// Function FortniteUI.AthenaCustomizationPicker.SetFilter
struct UAthenaCustomizationPicker_SetFilter_Params
{
public:
	class FName                                  FilterName;                                        // 0x0(0x4)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function FortniteUI.AthenaCustomizationPicker.SearchText
struct UAthenaCustomizationPicker_SearchText_Params
{
public:
	class FText                                  Text;                                              // 0x0(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function FortniteUI.AthenaCustomizationPicker.OnUpdateArchiveFilterTooltipText
struct UAthenaCustomizationPicker_OnUpdateArchiveFilterTooltipText_Params
{
public:
	class FText                                  Text;                                              // 0x0(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaCustomizationPicker.OnShowArchiveFilterTooltip
struct UAthenaCustomizationPicker_OnShowArchiveFilterTooltip_Params
{
public:
	bool                                         bShowTooltip;                                      // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaCustomizationPicker.OnSearchEnabled
struct UAthenaCustomizationPicker_OnSearchEnabled_Params
{
public:
	bool                                         bEnabled;                                          // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function FortniteUI.AthenaCustomizationPicker.OnNoItemsAvailableInFilter
struct UAthenaCustomizationPicker_OnNoItemsAvailableInFilter_Params
{
public:
	class FText                                  EmptyDisplayText;                                  // 0x0(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaCustomizationPicker.OnItemsAvailableInFilter
struct UAthenaCustomizationPicker_OnItemsAvailableInFilter_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// DelegateFunction FortniteUI.AthenaCustomizationPicker.OnCosmeticChangeSaveEvent__DelegateSignature
struct UAthenaCustomizationPicker_OnCosmeticChangeSaveEvent__DelegateSignature_Params
{
public:
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaCustomizationPicker.HasSelectableTile
struct UAthenaCustomizationPicker_HasSelectableTile_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x3 (0x3 - 0x0)
// Function FortniteUI.AthenaCustomizationPicker.HandleSelectedItemHasChanged
struct UAthenaCustomizationPicker_HandleSelectedItemHasChanged_Params
{
public:
	bool                                         ItemChanged;                                       // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         AmmoChanged;                                       // 0x1(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         IngredientsChanged;                                // 0x2(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaCustomizationPicker.HandleButtonTextSearchClicked
struct UAthenaCustomizationPicker_HandleButtonTextSearchClicked_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaCustomizationPicker.HandleArchiveFilterTooltipDismissed
struct UAthenaCustomizationPicker_HandleArchiveFilterTooltipDismissed_Params
{
public:
};

// 0x20 (0x20 - 0x0)
// Function FortniteUI.AthenaCustomizationPicker.GetQualifiedFilterDisplayName
struct UAthenaCustomizationPicker_GetQualifiedFilterDisplayName_Params
{
public:
	enum class EAthenaFilterDisplayType          InTopFilterDisplaySetting;                         // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3600[0x7];                                     // Fixing Size After Last Property
	class FText                                  ReturnValue;                                       // 0x8(0x18)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaCustomizationPicker.EndCustomizationCategory
struct UAthenaCustomizationPicker_EndCustomizationCategory_Params
{
public:
};

// 0x4 (0x4 - 0x0)
// Function FortniteUI.AthenaCustomizationPicker.BP_OnUpdateNumArchivedItems
struct UAthenaCustomizationPicker_BP_OnUpdateNumArchivedItems_Params
{
public:
	int32                                        InNumArchivedItems;                                // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xC (0xC - 0x0)
// Function FortniteUI.AthenaCustomizationPicker.BeginCustomizationCategory
struct UAthenaCustomizationPicker_BeginCustomizationCategory_Params
{
public:
	enum class EAthenaCustomizationCategory      Category;                                          // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3602[0x3];                                     // Fixing Size After Last Property
	int32                                        SubslotToEdit;                                     // 0x4(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bInAllowUnownedItems;                              // 0x8(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bInOneItemPerSlot;                                 // 0x9(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3603[0x2];                                     // Fixing Size Of Struct
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaCustomizationPickerSortAndFilterBlade.IsBladeOpen
struct UAthenaCustomizationPickerSortAndFilterBlade_IsBladeOpen_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaCustomizationPickerSortAndFilterBlade.HandleCloseAnimationFinished
struct UAthenaCustomizationPickerSortAndFilterBlade_HandleCloseAnimationFinished_Params
{
public:
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaCustomizationPickerSortAndFilterBlade.GetSortButtonAtIndex
struct UAthenaCustomizationPickerSortAndFilterBlade_GetSortButtonAtIndex_Params
{
public:
	int32                                        DesiredIndex;                                      // 0x0(0x4)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_360E[0x4];                                     // Fixing Size After Last Property
	class UCommonButtonBase*                     ReturnValue;                                       // 0x8(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteUI.AthenaCustomizationPickerSortAndFilterBlade.GetNumSorts
struct UAthenaCustomizationPickerSortAndFilterBlade_GetNumSorts_Params
{
public:
	int32                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteUI.AthenaCustomizationPickerSortAndFilterBlade.GetNumFilters
struct UAthenaCustomizationPickerSortAndFilterBlade_GetNumFilters_Params
{
public:
	int32                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaCustomizationPickerSortAndFilterBlade.GetFilterButtonAtIndex
struct UAthenaCustomizationPickerSortAndFilterBlade_GetFilterButtonAtIndex_Params
{
public:
	int32                                        DesiredIndex;                                      // 0x0(0x4)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3612[0x4];                                     // Fixing Size After Last Property
	class UCommonButtonBase*                     ReturnValue;                                       // 0x8(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaCustomizationPickerSortAndFilterBlade.GetAllSortAndFilterButtons
struct UAthenaCustomizationPickerSortAndFilterBlade_GetAllSortAndFilterButtons_Params
{
public:
	TArray<class UUserWidget*>                   ReturnValue;                                       // 0x0(0x10)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaCustomizationPickerSortAndFilterBlade.CloseBlade
struct UAthenaCustomizationPickerSortAndFilterBlade_CloseBlade_Params
{
public:
};

// 0x20 (0x20 - 0x0)
// Function FortniteUI.AthenaCustomizationPickerSortAndFilterBlade.BP_SetSortOrFilterButtonDisplayName
struct UAthenaCustomizationPickerSortAndFilterBlade_BP_SetSortOrFilterButtonDisplayName_Params
{
public:
	class UCommonButtonBase*                     SortOrFilterButton;                                // 0x0(0x8)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                  DisplayName;                                       // 0x8(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaCustomizationPickerSortAndFilterBlade.BP_OnSortOrFilterButtonCreated
struct UAthenaCustomizationPickerSortAndFilterBlade_BP_OnSortOrFilterButtonCreated_Params
{
public:
	class UCommonButtonBase*                     NewButton;                                         // 0x0(0x8)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaCustomizationPickerSortAndFilterBlade.BP_OnBladeOpen
struct UAthenaCustomizationPickerSortAndFilterBlade_BP_OnBladeOpen_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaCustomizationPickerSortAndFilterBlade.BP_OnBladeClose
struct UAthenaCustomizationPickerSortAndFilterBlade_BP_OnBladeClose_Params
{
public:
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaCustomizationPickerSortAndFilterBlade.BP_OnArchiveFilteringSet
struct UAthenaCustomizationPickerSortAndFilterBlade_BP_OnArchiveFilteringSet_Params
{
public:
	bool                                         bEnabled;                                          // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaCustomizationPickerSortAndFilterBlade.BP_HighlightSortOrFilterButton
struct UAthenaCustomizationPickerSortAndFilterBlade_BP_HighlightSortOrFilterButton_Params
{
public:
	class UCommonButtonBase*                     SortOrFilterButton;                                // 0x0(0x8)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bHighlight;                                        // 0x8(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3616[0x7];                                     // Fixing Size Of Struct
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaCustomizationPickerTileButton.OnUpdateExclusiveWarning
struct UAthenaCustomizationPickerTileButton_OnUpdateExclusiveWarning_Params
{
public:
	bool                                         bShouldWarn;                                       // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x2 (0x2 - 0x0)
// Function FortniteUI.AthenaCustomizationPickerTileButton.OnEquippedStateChanged
struct UAthenaCustomizationPickerTileButton_OnEquippedStateChanged_Params
{
public:
	bool                                         bEquipped;                                         // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bOnDifferentSlot;                                  // 0x1(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaCustomizationPickerTileButton.OnChangeOwnedState
struct UAthenaCustomizationPickerTileButton_OnChangeOwnedState_Params
{
public:
	bool                                         bOwned;                                            // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x2 (0x2 - 0x0)
// Function FortniteUI.AthenaCustomizationPickerTileButton.OnArchivedStatusUpdated
struct UAthenaCustomizationPickerTileButton_OnArchivedStatusUpdated_Params
{
public:
	bool                                         bShowAsArchived;                                   // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bUseAnimations;                                    // 0x1(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xC (0xC - 0x0)
// Function FortniteUI.AthenaCustomizationScreenBase.ShowLockerSlot
struct UAthenaCustomizationScreenBase_ShowLockerSlot_Params
{
public:
	enum class EAthenaCustomizationCategory      CustomizationCategory;                             // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3621[0x3];                                     // Fixing Size After Last Property
	int32                                        SlotIndex;                                         // 0x4(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bCanShowEmpty;                                     // 0x8(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3622[0x3];                                     // Fixing Size Of Struct
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaCustomizationScreenBase.ShouldShowQuickSaveTooltip
struct UAthenaCustomizationScreenBase_ShouldShowQuickSaveTooltip_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaCustomizationScreenBase.ShouldShowActionBarTooltip
struct UAthenaCustomizationScreenBase_ShouldShowActionBarTooltip_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaCustomizationScreenBase.SetCustomizationSelectionBeingProcessed
struct UAthenaCustomizationScreenBase_SetCustomizationSelectionBeingProcessed_Params
{
public:
	bool                                         bIsBeingProcessed;                                 // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaCustomizationScreenBase.QuickSaveToolTipSeen
struct UAthenaCustomizationScreenBase_QuickSaveToolTipSeen_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaCustomizationScreenBase.QuickRenameClicked
struct UAthenaCustomizationScreenBase_QuickRenameClicked_Params
{
public:
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaCustomizationScreenBase.OnBeginPickingCustomizationSlot
struct UAthenaCustomizationScreenBase_OnBeginPickingCustomizationSlot_Params
{
public:
	class UAthenaCustomizationSlotSelectorButton* SlotButton;                                        // 0x0(0x8)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x58 (0x58 - 0x0)
// Function FortniteUI.AthenaCustomizationScreenBase.HandleInventoryUpdated
struct UAthenaCustomizationScreenBase_HandleInventoryUpdated_Params
{
public:
	TSet<class FString>                          ItemChangeFlags;                                   // 0x0(0x50)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	int64                                        ProfileRevision;                                   // 0x50(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// Function FortniteUI.AthenaCustomizationScreenBase.GetItemTypeDisplayNames
struct UAthenaCustomizationScreenBase_GetItemTypeDisplayNames_Params
{
public:
	enum class EAthenaCustomizationCategory      InCategory;                                        // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3625[0x7];                                     // Fixing Size After Last Property
	class FText                                  ReturnValue;                                       // 0x8(0x18)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaCustomizationScreenBase.GetFavoriteItemForCategory
struct UAthenaCustomizationScreenBase_GetFavoriteItemForCategory_Params
{
public:
	enum class EAthenaCustomizationCategory      CustomizationType;                                 // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3628[0x3];                                     // Fixing Size After Last Property
	int32                                        SubslotIndex;                                      // 0x4(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortItem*                             ReturnValue;                                       // 0x8(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// Function FortniteUI.AthenaCustomizationScreenBase.GetCategoryDisplayName
struct UAthenaCustomizationScreenBase_GetCategoryDisplayName_Params
{
public:
	enum class EAthenaCustomizationCategory      InCategory;                                        // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3629[0x7];                                     // Fixing Size After Last Property
	class FText                                  ReturnValue;                                       // 0x8(0x18)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaCustomizationScreenBase.ActionBarToolTipSeen
struct UAthenaCustomizationScreenBase_ActionBarToolTipSeen_Params
{
public:
};

// 0xC (0xC - 0x0)
// Function FortniteUI.AthenaCustomizationSlotSelectorButton.SetCustomizationType
struct UAthenaCustomizationSlotSelectorButton_SetCustomizationType_Params
{
public:
	enum class EAthenaCustomizationCategory      NewType;                                           // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_362F[0x3];                                     // Fixing Size After Last Property
	int32                                        InSubslotIndex;                                    // 0x4(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                          RequiredSlotTag;                                   // 0x8(0x4)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x30 (0x30 - 0x0)
// Function FortniteUI.AthenaCustomizationSlotSelectorButton.SetCardDefaultImageAndWidth
struct UAthenaCustomizationSlotSelectorButton_SetCardDefaultImageAndWidth_Params
{
public:
	TSoftObjectPtr<class UTexture2D>             InDefaultImage;                                    // 0x0(0x28)(ConstParm, Parm, OutParm, ReferenceParm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        InWidth;                                           // 0x28(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3630[0x4];                                     // Fixing Size Of Struct
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaCustomizationSlotSelectorButton.OnUpdateExclusiveWarning
struct UAthenaCustomizationSlotSelectorButton_OnUpdateExclusiveWarning_Params
{
public:
	bool                                         bShouldWarn;                                       // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaCustomizationSlotSelectorButton.OnModifiedStatusUpdated
struct UAthenaCustomizationSlotSelectorButton_OnModifiedStatusUpdated_Params
{
public:
	bool                                         bIsModified;                                       // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x2 (0x2 - 0x0)
// Function FortniteUI.AthenaCustomizationSlotSelectorButton.OnCustomizationSlotActiveStateChanged
struct UAthenaCustomizationSlotSelectorButton_OnCustomizationSlotActiveStateChanged_Params
{
public:
	bool                                         bInAttachableCosmeticAvailable;                    // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bInActive;                                         // 0x1(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x30 (0x30 - 0x0)
// Function FortniteUI.AthenaCustomizationSlotSelectorButton.OnCardImageAndWidthChanged
struct UAthenaCustomizationSlotSelectorButton_OnCardImageAndWidthChanged_Params
{
public:
	TSoftObjectPtr<class UTexture2D>             Image;                                             // 0x0(0x28)(ConstParm, Parm, OutParm, ReferenceParm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        Width;                                             // 0x28(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3633[0x4];                                     // Fixing Size Of Struct
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaCustomizationSlotSelectorButton.OnArchivedStatusUpdated
struct UAthenaCustomizationSlotSelectorButton_OnArchivedStatusUpdated_Params
{
public:
	bool                                         bArchived;                                         // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaCustomizationSlotSelectorButton.IsSlotFilled
struct UAthenaCustomizationSlotSelectorButton_IsSlotFilled_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaCustomizationSlotSelectorButton.HandleDifferentHeroLoadoutActivated
struct UAthenaCustomizationSlotSelectorButton_HandleDifferentHeroLoadoutActivated_Params
{
public:
	class UFortMcpProfileCampaign*               Profile;                                           // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x2 (0x2 - 0x0)
// Function FortniteUI.AthenaCustomizationSlotSelectorButton.GetCustomizationSlotActiveState
struct UAthenaCustomizationSlotSelectorButton_GetCustomizationSlotActiveState_Params
{
public:
	bool                                         bOutAttachableCosmeticAvailable;                   // 0x0(0x1)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bOutActive;                                        // 0x1(0x1)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaCustomizationSlotSelectorButton.GetCampaignHeroPartItem
struct UAthenaCustomizationSlotSelectorButton_GetCampaignHeroPartItem_Params
{
public:
	class UFortItem*                             ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaDiscoverabilityBase.OnStompFailed
struct UAthenaDiscoverabilityBase_OnStompFailed_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaDiscoverabilityBase.OnStompedByOtherWidget
struct UAthenaDiscoverabilityBase_OnStompedByOtherWidget_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaDiscoverabilityBase.K2_OnBecomeInactive
struct UAthenaDiscoverabilityBase_K2_OnBecomeInactive_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaDiscoverabilityBase.K2_OnBecomeActive
struct UAthenaDiscoverabilityBase_K2_OnBecomeActive_Params
{
public:
};

// 0x4 (0x4 - 0x0)
// Function FortniteUI.AthenaDiscoverabilityBase.CommonVisitedEvent
struct UAthenaDiscoverabilityBase_CommonVisitedEvent_Params
{
public:
	struct FGameplayTag                          NewTag;                                            // 0x0(0x4)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteUI.AthenaDiscoverabilityBase.CommonDiscoveredEvent
struct UAthenaDiscoverabilityBase_CommonDiscoveredEvent_Params
{
public:
	struct FGameplayTag                          NewTag;                                            // 0x0(0x4)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteUI.AthenaDiscoverabilityBase.CommonArrivalEvent
struct UAthenaDiscoverabilityBase_CommonArrivalEvent_Params
{
public:
	struct FGameplayTag                          NewTag;                                            // 0x0(0x4)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteUI.AthenaDiscoverabilityDisplay_Extension.OnCommonArrivalEvent
struct UAthenaDiscoverabilityDisplay_Extension_OnCommonArrivalEvent_Params
{
public:
	struct FGameplayTag                          NewTag;                                            // 0x0(0x4)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x48 (0x48 - 0x0)
// Function FortniteUI.AthenaDiscoveredAreaOverlay.OnNewDiscovery
struct UAthenaDiscoveredAreaOverlay_OnNewDiscovery_Params
{
public:
	class FText                                  LocalizedLocationName;                             // 0x0(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class USoundCue>              DiscoveredSoundCue;                                // 0x18(0x28)(ConstParm, Parm, OutParm, ReferenceParm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIsNamedLocation;                                  // 0x40(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIsDiscovered;                                     // 0x41(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_364E[0x6];                                     // Fixing Size Of Struct
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaDiscoveredAreaOverlay.BP_HandlePlaylistExtensionWidgetCreated
struct UAthenaDiscoveredAreaOverlay_BP_HandlePlaylistExtensionWidgetCreated_Params
{
public:
	class UUserWidget*                           Widget;                                            // 0x0(0x8)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EUIExtensionSlot                  SlotType;                                          // 0x8(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3652[0x7];                                     // Fixing Size Of Struct
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaEquippedItemBase.HandleWorldItemsChanged
struct UAthenaEquippedItemBase_HandleWorldItemsChanged_Params
{
public:
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaEquippedItemBase.HandleWeaponTargetingChanged
struct UAthenaEquippedItemBase_HandleWeaponTargetingChanged_Params
{
public:
	bool                                         bIsTargeting;                                      // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaEquippedItemBase.HandleWeaponReloadStarted
struct UAthenaEquippedItemBase_HandleWeaponReloadStarted_Params
{
public:
	float                                        ReloadTime;                                        // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EFortWeaponReloadType             ReloadType;                                        // 0x4(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_365B[0x3];                                     // Fixing Size Of Struct
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaEquippedItemBase.HandleWeaponReloadCancelled
struct UAthenaEquippedItemBase_HandleWeaponReloadCancelled_Params
{
public:
};

// 0xC (0xC - 0x0)
// Function FortniteUI.AthenaEquippedItemBase.HandleWeaponOverheatValueChanged
struct UAthenaEquippedItemBase_HandleWeaponOverheatValueChanged_Params
{
public:
	float                                        CurrentValue;                                      // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MaxValue;                                          // 0x4(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EFortWeaponOverheatState          State;                                             // 0x8(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIsInCooldown;                                     // 0x9(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3667[0x2];                                     // Fixing Size Of Struct
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaEquippedItemBase.HandleWeaponEquipped
struct UAthenaEquippedItemBase_HandleWeaponEquipped_Params
{
public:
	class UFortWeapon*                           NewWeapon;                                         // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortWeapon*                           PrevWeapon;                                        // 0x8(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaEquippedItemBase.HandleViewTargetChanged
struct UAthenaEquippedItemBase_HandleViewTargetChanged_Params
{
public:
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaEquippedItemBase.HandleSecondaryFireReleased
struct UAthenaEquippedItemBase_HandleSecondaryFireReleased_Params
{
public:
	class UFortWeapon*                           Weapon;                                            // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaEquippedItemBase.HandleSecondaryFirePressed
struct UAthenaEquippedItemBase_HandleSecondaryFirePressed_Params
{
public:
	class UFortWeapon*                           Weapon;                                            // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaEquippedItemBase.HandleLocalAmmoChanged
struct UAthenaEquippedItemBase_HandleLocalAmmoChanged_Params
{
public:
	int32                                        LocalCount;                                        // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        LocalRemaining;                                    // 0x4(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaEquippedItemBase.HandleBuildingMaterialChanged
struct UAthenaEquippedItemBase_HandleBuildingMaterialChanged_Params
{
public:
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaEquippedItemBase.BP_HandleWeaponTargetingChanged
struct UAthenaEquippedItemBase_BP_HandleWeaponTargetingChanged_Params
{
public:
	bool                                         bIsTargeting;                                      // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaEquippedItemBase.BP_HandleWeaponReloadStarted
struct UAthenaEquippedItemBase_BP_HandleWeaponReloadStarted_Params
{
public:
	float                                        ReloadTime;                                        // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EFortWeaponReloadType             ReloadType;                                        // 0x4(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_368F[0x3];                                     // Fixing Size Of Struct
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaEquippedItemBase.BP_HandleWeaponReloadCancelled
struct UAthenaEquippedItemBase_BP_HandleWeaponReloadCancelled_Params
{
public:
	class UFortWeapon*                           Weapon;                                            // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xC (0xC - 0x0)
// Function FortniteUI.AthenaEquippedItemBase.BP_HandleWeaponOverheatValueChanged
struct UAthenaEquippedItemBase_BP_HandleWeaponOverheatValueChanged_Params
{
public:
	float                                        CurrentValue;                                      // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MaxValue;                                          // 0x4(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EFortWeaponOverheatState          State;                                             // 0x8(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIsInCooldown;                                     // 0x9(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_369B[0x2];                                     // Fixing Size Of Struct
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaEquippedItemBase.BP_HandleWeaponModeChanged
struct UAthenaEquippedItemBase_BP_HandleWeaponModeChanged_Params
{
public:
	enum class EEquippedWeaponDisplay            Mode;                                              // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaEquippedItemBase.BP_HandleWeaponEquipped
struct UAthenaEquippedItemBase_BP_HandleWeaponEquipped_Params
{
public:
	class UFortWeapon*                           NewWeapon;                                         // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortWeapon*                           PrevWeapon;                                        // 0x8(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaEquippedItemBase.BP_HandleSecondaryFireReleased
struct UAthenaEquippedItemBase_BP_HandleSecondaryFireReleased_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaEquippedItemBase.BP_HandleSecondaryFirePressed
struct UAthenaEquippedItemBase_BP_HandleSecondaryFirePressed_Params
{
public:
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaEquippedItemBase.BP_HandleResourceTypeChanged
struct UAthenaEquippedItemBase_BP_HandleResourceTypeChanged_Params
{
public:
	class UFortResourceItemDefinition*           Item;                                              // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        ResourceCount;                                     // 0x8(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_36B0[0x4];                                     // Fixing Size Of Struct
};

// 0x4 (0x4 - 0x0)
// Function FortniteUI.AthenaEquippedItemBase.BP_HandleResourceCountChanged
struct UAthenaEquippedItemBase_BP_HandleResourceCountChanged_Params
{
public:
	int32                                        ResourceCount;                                     // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaEquippedItemBase.BP_HandleHideReserveAmmoChanged
struct UAthenaEquippedItemBase_BP_HandleHideReserveAmmoChanged_Params
{
public:
	bool                                         bHideReserveAmmo;                                  // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaEquippedItemBase.BP_HandleHasBulletsPerClipChanged
struct UAthenaEquippedItemBase_BP_HandleHasBulletsPerClipChanged_Params
{
public:
	bool                                         bHasBulletsPerClip;                                // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaEquippedItemBase.BP_HandleHasAmmoChanged
struct UAthenaEquippedItemBase_BP_HandleHasAmmoChanged_Params
{
public:
	bool                                         bHasAmmo;                                          // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xC (0xC - 0x0)
// Function FortniteUI.AthenaEquippedItemBase.BP_HandleAmmoCountChanged
struct UAthenaEquippedItemBase_BP_HandleAmmoCountChanged_Params
{
public:
	int32                                        MagazineAmmoCount;                                 // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        SurplusAmmoCount;                                  // 0x4(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        TotalRemaining;                                    // 0x8(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaGamePhaseWidgetBase.OnUpdateGamePhaseIcon
struct UAthenaGamePhaseWidgetBase_OnUpdateGamePhaseIcon_Params
{
public:
	enum class EAthenaGamePhaseStep              GamePhaseStep;                                     // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteUI.AthenaGamePhaseWidgetBase.HandleCountdownUpdate
struct UAthenaGamePhaseWidgetBase_HandleCountdownUpdate_Params
{
public:
	int32                                        TimeRemaining;                                     // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaGenericHUDTimerWidgetBase.HandleGamePhaseChanged
struct UAthenaGenericHUDTimerWidgetBase_HandleGamePhaseChanged_Params
{
public:
	enum class EAthenaGamePhase                  GamePhase;                                         // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaGlobalCurrencyWidget.HandleOnItemCountChanged
struct UAthenaGlobalCurrencyWidget_HandleOnItemCountChanged_Params
{
public:
	class UFortItemDefinition*                   Definition;                                        // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        Delta;                                             // 0x8(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_36E4[0x4];                                     // Fixing Size Of Struct
};

// 0x38 (0x38 - 0x0)
// Function FortniteUI.AthenaHUDGamePhaseChangingBase.BP_UpdateMessaging
struct UAthenaHUDGamePhaseChangingBase_BP_UpdateMessaging_Params
{
public:
	enum class EAthenaGamePhaseStep              Step;                                              // 0x0(0x1)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_36E8[0x7];                                     // Fixing Size After Last Property
	class FText                                  Message;                                           // 0x8(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FText                                  TimeText;                                          // 0x20(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaHUDGamePhaseChangingBase.BP_HandleGamePhaseStepChanged
struct UAthenaHUDGamePhaseChangingBase_BP_HandleGamePhaseStepChanged_Params
{
public:
	enum class EAthenaGamePhaseStep              Step;                                              // 0x0(0x1)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaHUDPlayerActionAlertBase.RequestNextAlert
struct UAthenaHUDPlayerActionAlertBase_RequestNextAlert_Params
{
public:
};

// 0x20 (0x20 - 0x0)
// Function FortniteUI.AthenaHUDPlayerActionAlertBase.BP_ShowAlert
struct UAthenaHUDPlayerActionAlertBase_BP_ShowAlert_Params
{
public:
	enum class EAthenaPlayerActionAlert          Alert;                                             // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_36FD[0x7];                                     // Fixing Size After Last Property
	class FText                                  DetailText;                                        // 0x8(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaHUDPlayerActionAlertBase.BP_OnAlertsCleared
struct UAthenaHUDPlayerActionAlertBase_BP_OnAlertsCleared_Params
{
public:
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaIndicatorLayerBase.OnTargetingChanged
struct UAthenaIndicatorLayerBase_OnTargetingChanged_Params
{
public:
	bool                                         bTargeting;                                        // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaIndicatorLayerBase.OnTargetChangedNative
struct UAthenaIndicatorLayerBase_OnTargetChangedNative_Params
{
public:
	bool                                         bTargeting;                                        // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaIndicatorLayerBase.HandleIndicatorModeChanged
struct UAthenaIndicatorLayerBase_HandleIndicatorModeChanged_Params
{
public:
	bool                                         bIndicatorsEnabled;                                // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaInventoryItemTileButton.OnItemChanged
struct UAthenaInventoryItemTileButton_OnItemChanged_Params
{
public:
	class UFortItem*                             Item;                                              // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaInventoryItemTileButton.GetItemToRepresent
struct UAthenaInventoryItemTileButton_GetItemToRepresent_Params
{
public:
	class UFortItem*                             ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x48 (0x48 - 0x0)
// Function FortniteUI.AthenaItemSelectorScreenBase.StartItemCustomization
struct UAthenaItemSelectorScreenBase_StartItemCustomization_Params
{
public:
	struct FAthenaCustomizationParams            Params;                                            // 0x0(0x48)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaItemSelectorScreenBase.SaveAndExit_ApplyToAllSlots
struct UAthenaItemSelectorScreenBase_SaveAndExit_ApplyToAllSlots_Params
{
public:
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaItemSelectorScreenBase.SaveAndExit
struct UAthenaItemSelectorScreenBase_SaveAndExit_Params
{
public:
	bool                                         bApplyToAllSlots;                                  // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function FortniteUI.AthenaItemSelectorScreenBase.OnUpdateLockerArchivingCleanupTooltipText
struct UAthenaItemSelectorScreenBase_OnUpdateLockerArchivingCleanupTooltipText_Params
{
public:
	class FText                                  Text;                                              // 0x0(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// Function FortniteUI.AthenaItemSelectorScreenBase.OnUpdateExclusiveItemCallout
struct UAthenaItemSelectorScreenBase_OnUpdateExclusiveItemCallout_Params
{
public:
	bool                                         bShouldShow;                                       // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_371E[0x7];                                     // Fixing Size After Last Property
	class FText                                  CalloutText;                                       // 0x8(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function FortniteUI.AthenaItemSelectorScreenBase.OnUpdateArchiveModeTooltipText
struct UAthenaItemSelectorScreenBase_OnUpdateArchiveModeTooltipText_Params
{
public:
	class FText                                  Text;                                              // 0x0(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function FortniteUI.AthenaItemSelectorScreenBase.OnUpdateArchivedItemsTooltipText
struct UAthenaItemSelectorScreenBase_OnUpdateArchivedItemsTooltipText_Params
{
public:
	class FText                                  Text;                                              // 0x0(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaItemSelectorScreenBase.OnTabSelectionChanged
struct UAthenaItemSelectorScreenBase_OnTabSelectionChanged_Params
{
public:
	bool                                         bShowingVariants;                                  // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaItemSelectorScreenBase.OnShowLockerArchivingCleanupTooltip
struct UAthenaItemSelectorScreenBase_OnShowLockerArchivingCleanupTooltip_Params
{
public:
	bool                                         bShowTooltip;                                      // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaItemSelectorScreenBase.OnShowArchiveModeTooltip
struct UAthenaItemSelectorScreenBase_OnShowArchiveModeTooltip_Params
{
public:
	bool                                         bShowTooltip;                                      // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaItemSelectorScreenBase.OnShowArchivedItemsTooltip
struct UAthenaItemSelectorScreenBase_OnShowArchivedItemsTooltip_Params
{
public:
	bool                                         bShowTooltip;                                      // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaItemSelectorScreenBase.OnLockerScreenStateChanged
struct UAthenaItemSelectorScreenBase_OnLockerScreenStateChanged_Params
{
public:
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaItemSelectorScreenBase.OnItemSelectionCommited
struct UAthenaItemSelectorScreenBase_OnItemSelectionCommited_Params
{
public:
	class UFortItem*                             SelectedItem;                                      // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaItemSelectorScreenBase.OnItemSelectedChanged
struct UAthenaItemSelectorScreenBase_OnItemSelectedChanged_Params
{
public:
	class UFortItem*                             SelectedItem;                                      // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaItemSelectorScreenBase.OnHideItemInfoHeader
struct UAthenaItemSelectorScreenBase_OnHideItemInfoHeader_Params
{
public:
	bool                                         bShouldHide;                                       // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x40 (0x40 - 0x0)
// Function FortniteUI.AthenaItemSelectorScreenBase.OnFinishedItemSetup
struct UAthenaItemSelectorScreenBase_OnFinishedItemSetup_Params
{
public:
	class FText                                  CategoryDisplayName;                               // 0x0(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FText                                  ItemDisplayTypeName;                               // 0x18(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	enum class EAthenaCustomizationCategory      SelectedCategory;                                  // 0x30(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_372C[0x7];                                     // Fixing Size After Last Property
	class UMaterialInstance*                     OverrideSlotImage;                                 // 0x38(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaItemSelectorScreenBase.OnFinishedItemSave
struct UAthenaItemSelectorScreenBase_OnFinishedItemSave_Params
{
public:
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaItemSelectorScreenBase.OnCurrentItemChanged
struct UAthenaItemSelectorScreenBase_OnCurrentItemChanged_Params
{
public:
	class UFortItem*                             SelectedItem;                                      // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaItemSelectorScreenBase.IsItemOwned
struct UAthenaItemSelectorScreenBase_IsItemOwned_Params
{
public:
	class UFortItem*                             Item;                                              // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x8(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3732[0x7];                                     // Fixing Size Of Struct
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaItemSelectorScreenBase.IsAlternateActionHovered
struct UAthenaItemSelectorScreenBase_IsAlternateActionHovered_Params
{
public:
	bool                                         bAlternateActionHovered;                           // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaItemSelectorScreenBase.HandleShowArchivedItemsTooltipDismissed
struct UAthenaItemSelectorScreenBase_HandleShowArchivedItemsTooltipDismissed_Params
{
public:
};

// 0x18 (0x18 - 0x0)
// Function FortniteUI.AthenaItemSelectorScreenBase.HandleSearchTextChanged
struct UAthenaItemSelectorScreenBase_HandleSearchTextChanged_Params
{
public:
	class FText                                  NewText;                                           // 0x0(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaItemSelectorScreenBase.HandleScreenAnalytics
struct UAthenaItemSelectorScreenBase_HandleScreenAnalytics_Params
{
public:
	bool                                         bItemChanged;                                      // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteUI.AthenaItemSelectorScreenBase.HandlePickerMarkedItemsChanged
struct UAthenaItemSelectorScreenBase_HandlePickerMarkedItemsChanged_Params
{
public:
	int32                                        MarkedCount;                                       // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaItemSelectorScreenBase.HandleLockerArchivingCleanupTooltipDismissed
struct UAthenaItemSelectorScreenBase_HandleLockerArchivingCleanupTooltipDismissed_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaItemSelectorScreenBase.HandleCommitArchiveChangeClicked
struct UAthenaItemSelectorScreenBase_HandleCommitArchiveChangeClicked_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaItemSelectorScreenBase.HandleArchiveModeTooltipDismissed
struct UAthenaItemSelectorScreenBase_HandleArchiveModeTooltipDismissed_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaItemSelectorScreenBase.HandleAboutToClose
struct UAthenaItemSelectorScreenBase_HandleAboutToClose_Params
{
public:
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaItemSelectorScreenBase.GetCurrentItem
struct UAthenaItemSelectorScreenBase_GetCurrentItem_Params
{
public:
	class UFortItem*                             ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaItemSelectorScreenBase.ExitEditStyle
struct UAthenaItemSelectorScreenBase_ExitEditStyle_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaItemSelectorScreenBase.EnterEditStyle
struct UAthenaItemSelectorScreenBase_EnterEditStyle_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaItemSelectorScreenBase.BP_HandleBack
struct UAthenaItemSelectorScreenBase_BP_HandleBack_Params
{
public:
};

// 0x70 (0x70 - 0x0)
// Function FortniteUI.AthenaLeaderboardScreenBase.OnUpdateTabButtonText
struct UAthenaLeaderboardScreenBase_OnUpdateTabButtonText_Params
{
public:
	class UCommonButtonBase*                     Button;                                            // 0x0(0x8)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAthenaPlaylistLeaderboardData        PlaylistTabData;                                   // 0x8(0x68)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x68 (0x68 - 0x0)
// Function FortniteUI.AthenaLeaderboardScreenBase.OnUpdateListHeader
struct UAthenaLeaderboardScreenBase_OnUpdateListHeader_Params
{
public:
	struct FAthenaPlaylistLeaderboardData        PlaylistTabData;                                   // 0x0(0x68)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x28 (0x28 - 0x0)
// Function FortniteUI.AthenaLeaderboardScreenBase.OnUpdateLeaderboardListUI
struct UAthenaLeaderboardScreenBase_OnUpdateLeaderboardListUI_Params
{
public:
	bool                                         bWasSuccessful;                                    // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3778[0x7];                                     // Fixing Size After Last Property
	class UFortLeaderboardRowProxyInstance*      LocalUserRow;                                      // 0x8(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                  QueryErrorStr;                                     // 0x10(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaLeaderboardScreenBase.OnQueryStarted
struct UAthenaLeaderboardScreenBase_OnQueryStarted_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaLeaderboardScreenBase.OnQueryFinished
struct UAthenaLeaderboardScreenBase_OnQueryFinished_Params
{
public:
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaLeaderboardScreenBase.OnPlaylistChanged
struct UAthenaLeaderboardScreenBase_OnPlaylistChanged_Params
{
public:
	class FName                                  NewPlaylistName;                                   // 0x0(0x4)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class ECommonInputType                  NewInputType;                                      // 0x4(0x1)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_377D[0x3];                                     // Fixing Size Of Struct
};

// 0x4 (0x4 - 0x0)
// Function FortniteUI.AthenaLeaderboardScreenBase.OnMatchTypeChanged
struct UAthenaLeaderboardScreenBase_OnMatchTypeChanged_Params
{
public:
	int32                                        MatchTypeIndex;                                    // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteUI.AthenaLeaderboardScreenBase.OnFriendsFilterChanged
struct UAthenaLeaderboardScreenBase_OnFriendsFilterChanged_Params
{
public:
	int32                                        FriendsFilterIndex;                                // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteUI.AthenaLeaderboardScreenBase.OnActiveLeaderboardTabChanged
struct UAthenaLeaderboardScreenBase_OnActiveLeaderboardTabChanged_Params
{
public:
	int32                                        ActiveWidgetIndex;                                 // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaLeaderboardScreenBase.CanShowFriendsOnlyLeaderboard
struct UAthenaLeaderboardScreenBase_CanShowFriendsOnlyLeaderboard_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaLoadoutEntryWidget.SetLoadout
struct UAthenaLoadoutEntryWidget_SetLoadout_Params
{
public:
	class UFortAthenaInventoryLoadout*           NewLoadout;                                        // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaLoadoutEntryWidget.OnLoadoutPicked
struct UAthenaLoadoutEntryWidget_OnLoadoutPicked_Params
{
public:
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaLoadoutWidget.OnLoadoutChosen
struct UAthenaLoadoutWidget_OnLoadoutChosen_Params
{
public:
	class UFortAthenaInventoryLoadout*           SelectedLoadout;                                   // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaLoadoutWidget.AddEntryWidget
struct UAthenaLoadoutWidget_AddEntryWidget_Params
{
public:
	class UAthenaLoadoutEntryWidget*             NewWidget;                                         // 0x0(0x8)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.FortLobbyWidget.OnPlayerPanelHidden
struct UFortLobbyWidget_OnPlayerPanelHidden_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.FortLobbyWidget.OnPlayerClicked
struct UFortLobbyWidget_OnPlayerClicked_Params
{
public:
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.FortLobbyWidget.HandleEmoteClicked
struct UFortLobbyWidget_HandleEmoteClicked_Params
{
public:
	bool                                         bPassThrough;                                      // 0x0(0x1)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.FortLobbyWidget.DynamicHandleLoadingScreenVisibilityChanged
struct UFortLobbyWidget_DynamicHandleLoadingScreenVisibilityChanged_Params
{
public:
	bool                                         IsVisible;                                         // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function FortniteUI.AthenaLobbyBase.UpdateGenericLinkText
struct UAthenaLobbyBase_UpdateGenericLinkText_Params
{
public:
	class FText                                  NewText;                                           // 0x0(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaLobbyBase.OnQuestsButtonVisibilityChanged
struct UAthenaLobbyBase_OnQuestsButtonVisibilityChanged_Params
{
public:
	enum class ESlateVisibility                  NewVisibility;                                     // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaLobbyBase.OnPlaylistChanged
struct UAthenaLobbyBase_OnPlaylistChanged_Params
{
public:
	enum class EFortLobbyType                    LobbyType;                                         // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_37E2[0x7];                                     // Fixing Size After Last Property
	class UFortPlaylistAthena*                   PlaylistData;                                      // 0x8(0x8)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaLobbyBase.OnMatchmakingWidgetChanged
struct UAthenaLobbyBase_OnMatchmakingWidgetChanged_Params
{
public:
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaLobbyBase.OnLobbyChanged
struct UAthenaLobbyBase_OnLobbyChanged_Params
{
public:
	enum class EFortLobbyType                    LobbyType;                                         // 0x0(0x1)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaLobbyBase.HasUnseenQuests
struct UAthenaLobbyBase_HasUnseenQuests_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaLobbyBase.HandleUnseenQuestsChanged
struct UAthenaLobbyBase_HandleUnseenQuestsChanged_Params
{
public:
	bool                                         bHasUnseenQuests;                                  // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaLobbyBase.HandleToggleFullscreenMap
struct UAthenaLobbyBase_HandleToggleFullscreenMap_Params
{
public:
	bool                                         bVisible;                                          // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xC (0xC - 0x0)
// Function FortniteUI.AthenaLobbyBase.HandlePickerOpenRequest
struct UAthenaLobbyBase_HandlePickerOpenRequest_Params
{
public:
	enum class EFortPickerMode                   Mode;                                              // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_37FC[0x3];                                     // Fixing Size After Last Property
	int32                                        InitialOption;                                     // 0x4(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIgnoreFirstAccept;                                // 0x8(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_37FD[0x3];                                     // Fixing Size Of Struct
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaLobbyBase.HandleHideLobbySeasonResources
struct UAthenaLobbyBase_HandleHideLobbySeasonResources_Params
{
public:
	bool                                         bShouldHide;                                       // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaLobbyBase.HandleActiveWidgetChanged
struct UAthenaLobbyBase_HandleActiveWidgetChanged_Params
{
public:
	class UWidget*                               NewActiveWidget;                                   // 0x0(0x8)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        WidgetIndex;                                       // 0x8(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3804[0x4];                                     // Fixing Size Of Struct
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaLobbyBase.DisplayStoreUpdated
struct UAthenaLobbyBase_DisplayStoreUpdated_Params
{
public:
	class UStoreToastRequest*                    StoreUpdatedRequest;                               // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteUI.AthenaLobbyBase.DisplayGlyphQuestUpdated
struct UAthenaLobbyBase_DisplayGlyphQuestUpdated_Params
{
public:
	int32                                        NewGlyphs;                                         // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// Function FortniteUI.AthenaLockerItemInfo.SetItemDefinition
struct UAthenaLockerItemInfo_SetItemDefinition_Params
{
public:
	class UFortItemDefinition*                   ItemDefinition;                                    // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                  ItemDefinitionTitleOverride;                       // 0x8(0x18)(Parm, NativeAccessSpecifierPublic)
};

// 0x28 (0x28 - 0x0)
// Function FortniteUI.AthenaLockerItemInfo.OnUpdateAccessRestrictionWarning
struct UAthenaLockerItemInfo_OnUpdateAccessRestrictionWarning_Params
{
public:
	bool                                         bShouldShow;                                       // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_382F[0x7];                                     // Fixing Size After Last Property
	class FText                                  WarningText;                                       // 0x8(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	enum class EAthenaLockerInfoRestrictionWarning WarningType;                                       // 0x20(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3830[0x7];                                     // Fixing Size Of Struct
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaLockerItemInfo.OnNoItemSet
struct UAthenaLockerItemInfo_OnNoItemSet_Params
{
public:
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaLockerItemInfo.OnItemDefinitionSet
struct UAthenaLockerItemInfo_OnItemDefinitionSet_Params
{
public:
	class UFortItemDefinition*                   ItemDefinition;                                    // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaMapLayer.SetLocalPlayer
struct UAthenaMapLayer_SetLocalPlayer_Params
{
public:
	class ULocalPlayer*                          LocalPlayer;                                       // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaMapLayer.FlashPlayerIcon
struct UAthenaMapLayer_FlashPlayerIcon_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaMapLayer.ClearTouches
struct UAthenaMapLayer_ClearTouches_Params
{
public:
};

// 0x4 (0x4 - 0x0)
// Function FortniteUI.AthenaMapLayerContainer.OnTeleportToMarkerTimeChanged
struct UAthenaMapLayerContainer_OnTeleportToMarkerTimeChanged_Params
{
public:
	float                                        TimeLeftBeforeTeleport;                            // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaMapLayerContainer.HandleNewContextualObjectives
struct UAthenaMapLayerContainer_HandleNewContextualObjectives_Params
{
public:
	TArray<class UFortQuestItem*>                ContextualQuests;                                  // 0x0(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaMapScreenContainer.OnDamageReceived
struct UAthenaMapScreenContainer_OnDamageReceived_Params
{
public:
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaMapScreenContainer.IsQuestsTabActive
struct UAthenaMapScreenContainer_IsQuestsTabActive_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaMapScreenContainer.BP_OnShowTabsSet
struct UAthenaMapScreenContainer_BP_OnShowTabsSet_Params
{
public:
	bool                                         bShowTabs;                                         // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x180 (0x180 - 0x0)
// Function FortniteUI.AthenaMarkerDetails.UpdateMarkerData
struct UAthenaMarkerDetails_UpdateMarkerData_Params
{
public:
	struct FFortWorldMarkerData                  MarkerData;                                        // 0x0(0x180)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaMarkerDetails.UpdateMarkerAction
struct UAthenaMarkerDetails_UpdateMarkerAction_Params
{
public:
	enum class EFortMarkerActions                MarkerAction;                                      // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaMarkerPointer.SetTargetScreenPosition
struct UAthenaMarkerPointer_SetTargetScreenPosition_Params
{
public:
	struct FVector2D                             InTargetScreenPosition;                            // 0x0(0x10)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaMarkerPointer.SetLineMeshMaterial
struct UAthenaMarkerPointer_SetLineMeshMaterial_Params
{
public:
	class UMaterialInterface*                    Material;                                          // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaMatchReadyDesktopPopup.UserDismissedDialog
struct UAthenaMatchReadyDesktopPopup_UserDismissedDialog_Params
{
public:
	bool                                         bBringToFront;                                     // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// Function FortniteUI.AthenaPlayerHitPointBarBase.SetProgressBarFillColors
struct UAthenaPlayerHitPointBarBase_SetProgressBarFillColors_Params
{
public:
	struct FLinearColor                          ColorA;                                            // 0x0(0x10)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                          ColorB;                                            // 0x10(0x10)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaPlayerHitPointBarBase.OnValueChangedWithReason
struct UAthenaPlayerHitPointBarBase_OnValueChangedWithReason_Params
{
public:
	float                                        Value;                                             // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EFortHitPointModificationReason   Reason;                                            // 0x4(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3870[0x3];                                     // Fixing Size Of Struct
};

// 0x4 (0x4 - 0x0)
// Function FortniteUI.AthenaPlayerHitPointBarBase.OnMaxValueChanged
struct UAthenaPlayerHitPointBarBase_OnMaxValueChanged_Params
{
public:
	float                                        Value;                                             // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaPlayerHitPointBarBase.OnExtensionWidgetAdded
struct UAthenaPlayerHitPointBarBase_OnExtensionWidgetAdded_Params
{
public:
	enum class EUIExtensionSlot                  ExtensionSlot;                                     // 0x0(0x1)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_387A[0x7];                                     // Fixing Size After Last Property
	class UUserWidget*                           ExtensionWidget;                                   // 0x8(0x8)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaPlayerHitPointBarBase.OnDeltaChanged
struct UAthenaPlayerHitPointBarBase_OnDeltaChanged_Params
{
public:
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaPlayerHitPointBarBase.OnDBNOStateChanged
struct UAthenaPlayerHitPointBarBase_OnDBNOStateChanged_Params
{
public:
	bool                                         IsDBNO;                                            // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaPlayerHitPointBarBase.IsShieldSegmented
struct UAthenaPlayerHitPointBarBase_IsShieldSegmented_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteUI.AthenaPlayerHitPointBarBase.GetLastValuePercentage
struct UAthenaPlayerHitPointBarBase_GetLastValuePercentage_Params
{
public:
	float                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteUI.AthenaPlayerHitPointBarBase.GetCurrentValuePercentage
struct UAthenaPlayerHitPointBarBase_GetCurrentValuePercentage_Params
{
public:
	float                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaPlayerHitPointInfo.HandleTetherChanged
struct UAthenaPlayerHitPointInfo_HandleTetherChanged_Params
{
public:
	bool                                         bTethered;                                         // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaPlayerHitPointInfo.HandleExitVehicle
struct UAthenaPlayerHitPointInfo_HandleExitVehicle_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaPlayerHitPointInfo.HandleEnterVehicle
struct UAthenaPlayerHitPointInfo_HandleEnterVehicle_Params
{
public:
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaPlayerIndicatorBase.OnExtensionWidgetCreated
struct UAthenaPlayerIndicatorBase_OnExtensionWidgetCreated_Params
{
public:
	class UUserWidget*                           Widget;                                            // 0x0(0x8)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EUIExtensionSlot                  SlotType;                                          // 0x8(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_38A6[0x7];                                     // Fixing Size Of Struct
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaPlayerIndicatorBase.HandleCurrentPawnChanged
struct UAthenaPlayerIndicatorBase_HandleCurrentPawnChanged_Params
{
public:
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaPlayerIndicatorBase.BP_UpdateWorldNameVisibility
struct UAthenaPlayerIndicatorBase_BP_UpdateWorldNameVisibility_Params
{
public:
	bool                                         bDisplayWorldName;                                 // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaPlayerIndicatorBase.BP_OnHandleTeamMemberStateChanged
struct UAthenaPlayerIndicatorBase_BP_OnHandleTeamMemberStateChanged_Params
{
public:
	enum class ETeamMemberState                  TeamMemberState;                                   // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaPlayerIndicatorBase.BP_OnHandleTalkingStateChanged
struct UAthenaPlayerIndicatorBase_BP_OnHandleTalkingStateChanged_Params
{
public:
	bool                                         bIsTalking;                                        // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaPlayerIndicatorBase.BP_OnHandlePlayerStateSet
struct UAthenaPlayerIndicatorBase_BP_OnHandlePlayerStateSet_Params
{
public:
	class UFortPlayerStateAthena*                PlayerStateAthena;                                 // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaPlayerIndicatorBase.BP_OnHandlePlayerNameReplicated
struct UAthenaPlayerIndicatorBase_BP_OnHandlePlayerNameReplicated_Params
{
public:
	class FString                                PlayerName;                                        // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaPlayerIndicatorBase.BP_OnHandlePinColorChanged
struct UAthenaPlayerIndicatorBase_BP_OnHandlePinColorChanged_Params
{
public:
	struct FLinearColor                          PinColor;                                          // 0x0(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaPlayerIndicatorBase.BP_OnHandleDBNOStateChanged
struct UAthenaPlayerIndicatorBase_BP_OnHandleDBNOStateChanged_Params
{
public:
	bool                                         bIsDBNO;                                           // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaPlayerIndicatorBase.BP_OnHandleBeingRevivedStateChanged
struct UAthenaPlayerIndicatorBase_BP_OnHandleBeingRevivedStateChanged_Params
{
public:
	bool                                         bIsBeingRevived;                                   // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_38B1[0x3];                                     // Fixing Size After Last Property
	float                                        MaxReviveTime;                                     // 0x4(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaPlayerInfoBase.SetPlayerState
struct UAthenaPlayerInfoBase_SetPlayerState_Params
{
public:
	class UFortPlayerStateAthena*                InPlayerState;                                     // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x28 (0x28 - 0x0)
// Function FortniteUI.AthenaPlayerInfoBase.HandlePlaylistLoaded
struct UAthenaPlayerInfoBase_HandlePlaylistLoaded_Params
{
public:
	class FName                                  PlaylistName;                                      // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_38BC[0x4];                                     // Fixing Size After Last Property
	struct FGameplayTagContainer                 PlaylistContextTags;                               // 0x8(0x20)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaPlayerInfoBase.HandlePlayerMutatorDataChanged
struct UAthenaPlayerInfoBase_HandlePlayerMutatorDataChanged_Params
{
public:
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaPlayerInfoBase.HandleGamePhaseChanged
struct UAthenaPlayerInfoBase_HandleGamePhaseChanged_Params
{
public:
	enum class EAthenaGamePhase                  NewPhase;                                          // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaPlayerInfoBase.BP_HandleTalkingVisualDisplayChanged
struct UAthenaPlayerInfoBase_BP_HandleTalkingVisualDisplayChanged_Params
{
public:
	bool                                         bTalkingVisualsActive;                             // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaPlayerInfoBase.BP_HandleTalkingStateChanged
struct UAthenaPlayerInfoBase_BP_HandleTalkingStateChanged_Params
{
public:
	bool                                         bIsTalking;                                        // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteUI.AthenaPlayerInfoBase.BP_HandleSeasonLevelUIDisplayChanged
struct UAthenaPlayerInfoBase_BP_HandleSeasonLevelUIDisplayChanged_Params
{
public:
	int32                                        Level;                                             // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x3 (0x3 - 0x0)
// Function FortniteUI.AthenaPlayerInfoBase.BP_HandleResurrectionStateChanged
struct UAthenaPlayerInfoBase_BP_HandleResurrectionStateChanged_Params
{
public:
	struct FFortResurrectionUIData               ResurrectionStateData;                             // 0x0(0x3)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};

// 0x28 (0x28 - 0x0)
// Function FortniteUI.AthenaPlayerInfoBase.BP_HandlePlaylistLoaded
struct UAthenaPlayerInfoBase_BP_HandlePlaylistLoaded_Params
{
public:
	class FName                                  PlaylistName;                                      // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_38CB[0x4];                                     // Fixing Size After Last Property
	struct FGameplayTagContainer                 PlaylistContextTags;                               // 0x8(0x20)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaPlayerInfoBase.BP_HandlePlaylistExtensionWidgetCreated
struct UAthenaPlayerInfoBase_BP_HandlePlaylistExtensionWidgetCreated_Params
{
public:
	class UUserWidget*                           Widget;                                            // 0x0(0x8)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EUIExtensionSlot                  SlotType;                                          // 0x8(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_38CF[0x7];                                     // Fixing Size Of Struct
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaPlayerInfoBase.BP_HandlePlayerNameReplicated
struct UAthenaPlayerInfoBase_BP_HandlePlayerNameReplicated_Params
{
public:
	class FString                                PlayerName;                                        // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaPlayerInfoBase.BP_HandleMutedStateChanged
struct UAthenaPlayerInfoBase_BP_HandleMutedStateChanged_Params
{
public:
	bool                                         bIsMuted;                                          // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaPlayerInfoBase.BP_HandleIsBeingRevivedStateChanged
struct UAthenaPlayerInfoBase_BP_HandleIsBeingRevivedStateChanged_Params
{
public:
	bool                                         bIsTalking;                                        // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaPlayerInfoBase.BP_HandleGameModeIconChanged
struct UAthenaPlayerInfoBase_BP_HandleGameModeIconChanged_Params
{
public:
	class UTexture2D*                            GameModeIcon;                                      // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaPlayerInfoBase.BP_HandleDBNOStateChanged
struct UAthenaPlayerInfoBase_BP_HandleDBNOStateChanged_Params
{
public:
	bool                                         bDBNO;                                             // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaPlayerKillsBase.SetKillsSourcePlayerState
struct UAthenaPlayerKillsBase_SetKillsSourcePlayerState_Params
{
public:
	class UFortPlayerStateAthena*                InPlayerState;                                     // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaPlayerKillsBase.SetKillsSourcePlayerController
struct UAthenaPlayerKillsBase_SetKillsSourcePlayerController_Params
{
public:
	class UFortPlayerControllerAthena*           InPlayerController;                                // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaPlayerKillsBase.HandlePlayerViewTargetChanged
struct UAthenaPlayerKillsBase_HandlePlayerViewTargetChanged_Params
{
public:
};

// 0x34 (0x34 - 0x0)
// Function FortniteUI.FortAccountWidgetBase.OnAccountInfoChanged
struct UFortAccountWidgetBase_OnAccountInfoChanged_Params
{
public:
	struct FFortPublicAccountInfo                Result;                                            // 0x0(0x34)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};

// 0x34 (0x34 - 0x0)
// Function FortniteUI.FortAccountWidgetBase.HandleCurrentlyViewedAccountInfoChanged
struct UFortAccountWidgetBase_HandleCurrentlyViewedAccountInfoChanged_Params
{
public:
	struct FFortPublicAccountInfo                NewInfo;                                           // 0x0(0x34)(Parm, NoDestructor, NativeAccessSpecifierPublic)
};

// 0x58 (0x58 - 0x0)
// Function FortniteUI.FortAccountWidgetBase.GetSeasonBannerInfo
struct UFortAccountWidgetBase_GetSeasonBannerInfo_Params
{
public:
	int32                                        Level;                                             // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3914[0x4];                                     // Fixing Size After Last Property
	struct FAthenaSeasonBannerLevel              ReturnValue;                                       // 0x8(0x50)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// 0x14 (0x14 - 0x0)
// Function FortniteUI.FortAccountWidgetBase.GetNextSeasonReward
struct UFortAccountWidgetBase_GetNextSeasonReward_Params
{
public:
	struct FFortItemQuantityPair                 Reward;                                            // 0x0(0xC)(Parm, OutParm, NoDestructor, NativeAccessSpecifierPublic)
	int32                                        RewardLevel;                                       // 0xC(0x4)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x10(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_391C[0x3];                                     // Fixing Size Of Struct
};

// 0x18 (0x18 - 0x0)
// Function FortniteUI.FortAccountWidgetBase.GetNextSeasonChaseReward
struct UFortAccountWidgetBase_GetNextSeasonChaseReward_Params
{
public:
	struct FFortItemQuantityPair                 Reward;                                            // 0x0(0xC)(Parm, OutParm, NoDestructor, NativeAccessSpecifierPublic)
	int32                                        RewardLevel;                                       // 0xC(0x4)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        StartingLevel;                                     // 0x10(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x14(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3927[0x3];                                     // Fixing Size Of Struct
};

// 0x18 (0x18 - 0x0)
// Function FortniteUI.FortAccountWidgetBase.GetCurrentSeasonNumberAsText
struct UFortAccountWidgetBase_GetCurrentSeasonNumberAsText_Params
{
public:
	class FText                                  ReturnValue;                                       // 0x0(0x18)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function FortniteUI.FortAccountWidgetBase.GetCurrentChapterAsText
struct UFortAccountWidgetBase_GetCurrentChapterAsText_Params
{
public:
	class FText                                  ReturnValue;                                       // 0x0(0x18)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaPlayerLevelDisplay.UpdateBPStatus
struct UAthenaPlayerLevelDisplay_UpdateBPStatus_Params
{
public:
	enum class EBPStatus                         Status;                                            // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaPlayerLevelDisplay.OnUpdateXpBar
struct UAthenaPlayerLevelDisplay_OnUpdateXpBar_Params
{
public:
	float                                        Progress;                                          // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIsMaxLevel;                                       // 0x4(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3944[0x3];                                     // Fixing Size Of Struct
};

// 0x40 (0x40 - 0x0)
// Function FortniteUI.AthenaPlayerLevelDisplay.OnUpdateRewardIcon
struct UAthenaPlayerLevelDisplay_OnUpdateRewardIcon_Params
{
public:
	class UFortItem*                             RewardItem;                                        // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UTexture2D>             RewardTexture;                                     // 0x8(0x28)(ConstParm, Parm, OutParm, ReferenceParm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bHasAdditionalStylesToDisplay;                     // 0x30(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3956[0x3];                                     // Fixing Size After Last Property
	int32                                        RewardLevel;                                       // 0x34(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bRequiresBattlePass;                               // 0x38(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3959[0x7];                                     // Fixing Size Of Struct
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaPlayersLeftBase.UpdatePlayersLeft
struct UAthenaPlayersLeftBase_UpdatePlayersLeft_Params
{
public:
};

// 0x18 (0x18 - 0x0)
// Function FortniteUI.AthenaPlayersLeftBase.SetPlayersLeftText
struct UAthenaPlayersLeftBase_SetPlayersLeftText_Params
{
public:
	class FText                                  PlayersText;                                       // 0x0(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function FortniteUI.AthenaPlayersLeftBase.SetHumansLeftText
struct UAthenaPlayersLeftBase_SetHumansLeftText_Params
{
public:
	class FText                                  HumansText;                                        // 0x0(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function FortniteUI.AthenaPlayersLeftBase.SetBotsLeftText
struct UAthenaPlayersLeftBase_SetBotsLeftText_Params
{
public:
	class FText                                  BotsText;                                          // 0x0(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaPlayerTeamKillsBase.HandlePlayerViewTargetChanged
struct UAthenaPlayerTeamKillsBase_HandlePlayerViewTargetChanged_Params
{
public:
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaPlayerVitalityBarBase.SetDataSource
struct UAthenaPlayerVitalityBarBase_SetDataSource_Params
{
public:
	class UAthenaPlayerViewModel*                PlayerViewModel;                                   // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaQuickbarEditorBase.SelectPreviousQuickBarSlot
struct UAthenaQuickbarEditorBase_SelectPreviousQuickBarSlot_Params
{
public:
	bool                                         bSetFocus;                                         // 0x0(0x1)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaQuickbarEditorBase.SelectNextQuickBarSlot
struct UAthenaQuickbarEditorBase_SelectNextQuickBarSlot_Params
{
public:
	bool                                         bSetFocus;                                         // 0x0(0x1)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaQuickbarEditorBase.OnQuickBarSlotButtonCreated
struct UAthenaQuickbarEditorBase_OnQuickBarSlotButtonCreated_Params
{
public:
	class UAthenaQuickBarSlotButtonBase*         QuickBarSlotButton;                                // 0x0(0x8)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaQuickbarEditorBase.GetFirstEquipSlotButton
struct UAthenaQuickbarEditorBase_GetFirstEquipSlotButton_Params
{
public:
	class UWidget*                               ReturnValue;                                       // 0x0(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaRebootCardIndicator.HandleDisplayForSelf
struct UAthenaRebootCardIndicator_HandleDisplayForSelf_Params
{
public:
	bool                                         bSelf;                                             // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaRebootChipDirective.UpdateSquadListDisplay
struct UAthenaRebootChipDirective_UpdateSquadListDisplay_Params
{
public:
	enum class EAthenaSquadListUpdateType        UpdateType;                                        // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_39B4[0x7];                                     // Fixing Size After Last Property
	class UFortPlayerStateAthena*                PS;                                                // 0x8(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x98 (0x98 - 0x0)
// Function FortniteUI.AthenaRebootChipDirective.HandleLocalPlayerDied
struct UAthenaRebootChipDirective_HandleLocalPlayerDied_Params
{
public:
	struct FFortPlayerDeathReport                DeathReport;                                       // 0x0(0x98)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaRebootVanIndicator.OnSpawnMachineStateChanged
struct UAthenaRebootVanIndicator_OnSpawnMachineStateChanged_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaRespawnBase.UpdateAllUI
struct UAthenaRespawnBase_UpdateAllUI_Params
{
public:
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaRespawnBase.OnUpdateRespawnState
struct UAthenaRespawnBase_OnUpdateRespawnState_Params
{
public:
	bool                                         bEnabled;                                          // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteUI.AthenaRespawnBase.OnUpdateLives
struct UAthenaRespawnBase_OnUpdateLives_Params
{
public:
	int32                                        Lives;                                             // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaRespawnBase.OnGamePhaseChanged
struct UAthenaRespawnBase_OnGamePhaseChanged_Params
{
public:
	enum class EAthenaGamePhase                  GamePhase;                                         // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x28 (0x28 - 0x0)
// Function FortniteUI.AthenaScorePopWidgetBase.OnNewScoreEarned
struct UAthenaScorePopWidgetBase_OnNewScoreEarned_Params
{
public:
	int32                                        NewScoreValue;                                     // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_39E0[0x4];                                     // Fixing Size After Last Property
	class FText                                  NewScoreTypeText;                                  // 0x8(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	int32                                        BigScoreThreshold;                                 // 0x20(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_39E1[0x4];                                     // Fixing Size Of Struct
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaScorePopWidgetBase.HandleNewScoreEarned
struct UAthenaScorePopWidgetBase_HandleNewScoreEarned_Params
{
public:
	int32                                        NewPoints;                                         // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EAthenaScoringEvent               ScoreType;                                         // 0x4(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_39E9[0x3];                                     // Fixing Size Of Struct
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaSkydivingInformation.OnStartSkydive
struct UAthenaSkydivingInformation_OnStartSkydive_Params
{
public:
};

// 0x4 (0x4 - 0x0)
// Function FortniteUI.AthenaSkydivingInformation.OnNewVerticalSpeed
struct UAthenaSkydivingInformation_OnNewVerticalSpeed_Params
{
public:
	float                                        NewVerticalSpeed;                                  // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteUI.AthenaSkydivingInformation.OnNewRating
struct UAthenaSkydivingInformation_OnNewRating_Params
{
public:
	float                                        NewRating;                                         // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteUI.AthenaSkydivingInformation.OnNewNormalizedPlayerAltitude
struct UAthenaSkydivingInformation_OnNewNormalizedPlayerAltitude_Params
{
public:
	float                                        NormalizedPlayerAltitude;                          // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteUI.AthenaSkydivingInformation.OnNewNormalizedOpeningAltitude
struct UAthenaSkydivingInformation_OnNewNormalizedOpeningAltitude_Params
{
public:
	float                                        NormalizedOpeningAltitude;                         // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteUI.AthenaSkydivingInformation.OnNewNormalizedGroundAltitude
struct UAthenaSkydivingInformation_OnNewNormalizedGroundAltitude_Params
{
public:
	float                                        NormalizedGroundAltitude;                          // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteUI.AthenaSkydivingInformation.OnNewHorizontalSpeed
struct UAthenaSkydivingInformation_OnNewHorizontalSpeed_Params
{
public:
	float                                        NewHorizontalSpeed;                                // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteUI.AthenaSkydivingInformation.OnNewGroundAltitude
struct UAthenaSkydivingInformation_OnNewGroundAltitude_Params
{
public:
	float                                        NewGroundAltitude;                                 // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteUI.AthenaSkydivingInformation.OnNewDuration
struct UAthenaSkydivingInformation_OnNewDuration_Params
{
public:
	float                                        NewDuration;                                       // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteUI.AthenaSkydivingInformation.OnNewCurrentAltitude
struct UAthenaSkydivingInformation_OnNewCurrentAltitude_Params
{
public:
	float                                        NewCurrentAltitude;                                // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteUI.AthenaSkydivingInformation.OnNewAltitude
struct UAthenaSkydivingInformation_OnNewAltitude_Params
{
public:
	float                                        NewAltitude;                                       // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaSkydivingInformation.OnExitSkydive
struct UAthenaSkydivingInformation_OnExitSkydive_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaSkydivingInformation.OnEnterGlider
struct UAthenaSkydivingInformation_OnEnterGlider_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaSocialScreen.ShowCareerScreen
struct UAthenaSocialScreen_ShowCareerScreen_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaSquadListBase.UpdateSquadFromMinigameOptionChange
struct UAthenaSquadListBase_UpdateSquadFromMinigameOptionChange_Params
{
public:
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaSquadListBase.UpdateIsTeamMiniGameOnMinigameVolumeChanged
struct UAthenaSquadListBase_UpdateIsTeamMiniGameOnMinigameVolumeChanged_Params
{
public:
	class UFortVolume*                           Volume;                                            // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaSquadListBase.OnExtensionWidgetRemoved
struct UAthenaSquadListBase_OnExtensionWidgetRemoved_Params
{
public:
	class UUserWidget*                           Widget;                                            // 0x0(0x8)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaSquadListBase.OnExtensionWidgetAdded
struct UAthenaSquadListBase_OnExtensionWidgetAdded_Params
{
public:
	enum class EUIExtensionSlot                  SlotType;                                          // 0x0(0x1)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3A44[0x7];                                     // Fixing Size After Last Property
	class UUserWidget*                           Widget;                                            // 0x8(0x8)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaSquadListBase.HandleSquadMemberDisconnected
struct UAthenaSquadListBase_HandleSquadMemberDisconnected_Params
{
public:
	class UFortPlayerStateAthena*                Player;                                            // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x30 (0x30 - 0x0)
// Function FortniteUI.AthenaSquadListBase.HandlePlayerUniqueIdReplicated
struct UAthenaSquadListBase_HandlePlayerUniqueIdReplicated_Params
{
public:
	struct FUniqueNetIdRepl                      UniqueId;                                          // 0x0(0x30)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaSquadListBase.HandlePlayerExitVolume
struct UAthenaSquadListBase_HandlePlayerExitVolume_Params
{
public:
	class UPlayerState*                          Client;                                            // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortVolume*                           Volume;                                            // 0x8(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaSquadListBase.HandlePlayerEnterVolume
struct UAthenaSquadListBase_HandlePlayerEnterVolume_Params
{
public:
	class UPlayerState*                          Client;                                            // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortVolume*                           Volume;                                            // 0x8(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaSquadListBase.HandleGameMemberChanged
struct UAthenaSquadListBase_HandleGameMemberChanged_Params
{
public:
	uint8                                        InSquadId;                                         // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        InTeamIndex;                                       // 0x1(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3A5B[0x6];                                     // Fixing Size After Last Property
	class UFortPlayerStateAthena*                ChangedPS;                                         // 0x8(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function FortniteUI.AthenaStatsScreenBase.SetPlatformButtonText
struct UAthenaStatsScreenBase_SetPlatformButtonText_Params
{
public:
	class FText                                  PlatformButtonText;                                // 0x0(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function FortniteUI.AthenaStatsScreenBase.SetDisplayName
struct UAthenaStatsScreenBase_SetDisplayName_Params
{
public:
	class FText                                  InDisplayName;                                     // 0x0(0x18)(Parm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaStatsScreenBase.SetAccountIdToQueryFromString
struct UAthenaStatsScreenBase_SetAccountIdToQueryFromString_Params
{
public:
	class FString                                InAccountId;                                       // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteUI.AthenaStatsScreenBase.OnTabSelected
struct UAthenaStatsScreenBase_OnTabSelected_Params
{
public:
	class FName                                  TabName;                                           // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaStatsScreenBase.OnQueryStarted
struct UAthenaStatsScreenBase_OnQueryStarted_Params
{
public:
};

// 0x2 (0x2 - 0x0)
// Function FortniteUI.AthenaStatsScreenBase.OnQueryFinished
struct UAthenaStatsScreenBase_OnQueryFinished_Params
{
public:
	bool                                         bWasSuccessful;                                    // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bHasStatsToDisplay;                                // 0x1(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaStatsScreenBase.DisplayQueriedUserPlatformProfile
struct UAthenaStatsScreenBase_DisplayQueriedUserPlatformProfile_Params
{
public:
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaStormSurgeWarningBase.OnStormCapStateChanged
struct UAthenaStormSurgeWarningBase_OnStormCapStateChanged_Params
{
public:
	enum class EAthenaStormCapState              StormCapState;                                     // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaStormSurgeWarningBase.OnStopDisplaying
struct UAthenaStormSurgeWarningBase_OnStopDisplaying_Params
{
public:
};

// 0x38 (0x38 - 0x0)
// Function FortniteUI.AthenaStormSurgeWarningBase.OnStartDisplaying
struct UAthenaStormSurgeWarningBase_OnStartDisplaying_Params
{
public:
	class FText                                  TitleText;                                         // 0x0(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FText                                  SubTitleText;                                      // 0x18(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                         bDisplaySubtitle;                                  // 0x30(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bPlayDamageActiveSound;                            // 0x31(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3A8E[0x6];                                     // Fixing Size Of Struct
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaStormSurgeWidgetBase.UpdateUI
struct UAthenaStormSurgeWidgetBase_UpdateUI_Params
{
public:
};

// 0x20 (0x20 - 0x0)
// Function FortniteUI.AthenaStormSurgeWidgetBase.OnUpdateThresholdDisplay
struct UAthenaStormSurgeWidgetBase_OnUpdateThresholdDisplay_Params
{
public:
	class FText                                  ThresholdText;                                     // 0x0(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	enum class EStormSurgeThresholdType          ThresholdType;                                     // 0x18(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3A99[0x7];                                     // Fixing Size Of Struct
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaStormSurgeWidgetBase.OnStormCapStateChanged
struct UAthenaStormSurgeWidgetBase_OnStormCapStateChanged_Params
{
public:
	enum class EAthenaStormCapState              StormCapState;                                     // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaStormSurgeWidgetBase.OnStopDisplaying
struct UAthenaStormSurgeWidgetBase_OnStopDisplaying_Params
{
public:
};

// 0x18 (0x18 - 0x0)
// Function FortniteUI.AthenaStormSurgeWidgetBase.OnStartDisplaying
struct UAthenaStormSurgeWidgetBase_OnStartDisplaying_Params
{
public:
	class FText                                  TitleText;                                         // 0x0(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x40 (0x40 - 0x0)
// Function FortniteUI.AthenaTeamAliveCountBase.SetTeamSlotData
struct UAthenaTeamAliveCountBase_SetTeamSlotData_Params
{
public:
	int32                                        TeamIdx;                                           // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3AAA[0x4];                                     // Fixing Size After Last Property
	struct FAthenaTeamCountSlotData              TeamSlotData;                                      // 0x8(0x38)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteUI.AthenaTeamScoreWidgetBase.OnScoreChanged
struct UAthenaTeamScoreWidgetBase_OnScoreChanged_Params
{
public:
	int32                                        Score;                                             // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteUI.AthenaTeamScoreWidgetBase.OnPlacementChanged
struct UAthenaTeamScoreWidgetBase_OnPlacementChanged_Params
{
public:
	int32                                        Placement;                                         // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaTeamScoreWidgetBase.OnLeaderboardChanged
struct UAthenaTeamScoreWidgetBase_OnLeaderboardChanged_Params
{
public:
	int32                                        ScoreDelta;                                        // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIsWinner;                                         // 0x4(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bHasScore;                                         // 0x5(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3AB6[0x2];                                     // Fixing Size Of Struct
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaTeamScoreWidgetBase.HandleUpdate
struct UAthenaTeamScoreWidgetBase_HandleUpdate_Params
{
public:
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaTeamScoreWidgetBase.HandleSpectatingChanged
struct UAthenaTeamScoreWidgetBase_HandleSpectatingChanged_Params
{
public:
	class UFortPlayerStateZone*                  SpectatingTarget;                                  // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteUI.AthenaTeamScoreWidgetBase.HandleScoreChanged
struct UAthenaTeamScoreWidgetBase_HandleScoreChanged_Params
{
public:
	int32                                        Score;                                             // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaTimeWidgetBase.UpdateTimeText
struct UAthenaTimeWidgetBase_UpdateTimeText_Params
{
public:
};

// 0x20 (0x20 - 0x0)
// Function FortniteUI.AthenaTimeWidgetBase.UpdateDisplay
struct UAthenaTimeWidgetBase_UpdateDisplay_Params
{
public:
	class FText                                  DisplayText;                                       // 0x0(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FName                                  DisplayTextStyle;                                  // 0x18(0x4)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3AD1[0x4];                                     // Fixing Size Of Struct
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaTimeWidgetBase.OnTimerWidgetActorUpdated
struct UAthenaTimeWidgetBase_OnTimerWidgetActorUpdated_Params
{
public:
	class UActor*                                TimerWidgetActor;                                  // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaTimeWidgetBase.OnStopTimeDisplay
struct UAthenaTimeWidgetBase_OnStopTimeDisplay_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaTimeWidgetBase.OnStartTimeDisplay
struct UAthenaTimeWidgetBase_OnStartTimeDisplay_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaTimeWidgetBase.OnMinigameStarted
struct UAthenaTimeWidgetBase_OnMinigameStarted_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaTimeWidgetBase.OnMinigameEnded
struct UAthenaTimeWidgetBase_OnMinigameEnded_Params
{
public:
};

// 0x18 (0x18 - 0x0)
// Function FortniteUI.AthenaTimeWidgetBase.OnGamePhaseStepChanged
struct UAthenaTimeWidgetBase_OnGamePhaseStepChanged_Params
{
public:
	TScriptInterface<class UFortSafeZoneInterface> SafeZoneInterface;                                 // 0x0(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EAthenaGamePhaseStep              GamePhaseStep;                                     // 0x10(0x1)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3AD5[0x7];                                     // Fixing Size Of Struct
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaTimeWidgetBase.OnGamePhaseChanged
struct UAthenaTimeWidgetBase_OnGamePhaseChanged_Params
{
public:
	enum class EAthenaGamePhase                  GamePhase;                                         // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaTimeWidgetBase.IsTextStyleValid
struct UAthenaTimeWidgetBase_IsTextStyleValid_Params
{
public:
	class FName                                  DisplayTextStyle;                                  // 0x0(0x4)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x4(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3AD9[0x3];                                     // Fixing Size Of Struct
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaTimeWidgetBase.ClientEnteredVolume
struct UAthenaTimeWidgetBase_ClientEnteredVolume_Params
{
public:
	class UPlayerState*                          PlayerState;                                       // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortVolume*                           FortVolume;                                        // 0x8(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xF8 (0xF8 - 0x0)
// Function FortniteUI.AthenaTravelLogFormatting.ShouldDisplayText
struct UAthenaTravelLogFormatting_ShouldDisplayText_Params
{
public:
	struct FAthenaTravelLogEntry                 Entry;                                             // 0x0(0xF0)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0xF0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3AE8[0x7];                                     // Fixing Size Of Struct
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaTravelLogFormatting.IsTravelLogTextDisplayEnabled
struct UAthenaTravelLogFormatting_IsTravelLogTextDisplayEnabled_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x110 (0x110 - 0x0)
// Function FortniteUI.AthenaTravelLogFormatting.FormatTravelLogEntry
struct UAthenaTravelLogFormatting_FormatTravelLogEntry_Params
{
public:
	class UObject*                               WorldContextObject;                                // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAthenaTravelLogEntry                 Entry;                                             // 0x8(0xF0)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FText                                  ReturnValue;                                       // 0xF8(0x18)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function FortniteUI.AthenaTrickFeedBase.UpdateTrickStats
struct UAthenaTrickFeedBase_UpdateTrickStats_Params
{
public:
