#pragma once

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x1BC (0x3EC8 - 0x3D0C)
// BlueprintGeneratedClass NPC_Pawn_Wildlife_Parent.NPC_Pawn_Wildlife_Parent_C
class UNPC_Pawn_Wildlife_Parent_C : public UNPC_Pawn_Parent_C
{
public:
	uint8                                        Pad_2BE3[0x4];                                     // Fixing Size After Last Property
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0x3D10(0x8)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                     Wildlife_FootDust;                                 // 0x3D18(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UFortPawnComponent_Convert*            ConvertComponent;                                  // 0x3D20(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TSoftClassPtr<class UAnimInstance>           Layer_Idle;                                        // 0x3D28(0x28)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftClassPtr<class UAnimInstance>           Layer_Locomotion;                                  // 0x3D50(0x28)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftClassPtr<class UAnimInstance>           Layer_Jump;                                        // 0x3D78(0x28)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	uint8                                        LeaderTeam;                                        // 0x3DA0(0x1)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2BE4[0x7];                                     // Fixing Size After Last Property
	class USoundEffectSourcePresetChain*         VocalSourceEffectChainOverride;                    // 0x3DA8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                         bTamingEnabled;                                    // 0x3DB0(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2BE5[0x7];                                     // Fixing Size After Last Property
	FMulticastInlineDelegateProperty_            OnPickupGrabbed_Destroyed;                         // 0x3DB8(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                         bCanBeInteractedWithWhileTamed;                    // 0x3DC8(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2BE6[0x3];                                     // Fixing Size After Last Property
	struct FActiveGameplayEffectHandle           GE_Quest_Converted_Handle;                         // 0x3DCC(0x8)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2BE7[0x4];                                     // Fixing Size After Last Property
	TSubclassOf<class UGameplayEffect>           GE_Quest_Converted_Irwin;                          // 0x3DD8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_            ConvertedDispatcher;                               // 0x3DE0(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                         bIsBeingRidden;                                    // 0x3DF0(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         NPCStatusWidgetShouldDisplayDamage;                // 0x3DF1(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2BE8[0x6];                                     // Fixing Size After Last Property
	TSubclassOf<class UGameplayEffect>           GE_GoalSelectionWhileTamed;                        // 0x3DF8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	struct FGameplayTagContainer                 T_GoalSelectionWhileTamed;                         // 0x3E00(0x20)(Edit, BlueprintVisible, DisableEditOnInstance)
	double                                       CurrentEnergy;                                     // 0x3E20(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                          IrwinSlidingGC;                                    // 0x3E28(0x4)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                         bLeaderSetSuccess;                                 // 0x3E2C(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2BE9[0x3];                                     // Fixing Size After Last Property
	struct FGameplayTag                          JumpLandSoundLibTag;                               // 0x3E30(0x4)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                          TameSoundLibTag;                                   // 0x3E34(0x4)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                            SoundIndicatorSound_Unridden;                      // 0x3E38(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                            SoundIndicatorSound_Ridden;                        // 0x3E40(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                         OverrideIncomingDmg;                               // 0x3E48(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2BEA[0x7];                                     // Fixing Size After Last Property
	double                                       OverridenIncomingDmgAmount;                        // 0x3E50(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_            OnModifiedDamageReceived;                          // 0x3E58(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	double                                       ColorVariation;                                    // 0x3E68(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Default_Unconvert_Reason;                          // 0x3E70(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2BEB[0x7];                                     // Fixing Size After Last Property
	struct FScalableFloat                        StuckBouncing_UnstuckEnabled;                      // 0x3E78(0x28)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                        StuckBouncing_LaunchCount;                         // 0x3EA0(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        StuckBouncing_MinLaunchCount;                      // 0x3EA4(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle           StuckBouncing_GeHandle;                            // 0x3EA8(0x8)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TSubclassOf<class UGameplayEffect>           StuckBouncing_GE;                                  // 0x3EB0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	double                                       StuckBouncing_UnstuckVelocityMaxZRotationAngle;    // 0x3EB8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       StuckBouncing_UnstuckVelocity;                     // 0x3EC0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("NPC_Pawn_Wildlife_Parent_C");
		return Clss;
	}

	struct FVector OnLaunchCharacter(const struct FVector& LaunchVelocity, bool bXYOverride, bool bZOverride, const struct FVector& CallFunc_Conv_DoubleToVector_ReturnValue, const struct FVector2D& CallFunc_Conv_VectorToVector2D_ReturnValue, const struct FVector& CallFunc_Vector_Up_ReturnValue, bool CallFunc_IsNearlyZero2D_ReturnValue, const struct FVector& CallFunc_GetActorForwardVector_ReturnValue, double CallFunc_Multiply_DoubleDouble_ReturnValue, const struct FVector& CallFunc_Multiply_VectorVector_ReturnValue, double CallFunc_RandomFloatInRange_ReturnValue, const struct FVector& CallFunc_RotateAngleAxis_ReturnValue, bool CallFunc_GetValueAsBool_ReturnValue, const struct FVector& CallFunc_Add_VectorVector_ReturnValue, bool CallFunc_IsValidClass_ReturnValue, int32 Temp_int_Variable, bool CallFunc_RemoveActiveGameplayEffect_ReturnValue, bool CallFunc_HasMatchingGameplayTag_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue, bool CallFunc_GreaterEqual_IntInt_ReturnValue, bool CallFunc_BooleanAND_ReturnValue, bool CallFunc_BooleanAND_ReturnValue_1, const struct FActiveGameplayEffectHandle& CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue, float CallFunc_RotateAngleAxis_AngleDeg_ImplicitCast);
	void TryShowHealthBar(class UFortPawnComponent_Convert* CallFunc_GetComponentByClass_ReturnValue, bool CallFunc_IsValid_ReturnValue, class UFortPlayerPawn* CallFunc_GetConverterPawn_ReturnValue, bool CallFunc_IsValid_ReturnValue_1, bool CallFunc_OnLocalPlayersTeam_Return_Value, bool CallFunc_IsLocallyControlled_ReturnValue);
	bool BlueprintCanInteract(class UFortPawn* InteractingPawn, enum class EInteractionBeingAttempted InteractionBeingAttempted, bool CallFunc_BlueprintCanInteract_ReturnValue, TScriptInterface<class UGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput, bool CallFunc_HasMatchingGameplayTag_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue, class UFortPawnComponent_Convert* CallFunc_GetComponentByClass_ReturnValue, class UFortPlayerPawn* CallFunc_GetConverterPawn_ReturnValue, bool CallFunc_IsValid_ReturnValue, bool CallFunc_EqualEqual_ObjectObject_ReturnValue, bool CallFunc_IsValid_ReturnValue_1, bool CallFunc_GetOnlyLeaderInteraction_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue_1, bool CallFunc_BooleanOR_ReturnValue);
	void PlayStateChangeAudio(enum class Enum_NPC_AlertLevel Index, const struct FGameplayTag& Temp_struct_Variable, const struct FGameplayTag& Temp_struct_Variable_1, const struct FGameplayTag& Temp_struct_Variable_2, const struct FGameplayTag& Temp_struct_Variable_3, const struct FGameplayTag& Temp_struct_Variable_4, enum class Enum_NPC_AlertLevel Temp_byte_Variable, const struct FGameplayTag& K2Node_Select_Default, bool CallFunc_IsGameplayTagValid_ReturnValue);
	void PlayAdditiveHitReacts(struct FVector& Hit_Direction, class UAnimMontage* Anim_Montage, const struct FGameplayTagContainer& CallFunc_GetOwnedGameplayTags_TagContainer, bool CallFunc_HasTag_ReturnValue);
	float BlueprintModifyIncomingDamage(float Damage, struct FGameplayTagContainer& DamageTags, struct FGameplayEffectContextHandle& EffectContext, class UController* EventInstigator, class UActor* DamageCauser, int64 LastFrameCount, class UActor* Last_DamageCauser, class UController* LastDamageInstigator, double NewDamage, float CallFunc_BlueprintModifyIncomingDamage_ReturnValue, int64 CallFunc_GetFrameCount_ReturnValue, bool CallFunc_EqualEqual_Int64Int64_ReturnValue, bool CallFunc_EqualEqual_ObjectObject_ReturnValue, bool CallFunc_EqualEqual_ObjectObject_ReturnValue_1, bool CallFunc_BooleanAND_ReturnValue, bool CallFunc_BooleanAND_ReturnValue_1, float K2Node_FunctionResult_ReturnValue_ImplicitCast);
	void NPCStatusWidget_UpdateKeepVisible(bool ShouldKeepVisible, float CallFunc_GetMaxHealth_ReturnValue, float CallFunc_GetHealth_ReturnValue, class UFortPlayerController* CallFunc_GetFirstLocalFortPlayerController_ReturnValue, double CallFunc_Divide_DoubleDouble_ReturnValue, class UPawn* CallFunc_K2_GetPawn_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue_1, bool CallFunc_IsValid_ReturnValue, bool CallFunc_NPC_GetScalableFloatHotfixValue_AsBool, int32 CallFunc_NPC_GetScalableFloatHotfixValue_AsIntRounded, double CallFunc_NPC_GetScalableFloatHotfixValue_AsFloat, class UUserWidget* CallFunc_GetUserWidgetObject_ReturnValue, class UNPCStatusWidget_C* K2Node_DynamicCast_AsNPCStatus_Widget, bool K2Node_DynamicCast_bSuccess, double CallFunc_GetDistanceBetweenActors_Distance, bool CallFunc_Greater_DoubleDouble_ReturnValue, bool CallFunc_BooleanAND_ReturnValue, enum class ESubGame CallFunc_GetSubGame_ReturnValue, bool CallFunc_BooleanAND_ReturnValue_1, bool CallFunc_EqualEqual_ByteByte_ReturnValue, double CallFunc_Divide_DoubleDouble_B_ImplicitCast, double CallFunc_Divide_DoubleDouble_A_ImplicitCast);
	void CanBeInteractedWithWhenTamed(bool* bCanInteract, bool CallFunc_NPC_GetScalableFloatHotfixValue_AsBool, int32 CallFunc_NPC_GetScalableFloatHotfixValue_AsIntRounded, double CallFunc_NPC_GetScalableFloatHotfixValue_AsFloat, bool CallFunc_BooleanAND_ReturnValue);
	void NPC_PickupGrabbed_Destroyed(class UActor* ActorGrabbed);
	void SetTamingEnabled(bool EnableTaming, bool CallFunc_NPC_CanBeInteractedWith_CanInteract, class UFortPawnComponent_Convert* CallFunc_GetComponentByClass_ReturnValue, bool CallFunc_IsValid_ReturnValue);
	void NPC_CanBeInteractedWith(bool* CanInteract, bool CallFunc_NPC_CanBeInteractedWith_CanInteract, bool CallFunc_BooleanAND_ReturnValue);
	void AttachAndApplyVocalFX(struct FSoundLibraryPlayResult& SoundLibraryResult, int32 Temp_int_Array_Index_Variable, class UAudioComponent* CallFunc_Array_Get_Item, int32 CallFunc_Array_Length_ReturnValue, bool CallFunc_IsValid_ReturnValue, bool CallFunc_MatchesTag_ReturnValue, int32 Temp_int_Loop_Counter_Variable, class USceneComponent* CallFunc_K2_GetRootComponent_ReturnValue, bool CallFunc_K2_AttachToComponent_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue, bool CallFunc_IsValid_ReturnValue_1);
	void Play_Water_Splash_at_Water_Surface(class UFortWaterBodyActor* Water_Body, bool Enter_Water);
	bool IsValidAutoFireTarget(class UActor* Attacker, enum class EFortTeamAffiliation TeamAffiliation, uint8 CallFunc_GetActorTeam_ReturnValue, bool CallFunc_EqualEqual_ByteByte_ReturnValue, enum class EFortTeamAffiliation CallFunc_GetTeamAffiliationBetweenTeams_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue, bool CallFunc_EqualEqual_ByteByte_ReturnValue_1, float CallFunc_GetMaxHealth_ReturnValue, float CallFunc_GetHealth_ReturnValue, bool CallFunc_Less_DoubleDouble_ReturnValue, bool CallFunc_EqualEqual_ByteByte_ReturnValue_2, bool CallFunc_BooleanAND_ReturnValue, double CallFunc_Less_DoubleDouble_B_ImplicitCast, double CallFunc_Less_DoubleDouble_A_ImplicitCast);
	void Play_Sound_Lib(const struct FGameplayTag& Event_Name, class USoundLibrarySubsystem* CallFunc_GetWorldSubsystem_ReturnValue, const struct FSoundLibrarySimpleContextSettings& K2Node_MakeStruct_SoundLibrarySimpleContextSettings, bool CallFunc_IsValid_ReturnValue, class UB_CreatureSoundLibraryContext_C* CallFunc_SpawnObject_ReturnValue, bool CallFunc_IsValid_ReturnValue_1, const struct FSoundLibraryPlayResult& CallFunc_PlaySound_OutResults);
	void UpdateTamingIndicator(bool CallFunc_HasAuthority_ReturnValue, class UFortPlayerController* CallFunc_GetFirstLocalFortPlayerController_ReturnValue, uint8 CallFunc_GetActorTeam_ReturnValue, bool CallFunc_EqualEqual_ByteByte_ReturnValue);
	void OnRep_LeaderTeam();
	void OnLoaded_9DC5FDA543FAF13BB29E95AA78B28A06(TSubclassOf<class UObject> Loaded);
	void ReceiveBeginPlay();
	void LinkAnimationLayers();
	void AsyncLinkAnimationLayer(TSoftClassPtr<class UAnimInstance> AnimationLayer);
	void OnCustomizationsLoaded_BP();
	void On_NPC_PawnInteractedWith(class UActor* AIPawn, class UFortPlayerPawn* InteractingPlayerPawn);
	void BndEvt__ConvertComponent_K2Node_ComponentBoundEvent_0_ConvertedEvent__DelegateSignature(class UFortPawn* InstigatorPawn, class UFortPawn* ConvertedPawn);
	void BndEvt__ConvertComponent_K2Node_ComponentBoundEvent_1_UnconvertedEvent__DelegateSignature(class UFortPawn* UnconvertedPawn, enum class EUnconvertReason UnconvertReason);
	void NPC_AlertLevelChangedServer(enum class Enum_NPC_AlertLevel NPCAlertLevel);
	void OnDeathServer(float Damage, struct FGameplayTagContainer& DamageTags, const struct FVector& Momentum, struct FHitResult& HitInfo, class UController* InstigatedBy, class UActor* DamageCauser, const struct FGameplayEffectContextHandle& EffectContext);
	void NPC_LeaderSet(bool Success_, class UActor* Leader, enum class EUnconvertReason UnconvertReason);
	void BndEvt__SoundLibrary_Component_K2Node_ComponentBoundEvent_2_OnSoundLibraryPlayEvent__DelegateSignature(struct FSoundLibraryPlayResult& Results, class USoundLibraryContext* Context);
	void OnBeingControlledChanged(bool bControlled);
	void OnApplyEffectOptimization(int32 NewBudgetValue);
	void OnDamagePlayEffects(float Damage, struct FGameplayTagContainer& DamageTags, const struct FVector& Momentum, struct FHitResult& HitInfo, class UFortPawn* InstigatedBy, class UActor* DamageCauser, const struct FGameplayEffectContextHandle& EffectContext);
	void NPC_UpdateHealthBarComponentVisibility();
	void OnPawnHealthChanged_Event_0();
	void On_Pawn_Focused(class UFortPawn* FocusedPawn);
	void HideStatus();
	void OnSlidingStateChanged(bool bNewSlidingState);
	void OnDeathPlayEffects(float Damage, struct FGameplayTagContainer& DamageTags, const struct FVector& Momentum, struct FHitResult& HitInfo, class UFortPawn* InstigatedBy, class UActor* DamageCauser, const struct FGameplayEffectContextHandle& EffectContext);
	void OnLanded(struct FHitResult& Hit);
	void OnOutOfConvertResistanceServer(float ConvertDamageDone, struct FGameplayTagContainer& SourceTags, struct FGameplayEffectContextHandle& EffectContext, class UController* EffectInstigator, class UActor* EffectCauser);
	void RestoreConvertResistance();
	void CE_UpdateSurfaceType(class UActorComponent* Component, bool bReset);
	void ExecuteUbergraph_NPC_Pawn_Wildlife_Parent(int32 EntryPoint, bool Temp_bool_Variable, bool CallFunc_IsDedicatedServer_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue, TSoftClassPtr<class UAnimInstance> K2Node_CustomEvent_AnimationLayer, bool CallFunc_IsValidSoftClassReference_ReturnValue, bool Temp_wildcard_To_allow_the_previous_value_to_be_returned_Variable, bool CallFunc_IsValid_ReturnValue, class UUserWidget* CallFunc_GetUserWidgetObject_ReturnValue, class UNPCStatusWidget_C* K2Node_DynamicCast_AsNPCStatus_Widget, bool K2Node_DynamicCast_bSuccess, class UActor* K2Node_Event_AIPawn, class UFortPlayerPawn* K2Node_Event_InteractingPlayerPawn, int32 Temp_int_Variable, bool K2Node_SwitchInteger_CmpSuccess, class UFortPawn* K2Node_DynamicCast_AsFort_Pawn, bool K2Node_DynamicCast_bSuccess_1, int32 CallFunc_GetConsoleVariableIntValue_ReturnValue, bool CallFunc_InEditorOrPIE_ReturnValue, TArray<bool>& Temp_wildcard_Avoid_creating_array_every_time_Variable, class UGameUserSettings* CallFunc_GetGameUserSettings_ReturnValue, class UFortPawn* K2Node_ComponentBoundEvent_InstigatorPawn, class UFortPawn* K2Node_ComponentBoundEvent_ConvertedPawn, int32 CallFunc_GetVisualEffectQuality_ReturnValue, uint8 CallFunc_GetActorTeam_ReturnValue, class UFortAbilitySystemComponent* CallFunc_GetFortAbilitySystemComponent_ReturnValue, class UFortPawn* K2Node_ComponentBoundEvent_UnconvertedPawn, enum class EUnconvertReason K2Node_ComponentBoundEvent_UnconvertReason, bool CallFunc_IsValid_ReturnValue_1, bool CallFunc_IsValid_ReturnValue_2, enum class Enum_NPC_AlertLevel K2Node_Event_NPCAlertLevel, bool K2Node_SwitchEnum_CmpSuccess, float K2Node_Event_Damage_2, const struct FGameplayTagContainer& K2Node_Event_DamageTags_2, const struct FVector& K2Node_Event_Momentum_2, const struct FHitResult& K2Node_Event_HitInfo_2, class UController* K2Node_Event_InstigatedBy_2, class UActor* K2Node_Event_DamageCauser_2, const struct FGameplayEffectContextHandle& K2Node_Event_EffectContext_3, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue, bool K2Node_Event_Success_, class UActor* K2Node_Event_Leader, enum class EUnconvertReason K2Node_Event_UnconvertReason, int32 CallFunc_GetConsoleVariableIntValue_ReturnValue_1, const struct FSoundLibraryPlayResult& K2Node_ComponentBoundEvent_Results, class USoundLibraryContext* K2Node_ComponentBoundEvent_Context, bool CallFunc_EqualEqual_IntInt_ReturnValue, bool K2Node_Event_bControlled, class UFortHUDContext* CallFunc_GetContext_ReturnValue, bool CallFunc_IsValid_ReturnValue_3, bool CallFunc_Not_PreBool_ReturnValue_1, bool CallFunc_NPC_CanBeInteractedWith_CanInteract, bool CallFunc_CanBeInteractedWithWhenTamed_bCanInteract, bool CallFunc_NPC_UpdateInteract_EnabledInteract, int32 K2Node_Event_NewBudgetValue, bool CallFunc_LessEqual_IntInt_ReturnValue, bool CallFunc_IsDead_ReturnValue, int32 Temp_int_Variable_1, bool K2Node_SwitchInteger_CmpSuccess_1, float K2Node_Event_Damage_1, const struct FGameplayTagContainer& K2Node_Event_DamageTags_1, const struct FVector& K2Node_Event_Momentum_1, const struct FHitResult& K2Node_Event_HitInfo_1, class UFortPawn* K2Node_Event_InstigatedBy_1, class UActor* K2Node_Event_DamageCauser_1, const struct FGameplayEffectContextHandle& K2Node_Event_EffectContext_2, class UFortPlayerPawn* K2Node_DynamicCast_AsFort_Player_Pawn, bool K2Node_DynamicCast_bSuccess_2, enum class ESubGame CallFunc_GetSubGame_ReturnValue, int32 CallFunc_GetConsoleVariableIntValue_ReturnValue_2, bool CallFunc_EqualEqual_ByteByte_ReturnValue, enum class ESubGame CallFunc_GetSubGame_ReturnValue_1, bool CallFunc_InEditorOrPIE_ReturnValue_1, bool CallFunc_EqualEqual_ByteByte_ReturnValue_1, class UFortPlayerPawn* CallFunc_GetConverterPawn_ReturnValue, bool CallFunc_IsValid_ReturnValue_4, class UGameUserSettings* CallFunc_GetGameUserSettings_ReturnValue_1, int32 CallFunc_GetVisualEffectQuality_ReturnValue_1, enum class ESubGame CallFunc_GetSubGame_ReturnValue_2, bool CallFunc_EqualEqual_ByteByte_ReturnValue_2, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate, class UFortPlayerPawn* CallFunc_GetConverterPawn_ReturnValue_1, bool CallFunc_IsValid_ReturnValue_5, bool CallFunc_HasAuthority_ReturnValue, class UFortPawn* K2Node_CustomEvent_FocusedPawn, bool CallFunc_EqualEqual_ObjectObject_ReturnValue, class UFortPawnComponent_Convert* CallFunc_GetComponentByClass_ReturnValue, bool CallFunc_IsValid_ReturnValue_6, class UFortPlayerPawn* CallFunc_GetConverterPawn_ReturnValue_2, bool CallFunc_IsValid_ReturnValue_7, class UFortPlayerStateAthena* K2Node_DynamicCast_AsFort_Player_State_Athena, bool K2Node_DynamicCast_bSuccess_3, uint8 CallFunc_GetSquadId_ReturnValue, class UClass* Temp_class_Variable, class UClass* K2Node_ClassDynamicCast_AsAnim_Instance, bool K2Node_ClassDynamicCast_bSuccess, bool CallFunc_RemoveActiveGameplayEffect_ReturnValue, bool CallFunc_HasAuthority_ReturnValue_1, const struct FActiveGameplayEffectHandle& CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue, double Temp_real_Variable, bool CallFunc_IsDedicatedServer_ReturnValue_1, class UFortAbilitySystemComponent* CallFunc_GetFortAbilitySystemComponent_ReturnValue_1, class UFortPlayerController* CallFunc_GetFirstLocalFortPlayerController_ReturnValue, bool CallFunc_IsValid_ReturnValue_8, class UFortPlayerStateAthena* K2Node_DynamicCast_AsFort_Player_State_Athena_1, bool K2Node_DynamicCast_bSuccess_4, bool CallFunc_IsValid_ReturnValue_9, uint8 CallFunc_GetSquadId_ReturnValue_1, bool CallFunc_EqualEqual_ByteByte_ReturnValue_3, int32 CallFunc_RemoveActiveEffectsWithTags_ReturnValue, const struct FActiveGameplayEffectHandle& CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue_1, bool CallFunc_IsValid_ReturnValue_10, class UUserWidget* CallFunc_GetUserWidgetObject_ReturnValue_1, bool K2Node_Event_bNewSlidingState, class UNPCStatusWidget_C* K2Node_DynamicCast_AsNPCStatus_Widget_1, bool K2Node_DynamicCast_bSuccess_5, const struct FGameplayEffectContextHandle& CallFunc_MakeSimpleFortEffectContext_ReturnValue, TSubclassOf<class UObject> K2Node_CustomEvent_Loaded, bool CallFunc_Array_Contains_ReturnValue, float K2Node_Event_Damage, const struct FGameplayTagContainer& K2Node_Event_DamageTags, const struct FVector& K2Node_Event_Momentum, const struct FHitResult& K2Node_Event_HitInfo, class UFortPawn* K2Node_Event_InstigatedBy, class UActor* K2Node_Event_DamageCauser, const struct FGameplayEffectContextHandle& K2Node_Event_EffectContext_1, const struct FHitResult& K2Node_Event_Hit, TArray<class UActor*>& Temp_object_Variable, float CallFunc_GetHealth_ReturnValue, float CallFunc_GetMaxHealth_ReturnValue, double CallFunc_Divide_DoubleDouble_ReturnValue, class UFortAbilitySystemComponent* CallFunc_GetFortAbilitySystemComponent_ReturnValue_2, const struct FGameplayEffectSpecHandle& CallFunc_MakeOutgoingSpec_ReturnValue, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_1, const struct FGameplayEffectSpecHandle& CallFunc_AssignTagSetByCallerMagnitude_ReturnValue, const struct FActiveGameplayEffectHandle& CallFunc_BP_ApplyGameplayEffectSpecToSelf_ReturnValue, float CallFunc_GetMaxConvertResistance_ReturnValue, float K2Node_Event_ConvertDamageDone, const struct FGameplayTagContainer& K2Node_Event_SourceTags, const struct FGameplayEffectContextHandle& K2Node_Event_EffectContext, class UController* K2Node_Event_EffectInstigator, class UActor* K2Node_Event_EffectCauser, float CallFunc_GetMaxConvertResistance_ReturnValue, class UFortPawn* K2Node_DynamicCast_AsFort_Pawn_1, bool K2Node_DynamicCast_bSuccess_6, double CallFunc_Multiply_DoubleDouble_ReturnValue, class UFortSurfaceTrackingComponent* CallFunc_GetSurfaceTrackingComponent_ReturnValue, enum class EPhysicalSurface CallFunc_GetCurrentSurfaceType_ReturnValue, bool CallFunc_EqualEqual_ByteByte_ReturnValue_4, class UActorComponent* K2Node_CustomEvent_Component, bool K2Node_CustomEvent_bReset, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_2, bool CallFunc_IsValid_ReturnValue_11, class UUserWidget* CallFunc_GetUserWidgetObject_ReturnValue_2, TArray<enum class EObjectTypeQuery>& K2Node_MakeArray_Array, class UNPCStatusWidget_C* K2Node_DynamicCast_AsNPCStatus_Widget_2, bool K2Node_DynamicCast_bSuccess_7, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue_1, const struct FVector& CallFunc_Subtract_VectorVector_ReturnValue, const struct FVector& CallFunc_Subtract_VectorVector_ReturnValue_1, const struct FHitResult& CallFunc_LineTraceSingleForObjects_OutHit, bool CallFunc_LineTraceSingleForObjects_ReturnValue, const struct FVector& CallFunc_GetActorForwardVector_ReturnValue, bool CallFunc_BreakHitResult_bBlockingHit, bool CallFunc_BreakHitResult_bInitialOverlap, float CallFunc_BreakHitResult_Time, float CallFunc_BreakHitResult_Distance, const struct FVector& CallFunc_BreakHitResult_Location, const struct FVector& CallFunc_BreakHitResult_ImpactPoint, const struct FVector& CallFunc_BreakHitResult_Normal, const struct FVector& CallFunc_BreakHitResult_ImpactNormal, class UPhysicalMaterial* CallFunc_BreakHitResult_PhysMat, class UActor* CallFunc_BreakHitResult_HitActor, class UPrimitiveComponent* CallFunc_BreakHitResult_HitComponent, class FName CallFunc_BreakHitResult_HitBoneName, class FName CallFunc_BreakHitResult_BoneName, int32 CallFunc_BreakHitResult_HitItem, int32 CallFunc_BreakHitResult_ElementIndex, int32 CallFunc_BreakHitResult_FaceIndex, const struct FVector& CallFunc_BreakHitResult_TraceStart, const struct FVector& CallFunc_BreakHitResult_TraceEnd, const struct FRotator& CallFunc_MakeRotFromZX_ReturnValue, const struct FHitResult& CallFunc_K2_SetWorldRotation_SweepHitResult, float CallFunc_AssignTagSetByCallerMagnitude_Magnitude_ImplicitCast, double CallFunc_Divide_DoubleDouble_A_ImplicitCast, double CallFunc_Divide_DoubleDouble_B_ImplicitCast, double CallFunc_Multiply_DoubleDouble_A_ImplicitCast, double K2Node_VariableSetRef_Target_ImplicitCast);
	void OnModifiedDamageReceived__DelegateSignature();
	void ConvertedDispatcher__DelegateSignature(bool Converted, class UFortPawn* InstigatorPawn);
	void OnPickupGrabbed_Destroyed__DelegateSignature(class UNPC_Pawn_Wildlife_Parent_C* WildlifePawn, class UActor* ActorGrabbed);
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
