#pragma once

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

#include "../SDK.hpp"

namespace SDK
{
namespace Params
{
//---------------------------------------------------------------------------------------------------------------------
// PARAMETERS
//---------------------------------------------------------------------------------------------------------------------

// 0x1 (0x1 - 0x0)
// Function VerseFortniteInternal.Game_fort_building_settings_component._L_2fFortnite_2ecom_2fGame_2ffort__building__settings__component_N_RsetTrapPlacement_L_NPlayerSettingState_R
struct UGame_fort_building_settings_component__L_2fFortnite_2ecom_2fGame_2ffort__building__settings__component_N_RsetTrapPlacement_L_NPlayerSettingState_R_Params
{
public:
	enum class EGame_PlayerSettingState          __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x1 (0x1 - 0x0)
// Function VerseFortniteInternal.Game_fort_building_settings_component._L_2fFortnite_2ecom_2fGame_2ffort__building__settings__component_N_RsetEditingHostile_L_NPlayerSettingState_R
struct UGame_fort_building_settings_component__L_2fFortnite_2ecom_2fGame_2ffort__building__settings__component_N_RsetEditingHostile_L_NPlayerSettingState_R_Params
{
public:
	enum class EGame_PlayerSettingState          __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x1 (0x1 - 0x0)
// Function VerseFortniteInternal.Game_fort_building_settings_component._L_2fFortnite_2ecom_2fGame_2ffort__building__settings__component_N_RsetEditing_L_NPlayerSettingState_R
struct UGame_fort_building_settings_component__L_2fFortnite_2ecom_2fGame_2ffort__building__settings__component_N_RsetEditing_L_NPlayerSettingState_R_Params
{
public:
	enum class EGame_PlayerSettingState          __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x1 (0x1 - 0x0)
// Function VerseFortniteInternal.Game_fort_building_settings_component._L_2fFortnite_2ecom_2fGame_2ffort__building__settings__component_N_RsetBuildingOnWater_L_NPlayerSettingState_R
struct UGame_fort_building_settings_component__L_2fFortnite_2ecom_2fGame_2ffort__building__settings__component_N_RsetBuildingOnWater_L_NPlayerSettingState_R_Params
{
public:
	enum class EGame_PlayerSettingState          __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x1 (0x1 - 0x0)
// Function VerseFortniteInternal.Game_fort_building_settings_component._L_2fFortnite_2ecom_2fGame_2ffort__building__settings__component_N_RsetBuilding_L_NPlayerSettingState_R
struct UGame_fort_building_settings_component__L_2fFortnite_2ecom_2fGame_2ffort__building__settings__component_N_RsetBuilding_L_NPlayerSettingState_R_Params
{
public:
	enum class EGame_PlayerSettingState          __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteInternal.Game_fort_building_settings_component.$InitInstance
struct UGame_fort_building_settings_component__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteInternal.Game_fort_building_settings_component.$Block
struct UGame_fort_building_settings_component__Block_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteInternal.Game_fort_building_settings_component.$InitCDO
struct UGame_fort_building_settings_component__InitCDO_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteInternal.Game_fort_item_definition.$InitInstance
struct UGame_fort_item_definition__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteInternal.Game_fort_item_definition.$Block
struct UGame_fort_item_definition__Block_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteInternal.Game_fort_item_definition.$InitCDO
struct UGame_fort_item_definition__InitCDO_Params
{
public:
};

// 0x28 (0x28 - 0x0)
// Function VerseFortniteInternal.Game_fort_playspace_component.__WaitForPlayerEliminated
struct UGame_fort_playspace_component___WaitForPlayerEliminated_Params
{
public:
	class UConcurrency_task*                     __verse_0xC1E81372_CallingTask;                    // 0x0(0x8)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                        __verse_0xA3A00DDB_CallerResumeState;              // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        __verse_0x2AC0E4D8_CallerCancelState;              // 0x10(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x18(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_6755[0x7];                                     // Fixing Size After Last Property
	class UConcurrency_task*                     RetVal;                                            // 0x20(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteInternal.Game_fort_playspace_component.$InitInstance
struct UGame_fort_playspace_component__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteInternal.Game_fort_playspace_component.$Block
struct UGame_fort_playspace_component__Block_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteInternal.Game_fort_playspace_component.$InitCDO
struct UGame_fort_playspace_component__InitCDO_Params
{
public:
};

// 0x2 (0x2 - 0x0)
// Function VerseFortniteInternal.Game_fortnite_building_component._L_2fFortnite_2ecom_2fGame_2ffortnite__building__component_N_RwasPlayerBuilt
struct UGame_fortnite_building_component__L_2fFortnite_2ecom_2fGame_2ffortnite__building__component_N_RwasPlayerBuilt_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        RetVal : 1;                                        // Mask: 0x1, PropSize: 0x10x1(0x1)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash)
};

// 0x1 (0x1 - 0x0)
// Function VerseFortniteInternal.Game_fortnite_building_component._L_2fFortnite_2ecom_2fGame_2ffortnite__building__component_N_RsetCanBeReplaced_L_Nlogic_R
struct UGame_fortnite_building_component__L_2fFortnite_2ecom_2fGame_2ffortnite__building__component_N_RsetCanBeReplaced_L_Nlogic_R_Params
{
public:
	uint8                                        __verse_0xB2CDDD72_Argument : 1;                   // Mask: 0x1, PropSize: 0x10x0(0x1)(Parm, NoDestructor, HasGetValueTypeHash)
};

// 0x1 (0x1 - 0x0)
// Function VerseFortniteInternal.Game_fortnite_building_component._L_2fFortnite_2ecom_2fGame_2ffortnite__building__component_N_RsetCanBeDamaged_L_Nlogic_R
struct UGame_fortnite_building_component__L_2fFortnite_2ecom_2fGame_2ffortnite__building__component_N_RsetCanBeDamaged_L_Nlogic_R_Params
{
public:
	uint8                                        __verse_0xB2CDDD72_Argument : 1;                   // Mask: 0x1, PropSize: 0x10x0(0x1)(Parm, NoDestructor, HasGetValueTypeHash)
};

// 0x2 (0x2 - 0x0)
// Function VerseFortniteInternal.Game_fortnite_building_component._L_2fFortnite_2ecom_2fGame_2ffortnite__building__component_N_RcanBeReplaced
struct UGame_fortnite_building_component__L_2fFortnite_2ecom_2fGame_2ffortnite__building__component_N_RcanBeReplaced_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        RetVal : 1;                                        // Mask: 0x1, PropSize: 0x10x1(0x1)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash)
};

// 0x2 (0x2 - 0x0)
// Function VerseFortniteInternal.Game_fortnite_building_component._L_2fFortnite_2ecom_2fGame_2ffortnite__building__component_N_RcanBeDamaged
struct UGame_fortnite_building_component__L_2fFortnite_2ecom_2fGame_2ffortnite__building__component_N_RcanBeDamaged_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        RetVal : 1;                                        // Mask: 0x1, PropSize: 0x10x1(0x1)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash)
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteInternal.Game_fortnite_building_component.$InitInstance
struct UGame_fortnite_building_component__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteInternal.Game_fortnite_building_component.$Block
struct UGame_fortnite_building_component__Block_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteInternal.Game_fortnite_building_component.$InitCDO
struct UGame_fortnite_building_component__InitCDO_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteInternal.Game_Item_item_type.$InitInstance
struct UGame_Item_item_type__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteInternal.Game_Item_item_type.$Block
struct UGame_Item_item_type__Block_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteInternal.Game_Item_item_type.$InitCDO
struct UGame_Item_item_type__InitCDO_Params
{
public:
};

// 0x20 (0x20 - 0x0)
// Function VerseFortniteInternal.Game_Item_player_pickup_component._L_2fFortnite_2ecom_2fGame_2fItem_2fplayer__pickup__component_N_RtossPickup_L_Nvector3_M_N_Qplayer__component_R
struct UGame_Item_player_pickup_component__L_2fFortnite_2ecom_2fGame_2fItem_2fplayer__pickup__component_N_RtossPickup_L_Nvector3_M_N_Qplayer__component_R_Params
{
public:
	struct FTuple_Lvector3_M_Qplayer__component_R __verse_0xB2CDDD72_Argument;                       // 0x0(0x20)(Parm, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function VerseFortniteInternal.Game_Item_player_pickup_component._L_2fFortnite_2ecom_2fGame_2fItem_2fplayer__pickup__component_N_RgivePickupTo_L_Nplayer__component_R
struct UGame_Item_player_pickup_component__L_2fFortnite_2ecom_2fGame_2fItem_2fplayer__pickup__component_N_RgivePickupTo_L_Nplayer__component_R_Params
{
public:
	class USimulation_player_component*          __verse_0xB2CDDD72_Argument;                       // 0x0(0x8)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// 0x10 (0x10 - 0x0)
// Function VerseFortniteInternal.Game_Item_player_pickup_component._L_2fFortnite_2ecom_2fGame_2fItem_2fplayer__pickup__component_N_RgetPrimaryItemType
struct UGame_Item_player_pickup_component__L_2fFortnite_2ecom_2fGame_2fItem_2fplayer__pickup__component_N_RgetPrimaryItemType_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_6775[0x7];                                     // Fixing Size After Last Property
	class UGame_Item_item_type*                  RetVal;                                            // 0x8(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// 0x10 (0x10 - 0x0)
// Function VerseFortniteInternal.Game_Item_player_pickup_component._L_2fFortnite_2ecom_2fGame_2fItem_2fplayer__pickup__component_N_RgetNumOfItemType_L_Nitem__type_R
struct UGame_Item_player_pickup_component__L_2fFortnite_2ecom_2fGame_2fItem_2fplayer__pickup__component_N_RgetNumOfItemType_L_Nitem__type_R_Params
{
public:
	class UGame_Item_item_type*                  __verse_0xB2CDDD72_Argument;                       // 0x0(0x8)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                        RetVal;                                            // 0x8(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x18 (0x18 - 0x0)
// Function VerseFortniteInternal.Game_Item_player_pickup_component._L_2fFortnite_2ecom_2fGame_2fItem_2fplayer__pickup__component_N_RattemptPartialCollect_L_Nitem__type_M_Nint_M_Nplayer__component_R
struct UGame_Item_player_pickup_component__L_2fFortnite_2ecom_2fGame_2fItem_2fplayer__pickup__component_N_RattemptPartialCollect_L_Nitem__type_M_Nint_M_Nplayer__component_R_Params
{
public:
	struct FTuple_Litem__type_Mint_Mplayer__component_R __verse_0xB2CDDD72_Argument;                       // 0x0(0x18)(Parm, HasGetValueTypeHash)
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteInternal.Game_Item_player_pickup_component.$InitInstance
struct UGame_Item_player_pickup_component__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteInternal.Game_Item_player_pickup_component.$Block
struct UGame_Item_player_pickup_component__Block_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteInternal.Game_Item_player_pickup_component.$InitCDO
struct UGame_Item_player_pickup_component__InitCDO_Params
{
public:
};

// 0x38 (0x38 - 0x0)
// Function VerseFortniteInternal.Game_Item_PlayerPickupComponent._L_2fFortnite_2ecom_2fGame_2fItem_2fPlayerPickupComponent_N_RcreatePickup_L_Ncomponent_M_Nfort__item__definition_M_Nint_M_Nvector3_R
struct UGame_Item_PlayerPickupComponent__L_2fFortnite_2ecom_2fGame_2fItem_2fPlayerPickupComponent_N_RcreatePickup_L_Ncomponent_M_Nfort__item__definition_M_Nint_M_Nvector3_R_Params
{
public:
	struct FTuple_Lcomponent_Mfort__item__definition_Mint_Mvector3_R __verse_0xB2CDDD72_Argument;                       // 0x0(0x30)(Parm, HasGetValueTypeHash)
	FOptionProperty_                             RetVal;                                            // 0x30(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteInternal.Game_Item_PlayerPickupComponent.$InitCDO
struct UGame_Item_PlayerPickupComponent__InitCDO_Params
{
public:
};

// 0x8 (0x8 - 0x0)
// Function VerseFortniteInternal.Game_Movement_projectile_movement_component._L_2fFortnite_2ecom_2fGame_2fMovement_2fprojectile__movement__component_N_RSetSpeed_L_Nfloat_R
struct UGame_Movement_projectile_movement_component__L_2fFortnite_2ecom_2fGame_2fMovement_2fprojectile__movement__component_N_RSetSpeed_L_Nfloat_R_Params
{
public:
	double                                       __verse_0xB2CDDD72_Argument;                       // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x1 (0x1 - 0x0)
// Function VerseFortniteInternal.Game_Movement_projectile_movement_component._L_2fFortnite_2ecom_2fGame_2fMovement_2fprojectile__movement__component_N_RSetShouldBounce_L_Nlogic_R
struct UGame_Movement_projectile_movement_component__L_2fFortnite_2ecom_2fGame_2fMovement_2fprojectile__movement__component_N_RSetShouldBounce_L_Nlogic_R_Params
{
public:
	uint8                                        __verse_0xB2CDDD72_Argument : 1;                   // Mask: 0x1, PropSize: 0x10x0(0x1)(Parm, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function VerseFortniteInternal.Game_Movement_projectile_movement_component._L_2fFortnite_2ecom_2fGame_2fMovement_2fprojectile__movement__component_N_RSetGravity_L_Nfloat_R
struct UGame_Movement_projectile_movement_component__L_2fFortnite_2ecom_2fGame_2fMovement_2fprojectile__movement__component_N_RSetGravity_L_Nfloat_R_Params
{
public:
	double                                       __verse_0xB2CDDD72_Argument;                       // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function VerseFortniteInternal.Game_Movement_projectile_movement_component._L_2fFortnite_2ecom_2fGame_2fMovement_2fprojectile__movement__component_N_RSetFriction_L_Nfloat_R
struct UGame_Movement_projectile_movement_component__L_2fFortnite_2ecom_2fGame_2fMovement_2fprojectile__movement__component_N_RSetFriction_L_Nfloat_R_Params
{
public:
	double                                       __verse_0xB2CDDD72_Argument;                       // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x18 (0x18 - 0x0)
// Function VerseFortniteInternal.Game_Movement_projectile_movement_component._L_2fFortnite_2ecom_2fGame_2fMovement_2fprojectile__movement__component_N_RSetDirection_L_Nvector3_R
struct UGame_Movement_projectile_movement_component__L_2fFortnite_2ecom_2fGame_2fMovement_2fprojectile__movement__component_N_RSetDirection_L_Nvector3_R_Params
{
public:
	struct FSpatialMath_vector3                  __verse_0xB2CDDD72_Argument;                       // 0x0(0x18)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// 0x8 (0x8 - 0x0)
// Function VerseFortniteInternal.Game_Movement_projectile_movement_component._L_2fFortnite_2ecom_2fGame_2fMovement_2fprojectile__movement__component_N_RSetBounciness_L_Nfloat_R
struct UGame_Movement_projectile_movement_component__L_2fFortnite_2ecom_2fGame_2fMovement_2fprojectile__movement__component_N_RSetBounciness_L_Nfloat_R_Params
{
public:
	double                                       __verse_0xB2CDDD72_Argument;                       // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteInternal.Game_Movement_projectile_movement_component.$InitInstance
struct UGame_Movement_projectile_movement_component__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteInternal.Game_Movement_projectile_movement_component.$Block
struct UGame_Movement_projectile_movement_component__Block_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteInternal.Game_Movement_projectile_movement_component.$InitCDO
struct UGame_Movement_projectile_movement_component__InitCDO_Params
{
public:
};

// 0x58 (0x58 - 0x0)
// Function VerseFortniteInternal.Game_Player.Game_Player_player_team$OverrideFactory
struct UGame_Player_Game_Player_player_team_OverrideFactory_Params
{
public:
	struct FGame_Player_player_team              RetVal;                                            // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                        Pad_679A[0x4];                                     // Fixing Size After Last Property
	TMap<FVerseStringProperty_, uint8>           __verse_0xFB48ED96__InitOverrideMap;               // 0x8(0x50)(ConstParm, Parm, ContainsInstancedReference)
};

// 0x4 (0x4 - 0x0)
// Function VerseFortniteInternal.Game_Player.Game_Player_player_team$Factory
struct UGame_Player_Game_Player_player_team_Factory_Params
{
public:
	struct FGame_Player_player_team              RetVal;                                            // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteInternal.Game_Player.$InitCDO
struct UGame_Player__InitCDO_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteInternal.Game_player_eliminated_result.$InitInstance
struct UGame_player_eliminated_result__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteInternal.Game_player_eliminated_result.$Block
struct UGame_player_eliminated_result__Block_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteInternal.Game_player_eliminated_result.$InitCDO
struct UGame_player_eliminated_result__InitCDO_Params
{
public:
};

// 0x11 (0x11 - 0x0)
// Function VerseFortniteInternal.Game_Player_fort_player_component._L_2fFortnite_2ecom_2fGame_2fPlayer_2ffort__player__component_N_RPushActiveState_L_N_Kchar_R
struct UGame_Player_fort_player_component__L_2fFortnite_2ecom_2fGame_2fPlayer_2ffort__player__component_N_RPushActiveState_L_N_Kchar_R_Params
{
public:
	FVerseStringProperty_                        __verse_0xB2CDDD72_Argument;                       // 0x0(0x10)(Parm, HasGetValueTypeHash)
	uint8                                        RetVal : 1;                                        // Mask: 0x1, PropSize: 0x10x10(0x1)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash)
};

// 0x11 (0x11 - 0x0)
// Function VerseFortniteInternal.Game_Player_fort_player_component._L_2fFortnite_2ecom_2fGame_2fPlayer_2ffort__player__component_N_RPopActiveState_L_N_Kchar_R
struct UGame_Player_fort_player_component__L_2fFortnite_2ecom_2fGame_2fPlayer_2ffort__player__component_N_RPopActiveState_L_N_Kchar_R_Params
{
public:
	FVerseStringProperty_                        __verse_0xB2CDDD72_Argument;                       // 0x0(0x10)(Parm, HasGetValueTypeHash)
	uint8                                        RetVal : 1;                                        // Mask: 0x1, PropSize: 0x10x10(0x1)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash)
};

// 0x11 (0x11 - 0x0)
// Function VerseFortniteInternal.Game_Player_fort_player_component._L_2fFortnite_2ecom_2fGame_2fPlayer_2ffort__player__component_N_RIsActive_L_N_Kchar_R
struct UGame_Player_fort_player_component__L_2fFortnite_2ecom_2fGame_2fPlayer_2ffort__player__component_N_RIsActive_L_N_Kchar_R_Params
{
public:
	FVerseStringProperty_                        __verse_0xB2CDDD72_Argument;                       // 0x0(0x10)(Parm, HasGetValueTypeHash)
	uint8                                        RetVal : 1;                                        // Mask: 0x1, PropSize: 0x10x10(0x1)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash)
};

// 0x18 (0x18 - 0x0)
// Function VerseFortniteInternal.Game_Player_fort_player_component._L_2fFortnite_2ecom_2fGame_2fPlayer_2ffort__player__component_N_RGetUniqueID
struct UGame_Player_fort_player_component__L_2fFortnite_2ecom_2fGame_2fPlayer_2ffort__player__component_N_RGetUniqueID_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_67A9[0x7];                                     // Fixing Size After Last Property
	FVerseStringProperty_                        RetVal;                                            // 0x8(0x10)(Parm, OutParm, ReturnParm, HasGetValueTypeHash)
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteInternal.Game_Player_fort_player_component.$InitInstance
struct UGame_Player_fort_player_component__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteInternal.Game_Player_fort_player_component.$Block
struct UGame_Player_fort_player_component__Block_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteInternal.Game_Player_fort_player_component.$InitCDO
struct UGame_Player_fort_player_component__InitCDO_Params
{
public:
};

// 0x20 (0x20 - 0x0)
// Function VerseFortniteInternal.Game_Player_player_start_component._L_2fFortnite_2ecom_2fGame_2fPlayer_2fplayer__start__component_N_RgetPosition
struct UGame_Player_player_start_component__L_2fFortnite_2ecom_2fGame_2fPlayer_2fplayer__start__component_N_RgetPosition_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_67AF[0x7];                                     // Fixing Size After Last Property
	struct FSpatialMath_vector3                  RetVal;                                            // 0x8(0x18)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// 0x10 (0x10 - 0x0)
// Function VerseFortniteInternal.Game_Player_player_start_component._L_2fFortnite_2ecom_2fGame_2fPlayer_2fplayer__start__component_N_RaddTags_L_N_K_Kchar_R
struct UGame_Player_player_start_component__L_2fFortnite_2ecom_2fGame_2fPlayer_2fplayer__start__component_N_RaddTags_L_N_K_Kchar_R_Params
{
public:
	TArray<FVerseStringProperty_>                __verse_0xB2CDDD72_Argument;                       // 0x0(0x10)(Parm, ContainsInstancedReference)
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteInternal.Game_Player_player_start_component.$InitInstance
struct UGame_Player_player_start_component__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteInternal.Game_Player_player_start_component.$Block
struct UGame_Player_player_start_component__Block_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteInternal.Game_Player_player_start_component.$InitCDO
struct UGame_Player_player_start_component__InitCDO_Params
{
public:
};

// 0x18 (0x18 - 0x0)
// Function VerseFortniteInternal.Game_Player_PlayerAttributes._L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerAttributes_N_RModifyNumericAttribute_L_Nplayer_M_NPlayerAttribute_M_NPlayerAttributeOperation_M_Nfloat_R
struct UGame_Player_PlayerAttributes__L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerAttributes_N_RModifyNumericAttribute_L_Nplayer_M_NPlayerAttribute_M_NPlayerAttributeOperation_M_Nfloat_R_Params
{
public:
	struct FTuple_Lplayer_MPlayerAttribute_MPlayerAttributeOperation_Mfloat_R __verse_0xB2CDDD72_Argument;                       // 0x0(0x18)(Parm, HasGetValueTypeHash)
};

// 0x18 (0x18 - 0x0)
// Function VerseFortniteInternal.Game_Player_PlayerAttributes._L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerAttributes_N_RGetNumericAttributeValue_L_Nplayer_M_NPlayerAttribute_R
struct UGame_Player_PlayerAttributes__L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerAttributes_N_RGetNumericAttributeValue_L_Nplayer_M_NPlayerAttribute_R_Params
{
public:
	struct FTuple_Lplayer_MPlayerAttribute_R     __verse_0xB2CDDD72_Argument;                       // 0x0(0x9)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_67BB[0x7];                                     // Fixing Size After Last Property
	double                                       RetVal;                                            // 0x10(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x18 (0x18 - 0x0)
// Function VerseFortniteInternal.Game_Player_PlayerAttributes._L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerAttributes_N_RAddToNumericAttribute_L_Nplayer_M_NPlayerAttribute_M_Nfloat_R
struct UGame_Player_PlayerAttributes__L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerAttributes_N_RAddToNumericAttribute_L_Nplayer_M_NPlayerAttribute_M_Nfloat_R_Params
{
public:
	struct FTuple_Lplayer_MPlayerAttribute_Mfloat_R __verse_0xB2CDDD72_Argument;                       // 0x0(0x18)(Parm, HasGetValueTypeHash)
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteInternal.Game_Player_PlayerAttributes.$InitCDO
struct UGame_Player_PlayerAttributes__InitCDO_Params
{
public:
};

// 0x28 (0x28 - 0x0)
// Function VerseFortniteInternal.Game_Player_PlayerInventory._L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerInventory_N_RTryAddToInventory_L_Nplayer_M_N_Kchar_M_Nint_M_Nlogic_R
struct UGame_Player_PlayerInventory__L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerInventory_N_RTryAddToInventory_L_Nplayer_M_N_Kchar_M_Nint_M_Nlogic_R_Params
{
public:
	struct FTuple_Lplayer_M_Kchar_Mint_Mlogic_R  __verse_0xB2CDDD72_Argument;                       // 0x0(0x21)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_67C4[0x7];                                     // Fixing Size Of Struct
};

// 0x22 (0x22 - 0x0)
// Function VerseFortniteInternal.Game_Player_PlayerInventory._L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerInventory_N_RTryAddItemToInventory_L_Nplayer_M_Nfort__item__definition_M_Nint_M_Nlogic_R
struct UGame_Player_PlayerInventory__L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerInventory_N_RTryAddItemToInventory_L_Nplayer_M_Nfort__item__definition_M_Nint_M_Nlogic_R_Params
{
public:
	struct FTuple_Lplayer_Mfort__item__definition_Mint_Mlogic_R __verse_0xB2CDDD72_Argument;                       // 0x0(0x19)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_67C7[0x7];                                     // Fixing Size After Last Property
	FOptionProperty_                             RetVal;                                            // 0x20(0x2)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x21 (0x21 - 0x0)
// Function VerseFortniteInternal.Game_Player_PlayerInventory._L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerInventory_N_RRemoveFromInventory_L_Nplayer_M_N_Kchar_M_Nint_R
struct UGame_Player_PlayerInventory__L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerInventory_N_RRemoveFromInventory_L_Nplayer_M_N_Kchar_M_Nint_R_Params
{
public:
	struct FTuple_Lplayer_M_Kchar_Mint_R         __verse_0xB2CDDD72_Argument;                       // 0x0(0x20)(Parm, HasGetValueTypeHash)
	uint8                                        RetVal : 1;                                        // Mask: 0x1, PropSize: 0x10x20(0x1)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function VerseFortniteInternal.Game_Player_PlayerInventory._L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerInventory_N_RClearDroppableItems_L_Nplayer_R
struct UGame_Player_PlayerInventory__L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerInventory_N_RClearDroppableItems_L_Nplayer_R_Params
{
public:
	class USimulation_player*                    __verse_0xB2CDDD72_Argument;                       // 0x0(0x8)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteInternal.Game_Player_PlayerInventory.$InitCDO
struct UGame_Player_PlayerInventory__InitCDO_Params
{
public:
};

// 0x10 (0x10 - 0x0)
// Function VerseFortniteInternal.Game_Player_PlayerInvulnerable._L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerInvulnerable_N_RSetPlayerInvulnerability_L_Nplayer_M_Nlogic_R
struct UGame_Player_PlayerInvulnerable__L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerInvulnerable_N_RSetPlayerInvulnerability_L_Nplayer_M_Nlogic_R_Params
{
public:
	struct FTuple_Lplayer_Mlogic_R               __verse_0xB2CDDD72_Argument;                       // 0x0(0x9)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_67CD[0x7];                                     // Fixing Size Of Struct
};

// 0xA (0xA - 0x0)
// Function VerseFortniteInternal.Game_Player_PlayerInvulnerable._L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerInvulnerable_N_RIsPlayerInvulnerable_L_Nplayer_R
struct UGame_Player_PlayerInvulnerable__L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerInvulnerable_N_RIsPlayerInvulnerable_L_Nplayer_R_Params
{
public:
	class USimulation_player*                    __verse_0xB2CDDD72_Argument;                       // 0x0(0x8)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FOptionProperty_                             RetVal;                                            // 0x8(0x2)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteInternal.Game_Player_PlayerInvulnerable.$InitCDO
struct UGame_Player_PlayerInvulnerable__InitCDO_Params
{
public:
};

// 0x12 (0x12 - 0x0)
// Function VerseFortniteInternal.Game_Player_PlayerSpectator._L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerSpectator_N_RSpectatePlayer_L_Nplayer_M_Nplayer_R
struct UGame_Player_PlayerSpectator__L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerSpectator_N_RSpectatePlayer_L_Nplayer_M_Nplayer_R_Params
{
public:
	struct FTuple_Lplayer_Mplayer_R              __verse_0xB2CDDD72_Argument;                       // 0x0(0x10)(Parm, HasGetValueTypeHash)
	FOptionProperty_                             RetVal;                                            // 0x10(0x2)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0xA (0xA - 0x0)
// Function VerseFortniteInternal.Game_Player_PlayerSpectator._L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerSpectator_N_RSpectateEliminator_L_Nplayer_R
struct UGame_Player_PlayerSpectator__L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerSpectator_N_RSpectateEliminator_L_Nplayer_R_Params
{
public:
	class USimulation_player*                    __verse_0xB2CDDD72_Argument;                       // 0x0(0x8)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FOptionProperty_                             RetVal;                                            // 0x8(0x2)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0xA (0xA - 0x0)
// Function VerseFortniteInternal.Game_Player_PlayerSpectator._L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerSpectator_N_RSetSpectator_L_Nplayer_R
struct UGame_Player_PlayerSpectator__L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerSpectator_N_RSetSpectator_L_Nplayer_R_Params
{
public:
	class USimulation_player*                    __verse_0xB2CDDD72_Argument;                       // 0x0(0x8)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FOptionProperty_                             RetVal;                                            // 0x8(0x2)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0xA (0xA - 0x0)
// Function VerseFortniteInternal.Game_Player_PlayerSpectator._L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerSpectator_N_RIsSpectator_L_Nplayer_R
struct UGame_Player_PlayerSpectator__L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerSpectator_N_RIsSpectator_L_Nplayer_R_Params
{
public:
	class USimulation_player*                    __verse_0xB2CDDD72_Argument;                       // 0x0(0x8)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FOptionProperty_                             RetVal;                                            // 0x8(0x2)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x18 (0x18 - 0x0)
// Function VerseFortniteInternal.Game_Player_PlayerSpectator._L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerSpectator_N_RGetPlayersSpectatingTarget_L_Nplayer_R
struct UGame_Player_PlayerSpectator__L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerSpectator_N_RGetPlayersSpectatingTarget_L_Nplayer_R_Params
{
public:
	class USimulation_player*                    __verse_0xB2CDDD72_Argument;                       // 0x0(0x8)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class USimulation_player*>            RetVal;                                            // 0x8(0x10)(Parm, OutParm, ReturnParm, ContainsInstancedReference)
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteInternal.Game_Player_PlayerSpectator.$InitCDO
struct UGame_Player_PlayerSpectator__InitCDO_Params
{
public:
};

// 0x28 (0x28 - 0x0)
// Function VerseFortniteInternal.Game_Player_PlayerStartComponent._L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerStartComponent_N_RfindAllInPlayspaceWithTags_L_Ncomponent_M_N_K_Kchar_R
struct UGame_Player_PlayerStartComponent__L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerStartComponent_N_RfindAllInPlayspaceWithTags_L_Ncomponent_M_N_K_Kchar_R_Params
{
public:
	struct FTuple_Lcomponent_M_K_Kchar_R         __verse_0xB2CDDD72_Argument;                       // 0x0(0x18)(Parm, HasGetValueTypeHash)
	TArray<class UGame_Player_player_start_component*> RetVal;                                            // 0x18(0x10)(Parm, OutParm, ReturnParm, ContainsInstancedReference)
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteInternal.Game_Player_PlayerStartComponent.$InitCDO
struct UGame_Player_PlayerStartComponent__InitCDO_Params
{
public:
};

// 0x8 (0x8 - 0x0)
// Function VerseFortniteInternal.Game_Player_PlayerStasis._L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerStasis_N_RReleaseFromStasis_L_Nplayer_R
struct UGame_Player_PlayerStasis__L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerStasis_N_RReleaseFromStasis_L_Nplayer_R_Params
{
public:
	class USimulation_player*                    __verse_0xB2CDDD72_Argument;                       // 0x0(0x8)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// 0x10 (0x10 - 0x0)
// Function VerseFortniteInternal.Game_Player_PlayerStasis._L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerStasis_N_RPutInStasisAdvanced_L_Nplayer_M_Nlogic_M_Nlogic_M_Nlogic_R
struct UGame_Player_PlayerStasis__L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerStasis_N_RPutInStasisAdvanced_L_Nplayer_M_Nlogic_M_Nlogic_M_Nlogic_R_Params
{
public:
	struct FTuple_Lplayer_Mlogic_Mlogic_Mlogic_R __verse_0xB2CDDD72_Argument;                       // 0x0(0xB)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_67DD[0x5];                                     // Fixing Size Of Struct
};

// 0x8 (0x8 - 0x0)
// Function VerseFortniteInternal.Game_Player_PlayerStasis._L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerStasis_N_RPutInStasis_L_Nplayer_R
struct UGame_Player_PlayerStasis__L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerStasis_N_RPutInStasis_L_Nplayer_R_Params
{
public:
	class USimulation_player*                    __verse_0xB2CDDD72_Argument;                       // 0x0(0x8)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteInternal.Game_Player_PlayerStasis.$InitCDO
struct UGame_Player_PlayerStasis__InitCDO_Params
{
public:
};

// 0x11 (0x11 - 0x0)
// Function VerseFortniteInternal.Game_Player_PlayerStatus._L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerStatus_N_RgetStatus_L_Nplayer__component_M_Nplayer__status__type_R
struct UGame_Player_PlayerStatus__L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerStatus_N_RgetStatus_L_Nplayer__component_M_Nplayer__status__type_R_Params
{
public:
	struct FTuple_Lplayer__component_Mplayer__status__type_R __verse_0xB2CDDD72_Argument;                       // 0x0(0x9)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_67E2[0x7];                                     // Fixing Size After Last Property
	uint8                                        RetVal : 1;                                        // Mask: 0x1, PropSize: 0x10x10(0x1)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash)
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteInternal.Game_Player_PlayerStatus.$InitCDO
struct UGame_Player_PlayerStatus__InitCDO_Params
{
public:
};

// 0x11 (0x11 - 0x0)
// Function VerseFortniteInternal.Game_Player_PlayerTeam._L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerTeam_N_RSetTeam_L_Nplayer_M_Nplayer__team_R
struct UGame_Player_PlayerTeam__L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerTeam_N_RSetTeam_L_Nplayer_M_Nplayer__team_R_Params
{
public:
	struct FTuple_Lplayer_Mplayer__team_R        __verse_0xB2CDDD72_Argument;                       // 0x0(0xC)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_67E4[0x4];                                     // Fixing Size After Last Property
	uint8                                        RetVal : 1;                                        // Mask: 0x1, PropSize: 0x10x10(0x1)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash)
};

// 0x14 (0x14 - 0x0)
// Function VerseFortniteInternal.Game_Player_PlayerTeam._L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerTeam_N_RPickTeam_L_Nplayer_M_Nplayer__team_R
struct UGame_Player_PlayerTeam__L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerTeam_N_RPickTeam_L_Nplayer_M_Nplayer__team_R_Params
{
public:
	struct FTuple_Lplayer_Mplayer__team_R        __verse_0xB2CDDD72_Argument;                       // 0x0(0xC)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_67E7[0x4];                                     // Fixing Size After Last Property
	struct FGame_Player_player_team              RetVal;                                            // 0x10(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// 0x10 (0x10 - 0x0)
// Function VerseFortniteInternal.Game_Player_PlayerTeam._L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerTeam_N_RGetTeamSize_L_Nplayer__team_R
struct UGame_Player_PlayerTeam__L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerTeam_N_RGetTeamSize_L_Nplayer__team_R_Params
{
public:
	struct FGame_Player_player_team              __verse_0xB2CDDD72_Argument;                       // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_67EA[0x4];                                     // Fixing Size After Last Property
	int64                                        RetVal;                                            // 0x8(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x18 (0x18 - 0x0)
// Function VerseFortniteInternal.Game_Player_PlayerTeam._L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerTeam_N_RGetTeamMembers_L_Nplayer__team_R
struct UGame_Player_PlayerTeam__L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerTeam_N_RGetTeamMembers_L_Nplayer__team_R_Params
{
public:
	struct FGame_Player_player_team              __verse_0xB2CDDD72_Argument;                       // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_67EE[0x4];                                     // Fixing Size After Last Property
	TArray<class USimulation_player*>            RetVal;                                            // 0x8(0x10)(Parm, OutParm, ReturnParm, ContainsInstancedReference)
};

// 0x20 (0x20 - 0x0)
// Function VerseFortniteInternal.Game_Player_PlayerTeam._L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerTeam_N_RGetTeamColor_L_Nplayer__team_R
struct UGame_Player_PlayerTeam__L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerTeam_N_RGetTeamColor_L_Nplayer__team_R_Params
{
public:
	struct FGame_Player_player_team              __verse_0xB2CDDD72_Argument;                       // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_67F3[0x4];                                     // Fixing Size After Last Property
	struct FColors_color                         RetVal;                                            // 0x8(0x18)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// 0xC (0xC - 0x0)
// Function VerseFortniteInternal.Game_Player_PlayerTeam._L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerTeam_N_RGetTeam_L_Nplayer_R
struct UGame_Player_PlayerTeam__L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerTeam_N_RGetTeam_L_Nplayer_R_Params
{
public:
	class USimulation_player*                    __verse_0xB2CDDD72_Argument;                       // 0x0(0x8)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FGame_Player_player_team              RetVal;                                            // 0x8(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// 0x8 (0x8 - 0x0)
// Function VerseFortniteInternal.Game_Player_PlayerTeam._L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerTeam_N_RGetNextTeam_L_Nplayer__team_R
struct UGame_Player_PlayerTeam__L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerTeam_N_RGetNextTeam_L_Nplayer__team_R_Params
{
public:
	struct FGame_Player_player_team              __verse_0xB2CDDD72_Argument;                       // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGame_Player_player_team              RetVal;                                            // 0x4(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// 0x8 (0x8 - 0x0)
// Function VerseFortniteInternal.Game_Player_PlayerTeam._L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerTeam_N_RGetInvalidTeam
struct UGame_Player_PlayerTeam__L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerTeam_N_RGetInvalidTeam_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_67F8[0x3];                                     // Fixing Size After Last Property
	struct FGame_Player_player_team              RetVal;                                            // 0x4(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// 0x8 (0x8 - 0x0)
// Function VerseFortniteInternal.Game_Player_PlayerTeam._L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerTeam_N_RGetFirstTeam
struct UGame_Player_PlayerTeam__L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerTeam_N_RGetFirstTeam_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_67F9[0x3];                                     // Fixing Size After Last Property
	struct FGame_Player_player_team              RetVal;                                            // 0x4(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// 0x9 (0x9 - 0x0)
// Function VerseFortniteInternal.Game_Player_PlayerTeam._L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerTeam_N_REquals_L_Nplayer__team_M_Nplayer__team_R
struct UGame_Player_PlayerTeam__L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerTeam_N_REquals_L_Nplayer__team_M_Nplayer__team_R_Params
{
public:
	struct FTuple_Lplayer__team_Mplayer__team_R  __verse_0xB2CDDD72_Argument;                       // 0x0(0x8)(Parm, HasGetValueTypeHash)
	uint8                                        RetVal : 1;                                        // Mask: 0x1, PropSize: 0x10x8(0x1)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash)
};

// 0x6 (0x6 - 0x0)
// Function VerseFortniteInternal.Game_Player_PlayerTeam._L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerTeam_N_RContainsHumanPlayers_L_Nplayer__team_R
struct UGame_Player_PlayerTeam__L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerTeam_N_RContainsHumanPlayers_L_Nplayer__team_R_Params
{
public:
	struct FGame_Player_player_team              __verse_0xB2CDDD72_Argument;                       // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	FOptionProperty_                             RetVal;                                            // 0x4(0x2)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteInternal.Game_Player_PlayerTeam.$InitCDO
struct UGame_Player_PlayerTeam__InitCDO_Params
{
public:
};

// 0x8 (0x8 - 0x0)
// Function VerseFortniteInternal.Game_Player_PlayerTravel._L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerTravel_N_RSendToLobby_L_Nplayer_R
struct UGame_Player_PlayerTravel__L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerTravel_N_RSendToLobby_L_Nplayer_R_Params
{
public:
	class USimulation_player*                    __verse_0xB2CDDD72_Argument;                       // 0x0(0x8)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteInternal.Game_Player_PlayerTravel.$InitCDO
struct UGame_Player_PlayerTravel__InitCDO_Params
{
public:
};

// 0x10 (0x10 - 0x0)
// Function VerseFortniteInternal.Game_Player_PlayerVisibility._L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerVisibility_N_RSetIsHidden_L_Nplayer_M_Nlogic_R
struct UGame_Player_PlayerVisibility__L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerVisibility_N_RSetIsHidden_L_Nplayer_M_Nlogic_R_Params
{
public:
	struct FTuple_Lplayer_Mlogic_R               __verse_0xB2CDDD72_Argument;                       // 0x0(0x9)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_67FE[0x7];                                     // Fixing Size Of Struct
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteInternal.Game_Player_PlayerVisibility.$InitCDO
struct UGame_Player_PlayerVisibility__InitCDO_Params
{
public:
};

// 0x11 (0x11 - 0x0)
// Function VerseFortniteInternal.Game_stat_container._L_2fFortnite_2ecom_2fGame_2fstat__container_N_RSetStatValue_L_Nint_M_Nint_R
struct UGame_stat_container__L_2fFortnite_2ecom_2fGame_2fstat__container_N_RSetStatValue_L_Nint_M_Nint_R_Params
{
public:
	struct FTuple_Lint_Mint_R                    __verse_0xB2CDDD72_Argument;                       // 0x0(0x10)(Parm, HasGetValueTypeHash)
	uint8                                        RetVal : 1;                                        // Mask: 0x1, PropSize: 0x10x10(0x1)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash)
};

// 0x11 (0x11 - 0x0)
// Function VerseFortniteInternal.Game_stat_container._L_2fFortnite_2ecom_2fGame_2fstat__container_N_RIncrementStat_L_Nint_M_Nint_R
struct UGame_stat_container__L_2fFortnite_2ecom_2fGame_2fstat__container_N_RIncrementStat_L_Nint_M_Nint_R_Params
{
public:
	struct FTuple_Lint_Mint_R                    __verse_0xB2CDDD72_Argument;                       // 0x0(0x10)(Parm, HasGetValueTypeHash)
	uint8                                        RetVal : 1;                                        // Mask: 0x1, PropSize: 0x10x10(0x1)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash)
};

// 0x10 (0x10 - 0x0)
// Function VerseFortniteInternal.Game_stat_container._L_2fFortnite_2ecom_2fGame_2fstat__container_N_RGetStatValue_L_Nint_R
struct UGame_stat_container__L_2fFortnite_2ecom_2fGame_2fstat__container_N_RGetStatValue_L_Nint_R_Params
{
public:
	int64                                        __verse_0xB2CDDD72_Argument;                       // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        RetVal;                                            // 0x8(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteInternal.Game_stat_container.$InitInstance
struct UGame_stat_container__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteInternal.Game_stat_container.$Block
struct UGame_stat_container__Block_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteInternal.Game_stat_container.$InitCDO
struct UGame_stat_container__InitCDO_Params
{
public:
};

// 0x18 (0x18 - 0x0)
// Function VerseFortniteInternal.Game_match_stats._L_2fFortnite_2ecom_2fGame_2fmatch__stats_N_RSetTeamStat_L_Nplayer__team_M_Nint_M_Nint_R
struct UGame_match_stats__L_2fFortnite_2ecom_2fGame_2fmatch__stats_N_RSetTeamStat_L_Nplayer__team_M_Nint_M_Nint_R_Params
{
public:
	struct FTuple_Lplayer__team_Mint_Mint_R      __verse_0xB2CDDD72_Argument;                       // 0x0(0x18)(Parm, HasGetValueTypeHash)
};

// 0x18 (0x18 - 0x0)
// Function VerseFortniteInternal.Game_match_stats._L_2fFortnite_2ecom_2fGame_2fmatch__stats_N_RSetPlayerStat_L_Nplayer_M_Nint_M_Nint_R
struct UGame_match_stats__L_2fFortnite_2ecom_2fGame_2fmatch__stats_N_RSetPlayerStat_L_Nplayer_M_Nint_M_Nint_R_Params
{
public:
	struct FTuple_Lplayer_Mint_Mint_R            __verse_0xB2CDDD72_Argument;                       // 0x0(0x18)(Parm, HasGetValueTypeHash)
};

// 0x10 (0x10 - 0x0)
// Function VerseFortniteInternal.Game_match_stats._L_2fFortnite_2ecom_2fGame_2fmatch__stats_N_RSetMatchStat_L_Nint_M_Nint_R
struct UGame_match_stats__L_2fFortnite_2ecom_2fGame_2fmatch__stats_N_RSetMatchStat_L_Nint_M_Nint_R_Params
{
public:
	struct FTuple_Lint_Mint_R                    __verse_0xB2CDDD72_Argument;                       // 0x0(0x10)(Parm, HasGetValueTypeHash)
};

// 0x1 (0x1 - 0x0)
// Function VerseFortniteInternal.Game_match_stats._L_2fFortnite_2ecom_2fGame_2fmatch__stats_N_RReset
struct UGame_match_stats__L_2fFortnite_2ecom_2fGame_2fmatch__stats_N_RReset_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
};

// 0x19 (0x19 - 0x0)
// Function VerseFortniteInternal.Game_match_stats._L_2fFortnite_2ecom_2fGame_2fmatch__stats_N_RIncrementTeamStat_L_Nplayer__team_M_Nint_M_Nint_R
struct UGame_match_stats__L_2fFortnite_2ecom_2fGame_2fmatch__stats_N_RIncrementTeamStat_L_Nplayer__team_M_Nint_M_Nint_R_Params
{
public:
	struct FTuple_Lplayer__team_Mint_Mint_R      __verse_0xB2CDDD72_Argument;                       // 0x0(0x18)(Parm, HasGetValueTypeHash)
	uint8                                        RetVal : 1;                                        // Mask: 0x1, PropSize: 0x10x18(0x1)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash)
};

// 0x19 (0x19 - 0x0)
// Function VerseFortniteInternal.Game_match_stats._L_2fFortnite_2ecom_2fGame_2fmatch__stats_N_RIncrementPlayerStat_L_Nplayer_M_Nint_M_Nint_R
struct UGame_match_stats__L_2fFortnite_2ecom_2fGame_2fmatch__stats_N_RIncrementPlayerStat_L_Nplayer_M_Nint_M_Nint_R_Params
{
public:
	struct FTuple_Lplayer_Mint_Mint_R            __verse_0xB2CDDD72_Argument;                       // 0x0(0x18)(Parm, HasGetValueTypeHash)
	uint8                                        RetVal : 1;                                        // Mask: 0x1, PropSize: 0x10x18(0x1)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash)
};

// 0x11 (0x11 - 0x0)
// Function VerseFortniteInternal.Game_match_stats._L_2fFortnite_2ecom_2fGame_2fmatch__stats_N_RIncrementMatchStat_L_Nint_M_Nint_R
struct UGame_match_stats__L_2fFortnite_2ecom_2fGame_2fmatch__stats_N_RIncrementMatchStat_L_Nint_M_Nint_R_Params
{
public:
	struct FTuple_Lint_Mint_R                    __verse_0xB2CDDD72_Argument;                       // 0x0(0x10)(Parm, HasGetValueTypeHash)
	uint8                                        RetVal : 1;                                        // Mask: 0x1, PropSize: 0x10x10(0x1)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash)
};

// 0x18 (0x18 - 0x0)
// Function VerseFortniteInternal.Game_match_stats._L_2fFortnite_2ecom_2fGame_2fmatch__stats_N_RGetTeamStat_L_Nplayer__team_M_Nint_R
struct UGame_match_stats__L_2fFortnite_2ecom_2fGame_2fmatch__stats_N_RGetTeamStat_L_Nplayer__team_M_Nint_R_Params
{
public:
	struct FTuple_Lplayer__team_Mint_R           __verse_0xB2CDDD72_Argument;                       // 0x0(0x10)(Parm, HasGetValueTypeHash)
	int64                                        RetVal;                                            // 0x10(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x18 (0x18 - 0x0)
// Function VerseFortniteInternal.Game_match_stats._L_2fFortnite_2ecom_2fGame_2fmatch__stats_N_RGetPlayerStat_L_Nplayer_M_Nint_R
struct UGame_match_stats__L_2fFortnite_2ecom_2fGame_2fmatch__stats_N_RGetPlayerStat_L_Nplayer_M_Nint_R_Params
{
public:
	struct FTuple_Lplayer_Mint_R                 __verse_0xB2CDDD72_Argument;                       // 0x0(0x10)(Parm, HasGetValueTypeHash)
	int64                                        RetVal;                                            // 0x10(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x10 (0x10 - 0x0)
// Function VerseFortniteInternal.Game_match_stats._L_2fFortnite_2ecom_2fGame_2fmatch__stats_N_RGetMatchStat_L_Nint_R
struct UGame_match_stats__L_2fFortnite_2ecom_2fGame_2fmatch__stats_N_RGetMatchStat_L_Nint_R_Params
{
public:
	int64                                        __verse_0xB2CDDD72_Argument;                       // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        RetVal;                                            // 0x8(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteInternal.Game_match_stats.$InitInstance
struct UGame_match_stats__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteInternal.Game_match_stats.$Block
struct UGame_match_stats__Block_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteInternal.Game_match_stats.$InitCDO
struct UGame_match_stats__InitCDO_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteInternal.Game_player_stat_values.$InitInstance
struct UGame_player_stat_values__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteInternal.Game_player_stat_values.$Block
struct UGame_player_stat_values__Block_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteInternal.Game_player_stat_values.$InitCDO
struct UGame_player_stat_values__InitCDO_Params
{
public:
};

// 0x600 (0x600 - 0x0)
// Function VerseFortniteInternal.Game_StormController_storm_controller_component._L_2fFortnite_2ecom_2fGame_2fStormController_2fstorm__controller__component_N_RsetBattleRoyalePhases
struct UGame_StormController_storm_controller_component__L_2fFortnite_2ecom_2fGame_2fStormController_2fstorm__controller__component_N_RsetBattleRoyalePhases_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_6827[0x7];                                     // Fixing Size After Last Property
	TArray<class UGame_StormController_storm_phase*> _ExprResult_0;                                     // 0x8(0x10)(ContainsInstancedReference)
	class UGame_StormController_storm_phase*     _ExprResult_1;                                     // 0x18(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                       _InstancingGraph_2;                                // 0x20(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSpatialMath_vector3                  _ExprResult_3;                                     // 0x28(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_4;                                // 0x40(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_5;                                     // 0x90(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_6;                                     // 0xA0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_7;                                     // 0xB0(0x10)(HasGetValueTypeHash)
	class UGame_StormController_storm_phase*     _ExprResult_8;                                     // 0xC0(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                       _InstancingGraph_9;                                // 0xC8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSpatialMath_vector3                  _ExprResult_10;                                    // 0xD0(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_11;                               // 0xE8(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_12;                                    // 0x138(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_13;                                    // 0x148(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_14;                                    // 0x158(0x10)(HasGetValueTypeHash)
	class UGame_StormController_storm_phase*     _ExprResult_15;                                    // 0x168(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                       _InstancingGraph_16;                               // 0x170(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSpatialMath_vector3                  _ExprResult_17;                                    // 0x178(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_18;                               // 0x190(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_19;                                    // 0x1E0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_20;                                    // 0x1F0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_21;                                    // 0x200(0x10)(HasGetValueTypeHash)
	class UGame_StormController_storm_phase*     _ExprResult_22;                                    // 0x210(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                       _InstancingGraph_23;                               // 0x218(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSpatialMath_vector3                  _ExprResult_24;                                    // 0x220(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_25;                               // 0x238(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_26;                                    // 0x288(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_27;                                    // 0x298(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_28;                                    // 0x2A8(0x10)(HasGetValueTypeHash)
	class UGame_StormController_storm_phase*     _ExprResult_29;                                    // 0x2B8(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                       _InstancingGraph_30;                               // 0x2C0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSpatialMath_vector3                  _ExprResult_31;                                    // 0x2C8(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_32;                               // 0x2E0(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_33;                                    // 0x330(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_34;                                    // 0x340(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_35;                                    // 0x350(0x10)(HasGetValueTypeHash)
	class UGame_StormController_storm_phase*     _ExprResult_36;                                    // 0x360(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                       _InstancingGraph_37;                               // 0x368(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSpatialMath_vector3                  _ExprResult_38;                                    // 0x370(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_39;                               // 0x388(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_40;                                    // 0x3D8(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_41;                                    // 0x3E8(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_42;                                    // 0x3F8(0x10)(HasGetValueTypeHash)
	class UGame_StormController_storm_phase*     _ExprResult_43;                                    // 0x408(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                       _InstancingGraph_44;                               // 0x410(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSpatialMath_vector3                  _ExprResult_45;                                    // 0x418(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_46;                               // 0x430(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_47;                                    // 0x480(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_48;                                    // 0x490(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_49;                                    // 0x4A0(0x10)(HasGetValueTypeHash)
	class UGame_StormController_storm_phase*     _ExprResult_50;                                    // 0x4B0(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                       _InstancingGraph_51;                               // 0x4B8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSpatialMath_vector3                  _ExprResult_52;                                    // 0x4C0(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_53;                               // 0x4D8(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_54;                                    // 0x528(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_55;                                    // 0x538(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_56;                                    // 0x548(0x10)(HasGetValueTypeHash)
	class UGame_StormController_storm_phase*     _ExprResult_57;                                    // 0x558(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                       _InstancingGraph_58;                               // 0x560(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSpatialMath_vector3                  _ExprResult_59;                                    // 0x568(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_60;                               // 0x580(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_61;                                    // 0x5D0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_62;                                    // 0x5E0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_63;                                    // 0x5F0(0x10)(HasGetValueTypeHash)
};

// 0x31 (0x31 - 0x0)
// Function VerseFortniteInternal.Game_StormController_storm_controller_component._L_2fFortnite_2ecom_2fGame_2fStormController_2fstorm__controller__component_N_Rreset
struct UGame_StormController_storm_controller_component__L_2fFortnite_2ecom_2fGame_2fStormController_2fstorm__controller__component_N_Rreset_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	enum class EVerseTrue                        _InvokeSureResultDummy_0;                          // 0x1(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_6833[0x6];                                     // Fixing Size After Last Property
	FVerseFunctionProperty_                      _Callee_1;                                         // 0x8(0x10)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_2;                                     // 0x18(0x1)(HasGetValueTypeHash)
	enum class EVerseTrue                        _InvokeSureResultDummy_3;                          // 0x19(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_6834[0x6];                                     // Fixing Size After Last Property
	FVerseFunctionProperty_                      _Callee_4;                                         // 0x20(0x10)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_5;                                     // 0x30(0x1)(HasGetValueTypeHash)
};

// 0x1 (0x1 - 0x0)
// Function VerseFortniteInternal.Game_StormController_storm_controller_component._L_2fFortnite_2ecom_2fGame_2fStormController_2fstorm__controller__component_N_Rpause
struct UGame_StormController_storm_controller_component__L_2fFortnite_2ecom_2fGame_2fStormController_2fstorm__controller__component_N_Rpause_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
};

// 0x2 (0x2 - 0x0)
// Function VerseFortniteInternal.Game_StormController_storm_controller_component._L_2fFortnite_2ecom_2fGame_2fStormController_2fstorm__controller__component_N_Rexists
struct UGame_StormController_storm_controller_component__L_2fFortnite_2ecom_2fGame_2fStormController_2fstorm__controller__component_N_Rexists_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        RetVal : 1;                                        // Mask: 0x1, PropSize: 0x10x1(0x1)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash)
};

// 0x1 (0x1 - 0x0)
// Function VerseFortniteInternal.Game_StormController_storm_controller_component._L_2fFortnite_2ecom_2fGame_2fStormController_2fstorm__controller__component_N_Rend
struct UGame_StormController_storm_controller_component__L_2fFortnite_2ecom_2fGame_2fStormController_2fstorm__controller__component_N_Rend_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
};

// 0x1 (0x1 - 0x0)
// Function VerseFortniteInternal.Game_StormController_storm_controller_component._L_2fFortnite_2ecom_2fGame_2fStormController_2fstorm__controller__component_N_Rbegin
struct UGame_StormController_storm_controller_component__L_2fFortnite_2ecom_2fGame_2fStormController_2fstorm__controller__component_N_Rbegin_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteInternal.Game_StormController_storm_controller_component.$InitInstance
struct UGame_StormController_storm_controller_component__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteInternal.Game_StormController_storm_controller_component.$Block
struct UGame_StormController_storm_controller_component__Block_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteInternal.Game_StormController_storm_controller_component.$InitCDO
struct UGame_StormController_storm_controller_component__InitCDO_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteInternal.Game_StormController_storm_phase.$InitInstance
struct UGame_StormController_storm_phase__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteInternal.Game_StormController_storm_phase.$Block
struct UGame_StormController_storm_phase__Block_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteInternal.Game_StormController_storm_phase.$InitCDO
struct UGame_StormController_storm_phase__InitCDO_Params
{
public:
};

// 0x18 (0x18 - 0x0)
// Function VerseFortniteInternal.Game_team_stat_values._L_2fFortnite_2ecom_2fGame_2fteam__stat__values_N_RSetPlayerStat_L_Nplayer_M_Nint_M_Nint_R
struct UGame_team_stat_values__L_2fFortnite_2ecom_2fGame_2fteam__stat__values_N_RSetPlayerStat_L_Nplayer_M_Nint_M_Nint_R_Params
{
public:
	struct FTuple_Lplayer_Mint_Mint_R            __verse_0xB2CDDD72_Argument;                       // 0x0(0x18)(Parm, HasGetValueTypeHash)
};

// 0x19 (0x19 - 0x0)
// Function VerseFortniteInternal.Game_team_stat_values._L_2fFortnite_2ecom_2fGame_2fteam__stat__values_N_RIncrementPlayerStat_L_Nplayer_M_Nint_M_Nint_R
struct UGame_team_stat_values__L_2fFortnite_2ecom_2fGame_2fteam__stat__values_N_RIncrementPlayerStat_L_Nplayer_M_Nint_M_Nint_R_Params
{
public:
	struct FTuple_Lplayer_Mint_Mint_R            __verse_0xB2CDDD72_Argument;                       // 0x0(0x18)(Parm, HasGetValueTypeHash)
	uint8                                        RetVal : 1;                                        // Mask: 0x1, PropSize: 0x10x18(0x1)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash)
};

// 0x18 (0x18 - 0x0)
// Function VerseFortniteInternal.Game_team_stat_values._L_2fFortnite_2ecom_2fGame_2fteam__stat__values_N_RGetPlayerStat_L_Nplayer_M_Nint_R
struct UGame_team_stat_values__L_2fFortnite_2ecom_2fGame_2fteam__stat__values_N_RGetPlayerStat_L_Nplayer_M_Nint_R_Params
{
public:
	struct FTuple_Lplayer_Mint_R                 __verse_0xB2CDDD72_Argument;                       // 0x0(0x10)(Parm, HasGetValueTypeHash)
	int64                                        RetVal;                                            // 0x10(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteInternal.Game_team_stat_values.$InitInstance
struct UGame_team_stat_values__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteInternal.Game_team_stat_values.$Block
struct UGame_team_stat_values__Block_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteInternal.Game_team_stat_values.$InitCDO
struct UGame_team_stat_values__InitCDO_Params
{
public:
};

// 0x10 (0x10 - 0x0)
// Function VerseFortniteInternal.Game_VerseFortniteHacks._L_2fFortnite_2ecom_2fGame_2fVerseFortniteHacks_N_RsetAutoRespawnEnabled_L_Ncomponent_M_Nlogic_R
struct UGame_VerseFortniteHacks__L_2fFortnite_2ecom_2fGame_2fVerseFortniteHacks_N_RsetAutoRespawnEnabled_L_Ncomponent_M_Nlogic_R_Params
{
public:
	struct FTuple_Lcomponent_Mlogic_R            __verse_0xB2CDDD72_Argument;                       // 0x0(0x9)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_6864[0x7];                                     // Fixing Size Of Struct
};

// 0x10 (0x10 - 0x0)
// Function VerseFortniteInternal.Game_VerseFortniteHacks._L_2fFortnite_2ecom_2fGame_2fVerseFortniteHacks_N_RrespawnPlayer_L_Nplayer__component_M_Nplayer__start__component_R
struct UGame_VerseFortniteHacks__L_2fFortnite_2ecom_2fGame_2fVerseFortniteHacks_N_RrespawnPlayer_L_Nplayer__component_M_Nplayer__start__component_R_Params
{
public:
	struct FTuple_Lplayer__component_Mplayer__start__component_R __verse_0xB2CDDD72_Argument;                       // 0x0(0x10)(Parm, HasGetValueTypeHash)
};

// 0x20 (0x20 - 0x0)
// Function VerseFortniteInternal.Game_VerseFortniteHacks._L_2fFortnite_2ecom_2fGame_2fVerseFortniteHacks_N_RgetAllComponentsOfType_L_Ncomponent_M_NType_20where_20Type_R
struct UGame_VerseFortniteHacks__L_2fFortnite_2ecom_2fGame_2fVerseFortniteHacks_N_RgetAllComponentsOfType_L_Ncomponent_M_NType_20where_20Type_R_Params
{
public:
	struct FTuple_Lcomponent_Mcomponent_R        __verse_0xB2CDDD72_Argument;                       // 0x0(0x10)(Parm, HasGetValueTypeHash)
	TArray<class UEntityComponent*>              RetVal;                                            // 0x10(0x10)(Parm, OutParm, ReturnParm, ContainsInstancedReference)
};

// 0x10 (0x10 - 0x0)
// Function VerseFortniteInternal.Game_VerseFortniteHacks._L_2fFortnite_2ecom_2fGame_2fVerseFortniteHacks_N_RGetPawnCollisionEntityID_L_Nplayer__component_R
struct UGame_VerseFortniteHacks__L_2fFortnite_2ecom_2fGame_2fVerseFortniteHacks_N_RGetPawnCollisionEntityID_L_Nplayer__component_R_Params
{
public:
	class USimulation_player_component*          __verse_0xB2CDDD72_Argument;                       // 0x0(0x8)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                        RetVal;                                            // 0x8(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x0 (0x0 - 0x0)
// Function VerseFortniteInternal.Game_VerseFortniteHacks.$InitCDO
struct UGame_VerseFortniteHacks__InitCDO_Params
{
public:
};

// 0x8 (0x8 - 0x0)
// Function VerseFortniteInternal.task_Game_fort_playspace_component$__WaitForPlayerEliminated.Update
struct UTask_Game_fort_playspace_component___WaitForPlayerEliminated_Update_Params
{
public:
	int64                                        RetVal;                                            // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}
}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
