#pragma once

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

#include "../SDK.hpp"

namespace SDK
{
namespace Params
{
//---------------------------------------------------------------------------------------------------------------------
// PARAMETERS
//---------------------------------------------------------------------------------------------------------------------

// 0x50 (0x50 - 0x0)
// Function VerseExperimental.VerseExperimental._L_2fVerse_2eorg_2fVerseExperimental_N_Roperator_U_2f_U_L_Ntime__span_M_Nfloat_R
struct UVerseExperimental__L_2fVerse_2eorg_2fVerseExperimental_N_Roperator_U_2f_U_L_Ntime__span_M_Nfloat_R_Params
{
public:
	struct FTuple_Ltime__span_Mfloat_R           __verse_0xB2CDDD72_Argument;                       // 0x0(0x18)(Parm, HasGetValueTypeHash)
	struct FVerseExperimental_time_span          RetVal;                                            // 0x18(0x10)(Parm, OutParm, ReturnParm, NoDestructor)
	FVerseFunctionProperty_                      _Callee_0;                                         // 0x28(0x10)(HasGetValueTypeHash)
	struct FTuple_Ltime__span_Mfloat_R           _ExprResult_1;                                     // 0x38(0x18)(HasGetValueTypeHash)
};

// 0x40 (0x40 - 0x0)
// Function VerseExperimental.VerseExperimental._L_2fVerse_2eorg_2fVerseExperimental_N_Roperator_U_2d_U_L_Ndate__time_M_Ndate__time_R
struct UVerseExperimental__L_2fVerse_2eorg_2fVerseExperimental_N_Roperator_U_2d_U_L_Ndate__time_M_Ndate__time_R_Params
{
public:
	struct FTuple_Ldate__time_Mdate__time_R      __verse_0xB2CDDD72_Argument;                       // 0x0(0x10)(Parm, HasGetValueTypeHash)
	struct FVerseExperimental_time_span          RetVal;                                            // 0x10(0x10)(Parm, OutParm, ReturnParm, NoDestructor)
	FVerseFunctionProperty_                      _Callee_0;                                         // 0x20(0x10)(HasGetValueTypeHash)
	struct FTuple_Ldate__time_Mdate__time_R      _ExprResult_1;                                     // 0x30(0x10)(HasGetValueTypeHash)
};

// 0x48 (0x48 - 0x0)
// Function VerseExperimental.VerseExperimental._L_2fVerse_2eorg_2fVerseExperimental_N_Roperator_U_2d_U_L_Ndate__time_M_Ntime__span_R
struct UVerseExperimental__L_2fVerse_2eorg_2fVerseExperimental_N_Roperator_U_2d_U_L_Ndate__time_M_Ntime__span_R_Params
{
public:
	struct FTuple_Ldate__time_Mtime__span_R      __verse_0xB2CDDD72_Argument;                       // 0x0(0x18)(Parm, HasGetValueTypeHash)
	struct FVerseExperimental_date_time          RetVal;                                            // 0x18(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_0;                                         // 0x20(0x10)(HasGetValueTypeHash)
	struct FTuple_Ldate__time_Mtime__span_R      _ExprResult_1;                                     // 0x30(0x18)(HasGetValueTypeHash)
};

// 0x80 (0x80 - 0x0)
// Function VerseExperimental.VerseExperimental._L_2fVerse_2eorg_2fVerseExperimental_N_Roperator_U_2d_U_L_Ntime__span_R
struct UVerseExperimental__L_2fVerse_2eorg_2fVerseExperimental_N_Roperator_U_2d_U_L_Ntime__span_R_Params
{
public:
	struct FVerseExperimental_time_span          __verse_0xB2CDDD72_Argument;                       // 0x0(0x10)(Parm, NoDestructor)
	struct FVerseExperimental_time_span          RetVal;                                            // 0x10(0x10)(Parm, OutParm, ReturnParm, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_0;                                // 0x20(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_1;                                     // 0x70(0x10)(HasGetValueTypeHash)
};

// 0x60 (0x60 - 0x0)
// Function VerseExperimental.VerseExperimental._L_2fVerse_2eorg_2fVerseExperimental_N_Roperator_U_2d_U_L_Ntime__span_M_Ntime__span_R
struct UVerseExperimental__L_2fVerse_2eorg_2fVerseExperimental_N_Roperator_U_2d_U_L_Ntime__span_M_Ntime__span_R_Params
{
public:
	struct FTuple_Ltime__span_Mtime__span_R      __verse_0xB2CDDD72_Argument;                       // 0x0(0x20)(Parm, HasGetValueTypeHash)
	struct FVerseExperimental_time_span          RetVal;                                            // 0x20(0x10)(Parm, OutParm, ReturnParm, NoDestructor)
	FVerseFunctionProperty_                      _Callee_0;                                         // 0x30(0x10)(HasGetValueTypeHash)
	struct FTuple_Ltime__span_Mtime__span_R      _ExprResult_1;                                     // 0x40(0x20)(HasGetValueTypeHash)
};

// 0x48 (0x48 - 0x0)
// Function VerseExperimental.VerseExperimental._L_2fVerse_2eorg_2fVerseExperimental_N_Roperator_U_2b_U_L_Ndate__time_M_Ntime__span_R
struct UVerseExperimental__L_2fVerse_2eorg_2fVerseExperimental_N_Roperator_U_2b_U_L_Ndate__time_M_Ntime__span_R_Params
{
public:
	struct FTuple_Ldate__time_Mtime__span_R      __verse_0xB2CDDD72_Argument;                       // 0x0(0x18)(Parm, HasGetValueTypeHash)
	struct FVerseExperimental_date_time          RetVal;                                            // 0x18(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_0;                                         // 0x20(0x10)(HasGetValueTypeHash)
	struct FTuple_Ldate__time_Mtime__span_R      _ExprResult_1;                                     // 0x30(0x18)(HasGetValueTypeHash)
};

// 0x60 (0x60 - 0x0)
// Function VerseExperimental.VerseExperimental._L_2fVerse_2eorg_2fVerseExperimental_N_Roperator_U_2b_U_L_Ntime__span_M_Ntime__span_R
struct UVerseExperimental__L_2fVerse_2eorg_2fVerseExperimental_N_Roperator_U_2b_U_L_Ntime__span_M_Ntime__span_R_Params
{
public:
	struct FTuple_Ltime__span_Mtime__span_R      __verse_0xB2CDDD72_Argument;                       // 0x0(0x20)(Parm, HasGetValueTypeHash)
	struct FVerseExperimental_time_span          RetVal;                                            // 0x20(0x10)(Parm, OutParm, ReturnParm, NoDestructor)
	FVerseFunctionProperty_                      _Callee_0;                                         // 0x30(0x10)(HasGetValueTypeHash)
	struct FTuple_Ltime__span_Mtime__span_R      _ExprResult_1;                                     // 0x40(0x20)(HasGetValueTypeHash)
};

// 0x50 (0x50 - 0x0)
// Function VerseExperimental.VerseExperimental._L_2fVerse_2eorg_2fVerseExperimental_N_Roperator_U_2a_U_L_Ntime__span_M_Nfloat_R
struct UVerseExperimental__L_2fVerse_2eorg_2fVerseExperimental_N_Roperator_U_2a_U_L_Ntime__span_M_Nfloat_R_Params
{
public:
	struct FTuple_Ltime__span_Mfloat_R           __verse_0xB2CDDD72_Argument;                       // 0x0(0x18)(Parm, HasGetValueTypeHash)
	struct FVerseExperimental_time_span          RetVal;                                            // 0x18(0x10)(Parm, OutParm, ReturnParm, NoDestructor)
	FVerseFunctionProperty_                      _Callee_0;                                         // 0x28(0x10)(HasGetValueTypeHash)
	struct FTuple_Ltime__span_Mfloat_R           _ExprResult_1;                                     // 0x38(0x18)(HasGetValueTypeHash)
};

// 0x50 (0x50 - 0x0)
// Function VerseExperimental.VerseExperimental._L_2fVerse_2eorg_2fVerseExperimental_N_Roperator_U_2a_U_L_Nfloat_M_Ntime__span_R
struct UVerseExperimental__L_2fVerse_2eorg_2fVerseExperimental_N_Roperator_U_2a_U_L_Nfloat_M_Ntime__span_R_Params
{
public:
	struct FTuple_Lfloat_Mtime__span_R           __verse_0xB2CDDD72_Argument;                       // 0x0(0x18)(Parm, HasGetValueTypeHash)
	struct FVerseExperimental_time_span          RetVal;                                            // 0x18(0x10)(Parm, OutParm, ReturnParm, NoDestructor)
	FVerseFunctionProperty_                      _Callee_0;                                         // 0x28(0x10)(HasGetValueTypeHash)
	struct FTuple_Ltime__span_Mfloat_R           _ExprResult_1;                                     // 0x38(0x18)(HasGetValueTypeHash)
};

// 0x39 (0x39 - 0x0)
// Function VerseExperimental.VerseExperimental._L_2fVerse_2eorg_2fVerseExperimental_N_RValidateDateTime_L_Nint_M_Nint_M_Nint_M_Nint_M_Nint_M_Nint_M_Nint_R
struct UVerseExperimental__L_2fVerse_2eorg_2fVerseExperimental_N_RValidateDateTime_L_Nint_M_Nint_M_Nint_M_Nint_M_Nint_M_Nint_M_Nint_R_Params
{
public:
	struct FTuple_Lint_Mint_Mint_Mint_Mint_Mint_Mint_R __verse_0xB2CDDD72_Argument;                       // 0x0(0x38)(Parm, HasGetValueTypeHash)
	uint8                                        RetVal : 1;                                        // Mask: 0x1, PropSize: 0x10x38(0x1)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash)
};

// 0xA9 (0xA9 - 0x0)
// Function VerseExperimental.VerseExperimental._L_2fVerse_2eorg_2fVerseExperimental_N_RValidate_L_Ndate__time_R
struct UVerseExperimental__L_2fVerse_2eorg_2fVerseExperimental_N_RValidate_L_Ndate__time_R_Params
{
public:
	struct FVerseExperimental_date_time          __verse_0xB2CDDD72_Argument;                       // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	FOptionProperty_                             RetVal;                                            // 0x8(0x2)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        _ExprResult_0 : 1;                                 // Mask: 0x1, PropSize: 0x10xA(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_84 : 7;                                     // Fixing Bit-Field Size
	uint8                                        Pad_F72[0x5];                                      // Fixing Size After Last Property
	FOptionProperty_                             _ExprResultStack_1;                                // 0x10(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_2;                                         // 0x20(0x10)(HasGetValueTypeHash)
	struct FTuple_Ldate__time_Mdate__time_R      _ExprResult_3;                                     // 0x30(0x10)(HasGetValueTypeHash)
	struct FVerseExperimental_date_time          _ExprResultStack_4;                                // 0x40(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_5;                                         // 0x48(0x10)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_6;                                     // 0x58(0x1)(HasGetValueTypeHash)
	uint8                                        Pad_F78[0x7];                                      // Fixing Size After Last Property
	FOptionProperty_                             _ExprResultStack_7;                                // 0x60(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_8;                                         // 0x70(0x10)(HasGetValueTypeHash)
	struct FTuple_Ldate__time_Mdate__time_R      _ExprResult_9;                                     // 0x80(0x10)(HasGetValueTypeHash)
	struct FVerseExperimental_date_time          _ExprResultStack_10;                               // 0x90(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_11;                                        // 0x98(0x10)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_12;                                    // 0xA8(0x1)(HasGetValueTypeHash)
};

// 0x10 (0x10 - 0x0)
// Function VerseExperimental.VerseExperimental._L_2fVerse_2eorg_2fVerseExperimental_N_RUtcNow
struct UVerseExperimental__L_2fVerse_2eorg_2fVerseExperimental_N_RUtcNow_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_F7D[0x7];                                      // Fixing Size After Last Property
	struct FVerseExperimental_date_time          RetVal;                                            // 0x8(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// 0x20 (0x20 - 0x0)
// Function VerseExperimental.VerseExperimental._L_2fVerse_2eorg_2fVerseExperimental_N_RToString_L_Ntime__span_R
struct UVerseExperimental__L_2fVerse_2eorg_2fVerseExperimental_N_RToString_L_Ntime__span_R_Params
{
public:
	struct FVerseExperimental_time_span          __verse_0xB2CDDD72_Argument;                       // 0x0(0x10)(Parm, NoDestructor)
	FVerseStringProperty_                        RetVal;                                            // 0x10(0x10)(Parm, OutParm, ReturnParm, HasGetValueTypeHash)
};

// 0x18 (0x18 - 0x0)
// Function VerseExperimental.VerseExperimental._L_2fVerse_2eorg_2fVerseExperimental_N_RToString_L_Ndate__time_R
struct UVerseExperimental__L_2fVerse_2eorg_2fVerseExperimental_N_RToString_L_Ndate__time_R_Params
{
public:
	struct FVerseExperimental_date_time          __verse_0xB2CDDD72_Argument;                       // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseStringProperty_                        RetVal;                                            // 0x8(0x10)(Parm, OutParm, ReturnParm, HasGetValueTypeHash)
};

// 0x30 (0x30 - 0x0)
// Function VerseExperimental.VerseExperimental._L_2fVerse_2eorg_2fVerseExperimental_N_RPerformNativeSubtract_L_Ntime__span_M_Ntime__span_R
struct UVerseExperimental__L_2fVerse_2eorg_2fVerseExperimental_N_RPerformNativeSubtract_L_Ntime__span_M_Ntime__span_R_Params
{
public:
	struct FTuple_Ltime__span_Mtime__span_R      __verse_0xB2CDDD72_Argument;                       // 0x0(0x20)(Parm, HasGetValueTypeHash)
	struct FVerseExperimental_time_span          RetVal;                                            // 0x20(0x10)(Parm, OutParm, ReturnParm, NoDestructor)
};

// 0x20 (0x20 - 0x0)
// Function VerseExperimental.VerseExperimental._L_2fVerse_2eorg_2fVerseExperimental_N_RPerformNativeSubtract_L_Ndate__time_M_Ndate__time_R
struct UVerseExperimental__L_2fVerse_2eorg_2fVerseExperimental_N_RPerformNativeSubtract_L_Ndate__time_M_Ndate__time_R_Params
{
public:
	struct FTuple_Ldate__time_Mdate__time_R      __verse_0xB2CDDD72_Argument;                       // 0x0(0x10)(Parm, HasGetValueTypeHash)
	struct FVerseExperimental_time_span          RetVal;                                            // 0x10(0x10)(Parm, OutParm, ReturnParm, NoDestructor)
};

// 0x20 (0x20 - 0x0)
// Function VerseExperimental.VerseExperimental._L_2fVerse_2eorg_2fVerseExperimental_N_RPerformNativeSubtract_L_Ndate__time_M_Ntime__span_R
struct UVerseExperimental__L_2fVerse_2eorg_2fVerseExperimental_N_RPerformNativeSubtract_L_Ndate__time_M_Ntime__span_R_Params
{
public:
	struct FTuple_Ldate__time_Mtime__span_R      __verse_0xB2CDDD72_Argument;                       // 0x0(0x18)(Parm, HasGetValueTypeHash)
	struct FVerseExperimental_date_time          RetVal;                                            // 0x18(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// 0x20 (0x20 - 0x0)
// Function VerseExperimental.VerseExperimental._L_2fVerse_2eorg_2fVerseExperimental_N_RPerformNativeNegate_L_Ntime__span_R
struct UVerseExperimental__L_2fVerse_2eorg_2fVerseExperimental_N_RPerformNativeNegate_L_Ntime__span_R_Params
{
public:
	struct FVerseExperimental_time_span          __verse_0xB2CDDD72_Argument;                       // 0x0(0x10)(Parm, NoDestructor)
	struct FVerseExperimental_time_span          RetVal;                                            // 0x10(0x10)(Parm, OutParm, ReturnParm, NoDestructor)
};

// 0x28 (0x28 - 0x0)
// Function VerseExperimental.VerseExperimental._L_2fVerse_2eorg_2fVerseExperimental_N_RPerformNativeMultiply_L_Ntime__span_M_Nfloat_R
struct UVerseExperimental__L_2fVerse_2eorg_2fVerseExperimental_N_RPerformNativeMultiply_L_Ntime__span_M_Nfloat_R_Params
{
public:
	struct FTuple_Ltime__span_Mfloat_R           __verse_0xB2CDDD72_Argument;                       // 0x0(0x18)(Parm, HasGetValueTypeHash)
	struct FVerseExperimental_time_span          RetVal;                                            // 0x18(0x10)(Parm, OutParm, ReturnParm, NoDestructor)
};

// 0x28 (0x28 - 0x0)
// Function VerseExperimental.VerseExperimental._L_2fVerse_2eorg_2fVerseExperimental_N_RPerformNativeDivide_L_Ntime__span_M_Nfloat_R
struct UVerseExperimental__L_2fVerse_2eorg_2fVerseExperimental_N_RPerformNativeDivide_L_Ntime__span_M_Nfloat_R_Params
{
public:
	struct FTuple_Ltime__span_Mfloat_R           __verse_0xB2CDDD72_Argument;                       // 0x0(0x18)(Parm, HasGetValueTypeHash)
	struct FVerseExperimental_time_span          RetVal;                                            // 0x18(0x10)(Parm, OutParm, ReturnParm, NoDestructor)
};

// 0x30 (0x30 - 0x0)
// Function VerseExperimental.VerseExperimental._L_2fVerse_2eorg_2fVerseExperimental_N_RPerformNativeAdd_L_Ntime__span_M_Ntime__span_R
struct UVerseExperimental__L_2fVerse_2eorg_2fVerseExperimental_N_RPerformNativeAdd_L_Ntime__span_M_Ntime__span_R_Params
{
public:
	struct FTuple_Ltime__span_Mtime__span_R      __verse_0xB2CDDD72_Argument;                       // 0x0(0x20)(Parm, HasGetValueTypeHash)
	struct FVerseExperimental_time_span          RetVal;                                            // 0x20(0x10)(Parm, OutParm, ReturnParm, NoDestructor)
};

// 0x20 (0x20 - 0x0)
// Function VerseExperimental.VerseExperimental._L_2fVerse_2eorg_2fVerseExperimental_N_RPerformNativeAdd_L_Ndate__time_M_Ntime__span_R
struct UVerseExperimental__L_2fVerse_2eorg_2fVerseExperimental_N_RPerformNativeAdd_L_Ndate__time_M_Ntime__span_R_Params
{
public:
	struct FTuple_Ldate__time_Mtime__span_R      __verse_0xB2CDDD72_Argument;                       // 0x0(0x18)(Parm, HasGetValueTypeHash)
	struct FVerseExperimental_date_time          RetVal;                                            // 0x18(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// 0x98 (0x98 - 0x0)
// Function VerseExperimental.VerseExperimental._L_2fVerse_2eorg_2fVerseExperimental_N_RLessEqual_L_Ndate__time_M_Ndate__time_R
struct UVerseExperimental__L_2fVerse_2eorg_2fVerseExperimental_N_RLessEqual_L_Ndate__time_M_Ndate__time_R_Params
{
public:
	struct FTuple_Ldate__time_Mdate__time_R      __verse_0xB2CDDD72_Argument;                       // 0x0(0x10)(Parm, HasGetValueTypeHash)
	FOptionProperty_                             RetVal;                                            // 0x10(0x10)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	struct FVerseExperimental_date_time          _ExprResult_0;                                     // 0x20(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_1;                                // 0x28(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_2;                                     // 0x78(0x10)(HasGetValueTypeHash)
	FOptionProperty_                             _ExprResultStack_3;                                // 0x88(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0xB8 (0xB8 - 0x0)
// Function VerseExperimental.VerseExperimental._L_2fVerse_2eorg_2fVerseExperimental_N_RLessEqual_L_Ntime__span_M_Ntime__span_R
struct UVerseExperimental__L_2fVerse_2eorg_2fVerseExperimental_N_RLessEqual_L_Ntime__span_M_Ntime__span_R_Params
{
public:
	struct FTuple_Ltime__span_Mtime__span_R      __verse_0xB2CDDD72_Argument;                       // 0x0(0x20)(Parm, HasGetValueTypeHash)
	FOptionProperty_                             RetVal;                                            // 0x20(0x18)(Parm, OutParm, ReturnParm, NoDestructor)
	struct FVerseExperimental_time_span          _ExprResult_0;                                     // 0x38(0x10)(NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_1;                                // 0x48(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_2;                                     // 0x98(0x10)(HasGetValueTypeHash)
	FOptionProperty_                             _ExprResultStack_3;                                // 0xA8(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x98 (0x98 - 0x0)
// Function VerseExperimental.VerseExperimental._L_2fVerse_2eorg_2fVerseExperimental_N_RLess_L_Ndate__time_M_Ndate__time_R
struct UVerseExperimental__L_2fVerse_2eorg_2fVerseExperimental_N_RLess_L_Ndate__time_M_Ndate__time_R_Params
{
public:
	struct FTuple_Ldate__time_Mdate__time_R      __verse_0xB2CDDD72_Argument;                       // 0x0(0x10)(Parm, HasGetValueTypeHash)
	FOptionProperty_                             RetVal;                                            // 0x10(0x10)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	struct FVerseExperimental_date_time          _ExprResult_0;                                     // 0x20(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_1;                                // 0x28(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_2;                                     // 0x78(0x10)(HasGetValueTypeHash)
	FOptionProperty_                             _ExprResultStack_3;                                // 0x88(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0xB8 (0xB8 - 0x0)
// Function VerseExperimental.VerseExperimental._L_2fVerse_2eorg_2fVerseExperimental_N_RLess_L_Ntime__span_M_Ntime__span_R
struct UVerseExperimental__L_2fVerse_2eorg_2fVerseExperimental_N_RLess_L_Ntime__span_M_Ntime__span_R_Params
{
public:
	struct FTuple_Ltime__span_Mtime__span_R      __verse_0xB2CDDD72_Argument;                       // 0x0(0x20)(Parm, HasGetValueTypeHash)
	FOptionProperty_                             RetVal;                                            // 0x20(0x18)(Parm, OutParm, ReturnParm, NoDestructor)
	struct FVerseExperimental_time_span          _ExprResult_0;                                     // 0x38(0x10)(NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_1;                                // 0x48(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_2;                                     // 0x98(0x10)(HasGetValueTypeHash)
	FOptionProperty_                             _ExprResultStack_3;                                // 0xA8(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x98 (0x98 - 0x0)
// Function VerseExperimental.VerseExperimental._L_2fVerse_2eorg_2fVerseExperimental_N_RGreaterEqual_L_Ndate__time_M_Ndate__time_R
struct UVerseExperimental__L_2fVerse_2eorg_2fVerseExperimental_N_RGreaterEqual_L_Ndate__time_M_Ndate__time_R_Params
{
public:
	struct FTuple_Ldate__time_Mdate__time_R      __verse_0xB2CDDD72_Argument;                       // 0x0(0x10)(Parm, HasGetValueTypeHash)
	FOptionProperty_                             RetVal;                                            // 0x10(0x10)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	struct FVerseExperimental_date_time          _ExprResult_0;                                     // 0x20(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_1;                                // 0x28(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_2;                                     // 0x78(0x10)(HasGetValueTypeHash)
	FOptionProperty_                             _ExprResultStack_3;                                // 0x88(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0xB8 (0xB8 - 0x0)
// Function VerseExperimental.VerseExperimental._L_2fVerse_2eorg_2fVerseExperimental_N_RGreaterEqual_L_Ntime__span_M_Ntime__span_R
struct UVerseExperimental__L_2fVerse_2eorg_2fVerseExperimental_N_RGreaterEqual_L_Ntime__span_M_Ntime__span_R_Params
{
public:
	struct FTuple_Ltime__span_Mtime__span_R      __verse_0xB2CDDD72_Argument;                       // 0x0(0x20)(Parm, HasGetValueTypeHash)
	FOptionProperty_                             RetVal;                                            // 0x20(0x18)(Parm, OutParm, ReturnParm, NoDestructor)
	struct FVerseExperimental_time_span          _ExprResult_0;                                     // 0x38(0x10)(NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_1;                                // 0x48(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_2;                                     // 0x98(0x10)(HasGetValueTypeHash)
	FOptionProperty_                             _ExprResultStack_3;                                // 0xA8(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0xB8 (0xB8 - 0x0)
// Function VerseExperimental.VerseExperimental._L_2fVerse_2eorg_2fVerseExperimental_N_RGreater_L_Ntime__span_M_Ntime__span_R
struct UVerseExperimental__L_2fVerse_2eorg_2fVerseExperimental_N_RGreater_L_Ntime__span_M_Ntime__span_R_Params
{
public:
	struct FTuple_Ltime__span_Mtime__span_R      __verse_0xB2CDDD72_Argument;                       // 0x0(0x20)(Parm, HasGetValueTypeHash)
	FOptionProperty_                             RetVal;                                            // 0x20(0x18)(Parm, OutParm, ReturnParm, NoDestructor)
	struct FVerseExperimental_time_span          _ExprResult_0;                                     // 0x38(0x10)(NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_1;                                // 0x48(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_2;                                     // 0x98(0x10)(HasGetValueTypeHash)
	FOptionProperty_                             _ExprResultStack_3;                                // 0xA8(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x98 (0x98 - 0x0)
// Function VerseExperimental.VerseExperimental._L_2fVerse_2eorg_2fVerseExperimental_N_RGreater_L_Ndate__time_M_Ndate__time_R
struct UVerseExperimental__L_2fVerse_2eorg_2fVerseExperimental_N_RGreater_L_Ndate__time_M_Ndate__time_R_Params
{
public:
	struct FTuple_Ldate__time_Mdate__time_R      __verse_0xB2CDDD72_Argument;                       // 0x0(0x10)(Parm, HasGetValueTypeHash)
	FOptionProperty_                             RetVal;                                            // 0x10(0x10)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	struct FVerseExperimental_date_time          _ExprResult_0;                                     // 0x20(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_1;                                // 0x28(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_2;                                     // 0x78(0x10)(HasGetValueTypeHash)
	FOptionProperty_                             _ExprResultStack_3;                                // 0x88(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x10 (0x10 - 0x0)
// Function VerseExperimental.VerseExperimental._L_2fVerse_2eorg_2fVerseExperimental_N_RGetYear_L_Ndate__time_R
struct UVerseExperimental__L_2fVerse_2eorg_2fVerseExperimental_N_RGetYear_L_Ndate__time_R_Params
{
public:
	struct FVerseExperimental_date_time          __verse_0xB2CDDD72_Argument;                       // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	int64                                        RetVal;                                            // 0x8(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x18 (0x18 - 0x0)
// Function VerseExperimental.VerseExperimental._L_2fVerse_2eorg_2fVerseExperimental_N_RGetTotalSeconds_L_Ntime__span_R
struct UVerseExperimental__L_2fVerse_2eorg_2fVerseExperimental_N_RGetTotalSeconds_L_Ntime__span_R_Params
{
public:
	struct FVerseExperimental_time_span          __verse_0xB2CDDD72_Argument;                       // 0x0(0x10)(Parm, NoDestructor)
	int64                                        RetVal;                                            // 0x10(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x18 (0x18 - 0x0)
// Function VerseExperimental.VerseExperimental._L_2fVerse_2eorg_2fVerseExperimental_N_RGetTotalMinutes_L_Ntime__span_R
struct UVerseExperimental__L_2fVerse_2eorg_2fVerseExperimental_N_RGetTotalMinutes_L_Ntime__span_R_Params
{
public:
	struct FVerseExperimental_time_span          __verse_0xB2CDDD72_Argument;                       // 0x0(0x10)(Parm, NoDestructor)
	int64                                        RetVal;                                            // 0x10(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x18 (0x18 - 0x0)
// Function VerseExperimental.VerseExperimental._L_2fVerse_2eorg_2fVerseExperimental_N_RGetTotalMilliseconds_L_Ntime__span_R
struct UVerseExperimental__L_2fVerse_2eorg_2fVerseExperimental_N_RGetTotalMilliseconds_L_Ntime__span_R_Params
{
public:
	struct FVerseExperimental_time_span          __verse_0xB2CDDD72_Argument;                       // 0x0(0x10)(Parm, NoDestructor)
	int64                                        RetVal;                                            // 0x10(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x18 (0x18 - 0x0)
// Function VerseExperimental.VerseExperimental._L_2fVerse_2eorg_2fVerseExperimental_N_RGetTotalMicroseconds_L_Ntime__span_R
struct UVerseExperimental__L_2fVerse_2eorg_2fVerseExperimental_N_RGetTotalMicroseconds_L_Ntime__span_R_Params
{
public:
	struct FVerseExperimental_time_span          __verse_0xB2CDDD72_Argument;                       // 0x0(0x10)(Parm, NoDestructor)
	int64                                        RetVal;                                            // 0x10(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x18 (0x18 - 0x0)
// Function VerseExperimental.VerseExperimental._L_2fVerse_2eorg_2fVerseExperimental_N_RGetTotalHours_L_Ntime__span_R
struct UVerseExperimental__L_2fVerse_2eorg_2fVerseExperimental_N_RGetTotalHours_L_Ntime__span_R_Params
{
public:
	struct FVerseExperimental_time_span          __verse_0xB2CDDD72_Argument;                       // 0x0(0x10)(Parm, NoDestructor)
	int64                                        RetVal;                                            // 0x10(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x18 (0x18 - 0x0)
// Function VerseExperimental.VerseExperimental._L_2fVerse_2eorg_2fVerseExperimental_N_RGetTotalDays_L_Ntime__span_R
struct UVerseExperimental__L_2fVerse_2eorg_2fVerseExperimental_N_RGetTotalDays_L_Ntime__span_R_Params
{
public:
	struct FVerseExperimental_time_span          __verse_0xB2CDDD72_Argument;                       // 0x0(0x10)(Parm, NoDestructor)
	int64                                        RetVal;                                            // 0x10(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x38 (0x38 - 0x0)
// Function VerseExperimental.VerseExperimental._L_2fVerse_2eorg_2fVerseExperimental_N_RGetTimeOfDay_L_Ndate__time_R
struct UVerseExperimental__L_2fVerse_2eorg_2fVerseExperimental_N_RGetTimeOfDay_L_Ndate__time_R_Params
{
public:
	struct FVerseExperimental_date_time          __verse_0xB2CDDD72_Argument;                       // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVerseExperimental_time_of_day_parts  RetVal;                                            // 0x8(0x30)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// 0x18 (0x18 - 0x0)
// Function VerseExperimental.VerseExperimental._L_2fVerse_2eorg_2fVerseExperimental_N_RGetSeconds_L_Ntime__span_R
struct UVerseExperimental__L_2fVerse_2eorg_2fVerseExperimental_N_RGetSeconds_L_Ntime__span_R_Params
{
public:
	struct FVerseExperimental_time_span          __verse_0xB2CDDD72_Argument;                       // 0x0(0x10)(Parm, NoDestructor)
	int64                                        RetVal;                                            // 0x10(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x10 (0x10 - 0x0)
// Function VerseExperimental.VerseExperimental._L_2fVerse_2eorg_2fVerseExperimental_N_RGetSeconds_L_Ndate__time_R
struct UVerseExperimental__L_2fVerse_2eorg_2fVerseExperimental_N_RGetSeconds_L_Ndate__time_R_Params
{
public:
	struct FVerseExperimental_date_time          __verse_0xB2CDDD72_Argument;                       // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	int64                                        RetVal;                                            // 0x8(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x10 (0x10 - 0x0)
// Function VerseExperimental.VerseExperimental._L_2fVerse_2eorg_2fVerseExperimental_N_RGetNanoseconds_L_Ndate__time_R
struct UVerseExperimental__L_2fVerse_2eorg_2fVerseExperimental_N_RGetNanoseconds_L_Ndate__time_R_Params
{
public:
	struct FVerseExperimental_date_time          __verse_0xB2CDDD72_Argument;                       // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	int64                                        RetVal;                                            // 0x8(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x18 (0x18 - 0x0)
// Function VerseExperimental.VerseExperimental._L_2fVerse_2eorg_2fVerseExperimental_N_RGetNanoseconds_L_Ntime__span_R
struct UVerseExperimental__L_2fVerse_2eorg_2fVerseExperimental_N_RGetNanoseconds_L_Ntime__span_R_Params
{
public:
	struct FVerseExperimental_time_span          __verse_0xB2CDDD72_Argument;                       // 0x0(0x10)(Parm, NoDestructor)
	int64                                        RetVal;                                            // 0x10(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x9 (0x9 - 0x0)
// Function VerseExperimental.VerseExperimental._L_2fVerse_2eorg_2fVerseExperimental_N_RGetMonthOfYear_L_Ndate__time_R
struct UVerseExperimental__L_2fVerse_2eorg_2fVerseExperimental_N_RGetMonthOfYear_L_Ndate__time_R_Params
{
public:
	struct FVerseExperimental_date_time          __verse_0xB2CDDD72_Argument;                       // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	enum class EVerseExperimental_month_of_year  RetVal;                                            // 0x8(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x10 (0x10 - 0x0)
// Function VerseExperimental.VerseExperimental._L_2fVerse_2eorg_2fVerseExperimental_N_RGetMonth_L_Ndate__time_R
struct UVerseExperimental__L_2fVerse_2eorg_2fVerseExperimental_N_RGetMonth_L_Ndate__time_R_Params
{
public:
	struct FVerseExperimental_date_time          __verse_0xB2CDDD72_Argument;                       // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	int64                                        RetVal;                                            // 0x8(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x18 (0x18 - 0x0)
// Function VerseExperimental.VerseExperimental._L_2fVerse_2eorg_2fVerseExperimental_N_RGetMinutes_L_Ntime__span_R
struct UVerseExperimental__L_2fVerse_2eorg_2fVerseExperimental_N_RGetMinutes_L_Ntime__span_R_Params
{
public:
	struct FVerseExperimental_time_span          __verse_0xB2CDDD72_Argument;                       // 0x0(0x10)(Parm, NoDestructor)
	int64                                        RetVal;                                            // 0x10(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x10 (0x10 - 0x0)
// Function VerseExperimental.VerseExperimental._L_2fVerse_2eorg_2fVerseExperimental_N_RGetMinutes_L_Ndate__time_R
struct UVerseExperimental__L_2fVerse_2eorg_2fVerseExperimental_N_RGetMinutes_L_Ndate__time_R_Params
{
public:
	struct FVerseExperimental_date_time          __verse_0xB2CDDD72_Argument;                       // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	int64                                        RetVal;                                            // 0x8(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x18 (0x18 - 0x0)
// Function VerseExperimental.VerseExperimental._L_2fVerse_2eorg_2fVerseExperimental_N_RGetMilliseconds_L_Ntime__span_R
struct UVerseExperimental__L_2fVerse_2eorg_2fVerseExperimental_N_RGetMilliseconds_L_Ntime__span_R_Params
{
public:
	struct FVerseExperimental_time_span          __verse_0xB2CDDD72_Argument;                       // 0x0(0x10)(Parm, NoDestructor)
	int64                                        RetVal;                                            // 0x10(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x10 (0x10 - 0x0)
// Function VerseExperimental.VerseExperimental._L_2fVerse_2eorg_2fVerseExperimental_N_RGetMilliseconds_L_Ndate__time_R
struct UVerseExperimental__L_2fVerse_2eorg_2fVerseExperimental_N_RGetMilliseconds_L_Ndate__time_R_Params
{
public:
	struct FVerseExperimental_date_time          __verse_0xB2CDDD72_Argument;                       // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	int64                                        RetVal;                                            // 0x8(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x18 (0x18 - 0x0)
// Function VerseExperimental.VerseExperimental._L_2fVerse_2eorg_2fVerseExperimental_N_RGetMicroseconds_L_Ntime__span_R
struct UVerseExperimental__L_2fVerse_2eorg_2fVerseExperimental_N_RGetMicroseconds_L_Ntime__span_R_Params
{
public:
	struct FVerseExperimental_time_span          __verse_0xB2CDDD72_Argument;                       // 0x0(0x10)(Parm, NoDestructor)
	int64                                        RetVal;                                            // 0x10(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x10 (0x10 - 0x0)
// Function VerseExperimental.VerseExperimental._L_2fVerse_2eorg_2fVerseExperimental_N_RGetMicroseconds_L_Ndate__time_R
struct UVerseExperimental__L_2fVerse_2eorg_2fVerseExperimental_N_RGetMicroseconds_L_Ndate__time_R_Params
{
public:
	struct FVerseExperimental_date_time          __verse_0xB2CDDD72_Argument;                       // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	int64                                        RetVal;                                            // 0x8(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x18 (0x18 - 0x0)
// Function VerseExperimental.VerseExperimental._L_2fVerse_2eorg_2fVerseExperimental_N_RGetHours_L_Ntime__span_R
struct UVerseExperimental__L_2fVerse_2eorg_2fVerseExperimental_N_RGetHours_L_Ntime__span_R_Params
{
public:
	struct FVerseExperimental_time_span          __verse_0xB2CDDD72_Argument;                       // 0x0(0x10)(Parm, NoDestructor)
	int64                                        RetVal;                                            // 0x10(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x10 (0x10 - 0x0)
// Function VerseExperimental.VerseExperimental._L_2fVerse_2eorg_2fVerseExperimental_N_RGetHours_L_Ndate__time_R
struct UVerseExperimental__L_2fVerse_2eorg_2fVerseExperimental_N_RGetHours_L_Ndate__time_R_Params
{
public:
	struct FVerseExperimental_date_time          __verse_0xB2CDDD72_Argument;                       // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	int64                                        RetVal;                                            // 0x8(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x18 (0x18 - 0x0)
// Function VerseExperimental.VerseExperimental._L_2fVerse_2eorg_2fVerseExperimental_N_RGetDays_L_Ntime__span_R
struct UVerseExperimental__L_2fVerse_2eorg_2fVerseExperimental_N_RGetDays_L_Ntime__span_R_Params
{
public:
	struct FVerseExperimental_time_span          __verse_0xB2CDDD72_Argument;                       // 0x0(0x10)(Parm, NoDestructor)
	int64                                        RetVal;                                            // 0x10(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x9 (0x9 - 0x0)
// Function VerseExperimental.VerseExperimental._L_2fVerse_2eorg_2fVerseExperimental_N_RGetDayOfWeek_L_Ndate__time_R
struct UVerseExperimental__L_2fVerse_2eorg_2fVerseExperimental_N_RGetDayOfWeek_L_Ndate__time_R_Params
{
public:
	struct FVerseExperimental_date_time          __verse_0xB2CDDD72_Argument;                       // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	enum class EVerseExperimental_day_of_week    RetVal;                                            // 0x8(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x10 (0x10 - 0x0)
// Function VerseExperimental.VerseExperimental._L_2fVerse_2eorg_2fVerseExperimental_N_RGetDay_L_Ndate__time_R
struct UVerseExperimental__L_2fVerse_2eorg_2fVerseExperimental_N_RGetDay_L_Ndate__time_R_Params
{
public:
	struct FVerseExperimental_date_time          __verse_0xB2CDDD72_Argument;                       // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	int64                                        RetVal;                                            // 0x8(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x20 (0x20 - 0x0)
// Function VerseExperimental.VerseExperimental._L_2fVerse_2eorg_2fVerseExperimental_N_RGetDate_L_Ndate__time_R
struct UVerseExperimental__L_2fVerse_2eorg_2fVerseExperimental_N_RGetDate_L_Ndate__time_R_Params
{
public:
	struct FVerseExperimental_date_time          __verse_0xB2CDDD72_Argument;                       // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVerseExperimental_date_parts         RetVal;                                            // 0x8(0x18)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// 0x10 (0x10 - 0x0)
// Function VerseExperimental.VerseExperimental._L_2fVerse_2eorg_2fVerseExperimental_N_RDaysInYear_L_Nint_R
struct UVerseExperimental__L_2fVerse_2eorg_2fVerseExperimental_N_RDaysInYear_L_Nint_R_Params
{
public:
	int64                                        __verse_0xB2CDDD72_Argument;                       // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        RetVal;                                            // 0x8(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x18 (0x18 - 0x0)
// Function VerseExperimental.VerseExperimental._L_2fVerse_2eorg_2fVerseExperimental_N_RDaysInMonth_L_Nint_M_Nint_R
struct UVerseExperimental__L_2fVerse_2eorg_2fVerseExperimental_N_RDaysInMonth_L_Nint_M_Nint_R_Params
{
public:
	struct FTuple_Lint_Mint_R                    __verse_0xB2CDDD72_Argument;                       // 0x0(0x10)(Parm, HasGetValueTypeHash)
	int64                                        RetVal;                                            // 0x10(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x70 (0x70 - 0x0)
// Function VerseExperimental.VerseExperimental._L_2fVerse_2eorg_2fVerseExperimental_N_RDateTimeMin
struct UVerseExperimental__L_2fVerse_2eorg_2fVerseExperimental_N_RDateTimeMin_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_1027[0x7];                                     // Fixing Size After Last Property
	struct FVerseExperimental_date_time          RetVal;                                            // 0x8(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_0;                                // 0x10(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_1;                                     // 0x60(0x10)(HasGetValueTypeHash)
};

// 0x70 (0x70 - 0x0)
// Function VerseExperimental.VerseExperimental._L_2fVerse_2eorg_2fVerseExperimental_N_RDateTimeMax
struct UVerseExperimental__L_2fVerse_2eorg_2fVerseExperimental_N_RDateTimeMax_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_102A[0x7];                                     // Fixing Size After Last Property
	struct FVerseExperimental_date_time          RetVal;                                            // 0x8(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_0;                                // 0x10(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_1;                                     // 0x60(0x10)(HasGetValueTypeHash)
};

// 0x38 (0x38 - 0x0)
// Function VerseExperimental.VerseExperimental._L_2fVerse_2eorg_2fVerseExperimental_N_RCreateTimeSpan_L_Nint_M_Nint_M_Nint_M_Nint_M_Nint_R
struct UVerseExperimental__L_2fVerse_2eorg_2fVerseExperimental_N_RCreateTimeSpan_L_Nint_M_Nint_M_Nint_M_Nint_M_Nint_R_Params
{
public:
	struct FTuple_Lint_Mint_Mint_Mint_Mint_R     __verse_0xB2CDDD72_Argument;                       // 0x0(0x28)(Parm, HasGetValueTypeHash)
	struct FVerseExperimental_time_span          RetVal;                                            // 0x28(0x10)(Parm, OutParm, ReturnParm, NoDestructor)
};

// 0x48 (0x48 - 0x0)
// Function VerseExperimental.VerseExperimental._L_2fVerse_2eorg_2fVerseExperimental_N_RCreateDateTime_L_Nint_M_Nint_M_Nint_M_Nint_M_Nint_M_Nint_M_Nint_R
struct UVerseExperimental__L_2fVerse_2eorg_2fVerseExperimental_N_RCreateDateTime_L_Nint_M_Nint_M_Nint_M_Nint_M_Nint_M_Nint_M_Nint_R_Params
{
public:
	struct FTuple_Lint_Mint_Mint_Mint_Mint_Mint_Mint_R __verse_0xB2CDDD72_Argument;                       // 0x0(0x38)(Parm, HasGetValueTypeHash)
	FOptionProperty_                             RetVal;                                            // 0x38(0x10)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// 0x72 (0x72 - 0x0)
// Function VerseExperimental.VerseExperimental.VerseExperimental_time_span$OverrideFactory
struct UVerseExperimental_VerseExperimental_time_span_OverrideFactory_Params
{
public:
	struct FVerseExperimental_time_span          RetVal;                                            // 0x0(0x10)(Parm, OutParm, ReturnParm, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           __verse_0xFB48ED96__InitOverrideMap;               // 0x10(0x50)(ConstParm, Parm, ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResultStack_0;                                // 0x60(0x10)(HasGetValueTypeHash)
	FOptionProperty_                             _ExprResult_1;                                     // 0x70(0x2)(NoDestructor, HasGetValueTypeHash)
};

// 0x10 (0x10 - 0x0)
// Function VerseExperimental.VerseExperimental.VerseExperimental_time_span$Factory
struct UVerseExperimental_VerseExperimental_time_span_Factory_Params
{
public:
	struct FVerseExperimental_time_span          RetVal;                                            // 0x0(0x10)(Parm, OutParm, ReturnParm, NoDestructor)
};

// 0x80 (0x80 - 0x0)
// Function VerseExperimental.VerseExperimental.VerseExperimental_time_of_day_parts$OverrideFactory
struct UVerseExperimental_VerseExperimental_time_of_day_parts_OverrideFactory_Params
{
public:
	struct FVerseExperimental_time_of_day_parts  RetVal;                                            // 0x0(0x30)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           __verse_0xFB48ED96__InitOverrideMap;               // 0x30(0x50)(ConstParm, Parm, ContainsInstancedReference)
};

// 0x30 (0x30 - 0x0)
// Function VerseExperimental.VerseExperimental.VerseExperimental_time_of_day_parts$Factory
struct UVerseExperimental_VerseExperimental_time_of_day_parts_Factory_Params
{
public:
	struct FVerseExperimental_time_of_day_parts  RetVal;                                            // 0x0(0x30)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// 0x68 (0x68 - 0x0)
// Function VerseExperimental.VerseExperimental.VerseExperimental_date_parts$OverrideFactory
struct UVerseExperimental_VerseExperimental_date_parts_OverrideFactory_Params
{
public:
	struct FVerseExperimental_date_parts         RetVal;                                            // 0x0(0x18)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           __verse_0xFB48ED96__InitOverrideMap;               // 0x18(0x50)(ConstParm, Parm, ContainsInstancedReference)
};

// 0x18 (0x18 - 0x0)
// Function VerseExperimental.VerseExperimental.VerseExperimental_date_parts$Factory
struct UVerseExperimental_VerseExperimental_date_parts_Factory_Params
{
public:
	struct FVerseExperimental_date_parts         RetVal;                                            // 0x0(0x18)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// 0x6A (0x6A - 0x0)
// Function VerseExperimental.VerseExperimental.VerseExperimental_date_time$OverrideFactory
struct UVerseExperimental_VerseExperimental_date_time_OverrideFactory_Params
{
public:
	struct FVerseExperimental_date_time          RetVal;                                            // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           __verse_0xFB48ED96__InitOverrideMap;               // 0x8(0x50)(ConstParm, Parm, ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResultStack_0;                                // 0x58(0x10)(HasGetValueTypeHash)
	FOptionProperty_                             _ExprResult_1;                                     // 0x68(0x2)(NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function VerseExperimental.VerseExperimental.VerseExperimental_date_time$Factory
struct UVerseExperimental_VerseExperimental_date_time_Factory_Params
{
public:
	struct FVerseExperimental_date_time          RetVal;                                            // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// 0x0 (0x0 - 0x0)
// Function VerseExperimental.VerseExperimental.$InitCDO
struct UVerseExperimental__InitCDO_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseExperimental.VerseExperimental_date_time_ticks.$InitCDO
struct UVerseExperimental_date_time_ticks__InitCDO_Params
{
public:
};

}
}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
