#pragma once

// Dumped with Dumper-7!


#include "../SDK.hpp"

namespace SDK
{
namespace Params
{
//---------------------------------------------------------------------------------------------------------------------
// PARAMETERS
//---------------------------------------------------------------------------------------------------------------------

// 0x12 (0x12 - 0x0)
// Function CompanionAI.CompanionAI._L_2fFortnite_2ecom_2fAI_2fCompanionAI_N_Roperator_U_2eIsBeingDBNOCarried_U_L_Nfort__character_M_Ntuple_L_R_M_Ntuple_L_R_R
struct UCompanionAI__L_2fFortnite_2ecom_2fAI_2fCompanionAI_N_Roperator_U_2eIsBeingDBNOCarried_U_L_Nfort__character_M_Ntuple_L_R_M_Ntuple_L_R_R_Params
{
public:
	struct FTuple_Lfort__character_Mtuple_L_R_Mtuple_L_R_R __verse_0xB2CDDD72_Argument;                       // 0x0(0xA)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_5FF9[0x6];                                     // Fixing Size After Last Property 
	FOptionalProperty_                           RetVal;                                            // 0x10(0x2)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x20 (0x20 - 0x0)
// Function CompanionAI.CompanionAI._L_2fFortnite_2ecom_2fAI_2fCompanionAI_N_Roperator_U_2eGetTeamMembers_U_L_Nagent_M_Ntuple_L_R_M_Ntuple_L_R_R
struct UCompanionAI__L_2fFortnite_2ecom_2fAI_2fCompanionAI_N_Roperator_U_2eGetTeamMembers_U_L_Nagent_M_Ntuple_L_R_M_Ntuple_L_R_R_Params
{
public:
	struct FTuple_Lagent_Mtuple_L_R_Mtuple_L_R_R __verse_0xB2CDDD72_Argument;                       // 0x0(0xA)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_5FFA[0x6];                                     // Fixing Size After Last Property 
	TArray<class USimulation_agent*>             RetVal;                                            // 0x10(0x10)(Parm, OutParm, ReturnParm, ContainsInstancedReference)
};

// 0x20 (0x20 - 0x0)
// Function CompanionAI.CompanionAI._L_2fFortnite_2ecom_2fAI_2fCompanionAI_N_Roperator_U_2eGetNPCLeashRadius_U_L_Nfort__character_M_Ntuple_L_R_M_Ntuple_L_R_R
struct UCompanionAI__L_2fFortnite_2ecom_2fAI_2fCompanionAI_N_Roperator_U_2eGetNPCLeashRadius_U_L_Nfort__character_M_Ntuple_L_R_M_Ntuple_L_R_R_Params
{
public:
	struct FTuple_Lfort__character_Mtuple_L_R_Mtuple_L_R_R __verse_0xB2CDDD72_Argument;                       // 0x0(0xA)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_5FFB[0x6];                                     // Fixing Size After Last Property 
	struct FTuple_Lfloat_Mfloat_R                RetVal;                                            // 0x10(0x10)(Parm, OutParm, ReturnParm, HasGetValueTypeHash)
};

// 0x18 (0x18 - 0x0)
// Function CompanionAI.CompanionAI._L_2fFortnite_2ecom_2fAI_2fCompanionAI_N_Roperator_U_2eGetFortPing_U_L_Nfort__character_M_Ntuple_L_R_M_Ntuple_L_R_R
struct UCompanionAI__L_2fFortnite_2ecom_2fAI_2fCompanionAI_N_Roperator_U_2eGetFortPing_U_L_Nfort__character_M_Ntuple_L_R_M_Ntuple_L_R_R_Params
{
public:
	struct FTuple_Lfort__character_Mtuple_L_R_Mtuple_L_R_R __verse_0xB2CDDD72_Argument;                       // 0x0(0xA)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_5FFC[0x6];                                     // Fixing Size After Last Property 
	FOptionalProperty_                           RetVal;                                            // 0x10(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};

// 0x18 (0x18 - 0x0)
// Function CompanionAI.CompanionAI._L_2fFortnite_2ecom_2fAI_2fCompanionAI_N_Roperator_U_2eGetFortBRCreatureActions_U_L_Nfort__character_M_Ntuple_L_R_M_Ntuple_L_R_R
struct UCompanionAI__L_2fFortnite_2ecom_2fAI_2fCompanionAI_N_Roperator_U_2eGetFortBRCreatureActions_U_L_Nfort__character_M_Ntuple_L_R_M_Ntuple_L_R_R_Params
{
public:
	struct FTuple_Lfort__character_Mtuple_L_R_Mtuple_L_R_R __verse_0xB2CDDD72_Argument;                       // 0x0(0xA)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_5FFE[0x6];                                     // Fixing Size After Last Property 
	FOptionalProperty_                           RetVal;                                            // 0x10(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};

// 0x18 (0x18 - 0x0)
// Function CompanionAI.CompanionAI._L_2fFortnite_2ecom_2fAI_2fCompanionAI_N_Roperator_U_2eGetFortBRCharacterActions_U_L_Nfort__character_M_Ntuple_L_R_M_Ntuple_L_R_R
struct UCompanionAI__L_2fFortnite_2ecom_2fAI_2fCompanionAI_N_Roperator_U_2eGetFortBRCharacterActions_U_L_Nfort__character_M_Ntuple_L_R_M_Ntuple_L_R_R_Params
{
public:
	struct FTuple_Lfort__character_Mtuple_L_R_Mtuple_L_R_R __verse_0xB2CDDD72_Argument;                       // 0x0(0xA)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_6001[0x6];                                     // Fixing Size After Last Property 
	FOptionalProperty_                           RetVal;                                            // 0x10(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};

// 0x18 (0x18 - 0x0)
// Function CompanionAI.CompanionAI._L_2fFortnite_2ecom_2fAI_2fCompanionAI_N_Roperator_U_2eGetAgent_U_L_Nentity_M_Ntuple_L_R_M_Ntuple_L_R_R
struct UCompanionAI__L_2fFortnite_2ecom_2fAI_2fCompanionAI_N_Roperator_U_2eGetAgent_U_L_Nentity_M_Ntuple_L_R_M_Ntuple_L_R_R_Params
{
public:
	struct FTuple_Lentity_Mtuple_L_R_Mtuple_L_R_R __verse_0xB2CDDD72_Argument;                       // 0x0(0xA)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_6002[0x6];                                     // Fixing Size After Last Property 
	FOptionalProperty_                           RetVal;                                            // 0x10(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};

// 0x378 (0x378 - 0x0)
// Function CompanionAI.CompanionAI._L_2fFortnite_2ecom_2fAI_2fCompanionAI_N_RToString_L_Nentity__type_R
struct UCompanionAI__L_2fFortnite_2ecom_2fAI_2fCompanionAI_N_RToString_L_Nentity__type_R_Params
{
public:
	enum class ECompanionAI_PingCommand_entity_type __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_6013[0x7];                                     // Fixing Size After Last Property 
	FVerseStringProperty_                        RetVal;                                            // 0x8(0x10)(Parm, OutParm, ReturnParm, HasGetValueTypeHash)
	FVerseDynamicProperty_                       InvokeResultDummy_0;                               // 0x18(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_1;                                // 0x28(0x18)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_2;                                     // 0x40(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_3;                                     // 0x50(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       InvokeResultDummy_4;                               // 0x60(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_5;                                // 0x70(0x18)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_6;                                     // 0x88(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_7;                                     // 0x98(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       InvokeResultDummy_8;                               // 0xA8(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_9;                                // 0xB8(0x18)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_10;                                    // 0xD0(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_11;                                    // 0xE0(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       InvokeResultDummy_12;                              // 0xF0(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_13;                               // 0x100(0x18)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_14;                                    // 0x118(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_15;                                    // 0x128(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       InvokeResultDummy_16;                              // 0x138(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_17;                               // 0x148(0x18)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_18;                                    // 0x160(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_19;                                    // 0x170(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       InvokeResultDummy_20;                              // 0x180(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_21;                               // 0x190(0x18)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_22;                                    // 0x1A8(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_23;                                    // 0x1B8(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       InvokeResultDummy_24;                              // 0x1C8(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_25;                               // 0x1D8(0x18)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_26;                                    // 0x1F0(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_27;                                    // 0x200(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       InvokeResultDummy_28;                              // 0x210(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_29;                               // 0x220(0x18)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_30;                                    // 0x238(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_31;                                    // 0x248(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       InvokeResultDummy_32;                              // 0x258(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_33;                               // 0x268(0x18)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_34;                                    // 0x280(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_35;                                    // 0x290(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       InvokeResultDummy_36;                              // 0x2A0(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_37;                               // 0x2B0(0x18)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_38;                                    // 0x2C8(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_39;                                    // 0x2D8(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       InvokeResultDummy_40;                              // 0x2E8(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_41;                               // 0x2F8(0x18)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_42;                                    // 0x310(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_43;                                    // 0x320(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       InvokeResultDummy_44;                              // 0x330(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_45;                               // 0x340(0x18)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_46;                                    // 0x358(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_47;                                    // 0x368(0x10)(HasGetValueTypeHash)
};

// 0x2E8 (0x2E8 - 0x0)
// Function CompanionAI.CompanionAI._L_2fFortnite_2ecom_2fAI_2fCompanionAI_N_RToString_L_Ncommand__type_R
struct UCompanionAI__L_2fFortnite_2ecom_2fAI_2fCompanionAI_N_RToString_L_Ncommand__type_R_Params
{
public:
	enum class ECompanionAI_PingCommand_command_type __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_602E[0x7];                                     // Fixing Size After Last Property 
	FVerseStringProperty_                        RetVal;                                            // 0x8(0x10)(Parm, OutParm, ReturnParm, HasGetValueTypeHash)
	FVerseDynamicProperty_                       InvokeResultDummy_0;                               // 0x18(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_1;                                // 0x28(0x18)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_2;                                     // 0x40(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_3;                                     // 0x50(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       InvokeResultDummy_4;                               // 0x60(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_5;                                // 0x70(0x18)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_6;                                     // 0x88(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_7;                                     // 0x98(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       InvokeResultDummy_8;                               // 0xA8(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_9;                                // 0xB8(0x18)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_10;                                    // 0xD0(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_11;                                    // 0xE0(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       InvokeResultDummy_12;                              // 0xF0(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_13;                               // 0x100(0x18)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_14;                                    // 0x118(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_15;                                    // 0x128(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       InvokeResultDummy_16;                              // 0x138(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_17;                               // 0x148(0x18)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_18;                                    // 0x160(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_19;                                    // 0x170(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       InvokeResultDummy_20;                              // 0x180(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_21;                               // 0x190(0x18)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_22;                                    // 0x1A8(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_23;                                    // 0x1B8(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       InvokeResultDummy_24;                              // 0x1C8(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_25;                               // 0x1D8(0x18)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_26;                                    // 0x1F0(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_27;                                    // 0x200(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       InvokeResultDummy_28;                              // 0x210(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_29;                               // 0x220(0x18)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_30;                                    // 0x238(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_31;                                    // 0x248(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       InvokeResultDummy_32;                              // 0x258(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_33;                               // 0x268(0x18)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_34;                                    // 0x280(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_35;                                    // 0x290(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       InvokeResultDummy_36;                              // 0x2A0(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_37;                               // 0x2B0(0x18)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_38;                                    // 0x2C8(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_39;                                    // 0x2D8(0x10)(HasGetValueTypeHash)
};

// 0x31 (0x31 - 0x0)
// Function CompanionAI.CompanionAI._L_2fFortnite_2ecom_2fAI_2fCompanionAI_N_RCompare_L_Nfort__obstacle__info_M_Nentity_R
struct UCompanionAI__L_2fFortnite_2ecom_2fAI_2fCompanionAI_N_RCompare_L_Nfort__obstacle__info_M_Nentity_R_Params
{
public:
	struct FTuple_Lfort__obstacle__info_Mentity_R __verse_0xB2CDDD72_Argument;                       // 0x0(0x30)(Parm, HasGetValueTypeHash)
	uint8                                        RetVal : 1;                                        // Mask: 0x1, PropSize: 0x10x30(0x1)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash)
};

// 0x88 (0x88 - 0x0)
// Function CompanionAI.CompanionAI.CompanionAI_ping_info$OverrideFactory
struct UCompanionAI_CompanionAI_ping_info_OverrideFactory_Params
{
public:
	struct FCompanionAI_ping_info                RetVal;                                            // 0x0(0x38)(Parm, OutParm, ReturnParm, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           __verse_0xFB48ED96__InitOverrideMap;               // 0x38(0x50)(ConstParm, Parm, ContainsInstancedReference)
};

// 0x38 (0x38 - 0x0)
// Function CompanionAI.CompanionAI.CompanionAI_ping_info$Factory
struct UCompanionAI_CompanionAI_ping_info_Factory_Params
{
public:
	struct FCompanionAI_ping_info                RetVal;                                            // 0x0(0x38)(Parm, OutParm, ReturnParm, NoDestructor)
};

// 0x0 (0x0 - 0x0)
// Function CompanionAI.CompanionAI.$InitCDO
struct UCompanionAI__InitCDO_Params
{
public:
};

// 0x28 (0x28 - 0x0)
// Function CompanionAI.CompanionAI_companion_ai.OnBegin
struct UCompanionAI_companion_ai_OnBegin_Params
{
public:
	class UConcurrency_task*                     __verse_0xC1E81372_CallingTask;                    // 0x0(0x8)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                        __verse_0xA3A00DDB_CallerResumeState;              // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        __verse_0x2AC0E4D8_CallerCancelState;              // 0x10(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x18(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_6042[0x7];                                     // Fixing Size After Last Property 
	class UConcurrency_task*                     RetVal;                                            // 0x20(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// 0x0 (0x0 - 0x0)
// Function CompanionAI.CompanionAI_companion_ai.$InitInstance
struct UCompanionAI_companion_ai__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function CompanionAI.CompanionAI_companion_ai.$Block
struct UCompanionAI_companion_ai__Block_Params
{
public:
};

// 0x40 (0x40 - 0x0)
// Function CompanionAI.CompanionAI_companion_ai.$InitCDO
struct UCompanionAI_companion_ai__InitCDO_Params
{
public:
	class UDiagnostics_log*                      _ExprResult_0;                                     // 0x0(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                       _InstancingGraph_1;                                // 0x8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDiagnostics_debug_draw*               _ExprResult_2;                                     // 0x10(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                       _InstancingGraph_3;                                // 0x18(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDiagnostics_log*                      _ExprResult_4;                                     // 0x20(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                       _InstancingGraph_5;                                // 0x28(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDiagnostics_debug_draw*               _ExprResult_6;                                     // 0x30(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                       _InstancingGraph_7;                                // 0x38(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x30 (0x30 - 0x0)
// Function CompanionAI.CompanionAI_companion_ai_runtime.WaitForTargetMovementService_L_Nfort__character_M_Nfloat_R
struct UCompanionAI_companion_ai_runtime_WaitForTargetMovementService_L_Nfort__character_M_Nfloat_R_Params
{
public:
	class UConcurrency_task*                     __verse_0xC1E81372_CallingTask;                    // 0x0(0x8)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                        __verse_0xA3A00DDB_CallerResumeState;              // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        __verse_0x2AC0E4D8_CallerCancelState;              // 0x10(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTuple_Lfort__character_Mfloat_R      __verse_0xB2CDDD72_Argument;                       // 0x18(0x10)(Parm, HasGetValueTypeHash)
	class UConcurrency_task*                     RetVal;                                            // 0x28(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// 0x28 (0x28 - 0x0)
// Function CompanionAI.CompanionAI_companion_ai_runtime.WaitForTargetInVehicleService_L_Nfort__character_R
struct UCompanionAI_companion_ai_runtime_WaitForTargetInVehicleService_L_Nfort__character_R_Params
{
public:
	class UConcurrency_task*                     __verse_0xC1E81372_CallingTask;                    // 0x0(0x8)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                        __verse_0xA3A00DDB_CallerResumeState;              // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        __verse_0x2AC0E4D8_CallerCancelState;              // 0x10(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                               __verse_0xB2CDDD72_Argument;                       // 0x18(0x8)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UConcurrency_task*                     RetVal;                                            // 0x20(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// 0x28 (0x28 - 0x0)
// Function CompanionAI.CompanionAI_companion_ai_runtime.WaitForDamageService
struct UCompanionAI_companion_ai_runtime_WaitForDamageService_Params
{
public:
	class UConcurrency_task*                     __verse_0xC1E81372_CallingTask;                    // 0x0(0x8)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                        __verse_0xA3A00DDB_CallerResumeState;              // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        __verse_0x2AC0E4D8_CallerCancelState;              // 0x10(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x18(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_604F[0x7];                                     // Fixing Size After Last Property 
	class UConcurrency_task*                     RetVal;                                            // 0x20(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// 0x28 (0x28 - 0x0)
// Function CompanionAI.CompanionAI_companion_ai_runtime.TacticalSprintService
struct UCompanionAI_companion_ai_runtime_TacticalSprintService_Params
{
public:
	class UConcurrency_task*                     __verse_0xC1E81372_CallingTask;                    // 0x0(0x8)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                        __verse_0xA3A00DDB_CallerResumeState;              // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        __verse_0x2AC0E4D8_CallerCancelState;              // 0x10(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x18(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_6050[0x7];                                     // Fixing Size After Last Property 
	class UConcurrency_task*                     RetVal;                                            // 0x20(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// 0x28 (0x28 - 0x0)
// Function CompanionAI.CompanionAI_companion_ai_runtime.SprintService
struct UCompanionAI_companion_ai_runtime_SprintService_Params
{
public:
	class UConcurrency_task*                     __verse_0xC1E81372_CallingTask;                    // 0x0(0x8)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                        __verse_0xA3A00DDB_CallerResumeState;              // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        __verse_0x2AC0E4D8_CallerCancelState;              // 0x10(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x18(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_6054[0x7];                                     // Fixing Size After Last Property 
	class UConcurrency_task*                     RetVal;                                            // 0x20(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// 0x28 (0x28 - 0x0)
// Function CompanionAI.CompanionAI_companion_ai_runtime.ShootTargetService_L_Nfloat_R
struct UCompanionAI_companion_ai_runtime_ShootTargetService_L_Nfloat_R_Params
{
public:
	class UConcurrency_task*                     __verse_0xC1E81372_CallingTask;                    // 0x0(0x8)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                        __verse_0xA3A00DDB_CallerResumeState;              // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        __verse_0x2AC0E4D8_CallerCancelState;              // 0x10(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       __verse_0xB2CDDD72_Argument;                       // 0x18(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UConcurrency_task*                     RetVal;                                            // 0x20(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// 0x48 (0x48 - 0x0)
// Function CompanionAI.CompanionAI_companion_ai_runtime.SetLeashPosition_L_Nvector3_M_Nfloat_M_Nagent_R
struct UCompanionAI_companion_ai_runtime_SetLeashPosition_L_Nvector3_M_Nfloat_M_Nagent_R_Params
{
public:
	class UConcurrency_task*                     __verse_0xC1E81372_CallingTask;                    // 0x0(0x8)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                        __verse_0xA3A00DDB_CallerResumeState;              // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        __verse_0x2AC0E4D8_CallerCancelState;              // 0x10(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTuple_Lvector3_Mfloat_Magent_R       __verse_0xB2CDDD72_Argument;                       // 0x18(0x28)(Parm, HasGetValueTypeHash)
	class UConcurrency_task*                     RetVal;                                            // 0x40(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// 0x28 (0x28 - 0x0)
// Function CompanionAI.CompanionAI_companion_ai_runtime.ReviveCommand_L_Nagent_R
struct UCompanionAI_companion_ai_runtime_ReviveCommand_L_Nagent_R_Params
{
public:
	class UConcurrency_task*                     __verse_0xC1E81372_CallingTask;                    // 0x0(0x8)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                        __verse_0xA3A00DDB_CallerResumeState;              // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        __verse_0x2AC0E4D8_CallerCancelState;              // 0x10(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USimulation_agent*                     __verse_0xB2CDDD72_Argument;                       // 0x18(0x8)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UConcurrency_task*                     RetVal;                                            // 0x20(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// 0x41 (0x41 - 0x0)
// Function CompanionAI.CompanionAI_companion_ai_runtime._L_2fFortnite_2ecom_2fAI_2fCompanionAI_2fcompanion__ai__runtime_N_ROnUnconverted1_L_Nany_R_Nvoid
struct UCompanionAI_companion_ai_runtime__L_2fFortnite_2ecom_2fAI_2fCompanionAI_2fcompanion__ai__runtime_N_ROnUnconverted1_L_Nany_R_Nvoid_Params
{
public:
	FVerseDynamicProperty_                       __verse_0xB2CDDD72_Argument;                       // 0x0(0x10)(Parm, HasGetValueTypeHash)
	enum class EVerseTrue                        _InvokeSureResultDummy_0;                          // 0x10(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_605F[0x7];                                     // Fixing Size After Last Property 
	FVerseFunctionProperty_                      _Callee_1;                                         // 0x18(0x10)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_2;                                     // 0x28(0x1)(HasGetValueTypeHash)
	enum class EVerseTrue                        _InvokeSureResultDummy_3;                          // 0x29(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_6060[0x6];                                     // Fixing Size After Last Property 
	FVerseFunctionProperty_                      _Callee_4;                                         // 0x30(0x10)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_5;                                     // 0x40(0x1)(HasGetValueTypeHash)
};

// 0x48 (0x48 - 0x0)
// Function CompanionAI.CompanionAI_companion_ai_runtime._L_2fFortnite_2ecom_2fAI_2fCompanionAI_2fcompanion__ai__runtime_N_ROnUnconverted
struct UCompanionAI_companion_ai_runtime__L_2fFortnite_2ecom_2fAI_2fCompanionAI_2fcompanion__ai__runtime_N_ROnUnconverted_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_6064[0x7];                                     // Fixing Size After Last Property 
	class UObject*                               __verse_0x00000000__1;                             // 0x8(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	enum class EVerseTrue                        _InvokeSureResultDummy_0;                          // 0x10(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_6065[0x7];                                     // Fixing Size After Last Property 
	FVerseFunctionProperty_                      _Callee_1;                                         // 0x18(0x10)(HasGetValueTypeHash)
	class UObject*                               __verse_0x00000000__2;                             // 0x28(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	enum class EVerseTrue                        _InvokeSureResultDummy_2;                          // 0x30(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_6066[0x7];                                     // Fixing Size After Last Property 
	FVerseFunctionProperty_                      _Callee_3;                                         // 0x38(0x10)(HasGetValueTypeHash)
};

// 0x41 (0x41 - 0x0)
// Function CompanionAI.CompanionAI_companion_ai_runtime._L_2fFortnite_2ecom_2fAI_2fCompanionAI_2fcompanion__ai__runtime_N_ROnConverted0_L_Nany_R_Nvoid
struct UCompanionAI_companion_ai_runtime__L_2fFortnite_2ecom_2fAI_2fCompanionAI_2fcompanion__ai__runtime_N_ROnConverted0_L_Nany_R_Nvoid_Params
{
public:
	FVerseDynamicProperty_                       __verse_0xB2CDDD72_Argument;                       // 0x0(0x10)(Parm, HasGetValueTypeHash)
	enum class EVerseTrue                        _InvokeSureResultDummy_0;                          // 0x10(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_606A[0x7];                                     // Fixing Size After Last Property 
	FVerseFunctionProperty_                      _Callee_1;                                         // 0x18(0x10)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_2;                                     // 0x28(0x1)(HasGetValueTypeHash)
	enum class EVerseTrue                        _InvokeSureResultDummy_3;                          // 0x29(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_606B[0x6];                                     // Fixing Size After Last Property 
	FVerseFunctionProperty_                      _Callee_4;                                         // 0x30(0x10)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_5;                                     // 0x40(0x1)(HasGetValueTypeHash)
};

// 0x48 (0x48 - 0x0)
// Function CompanionAI.CompanionAI_companion_ai_runtime._L_2fFortnite_2ecom_2fAI_2fCompanionAI_2fcompanion__ai__runtime_N_ROnConverted
struct UCompanionAI_companion_ai_runtime__L_2fFortnite_2ecom_2fAI_2fCompanionAI_2fcompanion__ai__runtime_N_ROnConverted_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_6073[0x7];                                     // Fixing Size After Last Property 
	class UObject*                               __verse_0x00000000__1;                             // 0x8(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	enum class EVerseTrue                        _InvokeSureResultDummy_0;                          // 0x10(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_6076[0x7];                                     // Fixing Size After Last Property 
	FVerseFunctionProperty_                      _Callee_1;                                         // 0x18(0x10)(HasGetValueTypeHash)
	class UObject*                               __verse_0x00000000__2;                             // 0x28(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	enum class EVerseTrue                        _InvokeSureResultDummy_2;                          // 0x30(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_6077[0x7];                                     // Fixing Size After Last Property 
	FVerseFunctionProperty_                      _Callee_3;                                         // 0x38(0x10)(HasGetValueTypeHash)
};

// 0x28 (0x28 - 0x0)
// Function CompanionAI.CompanionAI_companion_ai_runtime.LookAtThreatTask
struct UCompanionAI_companion_ai_runtime_LookAtThreatTask_Params
{
public:
	class UConcurrency_task*                     __verse_0xC1E81372_CallingTask;                    // 0x0(0x8)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                        __verse_0xA3A00DDB_CallerResumeState;              // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        __verse_0x2AC0E4D8_CallerCancelState;              // 0x10(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x18(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_6080[0x7];                                     // Fixing Size After Last Property 
	class UConcurrency_task*                     RetVal;                                            // 0x20(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// 0x28 (0x28 - 0x0)
// Function CompanionAI.CompanionAI_companion_ai_runtime.LookAtOrAttackTarget
struct UCompanionAI_companion_ai_runtime_LookAtOrAttackTarget_Params
{
public:
	class UConcurrency_task*                     __verse_0xC1E81372_CallingTask;                    // 0x0(0x8)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                        __verse_0xA3A00DDB_CallerResumeState;              // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        __verse_0x2AC0E4D8_CallerCancelState;              // 0x10(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x18(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_6083[0x7];                                     // Fixing Size After Last Property 
	class UConcurrency_task*                     RetVal;                                            // 0x20(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// 0x48 (0x48 - 0x0)
// Function CompanionAI.CompanionAI_companion_ai_runtime.LookAroundTask_L_Nvector3_M_Nfloat_M_Nfloat_R
struct UCompanionAI_companion_ai_runtime_LookAroundTask_L_Nvector3_M_Nfloat_M_Nfloat_R_Params
{
public:
	class UConcurrency_task*                     __verse_0xC1E81372_CallingTask;                    // 0x0(0x8)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                        __verse_0xA3A00DDB_CallerResumeState;              // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        __verse_0x2AC0E4D8_CallerCancelState;              // 0x10(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTuple_Lvector3_Mfloat_Mfloat_R       __verse_0xB2CDDD72_Argument;                       // 0x18(0x28)(Parm, HasGetValueTypeHash)
	class UConcurrency_task*                     RetVal;                                            // 0x40(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// 0x240 (0x240 - 0x0)
// Function CompanionAI.CompanionAI_companion_ai_runtime._L_2fFortnite_2ecom_2fAI_2fCompanionAI_2fcompanion__ai__runtime_N_RLogAndDisplayOnScreen_L_N_Kchar_R
struct UCompanionAI_companion_ai_runtime__L_2fFortnite_2ecom_2fAI_2fCompanionAI_2fcompanion__ai__runtime_N_RLogAndDisplayOnScreen_L_N_Kchar_R_Params
{
public:
	FVerseStringProperty_                        __verse_0xB2CDDD72_Argument;                       // 0x0(0x10)(Parm, HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_0;                                // 0x10(0x2)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_6091[0x6];                                     // Fixing Size After Last Property 
	class UDiagnostics_log*                      __verse_0x00000000__2;                             // 0x18(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	enum class EVerseTrue                        _InvokeSureResultDummy_1;                          // 0x20(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_6092[0x7];                                     // Fixing Size After Last Property 
	FVerseFunctionProperty_                      _Callee_2;                                         // 0x28(0x10)(HasGetValueTypeHash)
	struct FTuple_L_Kchar_M_QLevel_Nlog__level_20_3d_20_2e_2e_2e_R _ExprResult_3;                                     // 0x38(0x12)(HasGetValueTypeHash)
	uint8                                        Pad_6093[0x6];                                     // Fixing Size After Last Property 
	FOptionalProperty_                           _ExprResult_4;                                     // 0x50(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class EVerseTrue                        _InvokeSureResultDummy_5;                          // 0x52(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_6094[0x5];                                     // Fixing Size After Last Property 
	FVerseFunctionProperty_                      _Callee_6;                                         // 0x58(0x10)(HasGetValueTypeHash)
	struct FTuple_L_Kchar_M_QDuration_Nfloat_20_3d_20_2e_2e_2e_M_QColor_Ncolor_20_3d_20_2e_2e_2e_R _ExprResult_7;                                     // 0x68(0x40)(HasGetValueTypeHash)
	struct FTuple_L_Kchar_M_QColor_Ncolor_M_QDuration_Nfloat_R __verse_0x00000000__3;                             // 0xA8(0x40)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_8;                                     // 0xE8(0x20)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FOptionalProperty_                           _ExprResult_9;                                     // 0x108(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResultDummy_10;                               // 0x118(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_11;                               // 0x128(0x2)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_6097[0x6];                                     // Fixing Size After Last Property 
	class UDiagnostics_log*                      __verse_0x00000000__5;                             // 0x130(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	enum class EVerseTrue                        _InvokeSureResultDummy_12;                         // 0x138(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_6098[0x7];                                     // Fixing Size After Last Property 
	FVerseFunctionProperty_                      _Callee_13;                                        // 0x140(0x10)(HasGetValueTypeHash)
	struct FTuple_L_Kchar_M_QLevel_Nlog__level_20_3d_20_2e_2e_2e_R _ExprResult_14;                                    // 0x150(0x12)(HasGetValueTypeHash)
	uint8                                        Pad_609A[0x6];                                     // Fixing Size After Last Property 
	FOptionalProperty_                           _ExprResult_15;                                    // 0x168(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class EVerseTrue                        _InvokeSureResultDummy_16;                         // 0x16A(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_609C[0x5];                                     // Fixing Size After Last Property 
	FVerseFunctionProperty_                      _Callee_17;                                        // 0x170(0x10)(HasGetValueTypeHash)
	struct FTuple_L_Kchar_M_QDuration_Nfloat_20_3d_20_2e_2e_2e_M_QColor_Ncolor_20_3d_20_2e_2e_2e_R _ExprResult_18;                                    // 0x180(0x40)(HasGetValueTypeHash)
	struct FTuple_L_Kchar_M_QColor_Ncolor_M_QDuration_Nfloat_R __verse_0x00000000__6;                             // 0x1C0(0x40)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_19;                                    // 0x200(0x20)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FOptionalProperty_                           _ExprResult_20;                                    // 0x220(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResultDummy_21;                               // 0x230(0x10)(HasGetValueTypeHash)
};

// 0x58 (0x58 - 0x0)
// Function CompanionAI.CompanionAI_companion_ai_runtime.HandleReviveCommand_L_Nping__info_R
struct UCompanionAI_companion_ai_runtime_HandleReviveCommand_L_Nping__info_R_Params
{
public:
	class UConcurrency_task*                     __verse_0xC1E81372_CallingTask;                    // 0x0(0x8)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                        __verse_0xA3A00DDB_CallerResumeState;              // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        __verse_0x2AC0E4D8_CallerCancelState;              // 0x10(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCompanionAI_ping_info                __verse_0xB2CDDD72_Argument;                       // 0x18(0x38)(Parm, NoDestructor)
	class UConcurrency_task*                     RetVal;                                            // 0x50(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// 0x28 (0x28 - 0x0)
// Function CompanionAI.CompanionAI_companion_ai_runtime.HandleObstacleService_L_N_Qentity_R
struct UCompanionAI_companion_ai_runtime_HandleObstacleService_L_N_Qentity_R_Params
{
public:
	class UConcurrency_task*                     __verse_0xC1E81372_CallingTask;                    // 0x0(0x8)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                        __verse_0xA3A00DDB_CallerResumeState;              // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        __verse_0x2AC0E4D8_CallerCancelState;              // 0x10(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FOptionalProperty_                           __verse_0xB2CDDD72_Argument;                       // 0x18(0x8)(Parm, ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class UConcurrency_task*                     RetVal;                                            // 0x20(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// 0x58 (0x58 - 0x0)
// Function CompanionAI.CompanionAI_companion_ai_runtime.HandleNPCCommand_L_Nping__info_R
struct UCompanionAI_companion_ai_runtime_HandleNPCCommand_L_Nping__info_R_Params
{
public:
	class UConcurrency_task*                     __verse_0xC1E81372_CallingTask;                    // 0x0(0x8)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                        __verse_0xA3A00DDB_CallerResumeState;              // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        __verse_0x2AC0E4D8_CallerCancelState;              // 0x10(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCompanionAI_ping_info                __verse_0xB2CDDD72_Argument;                       // 0x18(0x38)(Parm, NoDestructor)
	class UConcurrency_task*                     RetVal;                                            // 0x50(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// 0x58 (0x58 - 0x0)
// Function CompanionAI.CompanionAI_companion_ai_runtime.HandleHoldPositionCommand_L_Nping__info_R
struct UCompanionAI_companion_ai_runtime_HandleHoldPositionCommand_L_Nping__info_R_Params
{
public:
	class UConcurrency_task*                     __verse_0xC1E81372_CallingTask;                    // 0x0(0x8)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                        __verse_0xA3A00DDB_CallerResumeState;              // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        __verse_0x2AC0E4D8_CallerCancelState;              // 0x10(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCompanionAI_ping_info                __verse_0xB2CDDD72_Argument;                       // 0x18(0x38)(Parm, NoDestructor)
	class UConcurrency_task*                     RetVal;                                            // 0x50(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// 0x58 (0x58 - 0x0)
// Function CompanionAI.CompanionAI_companion_ai_runtime.HandleGoToCommand_L_Nping__info_R
struct UCompanionAI_companion_ai_runtime_HandleGoToCommand_L_Nping__info_R_Params
{
public:
	class UConcurrency_task*                     __verse_0xC1E81372_CallingTask;                    // 0x0(0x8)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                        __verse_0xA3A00DDB_CallerResumeState;              // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        __verse_0x2AC0E4D8_CallerCancelState;              // 0x10(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCompanionAI_ping_info                __verse_0xB2CDDD72_Argument;                       // 0x18(0x38)(Parm, NoDestructor)
	class UConcurrency_task*                     RetVal;                                            // 0x50(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// 0x58 (0x58 - 0x0)
// Function CompanionAI.CompanionAI_companion_ai_runtime.HandleGoTo_L_Nping__info_R
struct UCompanionAI_companion_ai_runtime_HandleGoTo_L_Nping__info_R_Params
{
public:
	class UConcurrency_task*                     __verse_0xC1E81372_CallingTask;                    // 0x0(0x8)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                        __verse_0xA3A00DDB_CallerResumeState;              // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        __verse_0x2AC0E4D8_CallerCancelState;              // 0x10(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCompanionAI_ping_info                __verse_0xB2CDDD72_Argument;                       // 0x18(0x38)(Parm, NoDestructor)
	class UConcurrency_task*                     RetVal;                                            // 0x50(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// 0x58 (0x58 - 0x0)
// Function CompanionAI.CompanionAI_companion_ai_runtime.HandleBackToMeCommand_L_Nping__info_R
struct UCompanionAI_companion_ai_runtime_HandleBackToMeCommand_L_Nping__info_R_Params
{
public:
	class UConcurrency_task*                     __verse_0xC1E81372_CallingTask;                    // 0x0(0x8)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                        __verse_0xA3A00DDB_CallerResumeState;              // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        __verse_0x2AC0E4D8_CallerCancelState;              // 0x10(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCompanionAI_ping_info                __verse_0xB2CDDD72_Argument;                       // 0x18(0x38)(Parm, NoDestructor)
	class UConcurrency_task*                     RetVal;                                            // 0x50(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// 0x60 (0x60 - 0x0)
// Function CompanionAI.CompanionAI_companion_ai_runtime.GoToPositionTask_L_Nvector3_M_N_Qagent_M_Nlogic_M_N_QReachRadius_Nfloat_20_3d_20_2e_2e_2e_M_N_QAllowPartialPath_Nlogic_20_3d_20_2e_2e_2e_R
struct UCompanionAI_companion_ai_runtime_GoToPositionTask_L_Nvector3_M_N_Qagent_M_Nlogic_M_N_QReachRadius_Nfloat_20_3d_20_2e_2e_2e_M_N_QAllowPartialPath_Nlogic_20_3d_20_2e_2e_2e_R_Params
{
public:
	class UConcurrency_task*                     __verse_0xC1E81372_CallingTask;                    // 0x0(0x8)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                        __verse_0xA3A00DDB_CallerResumeState;              // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        __verse_0x2AC0E4D8_CallerCancelState;              // 0x10(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTuple_Lvector3_M_Qagent_Mlogic_M_QReachRadius_Nfloat_20_3d_20_2e_2e_2e_M_QAllowPartialPath_Nlogic_20_3d_20_2e_2e_2e_R __verse_0xB2CDDD72_Argument;                       // 0x18(0x3A)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_60DC[0x6];                                     // Fixing Size After Last Property 
	class UConcurrency_task*                     RetVal;                                            // 0x58(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// 0x58 (0x58 - 0x0)
// Function CompanionAI.CompanionAI_companion_ai_runtime.GoToAndAttackTask_L_Nfort__threat__info_R
struct UCompanionAI_companion_ai_runtime_GoToAndAttackTask_L_Nfort__threat__info_R_Params
{
public:
	class UConcurrency_task*                     __verse_0xC1E81372_CallingTask;                    // 0x0(0x8)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                        __verse_0xA3A00DDB_CallerResumeState;              // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        __verse_0x2AC0E4D8_CallerCancelState;              // 0x10(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAI_fort_threat_info                  __verse_0xB2CDDD72_Argument;                       // 0x18(0x38)(Parm, NoDestructor)
	class UConcurrency_task*                     RetVal;                                            // 0x50(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// 0x28 (0x28 - 0x0)
// Function CompanionAI.CompanionAI_companion_ai_runtime.GetThreat
struct UCompanionAI_companion_ai_runtime_GetThreat_Params
{
public:
	class UConcurrency_task*                     __verse_0xC1E81372_CallingTask;                    // 0x0(0x8)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                        __verse_0xA3A00DDB_CallerResumeState;              // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        __verse_0x2AC0E4D8_CallerCancelState;              // 0x10(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x18(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_60E0[0x7];                                     // Fixing Size After Last Property 
	class UConcurrency_task*                     RetVal;                                            // 0x20(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// 0x28 (0x28 - 0x0)
// Function CompanionAI.CompanionAI_companion_ai_runtime.GetObstacle
struct UCompanionAI_companion_ai_runtime_GetObstacle_Params
{
public:
	class UConcurrency_task*                     __verse_0xC1E81372_CallingTask;                    // 0x0(0x8)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                        __verse_0xA3A00DDB_CallerResumeState;              // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        __verse_0x2AC0E4D8_CallerCancelState;              // 0x10(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x18(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_60E2[0x7];                                     // Fixing Size After Last Property 
	class UConcurrency_task*                     RetVal;                                            // 0x20(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// 0x28 (0x28 - 0x0)
// Function CompanionAI.CompanionAI_companion_ai_runtime.GetNewThreat
struct UCompanionAI_companion_ai_runtime_GetNewThreat_Params
{
public:
	class UConcurrency_task*                     __verse_0xC1E81372_CallingTask;                    // 0x0(0x8)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                        __verse_0xA3A00DDB_CallerResumeState;              // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        __verse_0x2AC0E4D8_CallerCancelState;              // 0x10(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x18(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_60E3[0x7];                                     // Fixing Size After Last Property 
	class UConcurrency_task*                     RetVal;                                            // 0x20(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// 0x28 (0x28 - 0x0)
// Function CompanionAI.CompanionAI_companion_ai_runtime.GetNewTargetPerception
struct UCompanionAI_companion_ai_runtime_GetNewTargetPerception_Params
{
public:
	class UConcurrency_task*                     __verse_0xC1E81372_CallingTask;                    // 0x0(0x8)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                        __verse_0xA3A00DDB_CallerResumeState;              // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        __verse_0x2AC0E4D8_CallerCancelState;              // 0x10(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x18(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_60E4[0x7];                                     // Fixing Size After Last Property 
	class UConcurrency_task*                     RetVal;                                            // 0x20(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// 0x28 (0x28 - 0x0)
// Function CompanionAI.CompanionAI_companion_ai_runtime.GetNewObstacle
struct UCompanionAI_companion_ai_runtime_GetNewObstacle_Params
{
public:
	class UConcurrency_task*                     __verse_0xC1E81372_CallingTask;                    // 0x0(0x8)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                        __verse_0xA3A00DDB_CallerResumeState;              // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        __verse_0x2AC0E4D8_CallerCancelState;              // 0x10(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x18(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_60E9[0x7];                                     // Fixing Size After Last Property 
	class UConcurrency_task*                     RetVal;                                            // 0x20(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// 0x58 (0x58 - 0x0)
// Function CompanionAI.CompanionAI_companion_ai_runtime.GetAttackCommandTarget_L_Nping__info_R
struct UCompanionAI_companion_ai_runtime_GetAttackCommandTarget_L_Nping__info_R_Params
{
public:
	class UConcurrency_task*                     __verse_0xC1E81372_CallingTask;                    // 0x0(0x8)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                        __verse_0xA3A00DDB_CallerResumeState;              // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        __verse_0x2AC0E4D8_CallerCancelState;              // 0x10(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCompanionAI_ping_info                __verse_0xB2CDDD72_Argument;                       // 0x18(0x38)(Parm, NoDestructor)
	class UConcurrency_task*                     RetVal;                                            // 0x50(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// 0x28 (0x28 - 0x0)
// Function CompanionAI.CompanionAI_companion_ai_runtime.GameLoop
struct UCompanionAI_companion_ai_runtime_GameLoop_Params
{
public:
	class UConcurrency_task*                     __verse_0xC1E81372_CallingTask;                    // 0x0(0x8)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                        __verse_0xA3A00DDB_CallerResumeState;              // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        __verse_0x2AC0E4D8_CallerCancelState;              // 0x10(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x18(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_60F4[0x7];                                     // Fixing Size After Last Property 
	class UConcurrency_task*                     RetVal;                                            // 0x20(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// 0x58 (0x58 - 0x0)
// Function CompanionAI.CompanionAI_companion_ai_runtime.DrawSphere_L_Nvector3_M_Nfloat_M_Ncolor_R
struct UCompanionAI_companion_ai_runtime_DrawSphere_L_Nvector3_M_Nfloat_M_Ncolor_R_Params
{
public:
	class UConcurrency_task*                     __verse_0xC1E81372_CallingTask;                    // 0x0(0x8)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                        __verse_0xA3A00DDB_CallerResumeState;              // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        __verse_0x2AC0E4D8_CallerCancelState;              // 0x10(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTuple_Lvector3_Mfloat_Mcolor_R       __verse_0xB2CDDD72_Argument;                       // 0x18(0x38)(Parm, HasGetValueTypeHash)
	class UConcurrency_task*                     RetVal;                                            // 0x50(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// 0x28 (0x28 - 0x0)
// Function CompanionAI.CompanionAI_companion_ai_runtime.CrouchUntilHit
struct UCompanionAI_companion_ai_runtime_CrouchUntilHit_Params
{
public:
	class UConcurrency_task*                     __verse_0xC1E81372_CallingTask;                    // 0x0(0x8)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                        __verse_0xA3A00DDB_CallerResumeState;              // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        __verse_0x2AC0E4D8_CallerCancelState;              // 0x10(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x18(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_60FC[0x7];                                     // Fixing Size After Last Property 
	class UConcurrency_task*                     RetVal;                                            // 0x20(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// 0x28 (0x28 - 0x0)
// Function CompanionAI.CompanionAI_companion_ai_runtime.CrouchService
struct UCompanionAI_companion_ai_runtime_CrouchService_Params
{
public:
	class UConcurrency_task*                     __verse_0xC1E81372_CallingTask;                    // 0x0(0x8)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                        __verse_0xA3A00DDB_CallerResumeState;              // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        __verse_0x2AC0E4D8_CallerCancelState;              // 0x10(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x18(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_60FF[0x7];                                     // Fixing Size After Last Property 
	class UConcurrency_task*                     RetVal;                                            // 0x20(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// 0x58 (0x58 - 0x0)
// Function CompanionAI.CompanionAI_companion_ai_runtime.CheckForReviveTeamMembers_L_Nping__info_R
struct UCompanionAI_companion_ai_runtime_CheckForReviveTeamMembers_L_Nping__info_R_Params
{
public:
	class UConcurrency_task*                     __verse_0xC1E81372_CallingTask;                    // 0x0(0x8)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                        __verse_0xA3A00DDB_CallerResumeState;              // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        __verse_0x2AC0E4D8_CallerCancelState;              // 0x10(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCompanionAI_ping_info                __verse_0xB2CDDD72_Argument;                       // 0x18(0x38)(Parm, NoDestructor)
	class UConcurrency_task*                     RetVal;                                            // 0x50(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// 0x0 (0x0 - 0x0)
// Function CompanionAI.CompanionAI_companion_ai_runtime.$InitInstance
struct UCompanionAI_companion_ai_runtime__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function CompanionAI.CompanionAI_companion_ai_runtime.$Block
struct UCompanionAI_companion_ai_runtime__Block_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function CompanionAI.CompanionAI_companion_ai_runtime.$InitCDO
struct UCompanionAI_companion_ai_runtime__InitCDO_Params
{
public:
};

// 0x28 (0x28 - 0x0)
// Function CompanionAI.CompanionAI_companion_creature.OnBegin
struct UCompanionAI_companion_creature_OnBegin_Params
{
public:
	class UConcurrency_task*                     __verse_0xC1E81372_CallingTask;                    // 0x0(0x8)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                        __verse_0xA3A00DDB_CallerResumeState;              // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        __verse_0x2AC0E4D8_CallerCancelState;              // 0x10(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x18(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_611A[0x7];                                     // Fixing Size After Last Property 
	class UConcurrency_task*                     RetVal;                                            // 0x20(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// 0x240 (0x240 - 0x0)
// Function CompanionAI.CompanionAI_companion_creature._L_2fFortnite_2ecom_2fAI_2fCompanionAI_2fcompanion__creature_N_RLogAndDisplayOnScreen_L_N_Kchar_R
struct UCompanionAI_companion_creature__L_2fFortnite_2ecom_2fAI_2fCompanionAI_2fcompanion__creature_N_RLogAndDisplayOnScreen_L_N_Kchar_R_Params
{
public:
	FVerseStringProperty_                        __verse_0xB2CDDD72_Argument;                       // 0x0(0x10)(Parm, HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_0;                                // 0x10(0x2)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_6137[0x6];                                     // Fixing Size After Last Property 
	class UDiagnostics_log*                      __verse_0x00000000__2;                             // 0x18(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	enum class EVerseTrue                        _InvokeSureResultDummy_1;                          // 0x20(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_6138[0x7];                                     // Fixing Size After Last Property 
	FVerseFunctionProperty_                      _Callee_2;                                         // 0x28(0x10)(HasGetValueTypeHash)
	struct FTuple_L_Kchar_M_QLevel_Nlog__level_20_3d_20_2e_2e_2e_R _ExprResult_3;                                     // 0x38(0x12)(HasGetValueTypeHash)
	uint8                                        Pad_6139[0x6];                                     // Fixing Size After Last Property 
	FOptionalProperty_                           _ExprResult_4;                                     // 0x50(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class EVerseTrue                        _InvokeSureResultDummy_5;                          // 0x52(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_613A[0x5];                                     // Fixing Size After Last Property 
	FVerseFunctionProperty_                      _Callee_6;                                         // 0x58(0x10)(HasGetValueTypeHash)
	struct FTuple_L_Kchar_M_QDuration_Nfloat_20_3d_20_2e_2e_2e_M_QColor_Ncolor_20_3d_20_2e_2e_2e_R _ExprResult_7;                                     // 0x68(0x40)(HasGetValueTypeHash)
	struct FTuple_L_Kchar_M_QColor_Ncolor_M_QDuration_Nfloat_R __verse_0x00000000__3;                             // 0xA8(0x40)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_8;                                     // 0xE8(0x20)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FOptionalProperty_                           _ExprResult_9;                                     // 0x108(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResultDummy_10;                               // 0x118(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_11;                               // 0x128(0x2)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_613B[0x6];                                     // Fixing Size After Last Property 
	class UDiagnostics_log*                      __verse_0x00000000__5;                             // 0x130(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	enum class EVerseTrue                        _InvokeSureResultDummy_12;                         // 0x138(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_613C[0x7];                                     // Fixing Size After Last Property 
	FVerseFunctionProperty_                      _Callee_13;                                        // 0x140(0x10)(HasGetValueTypeHash)
	struct FTuple_L_Kchar_M_QLevel_Nlog__level_20_3d_20_2e_2e_2e_R _ExprResult_14;                                    // 0x150(0x12)(HasGetValueTypeHash)
	uint8                                        Pad_613D[0x6];                                     // Fixing Size After Last Property 
	FOptionalProperty_                           _ExprResult_15;                                    // 0x168(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class EVerseTrue                        _InvokeSureResultDummy_16;                         // 0x16A(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_613E[0x5];                                     // Fixing Size After Last Property 
	FVerseFunctionProperty_                      _Callee_17;                                        // 0x170(0x10)(HasGetValueTypeHash)
	struct FTuple_L_Kchar_M_QDuration_Nfloat_20_3d_20_2e_2e_2e_M_QColor_Ncolor_20_3d_20_2e_2e_2e_R _ExprResult_18;                                    // 0x180(0x40)(HasGetValueTypeHash)
	struct FTuple_L_Kchar_M_QColor_Ncolor_M_QDuration_Nfloat_R __verse_0x00000000__6;                             // 0x1C0(0x40)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_19;                                    // 0x200(0x20)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FOptionalProperty_                           _ExprResult_20;                                    // 0x220(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResultDummy_21;                               // 0x230(0x10)(HasGetValueTypeHash)
};

// 0x58 (0x58 - 0x0)
// Function CompanionAI.CompanionAI_companion_creature.DrawSphere_L_Nvector3_M_Nfloat_M_Ncolor_R
struct UCompanionAI_companion_creature_DrawSphere_L_Nvector3_M_Nfloat_M_Ncolor_R_Params
{
public:
	class UConcurrency_task*                     __verse_0xC1E81372_CallingTask;                    // 0x0(0x8)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                        __verse_0xA3A00DDB_CallerResumeState;              // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        __verse_0x2AC0E4D8_CallerCancelState;              // 0x10(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTuple_Lvector3_Mfloat_Mcolor_R       __verse_0xB2CDDD72_Argument;                       // 0x18(0x38)(Parm, HasGetValueTypeHash)
	class UConcurrency_task*                     RetVal;                                            // 0x50(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// 0x0 (0x0 - 0x0)
// Function CompanionAI.CompanionAI_companion_creature.$InitInstance
struct UCompanionAI_companion_creature__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function CompanionAI.CompanionAI_companion_creature.$Block
struct UCompanionAI_companion_creature__Block_Params
{
public:
};

// 0x40 (0x40 - 0x0)
// Function CompanionAI.CompanionAI_companion_creature.$InitCDO
struct UCompanionAI_companion_creature__InitCDO_Params
{
public:
	class UDiagnostics_log*                      _ExprResult_0;                                     // 0x0(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                       _InstancingGraph_1;                                // 0x8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDiagnostics_debug_draw*               _ExprResult_2;                                     // 0x10(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                       _InstancingGraph_3;                                // 0x18(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDiagnostics_log*                      _ExprResult_4;                                     // 0x20(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                       _InstancingGraph_5;                                // 0x28(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDiagnostics_debug_draw*               _ExprResult_6;                                     // 0x30(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                       _InstancingGraph_7;                                // 0x38(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x30 (0x30 - 0x0)
// Function CompanionAI.CompanionAI_companion_creature_runtime.SeekLKP_L_Nagent_M_Nfloat_R
struct UCompanionAI_companion_creature_runtime_SeekLKP_L_Nagent_M_Nfloat_R_Params
{
public:
	class UConcurrency_task*                     __verse_0xC1E81372_CallingTask;                    // 0x0(0x8)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                        __verse_0xA3A00DDB_CallerResumeState;              // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        __verse_0x2AC0E4D8_CallerCancelState;              // 0x10(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTuple_Lagent_Mfloat_R                __verse_0xB2CDDD72_Argument;                       // 0x18(0x10)(Parm, HasGetValueTypeHash)
	class UConcurrency_task*                     RetVal;                                            // 0x28(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// 0x28 (0x28 - 0x0)
// Function CompanionAI.CompanionAI_companion_creature_runtime.PatrolAround
struct UCompanionAI_companion_creature_runtime_PatrolAround_Params
{
public:
	class UConcurrency_task*                     __verse_0xC1E81372_CallingTask;                    // 0x0(0x8)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                        __verse_0xA3A00DDB_CallerResumeState;              // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        __verse_0x2AC0E4D8_CallerCancelState;              // 0x10(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x18(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_615E[0x7];                                     // Fixing Size After Last Property 
	class UConcurrency_task*                     RetVal;                                            // 0x20(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// 0x50 (0x50 - 0x0)
// Function CompanionAI.CompanionAI_companion_creature_runtime._L_2fFortnite_2ecom_2fAI_2fCompanionAI_2fcompanion__creature__runtime_N_RLogAndDisplayOnScreen_L_N_Kchar_R
struct UCompanionAI_companion_creature_runtime__L_2fFortnite_2ecom_2fAI_2fCompanionAI_2fcompanion__creature__runtime_N_RLogAndDisplayOnScreen_L_N_Kchar_R_Params
{
public:
	FVerseStringProperty_                        __verse_0xB2CDDD72_Argument;                       // 0x0(0x10)(Parm, HasGetValueTypeHash)
	class UCompanionAI_companion_creature*       __verse_0x00000000__1;                             // 0x10(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	enum class EVerseTrue                        _InvokeSureResultDummy_0;                          // 0x18(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_6164[0x7];                                     // Fixing Size After Last Property 
	FVerseFunctionProperty_                      _Callee_1;                                         // 0x20(0x10)(HasGetValueTypeHash)
	class UCompanionAI_companion_creature*       __verse_0x00000000__2;                             // 0x30(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	enum class EVerseTrue                        _InvokeSureResultDummy_2;                          // 0x38(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_6165[0x7];                                     // Fixing Size After Last Property 
	FVerseFunctionProperty_                      _Callee_3;                                         // 0x40(0x10)(HasGetValueTypeHash)
};

// 0x328 (0x328 - 0x0)
// Function CompanionAI.CompanionAI_companion_creature_runtime._L_2fFortnite_2ecom_2fAI_2fCompanionAI_2fcompanion__creature__runtime_N_RIsTargetInRange_L_Nagent_M_Nfloat_R
struct UCompanionAI_companion_creature_runtime__L_2fFortnite_2ecom_2fAI_2fCompanionAI_2fcompanion__creature__runtime_N_RIsTargetInRange_L_Nagent_M_Nfloat_R_Params
{
public:
	struct FTuple_Lagent_Mfloat_R                __verse_0xB2CDDD72_Argument;                       // 0x0(0x10)(Parm, HasGetValueTypeHash)
	FOptionalProperty_                           RetVal;                                            // 0x10(0x2)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        _ExprResult_0 : 1;                                 // Mask: 0x1, PropSize: 0x10x12(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_3D1 : 7;                                    // Fixing Bit-Field Size 
	uint8                                        Pad_616B[0x5];                                     // Fixing Size After Last Property 
	struct FSpatialMath_vector3                  __verse_0x4550A2D9_MyPosition_2;                   // 0x18(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FSpatialMath_transform                _ExprResult_1;                                     // 0x30(0x60)(NoDestructor)
	class UObject*                               __verse_0x00000000__3;                             // 0x90(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_2;                                         // 0x98(0x10)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_3;                                     // 0xA8(0x1)(HasGetValueTypeHash)
	uint8                                        Pad_616C[0x7];                                     // Fixing Size After Last Property 
	struct FAI_fort_threat_info                  __verse_0x08287148_Snapshot_4;                     // 0xB0(0x38)(NoDestructor)
	class UObject*                               __verse_0x00000000__5;                             // 0xE8(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_4;                                // 0xF0(0x40)(ZeroConstructor, NoDestructor)
	FVerseFunctionProperty_                      _Callee_5;                                         // 0x130(0x10)(HasGetValueTypeHash)
	double                                       __verse_0x47C7BD3D_DistanceToLKP_4;                // 0x140(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_6;                                         // 0x148(0x10)(HasGetValueTypeHash)
	struct FTuple_Lvector3_Mvector3_R            _ExprResult_7;                                     // 0x158(0x30)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_8;                                // 0x188(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        _ExprResult_9 : 1;                                 // Mask: 0x1, PropSize: 0x10x198(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_3D2 : 7;                                    // Fixing Bit-Field Size 
	uint8                                        Pad_616E[0x7];                                     // Fixing Size After Last Property 
	struct FSpatialMath_vector3                  __verse_0x4550A2D9_MyPosition_8;                   // 0x1A0(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_616F[0x8];                                     // Fixing Size After Last Property 
	struct FSpatialMath_transform                _ExprResult_10;                                    // 0x1C0(0x60)(NoDestructor)
	class UObject*                               __verse_0x00000000__9;                             // 0x220(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_11;                                        // 0x228(0x10)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_12;                                    // 0x238(0x1)(HasGetValueTypeHash)
	uint8                                        Pad_6171[0x7];                                     // Fixing Size After Last Property 
	struct FAI_fort_threat_info                  __verse_0x08287148_Snapshot_10;                    // 0x240(0x38)(NoDestructor)
	class UObject*                               __verse_0x00000000__11;                            // 0x278(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_13;                               // 0x280(0x40)(ZeroConstructor, NoDestructor)
	FVerseFunctionProperty_                      _Callee_14;                                        // 0x2C0(0x10)(HasGetValueTypeHash)
	double                                       __verse_0x47C7BD3D_DistanceToLKP_10;               // 0x2D0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_15;                                        // 0x2D8(0x10)(HasGetValueTypeHash)
	struct FTuple_Lvector3_Mvector3_R            _ExprResult_16;                                    // 0x2E8(0x30)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_17;                               // 0x318(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x28 (0x28 - 0x0)
// Function CompanionAI.CompanionAI_companion_creature_runtime.Howl
struct UCompanionAI_companion_creature_runtime_Howl_Params
{
public:
	class UConcurrency_task*                     __verse_0xC1E81372_CallingTask;                    // 0x0(0x8)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                        __verse_0xA3A00DDB_CallerResumeState;              // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        __verse_0x2AC0E4D8_CallerCancelState;              // 0x10(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x18(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_6178[0x7];                                     // Fixing Size After Last Property 
	class UConcurrency_task*                     RetVal;                                            // 0x20(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// 0x28 (0x28 - 0x0)
// Function CompanionAI.CompanionAI_companion_creature_runtime.GameLoop
struct UCompanionAI_companion_creature_runtime_GameLoop_Params
{
public:
	class UConcurrency_task*                     __verse_0xC1E81372_CallingTask;                    // 0x0(0x8)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                        __verse_0xA3A00DDB_CallerResumeState;              // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        __verse_0x2AC0E4D8_CallerCancelState;              // 0x10(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x18(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_6183[0x7];                                     // Fixing Size After Last Property 
	class UConcurrency_task*                     RetVal;                                            // 0x20(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// 0x30 (0x30 - 0x0)
// Function CompanionAI.CompanionAI_companion_creature_runtime.FaceLKP_L_Nagent_M_Nfloat_R
struct UCompanionAI_companion_creature_runtime_FaceLKP_L_Nagent_M_Nfloat_R_Params
{
public:
	class UConcurrency_task*                     __verse_0xC1E81372_CallingTask;                    // 0x0(0x8)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                        __verse_0xA3A00DDB_CallerResumeState;              // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        __verse_0x2AC0E4D8_CallerCancelState;              // 0x10(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTuple_Lagent_Mfloat_R                __verse_0xB2CDDD72_Argument;                       // 0x18(0x10)(Parm, HasGetValueTypeHash)
	class UConcurrency_task*                     RetVal;                                            // 0x28(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// 0x30 (0x30 - 0x0)
// Function CompanionAI.CompanionAI_companion_creature_runtime.EngageTarget_L_Nagent_M_Ngameplay__ability__asset_R
struct UCompanionAI_companion_creature_runtime_EngageTarget_L_Nagent_M_Ngameplay__ability__asset_R_Params
{
public:
	class UConcurrency_task*                     __verse_0xC1E81372_CallingTask;                    // 0x0(0x8)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                        __verse_0xA3A00DDB_CallerResumeState;              // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        __verse_0x2AC0E4D8_CallerCancelState;              // 0x10(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTuple_Lagent_Mgameplay__ability__asset_R __verse_0xB2CDDD72_Argument;                       // 0x18(0x10)(Parm, HasGetValueTypeHash)
	class UConcurrency_task*                     RetVal;                                            // 0x28(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// 0x28 (0x28 - 0x0)
// Function CompanionAI.CompanionAI_companion_creature_runtime.DetectNewTarget
struct UCompanionAI_companion_creature_runtime_DetectNewTarget_Params
{
public:
	class UConcurrency_task*                     __verse_0xC1E81372_CallingTask;                    // 0x0(0x8)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                        __verse_0xA3A00DDB_CallerResumeState;              // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        __verse_0x2AC0E4D8_CallerCancelState;              // 0x10(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x18(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_6190[0x7];                                     // Fixing Size After Last Property 
	class UConcurrency_task*                     RetVal;                                            // 0x20(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// 0x48 (0x48 - 0x0)
// Function CompanionAI.CompanionAI_companion_creature_runtime.DetectMovement_L_Nvector3_M_Nagent_M_Nfloat_R
struct UCompanionAI_companion_creature_runtime_DetectMovement_L_Nvector3_M_Nagent_M_Nfloat_R_Params
{
public:
	class UConcurrency_task*                     __verse_0xC1E81372_CallingTask;                    // 0x0(0x8)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                        __verse_0xA3A00DDB_CallerResumeState;              // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        __verse_0x2AC0E4D8_CallerCancelState;              // 0x10(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTuple_Lvector3_Magent_Mfloat_R       __verse_0xB2CDDD72_Argument;                       // 0x18(0x28)(Parm, HasGetValueTypeHash)
	class UConcurrency_task*                     RetVal;                                            // 0x40(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// 0x40 (0x40 - 0x0)
// Function CompanionAI.CompanionAI_companion_creature_runtime.ActivateAbilityWhenCloseEnough_L_Nagent_M_Ngameplay__ability__asset_M_Nfloat_M_Nfloat_R
struct UCompanionAI_companion_creature_runtime_ActivateAbilityWhenCloseEnough_L_Nagent_M_Ngameplay__ability__asset_M_Nfloat_M_Nfloat_R_Params
{
public:
	class UConcurrency_task*                     __verse_0xC1E81372_CallingTask;                    // 0x0(0x8)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                        __verse_0xA3A00DDB_CallerResumeState;              // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        __verse_0x2AC0E4D8_CallerCancelState;              // 0x10(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTuple_Lagent_Mgameplay__ability__asset_Mfloat_Mfloat_R __verse_0xB2CDDD72_Argument;                       // 0x18(0x20)(Parm, HasGetValueTypeHash)
	class UConcurrency_task*                     RetVal;                                            // 0x38(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// 0x0 (0x0 - 0x0)
// Function CompanionAI.CompanionAI_companion_creature_runtime.$InitInstance
struct UCompanionAI_companion_creature_runtime__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function CompanionAI.CompanionAI_companion_creature_runtime.$Block
struct UCompanionAI_companion_creature_runtime__Block_Params
{
public:
};

// 0x1D (0x1D - 0x0)
// Function CompanionAI.CompanionAI_companion_creature_runtime.$InitCDO
struct UCompanionAI_companion_creature_runtime__InitCDO_Params
{
public:
	FOptionalProperty_                           _ExprResult_0;                                     // 0x0(0x8)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FOptionalProperty_                           __verse_0x00000000__1;                             // 0x8(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        _ExprResult_1 : 1;                                 // Mask: 0x1, PropSize: 0x10xA(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_3D3 : 7;                                    // Fixing Bit-Field Size 
	FOptionalProperty_                           _ExprResultStack_2;                                // 0xB(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_619D[0x3];                                     // Fixing Size After Last Property 
	FOptionalProperty_                           _ExprResult_3;                                     // 0x10(0x8)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FOptionalProperty_                           __verse_0x00000000__3;                             // 0x18(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        _ExprResult_4 : 1;                                 // Mask: 0x1, PropSize: 0x10x1A(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_3D4 : 7;                                    // Fixing Bit-Field Size 
	FOptionalProperty_                           _ExprResultStack_5;                                // 0x1B(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x28 (0x28 - 0x0)
// Function CompanionAI.CompanionAI_default_ai_behavior.OnBegin
struct UCompanionAI_default_ai_behavior_OnBegin_Params
{
public:
	class UConcurrency_task*                     __verse_0xC1E81372_CallingTask;                    // 0x0(0x8)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                        __verse_0xA3A00DDB_CallerResumeState;              // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        __verse_0x2AC0E4D8_CallerCancelState;              // 0x10(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x18(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_61A6[0x7];                                     // Fixing Size After Last Property 
	class UConcurrency_task*                     RetVal;                                            // 0x20(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// 0x0 (0x0 - 0x0)
// Function CompanionAI.CompanionAI_default_ai_behavior.$InitInstance
struct UCompanionAI_default_ai_behavior__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function CompanionAI.CompanionAI_default_ai_behavior.$Block
struct UCompanionAI_default_ai_behavior__Block_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function CompanionAI.CompanionAI_default_ai_behavior.$InitCDO
struct UCompanionAI_default_ai_behavior__InitCDO_Params
{
public:
};

// 0x28 (0x28 - 0x0)
// Function CompanionAI.CompanionAI_fort_br_character_actions_interface.RunDefaultBehavior
struct UCompanionAI_fort_br_character_actions_interface_RunDefaultBehavior_Params
{
public:
	class UConcurrency_task*                     __verse_0xC1E81372_CallingTask;                    // 0x0(0x8)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                        __verse_0xA3A00DDB_CallerResumeState;              // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        __verse_0x2AC0E4D8_CallerCancelState;              // 0x10(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x18(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_61B1[0x7];                                     // Fixing Size After Last Property 
	class UConcurrency_task*                     RetVal;                                            // 0x20(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// 0x2 (0x2 - 0x0)
// Function CompanionAI.CompanionAI_fort_br_character_actions_interface._L_2fFortnite_2ecom_2fAI_2fCompanionAI_2ffort__br__character__actions__interface_N_RIsFollowingBehaviorEnabled
struct UCompanionAI_fort_br_character_actions_interface__L_2fFortnite_2ecom_2fAI_2fCompanionAI_2ffort__br__character__actions__interface_N_RIsFollowingBehaviorEnabled_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        RetVal : 1;                                        // Mask: 0x1, PropSize: 0x10x1(0x1)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash)
};

// 0x28 (0x28 - 0x0)
// Function CompanionAI.CompanionAI_fort_br_creature_actions_interface.RunDefaultBehavior
struct UCompanionAI_fort_br_creature_actions_interface_RunDefaultBehavior_Params
{
public:
	class UConcurrency_task*                     __verse_0xC1E81372_CallingTask;                    // 0x0(0x8)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                        __verse_0xA3A00DDB_CallerResumeState;              // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        __verse_0x2AC0E4D8_CallerCancelState;              // 0x10(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x18(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_61BE[0x7];                                     // Fixing Size After Last Property 
	class UConcurrency_task*                     RetVal;                                            // 0x20(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// 0x28 (0x28 - 0x0)
// Function CompanionAI.CompanionAI_fort_creature_component.RunDefaultBehavior
struct UCompanionAI_fort_creature_component_RunDefaultBehavior_Params
{
public:
	class UConcurrency_task*                     __verse_0xC1E81372_CallingTask;                    // 0x0(0x8)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                        __verse_0xA3A00DDB_CallerResumeState;              // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        __verse_0x2AC0E4D8_CallerCancelState;              // 0x10(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x18(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_61CA[0x7];                                     // Fixing Size After Last Property 
	class UConcurrency_task*                     RetVal;                                            // 0x20(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// 0x0 (0x0 - 0x0)
// Function CompanionAI.CompanionAI_fort_creature_component.$InitInstance
struct UCompanionAI_fort_creature_component__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function CompanionAI.CompanionAI_fort_creature_component.$Block
struct UCompanionAI_fort_creature_component__Block_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function CompanionAI.CompanionAI_fort_creature_component.$InitCDO
struct UCompanionAI_fort_creature_component__InitCDO_Params
{
public:
};

// 0x28 (0x28 - 0x0)
// Function CompanionAI.CompanionAI_fort_npc_component.RunDefaultBehavior
struct UCompanionAI_fort_npc_component_RunDefaultBehavior_Params
{
public:
	class UConcurrency_task*                     __verse_0xC1E81372_CallingTask;                    // 0x0(0x8)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                        __verse_0xA3A00DDB_CallerResumeState;              // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        __verse_0x2AC0E4D8_CallerCancelState;              // 0x10(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x18(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_61D3[0x7];                                     // Fixing Size After Last Property 
	class UConcurrency_task*                     RetVal;                                            // 0x20(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// 0x2 (0x2 - 0x0)
// Function CompanionAI.CompanionAI_fort_npc_component._L_2fFortnite_2ecom_2fAI_2fCompanionAI_2ffort__br__character__actions__interface_N_RIsFollowingBehaviorEnabled
struct UCompanionAI_fort_npc_component__L_2fFortnite_2ecom_2fAI_2fCompanionAI_2ffort__br__character__actions__interface_N_RIsFollowingBehaviorEnabled_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        RetVal : 1;                                        // Mask: 0x1, PropSize: 0x10x1(0x1)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash)
};

// 0x0 (0x0 - 0x0)
// Function CompanionAI.CompanionAI_fort_npc_component.$InitInstance
struct UCompanionAI_fort_npc_component__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function CompanionAI.CompanionAI_fort_npc_component.$Block
struct UCompanionAI_fort_npc_component__Block_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function CompanionAI.CompanionAI_fort_npc_component.$InitCDO
struct UCompanionAI_fort_npc_component__InitCDO_Params
{
public:
};

// 0x10 (0x10 - 0x0)
// Function CompanionAI.CompanionAI_fort_ping_interface._L_2fFortnite_2ecom_2fAI_2fCompanionAI_2ffort__ping__interface_N_RUnconvertedEvent
struct UCompanionAI_fort_ping_interface__L_2fFortnite_2ecom_2fAI_2fCompanionAI_2ffort__ping__interface_N_RUnconvertedEvent_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_61E0[0x7];                                     // Fixing Size After Last Property 
	class UObject*                               RetVal;                                            // 0x8(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// 0x28 (0x28 - 0x0)
// Function CompanionAI.CompanionAI_fort_ping_interface.OnNPCCommand
struct UCompanionAI_fort_ping_interface_OnNPCCommand_Params
{
public:
	class UConcurrency_task*                     __verse_0xC1E81372_CallingTask;                    // 0x0(0x8)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                        __verse_0xA3A00DDB_CallerResumeState;              // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        __verse_0x2AC0E4D8_CallerCancelState;              // 0x10(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x18(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_61E3[0x7];                                     // Fixing Size After Last Property 
	class UConcurrency_task*                     RetVal;                                            // 0x20(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// 0x2 (0x2 - 0x0)
// Function CompanionAI.CompanionAI_fort_ping_interface._L_2fFortnite_2ecom_2fAI_2fCompanionAI_2ffort__ping__interface_N_RIsAttackCommandEnabled
struct UCompanionAI_fort_ping_interface__L_2fFortnite_2ecom_2fAI_2fCompanionAI_2ffort__ping__interface_N_RIsAttackCommandEnabled_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        RetVal : 1;                                        // Mask: 0x1, PropSize: 0x10x1(0x1)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash)
};

// 0x48 (0x48 - 0x0)
// Function CompanionAI.CompanionAI_fort_ping_interface._L_2fFortnite_2ecom_2fAI_2fCompanionAI_2ffort__ping__interface_N_RGetCurrentNPCCommand
struct UCompanionAI_fort_ping_interface__L_2fFortnite_2ecom_2fAI_2fCompanionAI_2ffort__ping__interface_N_RGetCurrentNPCCommand_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_61E6[0x7];                                     // Fixing Size After Last Property 
	FOptionalProperty_                           RetVal;                                            // 0x8(0x40)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor)
};

// 0x1 (0x1 - 0x0)
// Function CompanionAI.CompanionAI_fort_ping_interface._L_2fFortnite_2ecom_2fAI_2fCompanionAI_2ffort__ping__interface_N_REnableCommandWheel_L_Nlogic_R
struct UCompanionAI_fort_ping_interface__L_2fFortnite_2ecom_2fAI_2fCompanionAI_2ffort__ping__interface_N_REnableCommandWheel_L_Nlogic_R_Params
{
public:
	uint8                                        __verse_0xB2CDDD72_Argument : 1;                   // Mask: 0x1, PropSize: 0x10x0(0x1)(Parm, NoDestructor, HasGetValueTypeHash)
};

// 0x1 (0x1 - 0x0)
// Function CompanionAI.CompanionAI_fort_ping_interface._L_2fFortnite_2ecom_2fAI_2fCompanionAI_2ffort__ping__interface_N_RDeclineNPCCommand_L_Nlogic_R
struct UCompanionAI_fort_ping_interface__L_2fFortnite_2ecom_2fAI_2fCompanionAI_2ffort__ping__interface_N_RDeclineNPCCommand_L_Nlogic_R_Params
{
public:
	uint8                                        __verse_0xB2CDDD72_Argument : 1;                   // Mask: 0x1, PropSize: 0x10x0(0x1)(Parm, NoDestructor, HasGetValueTypeHash)
};

// 0x10 (0x10 - 0x0)
// Function CompanionAI.CompanionAI_fort_ping_interface._L_2fFortnite_2ecom_2fAI_2fCompanionAI_2ffort__ping__interface_N_RConvertedEvent
struct UCompanionAI_fort_ping_interface__L_2fFortnite_2ecom_2fAI_2fCompanionAI_2ffort__ping__interface_N_RConvertedEvent_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_61EC[0x7];                                     // Fixing Size After Last Property 
	class UObject*                               RetVal;                                            // 0x8(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function CompanionAI.CompanionAI_fort_ping_interface._L_2fFortnite_2ecom_2fAI_2fCompanionAI_2ffort__ping__interface_N_RConvertPingToAttack_L_Nagent_R
struct UCompanionAI_fort_ping_interface__L_2fFortnite_2ecom_2fAI_2fCompanionAI_2ffort__ping__interface_N_RConvertPingToAttack_L_Nagent_R_Params
{
public:
	class USimulation_agent*                     __verse_0xB2CDDD72_Argument;                       // 0x0(0x8)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// 0x2 (0x2 - 0x0)
// Function CompanionAI.CompanionAI_fort_ping_interface._L_2fFortnite_2ecom_2fAI_2fCompanionAI_2ffort__ping__interface_N_RCanAcceptPingCommand
struct UCompanionAI_fort_ping_interface__L_2fFortnite_2ecom_2fAI_2fCompanionAI_2ffort__ping__interface_N_RCanAcceptPingCommand_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        RetVal : 1;                                        // Mask: 0x1, PropSize: 0x10x1(0x1)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash)
};

// 0x2 (0x2 - 0x0)
// Function CompanionAI.CompanionAI_fort_ping_interface._L_2fFortnite_2ecom_2fAI_2fCompanionAI_2ffort__ping__interface_N_RAreNPCCommandsEnabled
struct UCompanionAI_fort_ping_interface__L_2fFortnite_2ecom_2fAI_2fCompanionAI_2ffort__ping__interface_N_RAreNPCCommandsEnabled_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        RetVal : 1;                                        // Mask: 0x1, PropSize: 0x10x1(0x1)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash)
};

// 0x0 (0x0 - 0x0)
// Function CompanionAI.CompanionAI_log_companion_ai.$InitInstance
struct UCompanionAI_log_companion_ai__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function CompanionAI.CompanionAI_log_companion_ai.$Block
struct UCompanionAI_log_companion_ai__Block_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function CompanionAI.CompanionAI_log_companion_ai.$InitCDO
struct UCompanionAI_log_companion_ai__InitCDO_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function CompanionAI.CompanionAI_log_companion_creature.$InitInstance
struct UCompanionAI_log_companion_creature__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function CompanionAI.CompanionAI_log_companion_creature.$Block
struct UCompanionAI_log_companion_creature__Block_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function CompanionAI.CompanionAI_log_companion_creature.$InitCDO
struct UCompanionAI_log_companion_creature__InitCDO_Params
{
public:
};

// 0x10 (0x10 - 0x0)
// Function CompanionAI.CompanionAI_ping_component._L_2fFortnite_2ecom_2fAI_2fCompanionAI_2ffort__ping__interface_N_RUnconvertedEvent
struct UCompanionAI_ping_component__L_2fFortnite_2ecom_2fAI_2fCompanionAI_2ffort__ping__interface_N_RUnconvertedEvent_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_6206[0x7];                                     // Fixing Size After Last Property 
	class UObject*                               RetVal;                                            // 0x8(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// 0x28 (0x28 - 0x0)
// Function CompanionAI.CompanionAI_ping_component.OnNPCCommand
struct UCompanionAI_ping_component_OnNPCCommand_Params
{
public:
	class UConcurrency_task*                     __verse_0xC1E81372_CallingTask;                    // 0x0(0x8)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                        __verse_0xA3A00DDB_CallerResumeState;              // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        __verse_0x2AC0E4D8_CallerCancelState;              // 0x10(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x18(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_6215[0x7];                                     // Fixing Size After Last Property 
	class UConcurrency_task*                     RetVal;                                            // 0x20(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// 0x2 (0x2 - 0x0)
// Function CompanionAI.CompanionAI_ping_component._L_2fFortnite_2ecom_2fAI_2fCompanionAI_2ffort__ping__interface_N_RIsAttackCommandEnabled
struct UCompanionAI_ping_component__L_2fFortnite_2ecom_2fAI_2fCompanionAI_2ffort__ping__interface_N_RIsAttackCommandEnabled_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        RetVal : 1;                                        // Mask: 0x1, PropSize: 0x10x1(0x1)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash)
};

// 0x48 (0x48 - 0x0)
// Function CompanionAI.CompanionAI_ping_component._L_2fFortnite_2ecom_2fAI_2fCompanionAI_2ffort__ping__interface_N_RGetCurrentNPCCommand
struct UCompanionAI_ping_component__L_2fFortnite_2ecom_2fAI_2fCompanionAI_2ffort__ping__interface_N_RGetCurrentNPCCommand_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_621D[0x7];                                     // Fixing Size After Last Property 
	FOptionalProperty_                           RetVal;                                            // 0x8(0x40)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor)
};

// 0x1 (0x1 - 0x0)
// Function CompanionAI.CompanionAI_ping_component._L_2fFortnite_2ecom_2fAI_2fCompanionAI_2ffort__ping__interface_N_REnableCommandWheel_L_Nlogic_R
struct UCompanionAI_ping_component__L_2fFortnite_2ecom_2fAI_2fCompanionAI_2ffort__ping__interface_N_REnableCommandWheel_L_Nlogic_R_Params
{
public:
	uint8                                        __verse_0xB2CDDD72_Argument : 1;                   // Mask: 0x1, PropSize: 0x10x0(0x1)(Parm, NoDestructor, HasGetValueTypeHash)
};

// 0x1 (0x1 - 0x0)
// Function CompanionAI.CompanionAI_ping_component._L_2fFortnite_2ecom_2fAI_2fCompanionAI_2ffort__ping__interface_N_RDeclineNPCCommand_L_Nlogic_R
struct UCompanionAI_ping_component__L_2fFortnite_2ecom_2fAI_2fCompanionAI_2ffort__ping__interface_N_RDeclineNPCCommand_L_Nlogic_R_Params
{
public:
	uint8                                        __verse_0xB2CDDD72_Argument : 1;                   // Mask: 0x1, PropSize: 0x10x0(0x1)(Parm, NoDestructor, HasGetValueTypeHash)
};

// 0x10 (0x10 - 0x0)
// Function CompanionAI.CompanionAI_ping_component._L_2fFortnite_2ecom_2fAI_2fCompanionAI_2ffort__ping__interface_N_RConvertedEvent
struct UCompanionAI_ping_component__L_2fFortnite_2ecom_2fAI_2fCompanionAI_2ffort__ping__interface_N_RConvertedEvent_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_622F[0x7];                                     // Fixing Size After Last Property 
	class UObject*                               RetVal;                                            // 0x8(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function CompanionAI.CompanionAI_ping_component._L_2fFortnite_2ecom_2fAI_2fCompanionAI_2ffort__ping__interface_N_RConvertPingToAttack_L_Nagent_R
struct UCompanionAI_ping_component__L_2fFortnite_2ecom_2fAI_2fCompanionAI_2ffort__ping__interface_N_RConvertPingToAttack_L_Nagent_R_Params
{
public:
	class USimulation_agent*                     __verse_0xB2CDDD72_Argument;                       // 0x0(0x8)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// 0x2 (0x2 - 0x0)
// Function CompanionAI.CompanionAI_ping_component._L_2fFortnite_2ecom_2fAI_2fCompanionAI_2ffort__ping__interface_N_RCanAcceptPingCommand
struct UCompanionAI_ping_component__L_2fFortnite_2ecom_2fAI_2fCompanionAI_2ffort__ping__interface_N_RCanAcceptPingCommand_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        RetVal : 1;                                        // Mask: 0x1, PropSize: 0x10x1(0x1)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash)
};

// 0x2 (0x2 - 0x0)
// Function CompanionAI.CompanionAI_ping_component._L_2fFortnite_2ecom_2fAI_2fCompanionAI_2ffort__ping__interface_N_RAreNPCCommandsEnabled
struct UCompanionAI_ping_component__L_2fFortnite_2ecom_2fAI_2fCompanionAI_2ffort__ping__interface_N_RAreNPCCommandsEnabled_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        RetVal : 1;                                        // Mask: 0x1, PropSize: 0x10x1(0x1)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash)
};

// 0x0 (0x0 - 0x0)
// Function CompanionAI.CompanionAI_ping_component.$InitInstance
struct UCompanionAI_ping_component__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function CompanionAI.CompanionAI_ping_component.$Block
struct UCompanionAI_ping_component__Block_Params
{
public:
};

// 0x40 (0x40 - 0x0)
// Function CompanionAI.CompanionAI_ping_component.$InitCDO
struct UCompanionAI_ping_component__InitCDO_Params
{
public:
	class UVerseEngine_multicast_delegate*       _ExprResult_0;                                     // 0x0(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                       _InstancingGraph_1;                                // 0x8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerseEngine_multicast_delegate*       _ExprResult_2;                                     // 0x10(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                       _InstancingGraph_3;                                // 0x18(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerseEngine_multicast_delegate*       _ExprResult_4;                                     // 0x20(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                       _InstancingGraph_5;                                // 0x28(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerseEngine_multicast_delegate*       _ExprResult_6;                                     // 0x30(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                       _InstancingGraph_7;                                // 0x38(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x18 (0x18 - 0x0)
// Function CompanionAI.task_CompanionAI_companion_ai$OnBegin.Update
struct UTask_CompanionAI_companion_ai_OnBegin_Update_Params
{
public:
	int64                                        RetVal;                                            // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint64                                       _InstancingGraph_62;                               // 0x8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint64                                       _InstancingGraph_139;                              // 0x10(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function CompanionAI.task_CompanionAI_companion_ai_runtime$CheckForReviveTeamMembers_L_Nping__info_R.Update
struct UTask_CompanionAI_companion_ai_runtime_CheckForReviveTeamMembers_L_Nping__info_R_Update_Params
{
public:
	int64                                        RetVal;                                            // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function CompanionAI.task_CompanionAI_companion_ai_runtime$CrouchService.Update
struct UTask_CompanionAI_companion_ai_runtime_CrouchService_Update_Params
{
public:
	int64                                        RetVal;                                            // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function CompanionAI.task_CompanionAI_companion_ai_runtime$CrouchUntilHit.Update
struct UTask_CompanionAI_companion_ai_runtime_CrouchUntilHit_Update_Params
{
public:
	int64                                        RetVal;                                            // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function CompanionAI.task_CompanionAI_companion_ai_runtime$DrawSphere_L_Nvector3_M_Nfloat_M_Ncolor_R.Update
struct UTask_CompanionAI_companion_ai_runtime_DrawSphere_L_Nvector3_M_Nfloat_M_Ncolor_R_Update_Params
{
public:
	int64                                        RetVal;                                            // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function CompanionAI.task_CompanionAI_companion_ai_runtime$GameLoop.Update
struct UTask_CompanionAI_companion_ai_runtime_GameLoop_Update_Params
{
public:
	int64                                        RetVal;                                            // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function CompanionAI.task_CompanionAI_companion_ai_runtime$GetAttackCommandTarget_L_Nping__info_R.Update
struct UTask_CompanionAI_companion_ai_runtime_GetAttackCommandTarget_L_Nping__info_R_Update_Params
{
public:
	int64                                        RetVal;                                            // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function CompanionAI.task_CompanionAI_companion_ai_runtime$GetNewObstacle.Update
struct UTask_CompanionAI_companion_ai_runtime_GetNewObstacle_Update_Params
{
public:
	int64                                        RetVal;                                            // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function CompanionAI.task_CompanionAI_companion_ai_runtime$GetNewTargetPerception.Update
struct UTask_CompanionAI_companion_ai_runtime_GetNewTargetPerception_Update_Params
{
public:
	int64                                        RetVal;                                            // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function CompanionAI.task_CompanionAI_companion_ai_runtime$GetNewThreat.Update
struct UTask_CompanionAI_companion_ai_runtime_GetNewThreat_Update_Params
{
public:
	int64                                        RetVal;                                            // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function CompanionAI.task_CompanionAI_companion_ai_runtime$GetObstacle.Update
struct UTask_CompanionAI_companion_ai_runtime_GetObstacle_Update_Params
{
public:
	int64                                        RetVal;                                            // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function CompanionAI.task_CompanionAI_companion_ai_runtime$GetThreat.Update
struct UTask_CompanionAI_companion_ai_runtime_GetThreat_Update_Params
{
public:
	int64                                        RetVal;                                            // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function CompanionAI.task_CompanionAI_companion_ai_runtime$GoToAndAttackTask_L_Nfort__threat__info_R.Update
struct UTask_CompanionAI_companion_ai_runtime_GoToAndAttackTask_L_Nfort__threat__info_R_Update_Params
{
public:
	int64                                        RetVal;                                            // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x28 (0x28 - 0x0)
// Function CompanionAI.task_CompanionAI_companion_ai_runtime$GoToPositionTask_L_Nvector3_M_N_Qagent_M_Nlogic_M_N_QReachRadius_Nfloat_20_3d_20_2e_2e_2e_M_N_QAllowPartialPath_Nlogic_20_3d_20_2e_2e_2e_R.Update
struct UTask_CompanionAI_companion_ai_runtime_GoToPositionTask_L_Nvector3_M_N_Qagent_M_Nlogic_M_N_QReachRadius_Nfloat_20_3d_20_2e_2e_2e_M_N_QAllowPartialPath_Nlogic_20_3d_20_2e_2e_2e_R_Update_Params
{
public:
	int64                                        RetVal;                                            // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint64                                       _InstancingGraph_34;                               // 0x8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint64                                       _InstancingGraph_49;                               // 0x10(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint64                                       _InstancingGraph_98;                               // 0x18(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint64                                       _InstancingGraph_113;                              // 0x20(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function CompanionAI.task_CompanionAI_companion_ai_runtime$HandleBackToMeCommand_L_Nping__info_R.Update
struct UTask_CompanionAI_companion_ai_runtime_HandleBackToMeCommand_L_Nping__info_R_Update_Params
{
public:
	int64                                        RetVal;                                            // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function CompanionAI.task_CompanionAI_companion_ai_runtime$HandleGoTo_L_Nping__info_R.Update
struct UTask_CompanionAI_companion_ai_runtime_HandleGoTo_L_Nping__info_R_Update_Params
{
public:
	int64                                        RetVal;                                            // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function CompanionAI.task_CompanionAI_companion_ai_runtime$HandleGoToCommand_L_Nping__info_R.Update
struct UTask_CompanionAI_companion_ai_runtime_HandleGoToCommand_L_Nping__info_R_Update_Params
{
public:
	int64                                        RetVal;                                            // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function CompanionAI.task_CompanionAI_companion_ai_runtime$HandleHoldPositionCommand_L_Nping__info_R.Update
struct UTask_CompanionAI_companion_ai_runtime_HandleHoldPositionCommand_L_Nping__info_R_Update_Params
{
public:
	int64                                        RetVal;                                            // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function CompanionAI.task_CompanionAI_companion_ai_runtime$HandleNPCCommand_L_Nping__info_R.Update
struct UTask_CompanionAI_companion_ai_runtime_HandleNPCCommand_L_Nping__info_R_Update_Params
{
public:
	int64                                        RetVal;                                            // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function CompanionAI.task_CompanionAI_companion_ai_runtime$HandleObstacleService_L_N_Qentity_R.Update
struct UTask_CompanionAI_companion_ai_runtime_HandleObstacleService_L_N_Qentity_R_Update_Params
{
public:
	int64                                        RetVal;                                            // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function CompanionAI.task_CompanionAI_companion_ai_runtime$HandleReviveCommand_L_Nping__info_R.Update
struct UTask_CompanionAI_companion_ai_runtime_HandleReviveCommand_L_Nping__info_R_Update_Params
{
public:
	int64                                        RetVal;                                            // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function CompanionAI.task_CompanionAI_companion_ai_runtime$LookAroundTask_L_Nvector3_M_Nfloat_M_Nfloat_R.Update
struct UTask_CompanionAI_companion_ai_runtime_LookAroundTask_L_Nvector3_M_Nfloat_M_Nfloat_R_Update_Params
{
public:
	int64                                        RetVal;                                            // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function CompanionAI.task_CompanionAI_companion_ai_runtime$LookAtOrAttackTarget.Update
struct UTask_CompanionAI_companion_ai_runtime_LookAtOrAttackTarget_Update_Params
{
public:
	int64                                        RetVal;                                            // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function CompanionAI.task_CompanionAI_companion_ai_runtime$LookAtThreatTask.Update
struct UTask_CompanionAI_companion_ai_runtime_LookAtThreatTask_Update_Params
{
public:
	int64                                        RetVal;                                            // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function CompanionAI.task_CompanionAI_companion_ai_runtime$ReviveCommand_L_Nagent_R.Update
struct UTask_CompanionAI_companion_ai_runtime_ReviveCommand_L_Nagent_R_Update_Params
{
public:
	int64                                        RetVal;                                            // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function CompanionAI.task_CompanionAI_companion_ai_runtime$SetLeashPosition_L_Nvector3_M_Nfloat_M_Nagent_R.Update
struct UTask_CompanionAI_companion_ai_runtime_SetLeashPosition_L_Nvector3_M_Nfloat_M_Nagent_R_Update_Params
{
public:
	int64                                        RetVal;                                            // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function CompanionAI.task_CompanionAI_companion_ai_runtime$ShootTargetService_L_Nfloat_R.Update
struct UTask_CompanionAI_companion_ai_runtime_ShootTargetService_L_Nfloat_R_Update_Params
{
public:
	int64                                        RetVal;                                            // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function CompanionAI.task_CompanionAI_companion_ai_runtime$SprintService.Update
struct UTask_CompanionAI_companion_ai_runtime_SprintService_Update_Params
{
public:
	int64                                        RetVal;                                            // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function CompanionAI.task_CompanionAI_companion_ai_runtime$TacticalSprintService.Update
struct UTask_CompanionAI_companion_ai_runtime_TacticalSprintService_Update_Params
{
public:
	int64                                        RetVal;                                            // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function CompanionAI.task_CompanionAI_companion_ai_runtime$WaitForDamageService.Update
struct UTask_CompanionAI_companion_ai_runtime_WaitForDamageService_Update_Params
{
public:
	int64                                        RetVal;                                            // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function CompanionAI.task_CompanionAI_companion_ai_runtime$WaitForTargetInVehicleService_L_Nfort__character_R.Update
struct UTask_CompanionAI_companion_ai_runtime_WaitForTargetInVehicleService_L_Nfort__character_R_Update_Params
{
public:
	int64                                        RetVal;                                            // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function CompanionAI.task_CompanionAI_companion_ai_runtime$WaitForTargetMovementService_L_Nfort__character_M_Nfloat_R.Update
struct UTask_CompanionAI_companion_ai_runtime_WaitForTargetMovementService_L_Nfort__character_M_Nfloat_R_Update_Params
{
public:
	int64                                        RetVal;                                            // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function CompanionAI.task_CompanionAI_companion_creature$DrawSphere_L_Nvector3_M_Nfloat_M_Ncolor_R.Update
struct UTask_CompanionAI_companion_creature_DrawSphere_L_Nvector3_M_Nfloat_M_Ncolor_R_Update_Params
{
public:
	int64                                        RetVal;                                            // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x18 (0x18 - 0x0)
// Function CompanionAI.task_CompanionAI_companion_creature$OnBegin.Update
struct UTask_CompanionAI_companion_creature_OnBegin_Update_Params
{
public:
	int64                                        RetVal;                                            // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint64                                       _InstancingGraph_29;                               // 0x8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint64                                       _InstancingGraph_93;                               // 0x10(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function CompanionAI.task_CompanionAI_companion_creature_runtime$ActivateAbilityWhenCloseEnough_L_Nagent_M_Ngameplay__ability__asset_M_Nfloat_M_Nfloat_R.Update
struct UTask_CompanionAI_companion_creature_runtime_ActivateAbilityWhenCloseEnough_L_Nagent_M_Ngameplay__ability__asset_M_Nfloat_M_Nfloat_R_Update_Params
{
public:
	int64                                        RetVal;                                            // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function CompanionAI.task_CompanionAI_companion_creature_runtime$DetectMovement_L_Nvector3_M_Nagent_M_Nfloat_R.Update
struct UTask_CompanionAI_companion_creature_runtime_DetectMovement_L_Nvector3_M_Nagent_M_Nfloat_R_Update_Params
{
public:
	int64                                        RetVal;                                            // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function CompanionAI.task_CompanionAI_companion_creature_runtime$DetectNewTarget.Update
struct UTask_CompanionAI_companion_creature_runtime_DetectNewTarget_Update_Params
{
public:
	int64                                        RetVal;                                            // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function CompanionAI.task_CompanionAI_companion_creature_runtime$EngageTarget_L_Nagent_M_Ngameplay__ability__asset_R.Update
struct UTask_CompanionAI_companion_creature_runtime_EngageTarget_L_Nagent_M_Ngameplay__ability__asset_R_Update_Params
{
public:
	int64                                        RetVal;                                            // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function CompanionAI.task_CompanionAI_companion_creature_runtime$FaceLKP_L_Nagent_M_Nfloat_R.Update
struct UTask_CompanionAI_companion_creature_runtime_FaceLKP_L_Nagent_M_Nfloat_R_Update_Params
{
public:
	int64                                        RetVal;                                            // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function CompanionAI.task_CompanionAI_companion_creature_runtime$GameLoop.Update
struct UTask_CompanionAI_companion_creature_runtime_GameLoop_Update_Params
{
public:
	int64                                        RetVal;                                            // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function CompanionAI.task_CompanionAI_companion_creature_runtime$Howl.Update
struct UTask_CompanionAI_companion_creature_runtime_Howl_Update_Params
{
public:
	int64                                        RetVal;                                            // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x48 (0x48 - 0x0)
// Function CompanionAI.task_CompanionAI_companion_creature_runtime$PatrolAround.Update
struct UTask_CompanionAI_companion_creature_runtime_PatrolAround_Update_Params
{
public:
	int64                                        RetVal;                                            // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint64                                       _InstancingGraph_6;                                // 0x8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint64                                       _InstancingGraph_23;                               // 0x10(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint64                                       _InstancingGraph_39;                               // 0x18(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint64                                       _InstancingGraph_55;                               // 0x20(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint64                                       _InstancingGraph_75;                               // 0x28(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint64                                       _InstancingGraph_92;                               // 0x30(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint64                                       _InstancingGraph_108;                              // 0x38(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint64                                       _InstancingGraph_124;                              // 0x40(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x18 (0x18 - 0x0)
// Function CompanionAI.task_CompanionAI_companion_creature_runtime$SeekLKP_L_Nagent_M_Nfloat_R.Update
struct UTask_CompanionAI_companion_creature_runtime_SeekLKP_L_Nagent_M_Nfloat_R_Update_Params
{
public:
	int64                                        RetVal;                                            // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint64                                       _InstancingGraph_24;                               // 0x8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint64                                       _InstancingGraph_61;                               // 0x10(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function CompanionAI.task_CompanionAI_default_ai_behavior$OnBegin.Update
struct UTask_CompanionAI_default_ai_behavior_OnBegin_Update_Params
{
public:
	int64                                        RetVal;                                            // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function CompanionAI.task_CompanionAI_fort_br_character_actions_interface$RunDefaultBehavior.Update
struct UTask_CompanionAI_fort_br_character_actions_interface_RunDefaultBehavior_Update_Params
{
public:
	int64                                        RetVal;                                            // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function CompanionAI.task_CompanionAI_fort_br_creature_actions_interface$RunDefaultBehavior.Update
struct UTask_CompanionAI_fort_br_creature_actions_interface_RunDefaultBehavior_Update_Params
{
public:
	int64                                        RetVal;                                            // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function CompanionAI.task_CompanionAI_fort_creature_component$RunDefaultBehavior.Update
struct UTask_CompanionAI_fort_creature_component_RunDefaultBehavior_Update_Params
{
public:
	int64                                        RetVal;                                            // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function CompanionAI.task_CompanionAI_fort_npc_component$RunDefaultBehavior.Update
struct UTask_CompanionAI_fort_npc_component_RunDefaultBehavior_Update_Params
{
public:
	int64                                        RetVal;                                            // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function CompanionAI.task_CompanionAI_fort_ping_interface$OnNPCCommand.Update
struct UTask_CompanionAI_fort_ping_interface_OnNPCCommand_Update_Params
{
public:
	int64                                        RetVal;                                            // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function CompanionAI.task_CompanionAI_ping_component$OnNPCCommand.Update
struct UTask_CompanionAI_ping_component_OnNPCCommand_Update_Params
{
public:
	int64                                        RetVal;                                            // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}
}


