#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x0 (0x28 - 0x28)
// VerseClass CompanionAI.$SolarisSignatureFunctionOuter
class U_SolarisSignatureFunctionOuter : public UObject
{
public:

	static class UClass* StaticClass();
	static class U_SolarisSignatureFunctionOuter* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// VerseClass CompanionAI.CompanionAI
class UCompanionAI : public UObject
{
public:

	static class UClass* StaticClass();
	static class UCompanionAI* GetDefaultObj();

	FOptionalProperty_ _L_2fFortnite_2ecom_2fAI_2fCompanionAI_N_Roperator_U_2eIsBeingDBNOCarried_U_L_Nfort__character_M_Ntuple_L_R_M_Ntuple_L_R_R(const struct FTuple_Lfort__character_Mtuple_L_R_Mtuple_L_R_R& __verse_0xB2CDDD72_Argument);
	TArray<class USimulation_agent*> _L_2fFortnite_2ecom_2fAI_2fCompanionAI_N_Roperator_U_2eGetTeamMembers_U_L_Nagent_M_Ntuple_L_R_M_Ntuple_L_R_R(const struct FTuple_Lagent_Mtuple_L_R_Mtuple_L_R_R& __verse_0xB2CDDD72_Argument);
	struct FTuple_Lfloat_Mfloat_R _L_2fFortnite_2ecom_2fAI_2fCompanionAI_N_Roperator_U_2eGetNPCLeashRadius_U_L_Nfort__character_M_Ntuple_L_R_M_Ntuple_L_R_R(const struct FTuple_Lfort__character_Mtuple_L_R_Mtuple_L_R_R& __verse_0xB2CDDD72_Argument);
	FOptionalProperty_ _L_2fFortnite_2ecom_2fAI_2fCompanionAI_N_Roperator_U_2eGetFortPing_U_L_Nfort__character_M_Ntuple_L_R_M_Ntuple_L_R_R(const struct FTuple_Lfort__character_Mtuple_L_R_Mtuple_L_R_R& __verse_0xB2CDDD72_Argument);
	FOptionalProperty_ _L_2fFortnite_2ecom_2fAI_2fCompanionAI_N_Roperator_U_2eGetFortBRCreatureActions_U_L_Nfort__character_M_Ntuple_L_R_M_Ntuple_L_R_R(const struct FTuple_Lfort__character_Mtuple_L_R_Mtuple_L_R_R& __verse_0xB2CDDD72_Argument);
	FOptionalProperty_ _L_2fFortnite_2ecom_2fAI_2fCompanionAI_N_Roperator_U_2eGetFortBRCharacterActions_U_L_Nfort__character_M_Ntuple_L_R_M_Ntuple_L_R_R(const struct FTuple_Lfort__character_Mtuple_L_R_Mtuple_L_R_R& __verse_0xB2CDDD72_Argument);
	FOptionalProperty_ _L_2fFortnite_2ecom_2fAI_2fCompanionAI_N_Roperator_U_2eGetAgent_U_L_Nentity_M_Ntuple_L_R_M_Ntuple_L_R_R(const struct FTuple_Lentity_Mtuple_L_R_Mtuple_L_R_R& __verse_0xB2CDDD72_Argument);
	FVerseStringProperty_ _L_2fFortnite_2ecom_2fAI_2fCompanionAI_N_RToString_L_Nentity__type_R(enum class ECompanionAI_PingCommand_entity_type __verse_0xB2CDDD72_Argument, FVerseDynamicProperty_ InvokeResultDummy_0, FOptionalProperty_ _ExprResultStack_1, FVerseDynamicProperty_ _ExprResult_2, FVerseDynamicProperty_ _ExprResult_3, FVerseDynamicProperty_ InvokeResultDummy_4, FOptionalProperty_ _ExprResultStack_5, FVerseDynamicProperty_ _ExprResult_6, FVerseDynamicProperty_ _ExprResult_7, FVerseDynamicProperty_ InvokeResultDummy_8, FOptionalProperty_ _ExprResultStack_9, FVerseDynamicProperty_ _ExprResult_10, FVerseDynamicProperty_ _ExprResult_11, FVerseDynamicProperty_ InvokeResultDummy_12, FOptionalProperty_ _ExprResultStack_13, FVerseDynamicProperty_ _ExprResult_14, FVerseDynamicProperty_ _ExprResult_15, FVerseDynamicProperty_ InvokeResultDummy_16, FOptionalProperty_ _ExprResultStack_17, FVerseDynamicProperty_ _ExprResult_18, FVerseDynamicProperty_ _ExprResult_19, FVerseDynamicProperty_ InvokeResultDummy_20, FOptionalProperty_ _ExprResultStack_21, FVerseDynamicProperty_ _ExprResult_22, FVerseDynamicProperty_ _ExprResult_23, FVerseDynamicProperty_ InvokeResultDummy_24, FOptionalProperty_ _ExprResultStack_25, FVerseDynamicProperty_ _ExprResult_26, FVerseDynamicProperty_ _ExprResult_27, FVerseDynamicProperty_ InvokeResultDummy_28, FOptionalProperty_ _ExprResultStack_29, FVerseDynamicProperty_ _ExprResult_30, FVerseDynamicProperty_ _ExprResult_31, FVerseDynamicProperty_ InvokeResultDummy_32, FOptionalProperty_ _ExprResultStack_33, FVerseDynamicProperty_ _ExprResult_34, FVerseDynamicProperty_ _ExprResult_35, FVerseDynamicProperty_ InvokeResultDummy_36, FOptionalProperty_ _ExprResultStack_37, FVerseDynamicProperty_ _ExprResult_38, FVerseDynamicProperty_ _ExprResult_39, FVerseDynamicProperty_ InvokeResultDummy_40, FOptionalProperty_ _ExprResultStack_41, FVerseDynamicProperty_ _ExprResult_42, FVerseDynamicProperty_ _ExprResult_43, FVerseDynamicProperty_ InvokeResultDummy_44, FOptionalProperty_ _ExprResultStack_45, FVerseDynamicProperty_ _ExprResult_46, FVerseDynamicProperty_ _ExprResult_47);
	FVerseStringProperty_ _L_2fFortnite_2ecom_2fAI_2fCompanionAI_N_RToString_L_Ncommand__type_R(enum class ECompanionAI_PingCommand_command_type __verse_0xB2CDDD72_Argument, FVerseDynamicProperty_ InvokeResultDummy_0, FOptionalProperty_ _ExprResultStack_1, FVerseDynamicProperty_ _ExprResult_2, FVerseDynamicProperty_ _ExprResult_3, FVerseDynamicProperty_ InvokeResultDummy_4, FOptionalProperty_ _ExprResultStack_5, FVerseDynamicProperty_ _ExprResult_6, FVerseDynamicProperty_ _ExprResult_7, FVerseDynamicProperty_ InvokeResultDummy_8, FOptionalProperty_ _ExprResultStack_9, FVerseDynamicProperty_ _ExprResult_10, FVerseDynamicProperty_ _ExprResult_11, FVerseDynamicProperty_ InvokeResultDummy_12, FOptionalProperty_ _ExprResultStack_13, FVerseDynamicProperty_ _ExprResult_14, FVerseDynamicProperty_ _ExprResult_15, FVerseDynamicProperty_ InvokeResultDummy_16, FOptionalProperty_ _ExprResultStack_17, FVerseDynamicProperty_ _ExprResult_18, FVerseDynamicProperty_ _ExprResult_19, FVerseDynamicProperty_ InvokeResultDummy_20, FOptionalProperty_ _ExprResultStack_21, FVerseDynamicProperty_ _ExprResult_22, FVerseDynamicProperty_ _ExprResult_23, FVerseDynamicProperty_ InvokeResultDummy_24, FOptionalProperty_ _ExprResultStack_25, FVerseDynamicProperty_ _ExprResult_26, FVerseDynamicProperty_ _ExprResult_27, FVerseDynamicProperty_ InvokeResultDummy_28, FOptionalProperty_ _ExprResultStack_29, FVerseDynamicProperty_ _ExprResult_30, FVerseDynamicProperty_ _ExprResult_31, FVerseDynamicProperty_ InvokeResultDummy_32, FOptionalProperty_ _ExprResultStack_33, FVerseDynamicProperty_ _ExprResult_34, FVerseDynamicProperty_ _ExprResult_35, FVerseDynamicProperty_ InvokeResultDummy_36, FOptionalProperty_ _ExprResultStack_37, FVerseDynamicProperty_ _ExprResult_38, FVerseDynamicProperty_ _ExprResult_39);
	uint8 _L_2fFortnite_2ecom_2fAI_2fCompanionAI_N_RCompare_L_Nfort__obstacle__info_M_Nentity_R(const struct FTuple_Lfort__obstacle__info_Mentity_R& __verse_0xB2CDDD72_Argument);
	struct FCompanionAI_ping_info CompanionAI_ping_info_OverrideFactory(TMap<FVerseStringProperty_, uint8> __verse_0xFB48ED96__InitOverrideMap);
	struct FCompanionAI_ping_info CompanionAI_ping_info_Factory();
	void _InitCDO();
};

// 0x68 (0x148 - 0xE0)
// VerseClass CompanionAI.CompanionAI_companion_ai
class UCompanionAI_companion_ai : public UAI_ai_behavior
{
public:
	class UDiagnostics_log*                      __verse_0xF524C2AC_Logger;                         // 0xE0(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDiagnostics_debug_draw*               __verse_0x8E43B8AF_DebugDraw;                      // 0xE8(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint8                                        __verse_0x4222121E_DebugDisplay : 1;               // Mask: 0x1, PropSize: 0x10xF0(0x1)(InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_3BC : 7;                                    // Fixing Bit-Field Size 
	uint8                                        Pad_6049[0x7];                                     // Fixing Size After Last Property 
	struct FColors_color                         __verse_0x71320F52_DebugScreenColor;               // 0xF8(0x18)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	double                                       __verse_0x2D4D6684_DebugScreenDuration;            // 0x110(0x8)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       __verse_0x5155C58D_GoToLeashDistance;              // 0x118(0x8)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       __verse_0x4D92C49B_GoToAttackTargetDistance;       // 0x120(0x8)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       __verse_0x8D041DAB_HoldPositionLeashDistance;      // 0x128(0x8)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       __verse_0x5EF17E77_BackToMeMovementThreshold;      // 0x130(0x8)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       __verse_0x80F3C16A_ReviveDistance;                 // 0x138(0x8)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       __verse_0x53BD03B7_AttackCommand_TargetProximityRadius; // 0x140(0x8)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	static class UClass* StaticClass();
	static class UCompanionAI_companion_ai* GetDefaultObj();

	class UConcurrency_task* OnBegin(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct FTuple_L_R& __verse_0xB2CDDD72_Argument);
	void _InitInstance();
	void _Block();
	void _InitCDO(class UDiagnostics_log* _ExprResult_0, uint64 _InstancingGraph_1, class UDiagnostics_debug_draw* _ExprResult_2, uint64 _InstancingGraph_3, class UDiagnostics_log* _ExprResult_4, uint64 _InstancingGraph_5, class UDiagnostics_debug_draw* _ExprResult_6, uint64 _InstancingGraph_7);
};

// 0x2A0 (0x2C8 - 0x28)
// VerseClass CompanionAI.CompanionAI_companion_ai_runtime
class UCompanionAI_companion_ai_runtime : public UObject
{
public:
	class UCompanionAI_companion_ai*             __verse_0xF8ADD547_CompanionAIScript;              // 0x28(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UObject*                               __verse_0x963EC691_Character;                      // 0x30(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UObject*                               __verse_0xD2827887_Navigatable;                    // 0x38(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UObject*                               __verse_0x47B0B441_CharacterMovement;              // 0x40(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UObject*                               __verse_0xA4160F11_Leashable;                      // 0x48(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UObject*                               __verse_0x3FE20196_FortPing;                       // 0x50(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UObject*                               __verse_0x03CEBA4E_CharacterActions;               // 0x58(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UObject*                               __verse_0x6F5C8C64_FocusInterface;                 // 0x60(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UObject*                               __verse_0xF161303F_WeaponActions;                  // 0x68(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UObject*                               __verse_0x0F05355D_ThreatPerception;               // 0x70(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UObject*                               __verse_0x00C33D6C_ObstaclePerception;             // 0x78(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UObject*                               __verse_0x27386837_TargetSelection;                // 0x80(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                      __verse_0xCD79BE49_CheckForReviveTeamMembers_L_Nping__info_R; // 0x88(0x10)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                      __verse_0xFD71F6F9_CrouchService;                  // 0x98(0x10)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                      __verse_0x42EEAE4C_CrouchUntilHit;                 // 0xA8(0x10)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                      __verse_0x4611DC7E_DrawSphere_L_Nvector3_M_Nfloat_M_Ncolor_R; // 0xB8(0x10)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                      __verse_0xAAC24BD9_GameLoop;                       // 0xC8(0x10)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                      __verse_0x48CFCF8A_GetAttackCommandTarget_L_Nping__info_R; // 0xD8(0x10)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                      __verse_0x0C45B447_GetNewObstacle;                 // 0xE8(0x10)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                      __verse_0x2E34E338_GetNewTargetPerception;         // 0xF8(0x10)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                      __verse_0x0CD61383_GetNewThreat;                   // 0x108(0x10)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                      __verse_0x8CAF1B4F_GetObstacle;                    // 0x118(0x10)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                      __verse_0x088B6B1E_GetThreat;                      // 0x128(0x10)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                      __verse_0x55602A55_GoToAndAttackTask_L_Nfort__threat__info_R; // 0x138(0x10)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                      __verse_0xD1C3C583_GoToPositionTask_L_Nvector3_M_N_Qagent_M_Nlogic_M_N_QReachRadius_Nfloat_20_3d_20_2e_2e_2e_M_N_QAllowPartialPath_Nlogic_20_3d_20_2e_2e_2e_R; // 0x148(0x10)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                      __verse_0xCDB7A2EB_HandleBackToMeCommand_L_Nping__info_R; // 0x158(0x10)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                      __verse_0xA6BE52A1_HandleGoTo_L_Nping__info_R;     // 0x168(0x10)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                      __verse_0xDA8C4382_HandleGoToCommand_L_Nping__info_R; // 0x178(0x10)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                      __verse_0x732222FF_HandleHoldPositionCommand_L_Nping__info_R; // 0x188(0x10)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                      __verse_0x598CA1A6_HandleNPCCommand_L_Nping__info_R; // 0x198(0x10)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                      __verse_0x78DA6F4F_HandleObstacleService_L_N_Qentity_R; // 0x1A8(0x10)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                      __verse_0x76F49D7B_HandleReviveCommand_L_Nping__info_R; // 0x1B8(0x10)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                      __verse_0x20C82F48__L_2fFortnite_2ecom_2fAI_2fCompanionAI_2fcompanion__ai__runtime_N_RLogAndDisplayOnScreen_L_N_Kchar_R; // 0x1C8(0x10)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                      __verse_0xB0983B50_LookAroundTask_L_Nvector3_M_Nfloat_M_Nfloat_R; // 0x1D8(0x10)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                      __verse_0x62AFAEFE_LookAtOrAttackTarget;           // 0x1E8(0x10)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                      __verse_0x3F6E3D53_LookAtThreatTask;               // 0x1F8(0x10)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                      __verse_0x4E82FBC7__L_2fFortnite_2ecom_2fAI_2fCompanionAI_2fcompanion__ai__runtime_N_ROnConverted; // 0x208(0x10)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                      __verse_0x4F101C14__L_2fFortnite_2ecom_2fAI_2fCompanionAI_2fcompanion__ai__runtime_N_ROnConverted0_L_Nany_R_Nvoid; // 0x218(0x10)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                      __verse_0xC0C030F4__L_2fFortnite_2ecom_2fAI_2fCompanionAI_2fcompanion__ai__runtime_N_ROnUnconverted; // 0x228(0x10)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                      __verse_0x0831C861__L_2fFortnite_2ecom_2fAI_2fCompanionAI_2fcompanion__ai__runtime_N_ROnUnconverted1_L_Nany_R_Nvoid; // 0x238(0x10)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                      __verse_0x46368FA8_ReviveCommand_L_Nagent_R;       // 0x248(0x10)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                      __verse_0x0E35E3BF_SetLeashPosition_L_Nvector3_M_Nfloat_M_Nagent_R; // 0x258(0x10)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                      __verse_0xDBC1E5D6_ShootTargetService_L_Nfloat_R;  // 0x268(0x10)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                      __verse_0xED5B1563_SprintService;                  // 0x278(0x10)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                      __verse_0x10E1DFC8_TacticalSprintService;          // 0x288(0x10)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                      __verse_0x3BF1C327_WaitForDamageService;           // 0x298(0x10)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                      __verse_0x1866443D_WaitForTargetInVehicleService_L_Nfort__character_R; // 0x2A8(0x10)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                      __verse_0xDCDE9DD2_WaitForTargetMovementService_L_Nfort__character_M_Nfloat_R; // 0x2B8(0x10)(InstancedReference, HasGetValueTypeHash)

	static class UClass* StaticClass();
	static class UCompanionAI_companion_ai_runtime* GetDefaultObj();

	class UConcurrency_task* WaitForTargetMovementService_L_Nfort__character_M_Nfloat_R(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct FTuple_Lfort__character_Mfloat_R& __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* WaitForTargetInVehicleService_L_Nfort__character_R(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, class UObject* __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* WaitForDamageService(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct FTuple_L_R& __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* TacticalSprintService(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct FTuple_L_R& __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* SprintService(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct FTuple_L_R& __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* ShootTargetService_L_Nfloat_R(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, double __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* SetLeashPosition_L_Nvector3_M_Nfloat_M_Nagent_R(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct FTuple_Lvector3_Mfloat_Magent_R& __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* ReviveCommand_L_Nagent_R(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, class USimulation_agent* __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fAI_2fCompanionAI_2fcompanion__ai__runtime_N_ROnUnconverted1_L_Nany_R_Nvoid(FVerseDynamicProperty_ __verse_0xB2CDDD72_Argument, enum class EVerseTrue _InvokeSureResultDummy_0, FVerseFunctionProperty_ _Callee_1, const struct FTuple_L_R& _ExprResult_2, enum class EVerseTrue _InvokeSureResultDummy_3, FVerseFunctionProperty_ _Callee_4, const struct FTuple_L_R& _ExprResult_5);
	void _L_2fFortnite_2ecom_2fAI_2fCompanionAI_2fcompanion__ai__runtime_N_ROnUnconverted(const struct FTuple_L_R& __verse_0xB2CDDD72_Argument, class UObject* __verse_0x00000000__1, enum class EVerseTrue _InvokeSureResultDummy_0, FVerseFunctionProperty_ _Callee_1, class UObject* __verse_0x00000000__2, enum class EVerseTrue _InvokeSureResultDummy_2, FVerseFunctionProperty_ _Callee_3);
	void _L_2fFortnite_2ecom_2fAI_2fCompanionAI_2fcompanion__ai__runtime_N_ROnConverted0_L_Nany_R_Nvoid(FVerseDynamicProperty_ __verse_0xB2CDDD72_Argument, enum class EVerseTrue _InvokeSureResultDummy_0, FVerseFunctionProperty_ _Callee_1, const struct FTuple_L_R& _ExprResult_2, enum class EVerseTrue _InvokeSureResultDummy_3, FVerseFunctionProperty_ _Callee_4, const struct FTuple_L_R& _ExprResult_5);
	void _L_2fFortnite_2ecom_2fAI_2fCompanionAI_2fcompanion__ai__runtime_N_ROnConverted(const struct FTuple_L_R& __verse_0xB2CDDD72_Argument, class UObject* __verse_0x00000000__1, enum class EVerseTrue _InvokeSureResultDummy_0, FVerseFunctionProperty_ _Callee_1, class UObject* __verse_0x00000000__2, enum class EVerseTrue _InvokeSureResultDummy_2, FVerseFunctionProperty_ _Callee_3);
	class UConcurrency_task* LookAtThreatTask(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct FTuple_L_R& __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* LookAtOrAttackTarget(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct FTuple_L_R& __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* LookAroundTask_L_Nvector3_M_Nfloat_M_Nfloat_R(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct FTuple_Lvector3_Mfloat_Mfloat_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fAI_2fCompanionAI_2fcompanion__ai__runtime_N_RLogAndDisplayOnScreen_L_N_Kchar_R(FVerseStringProperty_ __verse_0xB2CDDD72_Argument, FOptionalProperty_ _ExprResultStack_0, class UDiagnostics_log* __verse_0x00000000__2, enum class EVerseTrue _InvokeSureResultDummy_1, FVerseFunctionProperty_ _Callee_2, const struct FTuple_L_Kchar_M_QLevel_Nlog__level_20_3d_20_2e_2e_2e_R& _ExprResult_3, FOptionalProperty_ _ExprResult_4, enum class EVerseTrue _InvokeSureResultDummy_5, FVerseFunctionProperty_ _Callee_6, const struct FTuple_L_Kchar_M_QDuration_Nfloat_20_3d_20_2e_2e_2e_M_QColor_Ncolor_20_3d_20_2e_2e_2e_R& _ExprResult_7, const struct FTuple_L_Kchar_M_QColor_Ncolor_M_QDuration_Nfloat_R& __verse_0x00000000__3, FOptionalProperty_ _ExprResult_8, FOptionalProperty_ _ExprResult_9, FVerseStringProperty_ _ExprResultDummy_10, FOptionalProperty_ _ExprResultStack_11, class UDiagnostics_log* __verse_0x00000000__5, enum class EVerseTrue _InvokeSureResultDummy_12, FVerseFunctionProperty_ _Callee_13, const struct FTuple_L_Kchar_M_QLevel_Nlog__level_20_3d_20_2e_2e_2e_R& _ExprResult_14, FOptionalProperty_ _ExprResult_15, enum class EVerseTrue _InvokeSureResultDummy_16, FVerseFunctionProperty_ _Callee_17, const struct FTuple_L_Kchar_M_QDuration_Nfloat_20_3d_20_2e_2e_2e_M_QColor_Ncolor_20_3d_20_2e_2e_2e_R& _ExprResult_18, const struct FTuple_L_Kchar_M_QColor_Ncolor_M_QDuration_Nfloat_R& __verse_0x00000000__6, FOptionalProperty_ _ExprResult_19, FOptionalProperty_ _ExprResult_20, FVerseStringProperty_ _ExprResultDummy_21);
	class UConcurrency_task* HandleReviveCommand_L_Nping__info_R(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct FCompanionAI_ping_info& __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* HandleObstacleService_L_N_Qentity_R(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, FOptionalProperty_ __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* HandleNPCCommand_L_Nping__info_R(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct FCompanionAI_ping_info& __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* HandleHoldPositionCommand_L_Nping__info_R(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct FCompanionAI_ping_info& __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* HandleGoToCommand_L_Nping__info_R(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct FCompanionAI_ping_info& __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* HandleGoTo_L_Nping__info_R(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct FCompanionAI_ping_info& __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* HandleBackToMeCommand_L_Nping__info_R(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct FCompanionAI_ping_info& __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* GoToPositionTask_L_Nvector3_M_N_Qagent_M_Nlogic_M_N_QReachRadius_Nfloat_20_3d_20_2e_2e_2e_M_N_QAllowPartialPath_Nlogic_20_3d_20_2e_2e_2e_R(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct FTuple_Lvector3_M_Qagent_Mlogic_M_QReachRadius_Nfloat_20_3d_20_2e_2e_2e_M_QAllowPartialPath_Nlogic_20_3d_20_2e_2e_2e_R& __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* GoToAndAttackTask_L_Nfort__threat__info_R(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct FAI_fort_threat_info& __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* GetThreat(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct FTuple_L_R& __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* GetObstacle(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct FTuple_L_R& __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* GetNewThreat(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct FTuple_L_R& __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* GetNewTargetPerception(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct FTuple_L_R& __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* GetNewObstacle(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct FTuple_L_R& __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* GetAttackCommandTarget_L_Nping__info_R(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct FCompanionAI_ping_info& __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* GameLoop(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct FTuple_L_R& __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* DrawSphere_L_Nvector3_M_Nfloat_M_Ncolor_R(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct FTuple_Lvector3_Mfloat_Mcolor_R& __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* CrouchUntilHit(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct FTuple_L_R& __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* CrouchService(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct FTuple_L_R& __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* CheckForReviveTeamMembers_L_Nping__info_R(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct FCompanionAI_ping_info& __verse_0xB2CDDD72_Argument);
	void _InitInstance();
	void _Block();
	void _InitCDO();
};

// 0x60 (0x140 - 0xE0)
// VerseClass CompanionAI.CompanionAI_companion_creature
class UCompanionAI_companion_creature : public UAI_ai_behavior
{
public:
	class UDiagnostics_log*                      __verse_0xF524C2AC_Logger;                         // 0xE0(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDiagnostics_debug_draw*               __verse_0x8E43B8AF_DebugDraw;                      // 0xE8(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint8                                        __verse_0x4222121E_DebugDisplay : 1;               // Mask: 0x1, PropSize: 0x10xF0(0x1)(InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_3D0 : 7;                                    // Fixing Bit-Field Size 
	uint8                                        Pad_614F[0x7];                                     // Fixing Size After Last Property 
	struct FColors_color                         __verse_0x71320F52_DebugScreenColor;               // 0xF8(0x18)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	double                                       __verse_0x2D4D6684_DebugScreenDuration;            // 0x110(0x8)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       __verse_0x474367D7_EngageThreatsWithinDistance;    // 0x118(0x8)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                      __verse_0x4611DC7E_DrawSphere_L_Nvector3_M_Nfloat_M_Ncolor_R; // 0x120(0x10)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                      __verse_0xA3816CC6__L_2fFortnite_2ecom_2fAI_2fCompanionAI_2fcompanion__creature_N_RLogAndDisplayOnScreen_L_N_Kchar_R; // 0x130(0x10)(InstancedReference, HasGetValueTypeHash)

	static class UClass* StaticClass();
	static class UCompanionAI_companion_creature* GetDefaultObj();

	class UConcurrency_task* OnBegin(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct FTuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fAI_2fCompanionAI_2fcompanion__creature_N_RLogAndDisplayOnScreen_L_N_Kchar_R(FVerseStringProperty_ __verse_0xB2CDDD72_Argument, FOptionalProperty_ _ExprResultStack_0, class UDiagnostics_log* __verse_0x00000000__2, enum class EVerseTrue _InvokeSureResultDummy_1, FVerseFunctionProperty_ _Callee_2, const struct FTuple_L_Kchar_M_QLevel_Nlog__level_20_3d_20_2e_2e_2e_R& _ExprResult_3, FOptionalProperty_ _ExprResult_4, enum class EVerseTrue _InvokeSureResultDummy_5, FVerseFunctionProperty_ _Callee_6, const struct FTuple_L_Kchar_M_QDuration_Nfloat_20_3d_20_2e_2e_2e_M_QColor_Ncolor_20_3d_20_2e_2e_2e_R& _ExprResult_7, const struct FTuple_L_Kchar_M_QColor_Ncolor_M_QDuration_Nfloat_R& __verse_0x00000000__3, FOptionalProperty_ _ExprResult_8, FOptionalProperty_ _ExprResult_9, FVerseStringProperty_ _ExprResultDummy_10, FOptionalProperty_ _ExprResultStack_11, class UDiagnostics_log* __verse_0x00000000__5, enum class EVerseTrue _InvokeSureResultDummy_12, FVerseFunctionProperty_ _Callee_13, const struct FTuple_L_Kchar_M_QLevel_Nlog__level_20_3d_20_2e_2e_2e_R& _ExprResult_14, FOptionalProperty_ _ExprResult_15, enum class EVerseTrue _InvokeSureResultDummy_16, FVerseFunctionProperty_ _Callee_17, const struct FTuple_L_Kchar_M_QDuration_Nfloat_20_3d_20_2e_2e_2e_M_QColor_Ncolor_20_3d_20_2e_2e_2e_R& _ExprResult_18, const struct FTuple_L_Kchar_M_QColor_Ncolor_M_QDuration_Nfloat_R& __verse_0x00000000__6, FOptionalProperty_ _ExprResult_19, FOptionalProperty_ _ExprResult_20, FVerseStringProperty_ _ExprResultDummy_21);
	class UConcurrency_task* DrawSphere_L_Nvector3_M_Nfloat_M_Ncolor_R(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct FTuple_Lvector3_Mfloat_Mcolor_R& __verse_0xB2CDDD72_Argument);
	void _InitInstance();
	void _Block();
	void _InitCDO(class UDiagnostics_log* _ExprResult_0, uint64 _InstancingGraph_1, class UDiagnostics_debug_draw* _ExprResult_2, uint64 _InstancingGraph_3, class UDiagnostics_log* _ExprResult_4, uint64 _InstancingGraph_5, class UDiagnostics_debug_draw* _ExprResult_6, uint64 _InstancingGraph_7);
};

// 0xE8 (0x110 - 0x28)
// VerseClass CompanionAI.CompanionAI_companion_creature_runtime
class UCompanionAI_companion_creature_runtime : public UObject
{
public:
	class UCompanionAI_companion_creature*       __verse_0xF685FDC9_Creature;                       // 0x28(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UObject*                               __verse_0x963EC691_Character;                      // 0x30(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UObject*                               __verse_0xD2827887_Navigatable;                    // 0x38(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGame_Abilities_ability_component*     __verse_0x8FB74E85_AbilitySystemComponent;         // 0x40(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UObject*                               __verse_0xDE2F615F_Perception;                     // 0x48(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UObject*                               __verse_0x8D6253CB_Focus;                          // 0x50(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FOptionalProperty_                           __verse_0xBD80729A_CurrentTarget;                  // 0x58(0x8)(ZeroConstructor, InstancedReference, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                      __verse_0x22D4220B_ActivateAbilityWhenCloseEnough_L_Nagent_M_Ngameplay__ability__asset_M_Nfloat_M_Nfloat_R; // 0x60(0x10)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                      __verse_0xF46B70E4_DetectMovement_L_Nvector3_M_Nagent_M_Nfloat_R; // 0x70(0x10)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                      __verse_0x91032A84_DetectNewTarget;                // 0x80(0x10)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                      __verse_0xF1F2D599_EngageTarget_L_Nagent_M_Ngameplay__ability__asset_R; // 0x90(0x10)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                      __verse_0xA1DFFAE2_FaceLKP_L_Nagent_M_Nfloat_R;    // 0xA0(0x10)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                      __verse_0xAAC24BD9_GameLoop;                       // 0xB0(0x10)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                      __verse_0xAB01753C_Howl;                           // 0xC0(0x10)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                      __verse_0x1D301BDE__L_2fFortnite_2ecom_2fAI_2fCompanionAI_2fcompanion__creature__runtime_N_RIsTargetInRange_L_Nagent_M_Nfloat_R; // 0xD0(0x10)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                      __verse_0x445D2529__L_2fFortnite_2ecom_2fAI_2fCompanionAI_2fcompanion__creature__runtime_N_RLogAndDisplayOnScreen_L_N_Kchar_R; // 0xE0(0x10)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                      __verse_0xC66530C3_PatrolAround;                   // 0xF0(0x10)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                      __verse_0x91E7016C_SeekLKP_L_Nagent_M_Nfloat_R;    // 0x100(0x10)(InstancedReference, HasGetValueTypeHash)

	static class UClass* StaticClass();
	static class UCompanionAI_companion_creature_runtime* GetDefaultObj();

	class UConcurrency_task* SeekLKP_L_Nagent_M_Nfloat_R(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct FTuple_Lagent_Mfloat_R& __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* PatrolAround(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct FTuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fAI_2fCompanionAI_2fcompanion__creature__runtime_N_RLogAndDisplayOnScreen_L_N_Kchar_R(FVerseStringProperty_ __verse_0xB2CDDD72_Argument, class UCompanionAI_companion_creature* __verse_0x00000000__1, enum class EVerseTrue _InvokeSureResultDummy_0, FVerseFunctionProperty_ _Callee_1, class UCompanionAI_companion_creature* __verse_0x00000000__2, enum class EVerseTrue _InvokeSureResultDummy_2, FVerseFunctionProperty_ _Callee_3);
	FOptionalProperty_ _L_2fFortnite_2ecom_2fAI_2fCompanionAI_2fcompanion__creature__runtime_N_RIsTargetInRange_L_Nagent_M_Nfloat_R(const struct FTuple_Lagent_Mfloat_R& __verse_0xB2CDDD72_Argument, uint8 _ExprResult_0, const struct FSpatialMath_vector3& __verse_0x4550A2D9_MyPosition_2, const struct FSpatialMath_transform& _ExprResult_1, class UObject* __verse_0x00000000__3, FVerseFunctionProperty_ _Callee_2, const struct FTuple_L_R& _ExprResult_3, const struct FAI_fort_threat_info& __verse_0x08287148_Snapshot_4, class UObject* __verse_0x00000000__5, FOptionalProperty_ _ExprResultStack_4, FVerseFunctionProperty_ _Callee_5, double __verse_0x47C7BD3D_DistanceToLKP_4, FVerseFunctionProperty_ _Callee_6, const struct FTuple_Lvector3_Mvector3_R& _ExprResult_7, FOptionalProperty_ _ExprResultStack_8, uint8 _ExprResult_9, const struct FSpatialMath_vector3& __verse_0x4550A2D9_MyPosition_8, const struct FSpatialMath_transform& _ExprResult_10, class UObject* __verse_0x00000000__9, FVerseFunctionProperty_ _Callee_11, const struct FTuple_L_R& _ExprResult_12, const struct FAI_fort_threat_info& __verse_0x08287148_Snapshot_10, class UObject* __verse_0x00000000__11, FOptionalProperty_ _ExprResultStack_13, FVerseFunctionProperty_ _Callee_14, double __verse_0x47C7BD3D_DistanceToLKP_10, FVerseFunctionProperty_ _Callee_15, const struct FTuple_Lvector3_Mvector3_R& _ExprResult_16, FOptionalProperty_ _ExprResultStack_17);
	class UConcurrency_task* Howl(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct FTuple_L_R& __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* GameLoop(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct FTuple_L_R& __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* FaceLKP_L_Nagent_M_Nfloat_R(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct FTuple_Lagent_Mfloat_R& __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* EngageTarget_L_Nagent_M_Ngameplay__ability__asset_R(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct FTuple_Lagent_Mgameplay__ability__asset_R& __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* DetectNewTarget(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct FTuple_L_R& __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* DetectMovement_L_Nvector3_M_Nagent_M_Nfloat_R(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct FTuple_Lvector3_Magent_Mfloat_R& __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* ActivateAbilityWhenCloseEnough_L_Nagent_M_Ngameplay__ability__asset_M_Nfloat_M_Nfloat_R(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct FTuple_Lagent_Mgameplay__ability__asset_Mfloat_Mfloat_R& __verse_0xB2CDDD72_Argument);
	void _InitInstance();
	void _Block();
	void _InitCDO(FOptionalProperty_ _ExprResult_0, FOptionalProperty_ __verse_0x00000000__1, uint8 _ExprResult_1, FOptionalProperty_ _ExprResultStack_2, FOptionalProperty_ _ExprResult_3, FOptionalProperty_ __verse_0x00000000__3, uint8 _ExprResult_4, FOptionalProperty_ _ExprResultStack_5);
};

// 0x0 (0xE0 - 0xE0)
// VerseClass CompanionAI.CompanionAI_default_ai_behavior
class UCompanionAI_default_ai_behavior : public UAI_ai_behavior
{
public:

	static class UClass* StaticClass();
	static class UCompanionAI_default_ai_behavior* GetDefaultObj();

	class UConcurrency_task* OnBegin(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct FTuple_L_R& __verse_0xB2CDDD72_Argument);
	void _InitInstance();
	void _Block();
	void _InitCDO();
};

// 0x0 (0x28 - 0x28)
// VerseClass CompanionAI.CompanionAI_fort_br_character_actions_interface
class UCompanionAI_fort_br_character_actions_interface : public UObject
{
public:

	static class UClass* StaticClass();
	static class UCompanionAI_fort_br_character_actions_interface* GetDefaultObj();

	class UConcurrency_task* RunDefaultBehavior(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct FTuple_L_R& __verse_0xB2CDDD72_Argument);
	uint8 _L_2fFortnite_2ecom_2fAI_2fCompanionAI_2ffort__br__character__actions__interface_N_RIsFollowingBehaviorEnabled(const struct FTuple_L_R& __verse_0xB2CDDD72_Argument);
};

// 0x0 (0x28 - 0x28)
// VerseClass CompanionAI.CompanionAI_fort_br_creature_actions_interface
class UCompanionAI_fort_br_creature_actions_interface : public UObject
{
public:

	static class UClass* StaticClass();
	static class UCompanionAI_fort_br_creature_actions_interface* GetDefaultObj();

	class UConcurrency_task* RunDefaultBehavior(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct FTuple_L_R& __verse_0xB2CDDD72_Argument);
};

// 0x10 (0x140 - 0x130)
// VerseClass CompanionAI.CompanionAI_fort_creature_component
class UCompanionAI_fort_creature_component : public UVerseCreature_creature_component
{
public:
	FVerseFunctionProperty_                      __verse_0xECDDAB04_RunDefaultBehavior;             // 0x130(0x10)(InstancedReference, HasGetValueTypeHash)

	static class UClass* StaticClass();
	static class UCompanionAI_fort_creature_component* GetDefaultObj();

	class UConcurrency_task* RunDefaultBehavior(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct FTuple_L_R& __verse_0xB2CDDD72_Argument);
	void _InitInstance();
	void _Block();
	void _InitCDO();
};

// 0x20 (0x240 - 0x220)
// VerseClass CompanionAI.CompanionAI_fort_npc_component
class UCompanionAI_fort_npc_component : public UVerseNPC_npc_component
{
public:
	FVerseFunctionProperty_                      __verse_0xECDDAB04_RunDefaultBehavior;             // 0x220(0x10)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                      __verse_0x290D45C4__L_2fFortnite_2ecom_2fAI_2fCompanionAI_2ffort__br__character__actions__interface_N_RIsFollowingBehaviorEnabled; // 0x230(0x10)(InstancedReference, HasGetValueTypeHash)

	static class UClass* StaticClass();
	static class UCompanionAI_fort_npc_component* GetDefaultObj();

	class UConcurrency_task* RunDefaultBehavior(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct FTuple_L_R& __verse_0xB2CDDD72_Argument);
	uint8 _L_2fFortnite_2ecom_2fAI_2fCompanionAI_2ffort__br__character__actions__interface_N_RIsFollowingBehaviorEnabled(const struct FTuple_L_R& __verse_0xB2CDDD72_Argument);
	void _InitInstance();
	void _Block();
	void _InitCDO();
};

// 0x0 (0x28 - 0x28)
// VerseClass CompanionAI.CompanionAI_fort_ping_interface
class UCompanionAI_fort_ping_interface : public UObject
{
public:

	static class UClass* StaticClass();
	static class UCompanionAI_fort_ping_interface* GetDefaultObj();

	class UObject* _L_2fFortnite_2ecom_2fAI_2fCompanionAI_2ffort__ping__interface_N_RUnconvertedEvent(const struct FTuple_L_R& __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* OnNPCCommand(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct FTuple_L_R& __verse_0xB2CDDD72_Argument);
	uint8 _L_2fFortnite_2ecom_2fAI_2fCompanionAI_2ffort__ping__interface_N_RIsAttackCommandEnabled(const struct FTuple_L_R& __verse_0xB2CDDD72_Argument);
	FOptionalProperty_ _L_2fFortnite_2ecom_2fAI_2fCompanionAI_2ffort__ping__interface_N_RGetCurrentNPCCommand(const struct FTuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fAI_2fCompanionAI_2ffort__ping__interface_N_REnableCommandWheel_L_Nlogic_R(uint8 __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fAI_2fCompanionAI_2ffort__ping__interface_N_RDeclineNPCCommand_L_Nlogic_R(uint8 __verse_0xB2CDDD72_Argument);
	class UObject* _L_2fFortnite_2ecom_2fAI_2fCompanionAI_2ffort__ping__interface_N_RConvertedEvent(const struct FTuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fAI_2fCompanionAI_2ffort__ping__interface_N_RConvertPingToAttack_L_Nagent_R(class USimulation_agent* __verse_0xB2CDDD72_Argument);
	uint8 _L_2fFortnite_2ecom_2fAI_2fCompanionAI_2ffort__ping__interface_N_RCanAcceptPingCommand(const struct FTuple_L_R& __verse_0xB2CDDD72_Argument);
	uint8 _L_2fFortnite_2ecom_2fAI_2fCompanionAI_2ffort__ping__interface_N_RAreNPCCommandsEnabled(const struct FTuple_L_R& __verse_0xB2CDDD72_Argument);
};

// 0x0 (0x28 - 0x28)
// VerseClass CompanionAI.CompanionAI_log_companion_ai
class UCompanionAI_log_companion_ai : public UDiagnostics_log_channel
{
public:

	static class UClass* StaticClass();
	static class UCompanionAI_log_companion_ai* GetDefaultObj();

	void _InitInstance();
	void _Block();
	void _InitCDO();
};

// 0x0 (0x28 - 0x28)
// VerseClass CompanionAI.CompanionAI_log_companion_creature
class UCompanionAI_log_companion_creature : public UDiagnostics_log_channel
{
public:

	static class UClass* StaticClass();
	static class UCompanionAI_log_companion_creature* GetDefaultObj();

	void _InitInstance();
	void _Block();
	void _InitCDO();
};

// 0xB0 (0x158 - 0xA8)
// VerseClass CompanionAI.CompanionAI_ping_component
class UCompanionAI_ping_component : public UPingComponentBase
{
public:
	FVerseFunctionProperty_                      __verse_0x4A0C11E4__L_2fFortnite_2ecom_2fAI_2fCompanionAI_2ffort__ping__interface_N_RAreNPCCommandsEnabled; // 0xA8(0x10)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                      __verse_0xA07D85E4__L_2fFortnite_2ecom_2fAI_2fCompanionAI_2ffort__ping__interface_N_RCanAcceptPingCommand; // 0xB8(0x10)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                      __verse_0xFCB4C0C9__L_2fFortnite_2ecom_2fAI_2fCompanionAI_2ffort__ping__interface_N_REnableCommandWheel_L_Nlogic_R; // 0xC8(0x10)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                      __verse_0xD6588DA4__L_2fFortnite_2ecom_2fAI_2fCompanionAI_2ffort__ping__interface_N_RGetCurrentNPCCommand; // 0xD8(0x10)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                      __verse_0x68114BBA_OnNPCCommand;                   // 0xE8(0x10)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                      __verse_0xA8918968__L_2fFortnite_2ecom_2fAI_2fCompanionAI_2ffort__ping__interface_N_RDeclineNPCCommand_L_Nlogic_R; // 0xF8(0x10)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                      __verse_0x121A4D52__L_2fFortnite_2ecom_2fAI_2fCompanionAI_2ffort__ping__interface_N_RIsAttackCommandEnabled; // 0x108(0x10)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                      __verse_0xD81F0534__L_2fFortnite_2ecom_2fAI_2fCompanionAI_2ffort__ping__interface_N_RConvertPingToAttack_L_Nagent_R; // 0x118(0x10)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                      __verse_0xC34E89EF__L_2fFortnite_2ecom_2fAI_2fCompanionAI_2ffort__ping__interface_N_RConvertedEvent; // 0x128(0x10)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                      __verse_0x19DD9F60__L_2fFortnite_2ecom_2fAI_2fCompanionAI_2ffort__ping__interface_N_RUnconvertedEvent; // 0x138(0x10)(InstancedReference, HasGetValueTypeHash)
	class UVerseEngine_multicast_delegate*       __verse_0xC18257FD_ConvertedEventInternal;         // 0x148(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerseEngine_multicast_delegate*       __verse_0x0E297686_UnconvertedEventInternal;       // 0x150(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)

	static class UClass* StaticClass();
	static class UCompanionAI_ping_component* GetDefaultObj();

	class UObject* _L_2fFortnite_2ecom_2fAI_2fCompanionAI_2ffort__ping__interface_N_RUnconvertedEvent(const struct FTuple_L_R& __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* OnNPCCommand(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct FTuple_L_R& __verse_0xB2CDDD72_Argument);
	uint8 _L_2fFortnite_2ecom_2fAI_2fCompanionAI_2ffort__ping__interface_N_RIsAttackCommandEnabled(const struct FTuple_L_R& __verse_0xB2CDDD72_Argument);
	FOptionalProperty_ _L_2fFortnite_2ecom_2fAI_2fCompanionAI_2ffort__ping__interface_N_RGetCurrentNPCCommand(const struct FTuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fAI_2fCompanionAI_2ffort__ping__interface_N_REnableCommandWheel_L_Nlogic_R(uint8 __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fAI_2fCompanionAI_2ffort__ping__interface_N_RDeclineNPCCommand_L_Nlogic_R(uint8 __verse_0xB2CDDD72_Argument);
	class UObject* _L_2fFortnite_2ecom_2fAI_2fCompanionAI_2ffort__ping__interface_N_RConvertedEvent(const struct FTuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fAI_2fCompanionAI_2ffort__ping__interface_N_RConvertPingToAttack_L_Nagent_R(class USimulation_agent* __verse_0xB2CDDD72_Argument);
	uint8 _L_2fFortnite_2ecom_2fAI_2fCompanionAI_2ffort__ping__interface_N_RCanAcceptPingCommand(const struct FTuple_L_R& __verse_0xB2CDDD72_Argument);
	uint8 _L_2fFortnite_2ecom_2fAI_2fCompanionAI_2ffort__ping__interface_N_RAreNPCCommandsEnabled(const struct FTuple_L_R& __verse_0xB2CDDD72_Argument);
	void _InitInstance();
	void _Block();
	void _InitCDO(class UVerseEngine_multicast_delegate* _ExprResult_0, uint64 _InstancingGraph_1, class UVerseEngine_multicast_delegate* _ExprResult_2, uint64 _InstancingGraph_3, class UVerseEngine_multicast_delegate* _ExprResult_4, uint64 _InstancingGraph_5, class UVerseEngine_multicast_delegate* _ExprResult_6, uint64 _InstancingGraph_7);
};

// 0x818 (0x958 - 0x140)
// VerseClass CompanionAI.task_CompanionAI_companion_ai$OnBegin
class UTask_CompanionAI_companion_ai_OnBegin : public UConcurrency_task
{
public:
	class UCompanionAI_companion_ai*             _Self;                                             // 0x140(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x148(0x1)(Parm, HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_0;                                // 0x149(0x2)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_6245[0x5];                                     // Fixing Size After Last Property 
	class UDiagnostics_debug_draw*               __verse_0x00000000__3;                             // 0x150(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	enum class EVerseTrue                        _InvokeSureResultDummy_1;                          // 0x158(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_6246[0x7];                                     // Fixing Size After Last Property 
	FVerseFunctionProperty_                      _Callee_2;                                         // 0x160(0x10)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_3;                                     // 0x170(0x1)(HasGetValueTypeHash)
	uint8                                        Pad_6247[0x7];                                     // Fixing Size After Last Property 
	class UObject*                               __verse_0x963EC691_Character_4;                    // 0x178(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_4;                                // 0x180(0x8)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_5;                                         // 0x188(0x10)(HasGetValueTypeHash)
	struct FTuple_Lagent_Mtuple_L_R_Mtuple_L_R_R _ExprResult_6;                                     // 0x198(0xA)(HasGetValueTypeHash)
	uint8                                        Pad_6248[0x6];                                     // Fixing Size After Last Property 
	FOptionalProperty_                           _ExprResultStack_7;                                // 0x1A8(0x8)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_8;                                         // 0x1B0(0x10)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_9;                                     // 0x1C0(0x1)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_10;                                    // 0x1C1(0x1)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_11;                                    // 0x1C2(0x1)(HasGetValueTypeHash)
	uint8                                        Pad_6249[0x5];                                     // Fixing Size After Last Property 
	class UObject*                               __verse_0xD2827887_Navigatable_4;                  // 0x1C8(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_12;                               // 0x1D0(0x8)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_13;                                        // 0x1D8(0x10)(HasGetValueTypeHash)
	struct FTuple_Lfort__character_Mtuple_L_R_Mtuple_L_R_R _ExprResult_14;                                    // 0x1E8(0xA)(HasGetValueTypeHash)
	uint8                                        Pad_624A[0x6];                                     // Fixing Size After Last Property 
	struct FTuple_L_R                            _ExprResult_15;                                    // 0x1F8(0x1)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_16;                                    // 0x1F9(0x1)(HasGetValueTypeHash)
	uint8                                        Pad_624B[0x6];                                     // Fixing Size After Last Property 
	class UObject*                               __verse_0xA4160F11_Leashable_4;                    // 0x200(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_17;                               // 0x208(0x8)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_18;                                        // 0x210(0x10)(HasGetValueTypeHash)
	struct FTuple_Lfort__character_Mtuple_L_R_Mtuple_L_R_R _ExprResult_19;                                    // 0x220(0xA)(HasGetValueTypeHash)
	uint8                                        Pad_624C[0x6];                                     // Fixing Size After Last Property 
	struct FTuple_L_R                            _ExprResult_20;                                    // 0x230(0x1)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_21;                                    // 0x231(0x1)(HasGetValueTypeHash)
	uint8                                        Pad_624D[0x6];                                     // Fixing Size After Last Property 
	class UObject*                               __verse_0x47B0B441_CharacterMovement_4;            // 0x238(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_22;                               // 0x240(0x8)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_23;                                        // 0x248(0x10)(HasGetValueTypeHash)
	struct FTuple_Lfort__character_Mtuple_L_R_Mtuple_L_R_R _ExprResult_24;                                    // 0x258(0xA)(HasGetValueTypeHash)
	uint8                                        Pad_624E[0x6];                                     // Fixing Size After Last Property 
	struct FTuple_L_R                            _ExprResult_25;                                    // 0x268(0x1)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_26;                                    // 0x269(0x1)(HasGetValueTypeHash)
	uint8                                        Pad_624F[0x6];                                     // Fixing Size After Last Property 
	class UObject*                               __verse_0x3FE20196_FortPing_4;                     // 0x270(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_27;                               // 0x278(0x8)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_28;                                        // 0x280(0x10)(HasGetValueTypeHash)
	struct FTuple_Lfort__character_Mtuple_L_R_Mtuple_L_R_R _ExprResult_29;                                    // 0x290(0xA)(HasGetValueTypeHash)
	uint8                                        Pad_6251[0x6];                                     // Fixing Size After Last Property 
	struct FTuple_L_R                            _ExprResult_30;                                    // 0x2A0(0x1)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_31;                                    // 0x2A1(0x1)(HasGetValueTypeHash)
	uint8                                        Pad_6252[0x6];                                     // Fixing Size After Last Property 
	class UObject*                               __verse_0x03CEBA4E_CharacterActions_4;             // 0x2A8(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_32;                               // 0x2B0(0x8)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_33;                                        // 0x2B8(0x10)(HasGetValueTypeHash)
	struct FTuple_Lfort__character_Mtuple_L_R_Mtuple_L_R_R _ExprResult_34;                                    // 0x2C8(0xA)(HasGetValueTypeHash)
	uint8                                        Pad_6253[0x6];                                     // Fixing Size After Last Property 
	struct FTuple_L_R                            _ExprResult_35;                                    // 0x2D8(0x1)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_36;                                    // 0x2D9(0x1)(HasGetValueTypeHash)
	uint8                                        Pad_6254[0x6];                                     // Fixing Size After Last Property 
	class UObject*                               __verse_0xF161303F_WeaponActions_4;                // 0x2E0(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_37;                               // 0x2E8(0x8)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_38;                                        // 0x2F0(0x10)(HasGetValueTypeHash)
	struct FTuple_Lfort__character_Mtuple_L_R_Mtuple_L_R_R _ExprResult_39;                                    // 0x300(0xA)(HasGetValueTypeHash)
	uint8                                        Pad_6255[0x6];                                     // Fixing Size After Last Property 
	struct FTuple_L_R                            _ExprResult_40;                                    // 0x310(0x1)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_41;                                    // 0x311(0x1)(HasGetValueTypeHash)
	uint8                                        Pad_6256[0x6];                                     // Fixing Size After Last Property 
	class UObject*                               __verse_0x0F05355D_ThreatPerception_4;             // 0x318(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_42;                               // 0x320(0x8)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_43;                                        // 0x328(0x10)(HasGetValueTypeHash)
	struct FTuple_Lfort__character_Mtuple_L_R_Mtuple_L_R_R _ExprResult_44;                                    // 0x338(0xA)(HasGetValueTypeHash)
	uint8                                        Pad_6257[0x6];                                     // Fixing Size After Last Property 
	struct FTuple_L_R                            _ExprResult_45;                                    // 0x348(0x1)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_46;                                    // 0x349(0x1)(HasGetValueTypeHash)
	uint8                                        Pad_6258[0x6];                                     // Fixing Size After Last Property 
	class UObject*                               __verse_0x00C33D6C_ObstaclePerception_4;           // 0x350(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_47;                               // 0x358(0x8)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_48;                                        // 0x360(0x10)(HasGetValueTypeHash)
	struct FTuple_Lfort__character_Mtuple_L_R_Mtuple_L_R_R _ExprResult_49;                                    // 0x370(0xA)(HasGetValueTypeHash)
	uint8                                        Pad_6259[0x6];                                     // Fixing Size After Last Property 
	struct FTuple_L_R                            _ExprResult_50;                                    // 0x380(0x1)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_51;                                    // 0x381(0x1)(HasGetValueTypeHash)
	uint8                                        Pad_625A[0x6];                                     // Fixing Size After Last Property 
	class UObject*                               __verse_0x27386837_TargetSelection_4;              // 0x388(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_52;                               // 0x390(0x8)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_53;                                        // 0x398(0x10)(HasGetValueTypeHash)
	struct FTuple_Lfort__character_Mtuple_L_R_Mtuple_L_R_R _ExprResult_54;                                    // 0x3A8(0xA)(HasGetValueTypeHash)
	uint8                                        Pad_625C[0x6];                                     // Fixing Size After Last Property 
	struct FTuple_L_R                            _ExprResult_55;                                    // 0x3B8(0x1)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_56;                                    // 0x3B9(0x1)(HasGetValueTypeHash)
	uint8                                        Pad_625D[0x6];                                     // Fixing Size After Last Property 
	class UObject*                               __verse_0x6F5C8C64_FocusInterface_4;               // 0x3C0(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_57;                               // 0x3C8(0x8)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_58;                                        // 0x3D0(0x10)(HasGetValueTypeHash)
	struct FTuple_Lfort__character_Mtuple_L_R_Mtuple_L_R_R _ExprResult_59;                                    // 0x3E0(0xA)(HasGetValueTypeHash)
	uint8                                        Pad_6260[0x6];                                     // Fixing Size After Last Property 
	struct FTuple_L_R                            _ExprResult_60;                                    // 0x3F0(0x1)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_61;                                    // 0x3F1(0x1)(HasGetValueTypeHash)
	uint8                                        Pad_6261[0x6];                                     // Fixing Size After Last Property 
	class UCompanionAI_companion_ai_runtime*     __verse_0x2B0A024B_CompanionAIRuntime_4;           // 0x3F8(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCompanionAI_companion_ai_runtime*     __verse_0x00000000__5;                             // 0x400(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UConcurrency_task*                     _AsyncTask_63;                                     // 0x408(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _AsyncTaskClass_64;                                // 0x410(0x10)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_65;                                    // 0x420(0x1)(HasGetValueTypeHash)
	uint8                                        Pad_6264[0x7];                                     // Fixing Size After Last Property 
	int64                                        _AsyncResult_66;                                   // 0x428(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                        __verse_0x39263057_WarningMsg_6;                   // 0x430(0x10)(HasGetValueTypeHash)
	class UDiagnostics_log*                      __verse_0x00000000__7;                             // 0x440(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	enum class EVerseTrue                        _InvokeSureResultDummy_67;                         // 0x448(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_6265[0x7];                                     // Fixing Size After Last Property 
	FVerseFunctionProperty_                      _Callee_68;                                        // 0x450(0x10)(HasGetValueTypeHash)
	struct FTuple_L_Kchar_M_QLevel_Nlog__level_20_3d_20_2e_2e_2e_R _ExprResult_69;                                    // 0x460(0x12)(HasGetValueTypeHash)
	uint8                                        Pad_6266[0x6];                                     // Fixing Size After Last Property 
	FOptionalProperty_                           _ExprResult_70;                                    // 0x478(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class EVerseTrue                        _InvokeSureResultDummy_71;                         // 0x47A(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_6267[0x5];                                     // Fixing Size After Last Property 
	FVerseFunctionProperty_                      _Callee_72;                                        // 0x480(0x10)(HasGetValueTypeHash)
	struct FTuple_L_Kchar_M_QDuration_Nfloat_20_3d_20_2e_2e_2e_M_QColor_Ncolor_20_3d_20_2e_2e_2e_R _ExprResult_73;                                    // 0x490(0x40)(HasGetValueTypeHash)
	struct FTuple_L_Kchar_M_QColor_Ncolor_M_QDuration_Nfloat_R __verse_0x00000000__8;                             // 0x4D0(0x40)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_74;                                    // 0x510(0x20)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FOptionalProperty_                           _ExprResult_75;                                    // 0x530(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResultDummy_76;                               // 0x540(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_77;                               // 0x550(0x2)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_6268[0x6];                                     // Fixing Size After Last Property 
	class UDiagnostics_debug_draw*               __verse_0x00000000__11;                            // 0x558(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	enum class EVerseTrue                        _InvokeSureResultDummy_78;                         // 0x560(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_6269[0x7];                                     // Fixing Size After Last Property 
	FVerseFunctionProperty_                      _Callee_79;                                        // 0x568(0x10)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_80;                                    // 0x578(0x1)(HasGetValueTypeHash)
	uint8                                        Pad_626A[0x7];                                     // Fixing Size After Last Property 
	class UObject*                               __verse_0x963EC691_Character_12;                   // 0x580(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_81;                               // 0x588(0x8)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_82;                                        // 0x590(0x10)(HasGetValueTypeHash)
	struct FTuple_Lagent_Mtuple_L_R_Mtuple_L_R_R _ExprResult_83;                                    // 0x5A0(0xA)(HasGetValueTypeHash)
	uint8                                        Pad_626B[0x6];                                     // Fixing Size After Last Property 
	FOptionalProperty_                           _ExprResultStack_84;                               // 0x5B0(0x8)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_85;                                        // 0x5B8(0x10)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_86;                                    // 0x5C8(0x1)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_87;                                    // 0x5C9(0x1)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_88;                                    // 0x5CA(0x1)(HasGetValueTypeHash)
	uint8                                        Pad_626C[0x5];                                     // Fixing Size After Last Property 
	class UObject*                               __verse_0xD2827887_Navigatable_12;                 // 0x5D0(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_89;                               // 0x5D8(0x8)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_90;                                        // 0x5E0(0x10)(HasGetValueTypeHash)
	struct FTuple_Lfort__character_Mtuple_L_R_Mtuple_L_R_R _ExprResult_91;                                    // 0x5F0(0xA)(HasGetValueTypeHash)
	uint8                                        Pad_626D[0x6];                                     // Fixing Size After Last Property 
	struct FTuple_L_R                            _ExprResult_92;                                    // 0x600(0x1)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_93;                                    // 0x601(0x1)(HasGetValueTypeHash)
	uint8                                        Pad_626E[0x6];                                     // Fixing Size After Last Property 
	class UObject*                               __verse_0xA4160F11_Leashable_12;                   // 0x608(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_94;                               // 0x610(0x8)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_95;                                        // 0x618(0x10)(HasGetValueTypeHash)
	struct FTuple_Lfort__character_Mtuple_L_R_Mtuple_L_R_R _ExprResult_96;                                    // 0x628(0xA)(HasGetValueTypeHash)
	uint8                                        Pad_626F[0x6];                                     // Fixing Size After Last Property 
	struct FTuple_L_R                            _ExprResult_97;                                    // 0x638(0x1)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_98;                                    // 0x639(0x1)(HasGetValueTypeHash)
	uint8                                        Pad_6270[0x6];                                     // Fixing Size After Last Property 
	class UObject*                               __verse_0x47B0B441_CharacterMovement_12;           // 0x640(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_99;                               // 0x648(0x8)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_100;                                       // 0x650(0x10)(HasGetValueTypeHash)
	struct FTuple_Lfort__character_Mtuple_L_R_Mtuple_L_R_R _ExprResult_101;                                   // 0x660(0xA)(HasGetValueTypeHash)
	uint8                                        Pad_6271[0x6];                                     // Fixing Size After Last Property 
	struct FTuple_L_R                            _ExprResult_102;                                   // 0x670(0x1)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_103;                                   // 0x671(0x1)(HasGetValueTypeHash)
	uint8                                        Pad_6273[0x6];                                     // Fixing Size After Last Property 
	class UObject*                               __verse_0x3FE20196_FortPing_12;                    // 0x678(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_104;                              // 0x680(0x8)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_105;                                       // 0x688(0x10)(HasGetValueTypeHash)
	struct FTuple_Lfort__character_Mtuple_L_R_Mtuple_L_R_R _ExprResult_106;                                   // 0x698(0xA)(HasGetValueTypeHash)
	uint8                                        Pad_6275[0x6];                                     // Fixing Size After Last Property 
	struct FTuple_L_R                            _ExprResult_107;                                   // 0x6A8(0x1)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_108;                                   // 0x6A9(0x1)(HasGetValueTypeHash)
	uint8                                        Pad_6276[0x6];                                     // Fixing Size After Last Property 
	class UObject*                               __verse_0x03CEBA4E_CharacterActions_12;            // 0x6B0(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_109;                              // 0x6B8(0x8)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_110;                                       // 0x6C0(0x10)(HasGetValueTypeHash)
	struct FTuple_Lfort__character_Mtuple_L_R_Mtuple_L_R_R _ExprResult_111;                                   // 0x6D0(0xA)(HasGetValueTypeHash)
	uint8                                        Pad_6277[0x6];                                     // Fixing Size After Last Property 
	struct FTuple_L_R                            _ExprResult_112;                                   // 0x6E0(0x1)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_113;                                   // 0x6E1(0x1)(HasGetValueTypeHash)
	uint8                                        Pad_6278[0x6];                                     // Fixing Size After Last Property 
	class UObject*                               __verse_0xF161303F_WeaponActions_12;               // 0x6E8(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_114;                              // 0x6F0(0x8)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_115;                                       // 0x6F8(0x10)(HasGetValueTypeHash)
	struct FTuple_Lfort__character_Mtuple_L_R_Mtuple_L_R_R _ExprResult_116;                                   // 0x708(0xA)(HasGetValueTypeHash)
	uint8                                        Pad_6279[0x6];                                     // Fixing Size After Last Property 
	struct FTuple_L_R                            _ExprResult_117;                                   // 0x718(0x1)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_118;                                   // 0x719(0x1)(HasGetValueTypeHash)
	uint8                                        Pad_627A[0x6];                                     // Fixing Size After Last Property 
	class UObject*                               __verse_0x0F05355D_ThreatPerception_12;            // 0x720(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_119;                              // 0x728(0x8)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_120;                                       // 0x730(0x10)(HasGetValueTypeHash)
	struct FTuple_Lfort__character_Mtuple_L_R_Mtuple_L_R_R _ExprResult_121;                                   // 0x740(0xA)(HasGetValueTypeHash)
	uint8                                        Pad_627C[0x6];                                     // Fixing Size After Last Property 
	struct FTuple_L_R                            _ExprResult_122;                                   // 0x750(0x1)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_123;                                   // 0x751(0x1)(HasGetValueTypeHash)
	uint8                                        Pad_627D[0x6];                                     // Fixing Size After Last Property 
	class UObject*                               __verse_0x00C33D6C_ObstaclePerception_12;          // 0x758(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_124;                              // 0x760(0x8)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_125;                                       // 0x768(0x10)(HasGetValueTypeHash)
	struct FTuple_Lfort__character_Mtuple_L_R_Mtuple_L_R_R _ExprResult_126;                                   // 0x778(0xA)(HasGetValueTypeHash)
	uint8                                        Pad_627E[0x6];                                     // Fixing Size After Last Property 
	struct FTuple_L_R                            _ExprResult_127;                                   // 0x788(0x1)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_128;                                   // 0x789(0x1)(HasGetValueTypeHash)
	uint8                                        Pad_627F[0x6];                                     // Fixing Size After Last Property 
	class UObject*                               __verse_0x27386837_TargetSelection_12;             // 0x790(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_129;                              // 0x798(0x8)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_130;                                       // 0x7A0(0x10)(HasGetValueTypeHash)
	struct FTuple_Lfort__character_Mtuple_L_R_Mtuple_L_R_R _ExprResult_131;                                   // 0x7B0(0xA)(HasGetValueTypeHash)
	uint8                                        Pad_6280[0x6];                                     // Fixing Size After Last Property 
	struct FTuple_L_R                            _ExprResult_132;                                   // 0x7C0(0x1)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_133;                                   // 0x7C1(0x1)(HasGetValueTypeHash)
	uint8                                        Pad_6281[0x6];                                     // Fixing Size After Last Property 
	class UObject*                               __verse_0x6F5C8C64_FocusInterface_12;              // 0x7C8(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_134;                              // 0x7D0(0x8)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_135;                                       // 0x7D8(0x10)(HasGetValueTypeHash)
	struct FTuple_Lfort__character_Mtuple_L_R_Mtuple_L_R_R _ExprResult_136;                                   // 0x7E8(0xA)(HasGetValueTypeHash)
	uint8                                        Pad_6282[0x6];                                     // Fixing Size After Last Property 
	struct FTuple_L_R                            _ExprResult_137;                                   // 0x7F8(0x1)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_138;                                   // 0x7F9(0x1)(HasGetValueTypeHash)
	uint8                                        Pad_6283[0x6];                                     // Fixing Size After Last Property 
	class UCompanionAI_companion_ai_runtime*     __verse_0x2B0A024B_CompanionAIRuntime_12;          // 0x800(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCompanionAI_companion_ai_runtime*     __verse_0x00000000__13;                            // 0x808(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UConcurrency_task*                     _AsyncTask_140;                                    // 0x810(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _AsyncTaskClass_141;                               // 0x818(0x10)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_142;                                   // 0x828(0x1)(HasGetValueTypeHash)
	uint8                                        Pad_6284[0x7];                                     // Fixing Size After Last Property 
	int64                                        _AsyncResult_143;                                  // 0x830(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                        __verse_0x39263057_WarningMsg_14;                  // 0x838(0x10)(HasGetValueTypeHash)
	class UDiagnostics_log*                      __verse_0x00000000__15;                            // 0x848(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	enum class EVerseTrue                        _InvokeSureResultDummy_144;                        // 0x850(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_6286[0x7];                                     // Fixing Size After Last Property 
	FVerseFunctionProperty_                      _Callee_145;                                       // 0x858(0x10)(HasGetValueTypeHash)
	struct FTuple_L_Kchar_M_QLevel_Nlog__level_20_3d_20_2e_2e_2e_R _ExprResult_146;                                   // 0x868(0x12)(HasGetValueTypeHash)
	uint8                                        Pad_6288[0x6];                                     // Fixing Size After Last Property 
	FOptionalProperty_                           _ExprResult_147;                                   // 0x880(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class EVerseTrue                        _InvokeSureResultDummy_148;                        // 0x882(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_628A[0x5];                                     // Fixing Size After Last Property 
	FVerseFunctionProperty_                      _Callee_149;                                       // 0x888(0x10)(HasGetValueTypeHash)
	struct FTuple_L_Kchar_M_QDuration_Nfloat_20_3d_20_2e_2e_2e_M_QColor_Ncolor_20_3d_20_2e_2e_2e_R _ExprResult_150;                                   // 0x898(0x40)(HasGetValueTypeHash)
	struct FTuple_L_Kchar_M_QColor_Ncolor_M_QDuration_Nfloat_R __verse_0x00000000__16;                            // 0x8D8(0x40)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_151;                                   // 0x918(0x20)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FOptionalProperty_                           _ExprResult_152;                                   // 0x938(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResultDummy_153;                              // 0x948(0x10)(HasGetValueTypeHash)

	static class UClass* StaticClass();
	static class UTask_CompanionAI_companion_ai_OnBegin* GetDefaultObj();

	int64 Update(uint64 _InstancingGraph_62, uint64 _InstancingGraph_139);
};

// 0x8A8 (0x9E8 - 0x140)
// VerseClass CompanionAI.task_CompanionAI_companion_ai_runtime$CheckForReviveTeamMembers_L_Nping__info_R
class UTask_CompanionAI_companion_ai_runtime_CheckForReviveTeamMembers_L_Nping__info_R : public UConcurrency_task
{
public:
	class UCompanionAI_companion_ai_runtime*     _Self;                                             // 0x140(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FCompanionAI_ping_info                __verse_0xB2CDDD72_Argument;                       // 0x148(0x38)(Parm, NoDestructor)
	uint8                                        _RetVal : 1;                                       // Mask: 0x1, PropSize: 0x10x180(0x1)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_3F2 : 7;                                    // Fixing Bit-Field Size 
	enum class EVerseTrue                        _InvokeSureResultDummy_0;                          // 0x181(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_629D[0x6];                                     // Fixing Size After Last Property 
	FVerseFunctionProperty_                      _Callee_1;                                         // 0x188(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_2;                                     // 0x198(0x10)(HasGetValueTypeHash)
	class USimulation_agent*                     __verse_0xFD64D7AA_Emitter_2;                      // 0x1A8(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_3;                                // 0x1B0(0x8)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class UObject*                               __verse_0x6B4100B8_EmitterCharacter_2;             // 0x1B8(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_4;                                // 0x1C0(0x8)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_5;                                         // 0x1C8(0x10)(HasGetValueTypeHash)
	struct FTuple_Lagent_Mtuple_L_R_Mtuple_L_R_R _ExprResult_6;                                     // 0x1D8(0xA)(HasGetValueTypeHash)
	uint8                                        Pad_62A2[0x6];                                     // Fixing Size After Last Property 
	struct FTuple_L_R                            _ExprResult_7;                                     // 0x1E8(0x1)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_8;                                     // 0x1E9(0x1)(HasGetValueTypeHash)
	uint8                                        Pad_62A4[0x6];                                     // Fixing Size After Last Property 
	class USimulation_agent*                     __verse_0xC487D1E7_EmitterAgent_2;                 // 0x1F0(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UObject*                               __verse_0x00000000__3;                             // 0x1F8(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_9;                                // 0x200(0x8)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_10;                                        // 0x208(0x10)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_11;                                    // 0x218(0x1)(HasGetValueTypeHash)
	uint8                                        Pad_62A6[0x7];                                     // Fixing Size After Last Property 
	FOptionalProperty_                           _ExprResultStack_12;                               // 0x220(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       _ExprResultStack_13;                               // 0x230(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_14;                                        // 0x238(0x10)(HasGetValueTypeHash)
	struct FTuple_Lvector3_Mvector3_R            _ExprResult_15;                                    // 0x248(0x30)(HasGetValueTypeHash)
	uint8                                        Pad_62A8[0x8];                                     // Fixing Size After Last Property 
	struct FSpatialMath_transform                _ExprResult_16;                                    // 0x280(0x60)(NoDestructor)
	class UObject*                               __verse_0x00000000__6;                             // 0x2E0(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_17;                                        // 0x2E8(0x10)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_18;                                    // 0x2F8(0x1)(HasGetValueTypeHash)
	uint8                                        Pad_62AA[0x7];                                     // Fixing Size After Last Property 
	struct FSpatialMath_transform                _ExprResult_19;                                    // 0x300(0x60)(NoDestructor)
	class UObject*                               __verse_0x00000000__7;                             // 0x360(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_20;                                        // 0x368(0x10)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_21;                                    // 0x378(0x1)(HasGetValueTypeHash)
	uint8                                        __verse_0xC96E9091_HasRevivedEmitter_5 : 1;        // Mask: 0x1, PropSize: 0x10x379(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_3F3 : 7;                                    // Fixing Bit-Field Size 
	uint8                                        Pad_62AB[0x6];                                     // Fixing Size After Last Property 
	class UConcurrency_task*                     _AsyncTask_22;                                     // 0x380(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _AsyncTaskClass_23;                                // 0x388(0x10)(HasGetValueTypeHash)
	int64                                        _AsyncResult_24;                                   // 0x398(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_25;                               // 0x3A0(0x2)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_62AD[0x6];                                     // Fixing Size After Last Property 
	TArray<class USimulation_agent*>             __verse_0xBFBCE682_TeamMembers_4;                  // 0x3A8(0x10)(ContainsInstancedReference)
	FVerseFunctionProperty_                      _Callee_26;                                        // 0x3B8(0x10)(HasGetValueTypeHash)
	struct FTuple_Lagent_Mtuple_L_R_Mtuple_L_R_R _ExprResult_27;                                    // 0x3C8(0xA)(HasGetValueTypeHash)
	uint8                                        Pad_62AF[0x6];                                     // Fixing Size After Last Property 
	struct FTuple_L_R                            _ExprResult_28;                                    // 0x3D8(0x1)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_29;                                    // 0x3D9(0x1)(HasGetValueTypeHash)
	uint8                                        Pad_62B1[0x6];                                     // Fixing Size After Last Property 
	int64                                        _ForIndex_30;                                      // 0x3E0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        _ForLength_31;                                     // 0x3E8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USimulation_agent*                     __verse_0xAE35E375_TeamMember_12;                  // 0x3F0(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_32;                               // 0x3F8(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       _ExprResultStack_33;                               // 0x408(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_34;                                        // 0x410(0x10)(HasGetValueTypeHash)
	struct FTuple_Lvector3_Mvector3_R            _ExprResult_35;                                    // 0x420(0x30)(HasGetValueTypeHash)
	struct FSpatialMath_transform                _ExprResult_36;                                    // 0x450(0x60)(NoDestructor)
	class UObject*                               __verse_0x00000000__16;                            // 0x4B0(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_37;                               // 0x4B8(0x8)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_38;                                        // 0x4C0(0x10)(HasGetValueTypeHash)
	struct FTuple_Lagent_Mtuple_L_R_Mtuple_L_R_R _ExprResult_39;                                    // 0x4D0(0xA)(HasGetValueTypeHash)
	uint8                                        Pad_62B6[0x6];                                     // Fixing Size After Last Property 
	struct FTuple_L_R                            _ExprResult_40;                                    // 0x4E0(0x1)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_41;                                    // 0x4E1(0x1)(HasGetValueTypeHash)
	uint8                                        Pad_62B7[0x6];                                     // Fixing Size After Last Property 
	FVerseFunctionProperty_                      _Callee_42;                                        // 0x4E8(0x10)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_43;                                    // 0x4F8(0x1)(HasGetValueTypeHash)
	uint8                                        Pad_62B8[0x7];                                     // Fixing Size After Last Property 
	struct FSpatialMath_transform                _ExprResult_44;                                    // 0x500(0x60)(NoDestructor)
	class UObject*                               __verse_0x00000000__17;                            // 0x560(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_45;                                        // 0x568(0x10)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_46;                                    // 0x578(0x1)(HasGetValueTypeHash)
	uint8                                        __verse_0x87226150_HasRevivedTeamMember_15 : 1;    // Mask: 0x1, PropSize: 0x10x579(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_3F4 : 7;                                    // Fixing Bit-Field Size 
	uint8                                        Pad_62BB[0x6];                                     // Fixing Size After Last Property 
	FVerseFunctionProperty_                      _AsyncTaskClass_47;                                // 0x580(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_48;                               // 0x590(0x2)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	enum class EVerseTrue                        _InvokeSureResultDummy_49;                         // 0x592(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_62BC[0x5];                                     // Fixing Size After Last Property 
	FVerseFunctionProperty_                      _Callee_50;                                        // 0x598(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_51;                                    // 0x5A8(0x10)(HasGetValueTypeHash)
	enum class EVerseTrue                        _InvokeSureResultDummy_52;                         // 0x5B8(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_62BD[0x7];                                     // Fixing Size After Last Property 
	FVerseFunctionProperty_                      _Callee_53;                                        // 0x5C0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_54;                                    // 0x5D0(0x10)(HasGetValueTypeHash)
	class USimulation_agent*                     __verse_0xFD64D7AA_Emitter_22;                     // 0x5E0(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_55;                               // 0x5E8(0x8)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class UObject*                               __verse_0x6B4100B8_EmitterCharacter_22;            // 0x5F0(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_56;                               // 0x5F8(0x8)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_57;                                        // 0x600(0x10)(HasGetValueTypeHash)
	struct FTuple_Lagent_Mtuple_L_R_Mtuple_L_R_R _ExprResult_58;                                    // 0x610(0xA)(HasGetValueTypeHash)
	uint8                                        Pad_62BE[0x6];                                     // Fixing Size After Last Property 
	struct FTuple_L_R                            _ExprResult_59;                                    // 0x620(0x1)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_60;                                    // 0x621(0x1)(HasGetValueTypeHash)
	uint8                                        Pad_62C0[0x6];                                     // Fixing Size After Last Property 
	class USimulation_agent*                     __verse_0xC487D1E7_EmitterAgent_22;                // 0x628(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UObject*                               __verse_0x00000000__23;                            // 0x630(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_61;                               // 0x638(0x8)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_62;                                        // 0x640(0x10)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_63;                                    // 0x650(0x1)(HasGetValueTypeHash)
	uint8                                        Pad_62C1[0x7];                                     // Fixing Size After Last Property 
	FOptionalProperty_                           _ExprResultStack_64;                               // 0x658(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       _ExprResultStack_65;                               // 0x668(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_66;                                        // 0x670(0x10)(HasGetValueTypeHash)
	struct FTuple_Lvector3_Mvector3_R            _ExprResult_67;                                    // 0x680(0x30)(HasGetValueTypeHash)
	struct FSpatialMath_transform                _ExprResult_68;                                    // 0x6B0(0x60)(NoDestructor)
	class UObject*                               __verse_0x00000000__26;                            // 0x710(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_69;                                        // 0x718(0x10)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_70;                                    // 0x728(0x1)(HasGetValueTypeHash)
	uint8                                        Pad_62C2[0x7];                                     // Fixing Size After Last Property 
	struct FSpatialMath_transform                _ExprResult_71;                                    // 0x730(0x60)(NoDestructor)
	class UObject*                               __verse_0x00000000__27;                            // 0x790(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_72;                                        // 0x798(0x10)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_73;                                    // 0x7A8(0x1)(HasGetValueTypeHash)
	uint8                                        __verse_0xC96E9091_HasRevivedEmitter_25 : 1;       // Mask: 0x1, PropSize: 0x10x7A9(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_3F5 : 7;                                    // Fixing Bit-Field Size 
	uint8                                        Pad_62C3[0x6];                                     // Fixing Size After Last Property 
	class UConcurrency_task*                     _AsyncTask_74;                                     // 0x7B0(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _AsyncTaskClass_75;                                // 0x7B8(0x10)(HasGetValueTypeHash)
	int64                                        _AsyncResult_76;                                   // 0x7C8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_77;                               // 0x7D0(0x2)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_62C4[0x6];                                     // Fixing Size After Last Property 
	TArray<class USimulation_agent*>             __verse_0xBFBCE682_TeamMembers_24;                 // 0x7D8(0x10)(ContainsInstancedReference)
	FVerseFunctionProperty_                      _Callee_78;                                        // 0x7E8(0x10)(HasGetValueTypeHash)
	struct FTuple_Lagent_Mtuple_L_R_Mtuple_L_R_R _ExprResult_79;                                    // 0x7F8(0xA)(HasGetValueTypeHash)
	uint8                                        Pad_62C5[0x6];                                     // Fixing Size After Last Property 
	struct FTuple_L_R                            _ExprResult_80;                                    // 0x808(0x1)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_81;                                    // 0x809(0x1)(HasGetValueTypeHash)
	uint8                                        Pad_62C7[0x6];                                     // Fixing Size After Last Property 
	int64                                        _ForIndex_82;                                      // 0x810(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        _ForLength_83;                                     // 0x818(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USimulation_agent*                     __verse_0xAE35E375_TeamMember_32;                  // 0x820(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_84;                               // 0x828(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       _ExprResultStack_85;                               // 0x838(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_86;                                        // 0x840(0x10)(HasGetValueTypeHash)
	struct FTuple_Lvector3_Mvector3_R            _ExprResult_87;                                    // 0x850(0x30)(HasGetValueTypeHash)
	struct FSpatialMath_transform                _ExprResult_88;                                    // 0x880(0x60)(NoDestructor)
	class UObject*                               __verse_0x00000000__36;                            // 0x8E0(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_89;                               // 0x8E8(0x8)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_90;                                        // 0x8F0(0x10)(HasGetValueTypeHash)
	struct FTuple_Lagent_Mtuple_L_R_Mtuple_L_R_R _ExprResult_91;                                    // 0x900(0xA)(HasGetValueTypeHash)
	uint8                                        Pad_62CA[0x6];                                     // Fixing Size After Last Property 
	struct FTuple_L_R                            _ExprResult_92;                                    // 0x910(0x1)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_93;                                    // 0x911(0x1)(HasGetValueTypeHash)
	uint8                                        Pad_62CC[0x6];                                     // Fixing Size After Last Property 
	FVerseFunctionProperty_                      _Callee_94;                                        // 0x918(0x10)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_95;                                    // 0x928(0x1)(HasGetValueTypeHash)
	uint8                                        Pad_62CD[0x7];                                     // Fixing Size After Last Property 
	struct FSpatialMath_transform                _ExprResult_96;                                    // 0x930(0x60)(NoDestructor)
	class UObject*                               __verse_0x00000000__37;                            // 0x990(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_97;                                        // 0x998(0x10)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_98;                                    // 0x9A8(0x1)(HasGetValueTypeHash)
	uint8                                        __verse_0x87226150_HasRevivedTeamMember_35 : 1;    // Mask: 0x1, PropSize: 0x10x9A9(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_3F6 : 7;                                    // Fixing Bit-Field Size 
	uint8                                        Pad_62CF[0x6];                                     // Fixing Size After Last Property 
	FVerseFunctionProperty_                      _AsyncTaskClass_99;                                // 0x9B0(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_100;                              // 0x9C0(0x2)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	enum class EVerseTrue                        _InvokeSureResultDummy_101;                        // 0x9C2(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_62D0[0x5];                                     // Fixing Size After Last Property 
	FVerseFunctionProperty_                      _Callee_102;                                       // 0x9C8(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_103;                                   // 0x9D8(0x10)(HasGetValueTypeHash)

	static class UClass* StaticClass();
	static class UTask_CompanionAI_companion_ai_runtime_CheckForReviveTeamMembers_L_Nping__info_R* GetDefaultObj();

	int64 Update();
};

// 0xB0 (0x1F0 - 0x140)
// VerseClass CompanionAI.task_CompanionAI_companion_ai_runtime$CrouchService
class UTask_CompanionAI_companion_ai_runtime_CrouchService : public UConcurrency_task
{
public:
	class UCompanionAI_companion_ai_runtime*     _Self;                                             // 0x140(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x148(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_62D5[0x7];                                     // Fixing Size After Last Property 
	class UConcurrency_task*                     _AsyncTask_0;                                      // 0x150(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _AsyncTaskClass_1;                                 // 0x158(0x10)(HasGetValueTypeHash)
	int64                                        _AsyncResult_2;                                    // 0x168(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                               __verse_0x00000000__3;                             // 0x170(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _AsyncTaskClass_3;                                 // 0x178(0x10)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_4;                                     // 0x188(0x1)(HasGetValueTypeHash)
	uint8                                        Pad_62D7[0x7];                                     // Fixing Size After Last Property 
	FVerseFunctionProperty_                      _AsyncTaskClass_5;                                 // 0x190(0x10)(HasGetValueTypeHash)
	class UConcurrency_task*                     _AsyncTask_6;                                      // 0x1A0(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _AsyncTaskClass_7;                                 // 0x1A8(0x10)(HasGetValueTypeHash)
	int64                                        _AsyncResult_8;                                    // 0x1B8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                               __verse_0x00000000__6;                             // 0x1C0(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _AsyncTaskClass_9;                                 // 0x1C8(0x10)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_10;                                    // 0x1D8(0x1)(HasGetValueTypeHash)
	uint8                                        Pad_62DB[0x7];                                     // Fixing Size After Last Property 
	FVerseFunctionProperty_                      _AsyncTaskClass_11;                                // 0x1E0(0x10)(HasGetValueTypeHash)

	static class UClass* StaticClass();
	static class UTask_CompanionAI_companion_ai_runtime_CrouchService* GetDefaultObj();

	int64 Update();
};

// 0x248 (0x388 - 0x140)
// VerseClass CompanionAI.task_CompanionAI_companion_ai_runtime$CrouchUntilHit
class UTask_CompanionAI_companion_ai_runtime_CrouchUntilHit : public UConcurrency_task
{
public:
	class UCompanionAI_companion_ai_runtime*     _Self;                                             // 0x140(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x148(0x1)(Parm, HasGetValueTypeHash)
	enum class EVerseTrue                        _InvokeSureResultDummy_0;                          // 0x149(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_62E2[0x6];                                     // Fixing Size After Last Property 
	FVerseFunctionProperty_                      _Callee_1;                                         // 0x150(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_2;                                     // 0x160(0x10)(HasGetValueTypeHash)
	uint8                                        _AsyncBeginCount_3 : 1;                            // Mask: 0x1, PropSize: 0x10x170(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_3F8 : 7;                                    // Fixing Bit-Field Size 
	uint8                                        _AsyncBeginCount_4 : 1;                            // Mask: 0x1, PropSize: 0x10x171(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_3F9 : 7;                                    // Fixing Bit-Field Size 
	uint8                                        Pad_62E3[0x6];                                     // Fixing Size After Last Property 
	class UObject*                               __verse_0x00000000__2;                             // 0x178(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UConcurrency_task*                     _AsyncTask_5;                                      // 0x180(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _AsyncTaskClass_6;                                 // 0x188(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_7;                                     // 0x198(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        _AsyncResult_8;                                    // 0x1A8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        _AsyncBeginCount_9 : 1;                            // Mask: 0x1, PropSize: 0x10x1B0(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_3FA : 7;                                    // Fixing Bit-Field Size 
	uint8                                        Pad_62E5[0x7];                                     // Fixing Size After Last Property 
	class UConcurrency_task*                     _AsyncTask_10;                                     // 0x1B8(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _AsyncTaskClass_11;                                // 0x1C0(0x10)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_12;                                    // 0x1D0(0x1)(HasGetValueTypeHash)
	uint8                                        Pad_62E6[0x7];                                     // Fixing Size After Last Property 
	int64                                        _AsyncResult_13;                                   // 0x1D8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        _AsyncBeginCount_14 : 1;                           // Mask: 0x1, PropSize: 0x10x1E0(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_3FB : 7;                                    // Fixing Bit-Field Size 
	uint8                                        Pad_62E7[0x7];                                     // Fixing Size After Last Property 
	class UConcurrency_task*                     _AsyncTask_15;                                     // 0x1E8(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _AsyncTaskClass_16;                                // 0x1F0(0x10)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_17;                                    // 0x200(0x1)(HasGetValueTypeHash)
	uint8                                        Pad_62E8[0x7];                                     // Fixing Size After Last Property 
	int64                                        _AsyncResult_18;                                   // 0x208(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        _AsyncBeginCount_19 : 1;                           // Mask: 0x1, PropSize: 0x10x210(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_3FC : 7;                                    // Fixing Bit-Field Size 
	uint8                                        Pad_62EA[0x7];                                     // Fixing Size After Last Property 
	class UConcurrency_task*                     _AsyncTask_20;                                     // 0x218(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _AsyncTaskClass_21;                                // 0x220(0x10)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_22;                                    // 0x230(0x1)(HasGetValueTypeHash)
	uint8                                        Pad_62EB[0x7];                                     // Fixing Size After Last Property 
	int64                                        _AsyncResult_23;                                   // 0x238(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class EVerseTrue                        _InvokeSureResultDummy_24;                         // 0x240(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_62EC[0x7];                                     // Fixing Size After Last Property 
	FVerseFunctionProperty_                      _Callee_25;                                        // 0x248(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_26;                                    // 0x258(0x10)(HasGetValueTypeHash)
	enum class EVerseTrue                        _InvokeSureResultDummy_27;                         // 0x268(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_62ED[0x7];                                     // Fixing Size After Last Property 
	FVerseFunctionProperty_                      _Callee_28;                                        // 0x270(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_29;                                    // 0x280(0x10)(HasGetValueTypeHash)
	uint8                                        _AsyncBeginCount_30 : 1;                           // Mask: 0x1, PropSize: 0x10x290(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_3FE : 7;                                    // Fixing Bit-Field Size 
	uint8                                        _AsyncBeginCount_31 : 1;                           // Mask: 0x1, PropSize: 0x10x291(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_3FF : 7;                                    // Fixing Bit-Field Size 
	uint8                                        Pad_62F0[0x6];                                     // Fixing Size After Last Property 
	class UObject*                               __verse_0x00000000__5;                             // 0x298(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UConcurrency_task*                     _AsyncTask_32;                                     // 0x2A0(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _AsyncTaskClass_33;                                // 0x2A8(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_34;                                    // 0x2B8(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        _AsyncResult_35;                                   // 0x2C8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        _AsyncBeginCount_36 : 1;                           // Mask: 0x1, PropSize: 0x10x2D0(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_401 : 7;                                    // Fixing Bit-Field Size 
	uint8                                        Pad_62F4[0x7];                                     // Fixing Size After Last Property 
	class UConcurrency_task*                     _AsyncTask_37;                                     // 0x2D8(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _AsyncTaskClass_38;                                // 0x2E0(0x10)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_39;                                    // 0x2F0(0x1)(HasGetValueTypeHash)
	uint8                                        Pad_62F5[0x7];                                     // Fixing Size After Last Property 
	int64                                        _AsyncResult_40;                                   // 0x2F8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        _AsyncBeginCount_41 : 1;                           // Mask: 0x1, PropSize: 0x10x300(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_402 : 7;                                    // Fixing Bit-Field Size 
	uint8                                        Pad_62F7[0x7];                                     // Fixing Size After Last Property 
	class UConcurrency_task*                     _AsyncTask_42;                                     // 0x308(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _AsyncTaskClass_43;                                // 0x310(0x10)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_44;                                    // 0x320(0x1)(HasGetValueTypeHash)
	uint8                                        Pad_62F9[0x7];                                     // Fixing Size After Last Property 
	int64                                        _AsyncResult_45;                                   // 0x328(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        _AsyncBeginCount_46 : 1;                           // Mask: 0x1, PropSize: 0x10x330(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_404 : 7;                                    // Fixing Bit-Field Size 
	uint8                                        Pad_62FB[0x7];                                     // Fixing Size After Last Property 
	class UConcurrency_task*                     _AsyncTask_47;                                     // 0x338(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _AsyncTaskClass_48;                                // 0x340(0x10)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_49;                                    // 0x350(0x1)(HasGetValueTypeHash)
	uint8                                        Pad_62FC[0x7];                                     // Fixing Size After Last Property 
	int64                                        _AsyncResult_50;                                   // 0x358(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class EVerseTrue                        _InvokeSureResultDummy_51;                         // 0x360(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_62FD[0x7];                                     // Fixing Size After Last Property 
	FVerseFunctionProperty_                      _Callee_52;                                        // 0x368(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_53;                                    // 0x378(0x10)(HasGetValueTypeHash)

	static class UClass* StaticClass();
	static class UTask_CompanionAI_companion_ai_runtime_CrouchUntilHit* GetDefaultObj();

	int64 Update();
};

// 0x3C1 (0x501 - 0x140)
// VerseClass CompanionAI.task_CompanionAI_companion_ai_runtime$DrawSphere_L_Nvector3_M_Nfloat_M_Ncolor_R
class UTask_CompanionAI_companion_ai_runtime_DrawSphere_L_Nvector3_M_Nfloat_M_Ncolor_R : public UConcurrency_task
{
public:
	class UCompanionAI_companion_ai_runtime*     _Self;                                             // 0x140(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTuple_Lvector3_Mfloat_Mcolor_R       __verse_0xB2CDDD72_Argument;                       // 0x148(0x38)(Parm, HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_0;                                // 0x180(0x2)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_630D[0x6];                                     // Fixing Size After Last Property 
	class UDiagnostics_debug_draw*               __verse_0x00000000__4;                             // 0x188(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	enum class EVerseTrue                        _InvokeSureResultDummy_1;                          // 0x190(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_630E[0x7];                                     // Fixing Size After Last Property 
	FVerseFunctionProperty_                      _Callee_2;                                         // 0x198(0x10)(HasGetValueTypeHash)
	struct FTuple_Lvector3_M_QRadius_Nfloat_20_3d_20_2e_2e_2e_M_QColor_Ncolor_20_3d_20_2e_2e_2e_M_QNumSegments_Nint_20_3d_20_2e_2e_2e_M_QThickness_Nfloat_20_3d_20_2e_2e_2e_M_QDrawDurationPolicy_Ndebug__draw__duration__policy_20_3d_20_2e_2e_2e_M_QDuration_Nfloat_20_3d_20_2e_2e_2e_R _ExprResult_3;                                     // 0x1A8(0x80)(HasGetValueTypeHash)
	struct FTuple_Lvector3_M_QColor_Ncolor_M_QRadius_Nfloat_M_QThickness_Ntype_7b3_2e000000_7d_M_QDrawDurationPolicy_Ndebug__draw__duration__policy_M_QNumSegments_Ntype_7b32_7d_R __verse_0x00000000__5;                             // 0x228(0x70)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_4;                                     // 0x298(0x20)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FOptionalProperty_                           _ExprResult_5;                                     // 0x2B8(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_6;                                     // 0x2C8(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_7;                                     // 0x2D8(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_630F[0x6];                                     // Fixing Size After Last Property 
	FOptionalProperty_                           _ExprResult_8;                                     // 0x2E0(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_9;                                     // 0x2F0(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UConcurrency_task*                     _AsyncTask_10;                                     // 0x300(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _AsyncTaskClass_11;                                // 0x308(0x10)(HasGetValueTypeHash)
	int64                                        _AsyncResult_12;                                   // 0x318(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDiagnostics_debug_draw*               __verse_0x00000000__7;                             // 0x320(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	enum class EVerseTrue                        _InvokeSureResultDummy_13;                         // 0x328(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_6310[0x7];                                     // Fixing Size After Last Property 
	FVerseFunctionProperty_                      _Callee_14;                                        // 0x330(0x10)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_15;                                    // 0x340(0x1)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_16;                               // 0x341(0x2)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_6311[0x5];                                     // Fixing Size After Last Property 
	class UDiagnostics_debug_draw*               __verse_0x00000000__11;                            // 0x348(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	enum class EVerseTrue                        _InvokeSureResultDummy_17;                         // 0x350(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_6312[0x7];                                     // Fixing Size After Last Property 
	FVerseFunctionProperty_                      _Callee_18;                                        // 0x358(0x10)(HasGetValueTypeHash)
	struct FTuple_Lvector3_M_QRadius_Nfloat_20_3d_20_2e_2e_2e_M_QColor_Ncolor_20_3d_20_2e_2e_2e_M_QNumSegments_Nint_20_3d_20_2e_2e_2e_M_QThickness_Nfloat_20_3d_20_2e_2e_2e_M_QDrawDurationPolicy_Ndebug__draw__duration__policy_20_3d_20_2e_2e_2e_M_QDuration_Nfloat_20_3d_20_2e_2e_2e_R _ExprResult_19;                                    // 0x368(0x80)(HasGetValueTypeHash)
	struct FTuple_Lvector3_M_QColor_Ncolor_M_QRadius_Nfloat_M_QThickness_Ntype_7b3_2e000000_7d_M_QDrawDurationPolicy_Ndebug__draw__duration__policy_M_QNumSegments_Ntype_7b32_7d_R __verse_0x00000000__12;                            // 0x3E8(0x70)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_20;                                    // 0x458(0x20)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FOptionalProperty_                           _ExprResult_21;                                    // 0x478(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_22;                                    // 0x488(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_23;                                    // 0x498(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_6315[0x6];                                     // Fixing Size After Last Property 
	FOptionalProperty_                           _ExprResult_24;                                    // 0x4A0(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_25;                                    // 0x4B0(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UConcurrency_task*                     _AsyncTask_26;                                     // 0x4C0(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _AsyncTaskClass_27;                                // 0x4C8(0x10)(HasGetValueTypeHash)
	int64                                        _AsyncResult_28;                                   // 0x4D8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDiagnostics_debug_draw*               __verse_0x00000000__14;                            // 0x4E0(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	enum class EVerseTrue                        _InvokeSureResultDummy_29;                         // 0x4E8(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_6316[0x7];                                     // Fixing Size After Last Property 
	FVerseFunctionProperty_                      _Callee_30;                                        // 0x4F0(0x10)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_31;                                    // 0x500(0x1)(HasGetValueTypeHash)

	static class UClass* StaticClass();
	static class UTask_CompanionAI_companion_ai_runtime_DrawSphere_L_Nvector3_M_Nfloat_M_Ncolor_R* GetDefaultObj();

	int64 Update();
};

// 0x730 (0x870 - 0x140)
// VerseClass CompanionAI.task_CompanionAI_companion_ai_runtime$GameLoop
class UTask_CompanionAI_companion_ai_runtime_GameLoop : public UConcurrency_task
{
public:
	class UCompanionAI_companion_ai_runtime*     _Self;                                             // 0x140(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x148(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_631B[0x7];                                     // Fixing Size After Last Property 
	FVerseDynamicProperty_                       InvokeResultDummy_0;                               // 0x150(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_1;                                // 0x160(0x18)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_2;                                     // 0x178(0x10)(HasGetValueTypeHash)
	uint8                                        _ExprResult_3 : 1;                                 // Mask: 0x1, PropSize: 0x10x188(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_405 : 7;                                    // Fixing Bit-Field Size 
	uint8                                        Pad_631C[0x7];                                     // Fixing Size After Last Property 
	class UObject*                               __verse_0x00000000__3;                             // 0x190(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_4;                                         // 0x198(0x10)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_5;                                     // 0x1A8(0x1)(HasGetValueTypeHash)
	uint8                                        Pad_631D[0x7];                                     // Fixing Size After Last Property 
	FVerseDynamicProperty_                       _ExprResult_6;                                     // 0x1B0(0x10)(HasGetValueTypeHash)
	class UObject*                               __verse_0x00000000__5;                             // 0x1C0(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UConcurrency_task*                     _AsyncTask_7;                                      // 0x1C8(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _AsyncTaskClass_8;                                 // 0x1D0(0x10)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_9;                                     // 0x1E0(0x1)(HasGetValueTypeHash)
	uint8                                        Pad_631E[0x7];                                     // Fixing Size After Last Property 
	int64                                        _AsyncResult_10;                                   // 0x1E8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FOptionalProperty_                           __verse_0x01443115_PingInfo_1;                     // 0x1F0(0x40)(ZeroConstructor, NoDestructor)
	FOptionalProperty_                           __verse_0x00000000__6;                             // 0x230(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        _ExprResult_11 : 1;                                // Mask: 0x1, PropSize: 0x10x232(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_406 : 7;                                    // Fixing Bit-Field Size 
	FOptionalProperty_                           _ExprResultStack_12;                               // 0x233(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_6321[0x3];                                     // Fixing Size After Last Property 
	class UObject*                               __verse_0x00000000__8;                             // 0x238(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UObject*                               __verse_0x00000000__9;                             // 0x240(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_13;                                        // 0x248(0x10)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_14;                                    // 0x258(0x1)(HasGetValueTypeHash)
	uint8                                        Pad_6323[0x7];                                     // Fixing Size After Last Property 
	class UObject*                               _InvokeSureResultDummy_15;                         // 0x260(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_16;                                        // 0x268(0x10)(HasGetValueTypeHash)
	class UObject*                               __verse_0x00000000__10;                            // 0x278(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UObject*                               __verse_0x00000000__11;                            // 0x280(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_17;                                        // 0x288(0x10)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_18;                                    // 0x298(0x1)(HasGetValueTypeHash)
	uint8                                        Pad_6325[0x7];                                     // Fixing Size After Last Property 
	class UObject*                               _InvokeSureResultDummy_19;                         // 0x2A0(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_20;                                        // 0x2A8(0x10)(HasGetValueTypeHash)
	struct FCompanionAI_ping_info                __verse_0x78680F6D_CurrentCommand_13;              // 0x2B8(0x38)(NoDestructor)
	FOptionalProperty_                           _ExprResultStack_21;                               // 0x2F0(0x40)(ZeroConstructor, NoDestructor)
	uint8                                        _AsyncBeginCount_22 : 1;                           // Mask: 0x1, PropSize: 0x10x330(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_407 : 7;                                    // Fixing Bit-Field Size 
	uint8                                        _AsyncBeginCount_23 : 1;                           // Mask: 0x1, PropSize: 0x10x331(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_408 : 7;                                    // Fixing Bit-Field Size 
	uint8                                        Pad_6327[0x6];                                     // Fixing Size After Last Property 
	FOptionalProperty_                           _ExprResult_24;                                    // 0x338(0x40)(ZeroConstructor, NoDestructor)
	class UObject*                               __verse_0x00000000__14;                            // 0x378(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UConcurrency_task*                     _AsyncTask_25;                                     // 0x380(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _AsyncTaskClass_26;                                // 0x388(0x10)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_27;                                    // 0x398(0x1)(HasGetValueTypeHash)
	uint8                                        Pad_6329[0x7];                                     // Fixing Size After Last Property 
	int64                                        _AsyncResult_28;                                   // 0x3A0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        _AsyncBeginCount_29 : 1;                           // Mask: 0x1, PropSize: 0x10x3A8(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_409 : 7;                                    // Fixing Bit-Field Size 
	uint8                                        Pad_632B[0x7];                                     // Fixing Size After Last Property 
	class UConcurrency_task*                     _AsyncTask_30;                                     // 0x3B0(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _AsyncTaskClass_31;                                // 0x3B8(0x10)(HasGetValueTypeHash)
	int64                                        _AsyncResult_32;                                   // 0x3C8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                               __verse_0x00000000__16;                            // 0x3D0(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	enum class EVerseTrue                        _InvokeSureResultDummy_33;                         // 0x3D8(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_632C[0x7];                                     // Fixing Size After Last Property 
	FVerseFunctionProperty_                      _Callee_34;                                        // 0x3E0(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_35;                                    // 0x3F0(0x40)(ZeroConstructor, NoDestructor)
	FOptionalProperty_                           __verse_0x00000000__17;                            // 0x430(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        _ExprResult_36 : 1;                                // Mask: 0x1, PropSize: 0x10x432(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_40A : 7;                                    // Fixing Bit-Field Size 
	FOptionalProperty_                           _ExprResultStack_37;                               // 0x433(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        _AsyncBeginCount_38 : 1;                           // Mask: 0x1, PropSize: 0x10x435(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_40B : 7;                                    // Fixing Bit-Field Size 
	uint8                                        _AsyncBeginCount_39 : 1;                           // Mask: 0x1, PropSize: 0x10x436(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_40C : 7;                                    // Fixing Bit-Field Size 
	uint8                                        Pad_632E[0x1];                                     // Fixing Size After Last Property 
	class UObject*                               __verse_0x00000000__20;                            // 0x438(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UConcurrency_task*                     _AsyncTask_40;                                     // 0x440(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _AsyncTaskClass_41;                                // 0x448(0x10)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_42;                                    // 0x458(0x1)(HasGetValueTypeHash)
	uint8                                        Pad_6330[0x7];                                     // Fixing Size After Last Property 
	int64                                        _AsyncResult_43;                                   // 0x460(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        _AsyncBeginCount_44 : 1;                           // Mask: 0x1, PropSize: 0x10x468(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_40D : 7;                                    // Fixing Bit-Field Size 
	uint8                                        Pad_6331[0x7];                                     // Fixing Size After Last Property 
	FOptionalProperty_                           _ExprResult_45;                                    // 0x470(0x40)(ZeroConstructor, NoDestructor)
	class UObject*                               __verse_0x00000000__21;                            // 0x4B0(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UConcurrency_task*                     _AsyncTask_46;                                     // 0x4B8(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _AsyncTaskClass_47;                                // 0x4C0(0x10)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_48;                                    // 0x4D0(0x1)(HasGetValueTypeHash)
	uint8                                        Pad_6332[0x7];                                     // Fixing Size After Last Property 
	int64                                        _AsyncResult_49;                                   // 0x4D8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       InvokeResultDummy_50;                              // 0x4E0(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_51;                               // 0x4F0(0x18)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_52;                                    // 0x508(0x10)(HasGetValueTypeHash)
	uint8                                        _ExprResult_53 : 1;                                // Mask: 0x1, PropSize: 0x10x518(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_40E : 7;                                    // Fixing Bit-Field Size 
	uint8                                        Pad_6335[0x7];                                     // Fixing Size After Last Property 
	class UObject*                               __verse_0x00000000__24;                            // 0x520(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_54;                                        // 0x528(0x10)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_55;                                    // 0x538(0x1)(HasGetValueTypeHash)
	uint8                                        Pad_6336[0x7];                                     // Fixing Size After Last Property 
	FVerseDynamicProperty_                       _ExprResult_56;                                    // 0x540(0x10)(HasGetValueTypeHash)
	class UObject*                               __verse_0x00000000__26;                            // 0x550(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UConcurrency_task*                     _AsyncTask_57;                                     // 0x558(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _AsyncTaskClass_58;                                // 0x560(0x10)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_59;                                    // 0x570(0x1)(HasGetValueTypeHash)
	uint8                                        Pad_6337[0x7];                                     // Fixing Size After Last Property 
	int64                                        _AsyncResult_60;                                   // 0x578(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FOptionalProperty_                           __verse_0x01443115_PingInfo_22;                    // 0x580(0x40)(ZeroConstructor, NoDestructor)
	FOptionalProperty_                           __verse_0x00000000__27;                            // 0x5C0(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        _ExprResult_61 : 1;                                // Mask: 0x1, PropSize: 0x10x5C2(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_40F : 7;                                    // Fixing Bit-Field Size 
	FOptionalProperty_                           _ExprResultStack_62;                               // 0x5C3(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_6339[0x3];                                     // Fixing Size After Last Property 
	class UObject*                               __verse_0x00000000__29;                            // 0x5C8(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UObject*                               __verse_0x00000000__30;                            // 0x5D0(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_63;                                        // 0x5D8(0x10)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_64;                                    // 0x5E8(0x1)(HasGetValueTypeHash)
	uint8                                        Pad_633B[0x7];                                     // Fixing Size After Last Property 
	class UObject*                               _InvokeSureResultDummy_65;                         // 0x5F0(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_66;                                        // 0x5F8(0x10)(HasGetValueTypeHash)
	class UObject*                               __verse_0x00000000__31;                            // 0x608(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UObject*                               __verse_0x00000000__32;                            // 0x610(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_67;                                        // 0x618(0x10)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_68;                                    // 0x628(0x1)(HasGetValueTypeHash)
	uint8                                        Pad_633D[0x7];                                     // Fixing Size After Last Property 
	class UObject*                               _InvokeSureResultDummy_69;                         // 0x630(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_70;                                        // 0x638(0x10)(HasGetValueTypeHash)
	struct FCompanionAI_ping_info                __verse_0x78680F6D_CurrentCommand_34;              // 0x648(0x38)(NoDestructor)
	FOptionalProperty_                           _ExprResultStack_71;                               // 0x680(0x40)(ZeroConstructor, NoDestructor)
	uint8                                        _AsyncBeginCount_72 : 1;                           // Mask: 0x1, PropSize: 0x10x6C0(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_410 : 7;                                    // Fixing Bit-Field Size 
	uint8                                        _AsyncBeginCount_73 : 1;                           // Mask: 0x1, PropSize: 0x10x6C1(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_411 : 7;                                    // Fixing Bit-Field Size 
	uint8                                        Pad_633F[0x6];                                     // Fixing Size After Last Property 
	FOptionalProperty_                           _ExprResult_74;                                    // 0x6C8(0x40)(ZeroConstructor, NoDestructor)
	class UObject*                               __verse_0x00000000__35;                            // 0x708(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UConcurrency_task*                     _AsyncTask_75;                                     // 0x710(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _AsyncTaskClass_76;                                // 0x718(0x10)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_77;                                    // 0x728(0x1)(HasGetValueTypeHash)
	uint8                                        Pad_6341[0x7];                                     // Fixing Size After Last Property 
	int64                                        _AsyncResult_78;                                   // 0x730(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        _AsyncBeginCount_79 : 1;                           // Mask: 0x1, PropSize: 0x10x738(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_412 : 7;                                    // Fixing Bit-Field Size 
	uint8                                        Pad_6342[0x7];                                     // Fixing Size After Last Property 
	class UConcurrency_task*                     _AsyncTask_80;                                     // 0x740(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _AsyncTaskClass_81;                                // 0x748(0x10)(HasGetValueTypeHash)
	int64                                        _AsyncResult_82;                                   // 0x758(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                               __verse_0x00000000__37;                            // 0x760(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	enum class EVerseTrue                        _InvokeSureResultDummy_83;                         // 0x768(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_6343[0x7];                                     // Fixing Size After Last Property 
	FVerseFunctionProperty_                      _Callee_84;                                        // 0x770(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_85;                                    // 0x780(0x40)(ZeroConstructor, NoDestructor)
	FOptionalProperty_                           __verse_0x00000000__38;                            // 0x7C0(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        _ExprResult_86 : 1;                                // Mask: 0x1, PropSize: 0x10x7C2(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_413 : 7;                                    // Fixing Bit-Field Size 
	FOptionalProperty_                           _ExprResultStack_87;                               // 0x7C3(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        _AsyncBeginCount_88 : 1;                           // Mask: 0x1, PropSize: 0x10x7C5(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_414 : 7;                                    // Fixing Bit-Field Size 
	uint8                                        _AsyncBeginCount_89 : 1;                           // Mask: 0x1, PropSize: 0x10x7C6(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_415 : 7;                                    // Fixing Bit-Field Size 
	uint8                                        Pad_6347[0x1];                                     // Fixing Size After Last Property 
	class UObject*                               __verse_0x00000000__41;                            // 0x7C8(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UConcurrency_task*                     _AsyncTask_90;                                     // 0x7D0(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _AsyncTaskClass_91;                                // 0x7D8(0x10)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_92;                                    // 0x7E8(0x1)(HasGetValueTypeHash)
	uint8                                        Pad_6348[0x7];                                     // Fixing Size After Last Property 
	int64                                        _AsyncResult_93;                                   // 0x7F0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        _AsyncBeginCount_94 : 1;                           // Mask: 0x1, PropSize: 0x10x7F8(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_416 : 7;                                    // Fixing Bit-Field Size 
	uint8                                        Pad_6349[0x7];                                     // Fixing Size After Last Property 
	FOptionalProperty_                           _ExprResult_95;                                    // 0x800(0x40)(ZeroConstructor, NoDestructor)
	class UObject*                               __verse_0x00000000__42;                            // 0x840(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UConcurrency_task*                     _AsyncTask_96;                                     // 0x848(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _AsyncTaskClass_97;                                // 0x850(0x10)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_98;                                    // 0x860(0x1)(HasGetValueTypeHash)
	uint8                                        Pad_634A[0x7];                                     // Fixing Size After Last Property 
	int64                                        _AsyncResult_99;                                   // 0x868(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	static class UClass* StaticClass();
	static class UTask_CompanionAI_companion_ai_runtime_GameLoop* GetDefaultObj();

	int64 Update();
};

// 0x7F0 (0x930 - 0x140)
// VerseClass CompanionAI.task_CompanionAI_companion_ai_runtime$GetAttackCommandTarget_L_Nping__info_R
class UTask_CompanionAI_companion_ai_runtime_GetAttackCommandTarget_L_Nping__info_R : public UConcurrency_task
{
public:
	class UCompanionAI_companion_ai_runtime*     _Self;                                             // 0x140(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FCompanionAI_ping_info                __verse_0xB2CDDD72_Argument;                       // 0x148(0x38)(Parm, NoDestructor)
	FOptionalProperty_                           _RetVal;                                           // 0x180(0x40)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor)
	FVerseDynamicProperty_                       InvokeResultDummy_0;                               // 0x1C0(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_1;                                // 0x1D0(0x18)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_2;                                     // 0x1E8(0x10)(HasGetValueTypeHash)
	uint8                                        _ExprResult_3 : 1;                                 // Mask: 0x1, PropSize: 0x10x1F8(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_417 : 7;                                    // Fixing Bit-Field Size 
	uint8                                        Pad_634B[0x7];                                     // Fixing Size After Last Property 
	class UObject*                               __verse_0x00000000__3;                             // 0x200(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_4;                                         // 0x208(0x10)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_5;                                     // 0x218(0x1)(HasGetValueTypeHash)
	uint8                                        Pad_634C[0x7];                                     // Fixing Size After Last Property 
	FVerseDynamicProperty_                       _ExprResult_6;                                     // 0x220(0x10)(HasGetValueTypeHash)
	class UConcurrency_task*                     _AsyncTask_7;                                      // 0x230(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _AsyncTaskClass_8;                                 // 0x238(0x10)(HasGetValueTypeHash)
	int64                                        _AsyncResult_9;                                    // 0x248(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       __verse_0x0E44D420_ClosestTargetDistance_4;        // 0x250(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FOptionalProperty_                           __verse_0xA08A30EA_ClosestTarget_4;                // 0x258(0x40)(ZeroConstructor, NoDestructor)
	FOptionalProperty_                           __verse_0x00000000__5;                             // 0x298(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        _ExprResult_10 : 1;                                // Mask: 0x1, PropSize: 0x10x29A(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_418 : 7;                                    // Fixing Bit-Field Size 
	FOptionalProperty_                           _ExprResultStack_11;                               // 0x29B(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_634E[0x3];                                     // Fixing Size After Last Property 
	TArray<struct FAI_fort_threat_info>          _ForIterable_12;                                   // 0x2A0(0x10)(ContainsInstancedReference)
	class UObject*                               __verse_0x00000000__9;                             // 0x2B0(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_13;                               // 0x2B8(0x18)(ZeroConstructor, ContainsInstancedReference)
	FVerseFunctionProperty_                      _Callee_14;                                        // 0x2D0(0x10)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_15;                                    // 0x2E0(0x1)(HasGetValueTypeHash)
	uint8                                        Pad_634F[0x7];                                     // Fixing Size After Last Property 
	int64                                        _ForIndex_16;                                      // 0x2E8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        _ForLength_17;                                     // 0x2F0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAI_fort_threat_info                  __verse_0xD4ED8431_Threat_10;                      // 0x2F8(0x38)(NoDestructor)
	FVerseDynamicProperty_                       InvokeResultDummy_18;                              // 0x330(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_19;                               // 0x340(0x18)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_20;                                    // 0x358(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_21;                               // 0x368(0x8)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_22;                                        // 0x370(0x10)(HasGetValueTypeHash)
	struct FTuple_Lgame__action__instigator_Mtuple_L_R_Mtuple_L_R_R _ExprResult_23;                                    // 0x380(0xA)(HasGetValueTypeHash)
	uint8                                        Pad_6351[0x6];                                     // Fixing Size After Last Property 
	FOptionalProperty_                           _ExprResultStack_24;                               // 0x390(0x8)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_25;                                    // 0x398(0x1)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_26;                                    // 0x399(0x1)(HasGetValueTypeHash)
	uint8                                        Pad_6352[0x6];                                     // Fixing Size After Last Property 
	FVerseDynamicProperty_                       _ExprResult_27;                                    // 0x3A0(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_28;                               // 0x3B0(0x8)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_29;                                        // 0x3B8(0x10)(HasGetValueTypeHash)
	struct FTuple_Lentity_Mtuple_L_R_Mtuple_L_R_R _ExprResult_30;                                    // 0x3C8(0xA)(HasGetValueTypeHash)
	uint8                                        Pad_6355[0x6];                                     // Fixing Size After Last Property 
	FOptionalProperty_                           _ExprResultStack_31;                               // 0x3D8(0x8)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_32;                                    // 0x3E0(0x1)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_33;                                    // 0x3E1(0x1)(HasGetValueTypeHash)
	enum class EVerseTrue                        _InvokeSureResultDummy_34;                         // 0x3E2(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_6357[0x5];                                     // Fixing Size After Last Property 
	FVerseFunctionProperty_                      _Callee_35;                                        // 0x3E8(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_36;                                    // 0x3F8(0x10)(HasGetValueTypeHash)
	double                                       __verse_0xD58F9071_TargetDistance_15;              // 0x408(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_37;                                        // 0x410(0x10)(HasGetValueTypeHash)
	struct FTuple_Lvector3_Mvector3_R            _ExprResult_38;                                    // 0x420(0x30)(HasGetValueTypeHash)
	struct FSpatialMath_vector3                  _ExprResultStack_39;                               // 0x450(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_40;                                        // 0x468(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_41;                               // 0x478(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_42;                                    // 0x488(0x40)(ZeroConstructor, NoDestructor)
	struct FAI_fort_threat_info                  __verse_0x19FFC917_AttackTarget_17;                // 0x4C8(0x38)(NoDestructor)
	FOptionalProperty_                           _ExprResultStack_43;                               // 0x500(0x40)(ZeroConstructor, NoDestructor)
	enum class EVerseTrue                        _InvokeSureResultDummy_44;                         // 0x540(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_6359[0x7];                                     // Fixing Size After Last Property 
	FVerseFunctionProperty_                      _Callee_45;                                        // 0x548(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_46;                                    // 0x558(0x10)(HasGetValueTypeHash)
	FVerseFunctionProperty_                      _AsyncTaskClass_47;                                // 0x568(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       InvokeResultDummy_48;                              // 0x578(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_49;                               // 0x588(0x18)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_50;                                    // 0x5A0(0x10)(HasGetValueTypeHash)
	uint8                                        _ExprResult_51 : 1;                                // Mask: 0x1, PropSize: 0x10x5B0(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_419 : 7;                                    // Fixing Bit-Field Size 
	uint8                                        Pad_635B[0x7];                                     // Fixing Size After Last Property 
	class UObject*                               __verse_0x00000000__21;                            // 0x5B8(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_52;                                        // 0x5C0(0x10)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_53;                                    // 0x5D0(0x1)(HasGetValueTypeHash)
	uint8                                        Pad_635C[0x7];                                     // Fixing Size After Last Property 
	FVerseDynamicProperty_                       _ExprResult_54;                                    // 0x5D8(0x10)(HasGetValueTypeHash)
	class UConcurrency_task*                     _AsyncTask_55;                                     // 0x5E8(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _AsyncTaskClass_56;                                // 0x5F0(0x10)(HasGetValueTypeHash)
	int64                                        _AsyncResult_57;                                   // 0x600(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       __verse_0x0E44D420_ClosestTargetDistance_22;       // 0x608(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FOptionalProperty_                           __verse_0xA08A30EA_ClosestTarget_22;               // 0x610(0x40)(ZeroConstructor, NoDestructor)
	FOptionalProperty_                           __verse_0x00000000__23;                            // 0x650(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        _ExprResult_58 : 1;                                // Mask: 0x1, PropSize: 0x10x652(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_41A : 7;                                    // Fixing Bit-Field Size 
	FOptionalProperty_                           _ExprResultStack_59;                               // 0x653(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_6362[0x3];                                     // Fixing Size After Last Property 
	TArray<struct FAI_fort_threat_info>          _ForIterable_60;                                   // 0x658(0x10)(ContainsInstancedReference)
	class UObject*                               __verse_0x00000000__27;                            // 0x668(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_61;                               // 0x670(0x18)(ZeroConstructor, ContainsInstancedReference)
	FVerseFunctionProperty_                      _Callee_62;                                        // 0x688(0x10)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_63;                                    // 0x698(0x1)(HasGetValueTypeHash)
	uint8                                        Pad_6363[0x7];                                     // Fixing Size After Last Property 
	int64                                        _ForIndex_64;                                      // 0x6A0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        _ForLength_65;                                     // 0x6A8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAI_fort_threat_info                  __verse_0xD4ED8431_Threat_28;                      // 0x6B0(0x38)(NoDestructor)
	FVerseDynamicProperty_                       InvokeResultDummy_66;                              // 0x6E8(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_67;                               // 0x6F8(0x18)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_68;                                    // 0x710(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_69;                               // 0x720(0x8)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_70;                                        // 0x728(0x10)(HasGetValueTypeHash)
	struct FTuple_Lgame__action__instigator_Mtuple_L_R_Mtuple_L_R_R _ExprResult_71;                                    // 0x738(0xA)(HasGetValueTypeHash)
	uint8                                        Pad_6367[0x6];                                     // Fixing Size After Last Property 
	FOptionalProperty_                           _ExprResultStack_72;                               // 0x748(0x8)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_73;                                    // 0x750(0x1)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_74;                                    // 0x751(0x1)(HasGetValueTypeHash)
	uint8                                        Pad_6368[0x6];                                     // Fixing Size After Last Property 
	FVerseDynamicProperty_                       _ExprResult_75;                                    // 0x758(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_76;                               // 0x768(0x8)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_77;                                        // 0x770(0x10)(HasGetValueTypeHash)
	struct FTuple_Lentity_Mtuple_L_R_Mtuple_L_R_R _ExprResult_78;                                    // 0x780(0xA)(HasGetValueTypeHash)
	uint8                                        Pad_636A[0x6];                                     // Fixing Size After Last Property 
	FOptionalProperty_                           _ExprResultStack_79;                               // 0x790(0x8)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_80;                                    // 0x798(0x1)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_81;                                    // 0x799(0x1)(HasGetValueTypeHash)
	enum class EVerseTrue                        _InvokeSureResultDummy_82;                         // 0x79A(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_636B[0x5];                                     // Fixing Size After Last Property 
	FVerseFunctionProperty_                      _Callee_83;                                        // 0x7A0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_84;                                    // 0x7B0(0x10)(HasGetValueTypeHash)
	double                                       __verse_0xD58F9071_TargetDistance_33;              // 0x7C0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_85;                                        // 0x7C8(0x10)(HasGetValueTypeHash)
	struct FTuple_Lvector3_Mvector3_R            _ExprResult_86;                                    // 0x7D8(0x30)(HasGetValueTypeHash)
	struct FSpatialMath_vector3                  _ExprResultStack_87;                               // 0x808(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_88;                                        // 0x820(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_89;                               // 0x830(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_90;                                    // 0x840(0x40)(ZeroConstructor, NoDestructor)
	struct FAI_fort_threat_info                  __verse_0x19FFC917_AttackTarget_35;                // 0x880(0x38)(NoDestructor)
	FOptionalProperty_                           _ExprResultStack_91;                               // 0x8B8(0x40)(ZeroConstructor, NoDestructor)
	enum class EVerseTrue                        _InvokeSureResultDummy_92;                         // 0x8F8(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_6370[0x7];                                     // Fixing Size After Last Property 
	FVerseFunctionProperty_                      _Callee_93;                                        // 0x900(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_94;                                    // 0x910(0x10)(HasGetValueTypeHash)
	FVerseFunctionProperty_                      _AsyncTaskClass_95;                                // 0x920(0x10)(HasGetValueTypeHash)

	static class UClass* StaticClass();
	static class UTask_CompanionAI_companion_ai_runtime_GetAttackCommandTarget_L_Nping__info_R* GetDefaultObj();

	int64 Update();
};

// 0x150 (0x290 - 0x140)
// VerseClass CompanionAI.task_CompanionAI_companion_ai_runtime$GetNewObstacle
class UTask_CompanionAI_companion_ai_runtime_GetNewObstacle : public UConcurrency_task
{
public:
	class UCompanionAI_companion_ai_runtime*     _Self;                                             // 0x140(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x148(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_6371[0x7];                                     // Fixing Size After Last Property 
	FOptionalProperty_                           _RetVal;                                           // 0x150(0x30)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor)
	struct FVerseAIBase_fort_obstacle_info       __verse_0x39C5E53E_ObstacleInfo_1;                 // 0x180(0x28)(NoDestructor)
	class UObject*                               __verse_0x00000000__2;                             // 0x1A8(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UObject*                               __verse_0x00000000__3;                             // 0x1B0(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_0;                                         // 0x1B8(0x10)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_1;                                     // 0x1C8(0x1)(HasGetValueTypeHash)
	uint8                                        Pad_6372[0x7];                                     // Fixing Size After Last Property 
	FVerseDynamicProperty_                       _ExprResult_2;                                     // 0x1D0(0x10)(HasGetValueTypeHash)
	class UConcurrency_task*                     _AsyncTask_3;                                      // 0x1E0(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _AsyncTaskClass_4;                                 // 0x1E8(0x10)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_5;                                     // 0x1F8(0x1)(HasGetValueTypeHash)
	uint8                                        Pad_6373[0x7];                                     // Fixing Size After Last Property 
	int64                                        _AsyncResult_6;                                    // 0x200(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVerseAIBase_fort_obstacle_info       __verse_0x39C5E53E_ObstacleInfo_4;                 // 0x208(0x28)(NoDestructor)
	class UObject*                               __verse_0x00000000__5;                             // 0x230(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UObject*                               __verse_0x00000000__6;                             // 0x238(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_7;                                         // 0x240(0x10)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_8;                                     // 0x250(0x1)(HasGetValueTypeHash)
	uint8                                        Pad_6374[0x7];                                     // Fixing Size After Last Property 
	FVerseDynamicProperty_                       _ExprResult_9;                                     // 0x258(0x10)(HasGetValueTypeHash)
	class UConcurrency_task*                     _AsyncTask_10;                                     // 0x268(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _AsyncTaskClass_11;                                // 0x270(0x10)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_12;                                    // 0x280(0x1)(HasGetValueTypeHash)
	uint8                                        Pad_6375[0x7];                                     // Fixing Size After Last Property 
	int64                                        _AsyncResult_13;                                   // 0x288(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	static class UClass* StaticClass();
	static class UTask_CompanionAI_companion_ai_runtime_GetNewObstacle* GetDefaultObj();

	int64 Update();
};

// 0x180 (0x2C0 - 0x140)
// VerseClass CompanionAI.task_CompanionAI_companion_ai_runtime$GetNewTargetPerception
class UTask_CompanionAI_companion_ai_runtime_GetNewTargetPerception : public UConcurrency_task
{
public:
	class UCompanionAI_companion_ai_runtime*     _Self;                                             // 0x140(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x148(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_6381[0x7];                                     // Fixing Size After Last Property 
	FOptionalProperty_                           _RetVal;                                           // 0x150(0x40)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor)
	struct FAI_fort_threat_info                  __verse_0x1EB80E5B_ThreatInfo_1;                   // 0x190(0x38)(NoDestructor)
	class UObject*                               __verse_0x00000000__2;                             // 0x1C8(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UObject*                               __verse_0x00000000__3;                             // 0x1D0(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_0;                                         // 0x1D8(0x10)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_1;                                     // 0x1E8(0x1)(HasGetValueTypeHash)
	uint8                                        Pad_6384[0x7];                                     // Fixing Size After Last Property 
	FVerseDynamicProperty_                       _ExprResult_2;                                     // 0x1F0(0x10)(HasGetValueTypeHash)
	class UConcurrency_task*                     _AsyncTask_3;                                      // 0x200(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _AsyncTaskClass_4;                                 // 0x208(0x10)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_5;                                     // 0x218(0x1)(HasGetValueTypeHash)
	uint8                                        Pad_6386[0x7];                                     // Fixing Size After Last Property 
	int64                                        _AsyncResult_6;                                    // 0x220(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAI_fort_threat_info                  __verse_0x1EB80E5B_ThreatInfo_4;                   // 0x228(0x38)(NoDestructor)
	class UObject*                               __verse_0x00000000__5;                             // 0x260(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UObject*                               __verse_0x00000000__6;                             // 0x268(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_7;                                         // 0x270(0x10)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_8;                                     // 0x280(0x1)(HasGetValueTypeHash)
	uint8                                        Pad_638A[0x7];                                     // Fixing Size After Last Property 
	FVerseDynamicProperty_                       _ExprResult_9;                                     // 0x288(0x10)(HasGetValueTypeHash)
	class UConcurrency_task*                     _AsyncTask_10;                                     // 0x298(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _AsyncTaskClass_11;                                // 0x2A0(0x10)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_12;                                    // 0x2B0(0x1)(HasGetValueTypeHash)
	uint8                                        Pad_638C[0x7];                                     // Fixing Size After Last Property 
	int64                                        _AsyncResult_13;                                   // 0x2B8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	static class UClass* StaticClass();
	static class UTask_CompanionAI_companion_ai_runtime_GetNewTargetPerception* GetDefaultObj();

	int64 Update();
};

// 0x180 (0x2C0 - 0x140)
// VerseClass CompanionAI.task_CompanionAI_companion_ai_runtime$GetNewThreat
class UTask_CompanionAI_companion_ai_runtime_GetNewThreat : public UConcurrency_task
{
public:
	class UCompanionAI_companion_ai_runtime*     _Self;                                             // 0x140(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x148(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_6390[0x7];                                     // Fixing Size After Last Property 
	FOptionalProperty_                           _RetVal;                                           // 0x150(0x40)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor)
	struct FAI_fort_threat_info                  __verse_0x1EB80E5B_ThreatInfo_1;                   // 0x190(0x38)(NoDestructor)
	class UObject*                               __verse_0x00000000__2;                             // 0x1C8(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UObject*                               __verse_0x00000000__3;                             // 0x1D0(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_0;                                         // 0x1D8(0x10)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_1;                                     // 0x1E8(0x1)(HasGetValueTypeHash)
	uint8                                        Pad_6391[0x7];                                     // Fixing Size After Last Property 
	FVerseDynamicProperty_                       _ExprResult_2;                                     // 0x1F0(0x10)(HasGetValueTypeHash)
	class UConcurrency_task*                     _AsyncTask_3;                                      // 0x200(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _AsyncTaskClass_4;                                 // 0x208(0x10)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_5;                                     // 0x218(0x1)(HasGetValueTypeHash)
	uint8                                        Pad_6392[0x7];                                     // Fixing Size After Last Property 
	int64                                        _AsyncResult_6;                                    // 0x220(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAI_fort_threat_info                  __verse_0x1EB80E5B_ThreatInfo_4;                   // 0x228(0x38)(NoDestructor)
	class UObject*                               __verse_0x00000000__5;                             // 0x260(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UObject*                               __verse_0x00000000__6;                             // 0x268(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_7;                                         // 0x270(0x10)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_8;                                     // 0x280(0x1)(HasGetValueTypeHash)
	uint8                                        Pad_6394[0x7];                                     // Fixing Size After Last Property 
	FVerseDynamicProperty_                       _ExprResult_9;                                     // 0x288(0x10)(HasGetValueTypeHash)
	class UConcurrency_task*                     _AsyncTask_10;                                     // 0x298(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _AsyncTaskClass_11;                                // 0x2A0(0x10)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_12;                                    // 0x2B0(0x1)(HasGetValueTypeHash)
	uint8                                        Pad_6395[0x7];                                     // Fixing Size After Last Property 
	int64                                        _AsyncResult_13;                                   // 0x2B8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	static class UClass* StaticClass();
	static class UTask_CompanionAI_companion_ai_runtime_GetNewThreat* GetDefaultObj();

	int64 Update();
};

// 0x134 (0x274 - 0x140)
// VerseClass CompanionAI.task_CompanionAI_companion_ai_runtime$GetObstacle
class UTask_CompanionAI_companion_ai_runtime_GetObstacle : public UConcurrency_task
{
public:
	class UCompanionAI_companion_ai_runtime*     _Self;                                             // 0x140(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x148(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_6398[0x7];                                     // Fixing Size After Last Property 
	FOptionalProperty_                           _RetVal;                                           // 0x150(0x30)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor)
	FOptionalProperty_                           __verse_0x00000000__1;                             // 0x180(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_6399[0x6];                                     // Fixing Size After Last Property 
	struct FVerseAIBase_fort_obstacle_info       __verse_0x39C5E53E_ObstacleInfo_3;                 // 0x188(0x28)(NoDestructor)
	class UObject*                               __verse_0x00000000__4;                             // 0x1B0(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_0;                                // 0x1B8(0x30)(ZeroConstructor, NoDestructor)
	FVerseFunctionProperty_                      _Callee_1;                                         // 0x1E8(0x10)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_2;                                     // 0x1F8(0x1)(HasGetValueTypeHash)
	uint8                                        _ExprResult_3 : 1;                                 // Mask: 0x1, PropSize: 0x10x1F9(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_41B : 7;                                    // Fixing Bit-Field Size 
	FOptionalProperty_                           _ExprResultStack_4;                                // 0x1FA(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FOptionalProperty_                           __verse_0x00000000__7;                             // 0x1FC(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_639F[0x2];                                     // Fixing Size After Last Property 
	struct FVerseAIBase_fort_obstacle_info       __verse_0x39C5E53E_ObstacleInfo_9;                 // 0x200(0x28)(NoDestructor)
	class UObject*                               __verse_0x00000000__10;                            // 0x228(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_5;                                // 0x230(0x30)(ZeroConstructor, NoDestructor)
	FVerseFunctionProperty_                      _Callee_6;                                         // 0x260(0x10)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_7;                                     // 0x270(0x1)(HasGetValueTypeHash)
	uint8                                        _ExprResult_8 : 1;                                 // Mask: 0x1, PropSize: 0x10x271(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_41C : 7;                                    // Fixing Bit-Field Size 
	FOptionalProperty_                           _ExprResultStack_9;                                // 0x272(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	static class UClass* StaticClass();
	static class UTask_CompanionAI_companion_ai_runtime_GetObstacle* GetDefaultObj();

	int64 Update();
};

// 0x184 (0x2C4 - 0x140)
// VerseClass CompanionAI.task_CompanionAI_companion_ai_runtime$GetThreat
class UTask_CompanionAI_companion_ai_runtime_GetThreat : public UConcurrency_task
{
public:
	class UCompanionAI_companion_ai_runtime*     _Self;                                             // 0x140(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x148(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_63A3[0x7];                                     // Fixing Size After Last Property 
	FOptionalProperty_                           _RetVal;                                           // 0x150(0x40)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor)
	FOptionalProperty_                           __verse_0x00000000__1;                             // 0x190(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_63A5[0x6];                                     // Fixing Size After Last Property 
	struct FAI_fort_threat_info                  __verse_0x1EB80E5B_ThreatInfo_3;                   // 0x198(0x38)(NoDestructor)
	class UObject*                               __verse_0x00000000__4;                             // 0x1D0(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_0;                                // 0x1D8(0x40)(ZeroConstructor, NoDestructor)
	FVerseFunctionProperty_                      _Callee_1;                                         // 0x218(0x10)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_2;                                     // 0x228(0x1)(HasGetValueTypeHash)
	uint8                                        _ExprResult_3 : 1;                                 // Mask: 0x1, PropSize: 0x10x229(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_41D : 7;                                    // Fixing Bit-Field Size 
	FOptionalProperty_                           _ExprResultStack_4;                                // 0x22A(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FOptionalProperty_                           __verse_0x00000000__7;                             // 0x22C(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_63A7[0x2];                                     // Fixing Size After Last Property 
	struct FAI_fort_threat_info                  __verse_0x1EB80E5B_ThreatInfo_9;                   // 0x230(0x38)(NoDestructor)
	class UObject*                               __verse_0x00000000__10;                            // 0x268(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_5;                                // 0x270(0x40)(ZeroConstructor, NoDestructor)
	FVerseFunctionProperty_                      _Callee_6;                                         // 0x2B0(0x10)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_7;                                     // 0x2C0(0x1)(HasGetValueTypeHash)
	uint8                                        _ExprResult_8 : 1;                                 // Mask: 0x1, PropSize: 0x10x2C1(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_41E : 7;                                    // Fixing Bit-Field Size 
	FOptionalProperty_                           _ExprResultStack_9;                                // 0x2C2(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	static class UClass* StaticClass();
	static class UTask_CompanionAI_companion_ai_runtime_GetThreat* GetDefaultObj();

	int64 Update();
};

// 0x210 (0x350 - 0x140)
// VerseClass CompanionAI.task_CompanionAI_companion_ai_runtime$GoToAndAttackTask_L_Nfort__threat__info_R
class UTask_CompanionAI_companion_ai_runtime_GoToAndAttackTask_L_Nfort__threat__info_R : public UConcurrency_task
{
public:
	class UCompanionAI_companion_ai_runtime*     _Self;                                             // 0x140(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FAI_fort_threat_info                  __verse_0xB2CDDD72_Argument;                       // 0x148(0x38)(Parm, NoDestructor)
	enum class EVerseTrue                        _InvokeSureResultDummy_0;                          // 0x180(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_63AE[0x7];                                     // Fixing Size After Last Property 
	FVerseFunctionProperty_                      _Callee_1;                                         // 0x188(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_2;                                     // 0x198(0x10)(HasGetValueTypeHash)
	uint8                                        _AsyncBeginCount_3 : 1;                            // Mask: 0x1, PropSize: 0x10x1A8(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_41F : 7;                                    // Fixing Bit-Field Size 
	uint8                                        Pad_63B0[0x7];                                     // Fixing Size After Last Property 
	class UConcurrency_task*                     _AsyncTask_4;                                      // 0x1B0(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _AsyncTaskClass_5;                                 // 0x1B8(0x10)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_6;                                     // 0x1C8(0x1)(HasGetValueTypeHash)
	uint8                                        Pad_63B1[0x7];                                     // Fixing Size After Last Property 
	int64                                        _AsyncResult_7;                                    // 0x1D0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        _AsyncBeginCount_8 : 1;                            // Mask: 0x1, PropSize: 0x10x1D8(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_420 : 7;                                    // Fixing Bit-Field Size 
	uint8                                        _AsyncBeginCount_9 : 1;                            // Mask: 0x1, PropSize: 0x10x1D9(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_421 : 7;                                    // Fixing Bit-Field Size 
	uint8                                        Pad_63B3[0x6];                                     // Fixing Size After Last Property 
	class UObject*                               __verse_0x00000000__2;                             // 0x1E0(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UConcurrency_task*                     _AsyncTask_10;                                     // 0x1E8(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _AsyncTaskClass_11;                                // 0x1F0(0x10)(HasGetValueTypeHash)
	int64                                        _AsyncResult_12;                                   // 0x200(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        _AsyncBeginCount_13 : 1;                           // Mask: 0x1, PropSize: 0x10x208(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_422 : 7;                                    // Fixing Bit-Field Size 
	uint8                                        Pad_63B5[0x7];                                     // Fixing Size After Last Property 
	class UObject*                               __verse_0x00000000__3;                             // 0x210(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UConcurrency_task*                     _AsyncTask_14;                                     // 0x218(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _AsyncTaskClass_15;                                // 0x220(0x10)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_16;                                    // 0x230(0x1)(HasGetValueTypeHash)
	uint8                                        Pad_63B6[0x7];                                     // Fixing Size After Last Property 
	int64                                        _AsyncResult_17;                                   // 0x238(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class EVerseTrue                        _InvokeSureResultDummy_18;                         // 0x240(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_63B7[0x7];                                     // Fixing Size After Last Property 
	FVerseFunctionProperty_                      _Callee_19;                                        // 0x248(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_20;                                    // 0x258(0x10)(HasGetValueTypeHash)
	enum class EVerseTrue                        _InvokeSureResultDummy_21;                         // 0x268(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_63B8[0x7];                                     // Fixing Size After Last Property 
	FVerseFunctionProperty_                      _Callee_22;                                        // 0x270(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_23;                                    // 0x280(0x10)(HasGetValueTypeHash)
	uint8                                        _AsyncBeginCount_24 : 1;                           // Mask: 0x1, PropSize: 0x10x290(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_423 : 7;                                    // Fixing Bit-Field Size 
	uint8                                        Pad_63B9[0x7];                                     // Fixing Size After Last Property 
	class UConcurrency_task*                     _AsyncTask_25;                                     // 0x298(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _AsyncTaskClass_26;                                // 0x2A0(0x10)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_27;                                    // 0x2B0(0x1)(HasGetValueTypeHash)
	uint8                                        Pad_63BC[0x7];                                     // Fixing Size After Last Property 
	int64                                        _AsyncResult_28;                                   // 0x2B8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        _AsyncBeginCount_29 : 1;                           // Mask: 0x1, PropSize: 0x10x2C0(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_424 : 7;                                    // Fixing Bit-Field Size 
	uint8                                        _AsyncBeginCount_30 : 1;                           // Mask: 0x1, PropSize: 0x10x2C1(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_425 : 7;                                    // Fixing Bit-Field Size 
	uint8                                        Pad_63BE[0x6];                                     // Fixing Size After Last Property 
	class UObject*                               __verse_0x00000000__6;                             // 0x2C8(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UConcurrency_task*                     _AsyncTask_31;                                     // 0x2D0(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _AsyncTaskClass_32;                                // 0x2D8(0x10)(HasGetValueTypeHash)
	int64                                        _AsyncResult_33;                                   // 0x2E8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        _AsyncBeginCount_34 : 1;                           // Mask: 0x1, PropSize: 0x10x2F0(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_426 : 7;                                    // Fixing Bit-Field Size 
	uint8                                        Pad_63BF[0x7];                                     // Fixing Size After Last Property 
	class UObject*                               __verse_0x00000000__7;                             // 0x2F8(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UConcurrency_task*                     _AsyncTask_35;                                     // 0x300(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _AsyncTaskClass_36;                                // 0x308(0x10)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_37;                                    // 0x318(0x1)(HasGetValueTypeHash)
	uint8                                        Pad_63C2[0x7];                                     // Fixing Size After Last Property 
	int64                                        _AsyncResult_38;                                   // 0x320(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class EVerseTrue                        _InvokeSureResultDummy_39;                         // 0x328(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_63C3[0x7];                                     // Fixing Size After Last Property 
	FVerseFunctionProperty_                      _Callee_40;                                        // 0x330(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_41;                                    // 0x340(0x10)(HasGetValueTypeHash)

	static class UClass* StaticClass();
	static class UTask_CompanionAI_companion_ai_runtime_GoToAndAttackTask_L_Nfort__threat__info_R* GetDefaultObj();

	int64 Update();
};

// 0x818 (0x958 - 0x140)
// VerseClass CompanionAI.task_CompanionAI_companion_ai_runtime$GoToPositionTask_L_Nvector3_M_N_Qagent_M_Nlogic_M_N_QReachRadius_Nfloat_20_3d_20_2e_2e_2e_M_N_QAllowPartialPath_Nlogic_20_3d_20_2e_2e_2e_R
class UTask_CompanionAI_companion_ai_runtime_GoToPositionTask_L_Nvector3_M_N_Qagent_M_Nlogic_M_N_QReachRadius_Nfloat_20_3d_20_2e_2e_2e_M_N_QAllowPartialPath_Nlogic_20_3d_20_2e_2e_2e_R : public UConcurrency_task
{
public:
	class UCompanionAI_companion_ai_runtime*     _Self;                                             // 0x140(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTuple_Lvector3_M_Qagent_Mlogic_M_QReachRadius_Nfloat_20_3d_20_2e_2e_2e_M_QAllowPartialPath_Nlogic_20_3d_20_2e_2e_2e_R __verse_0xB2CDDD72_Argument;                       // 0x148(0x3A)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_63CB[0x6];                                     // Fixing Size After Last Property 
	uint8                                        _RetVal : 1;                                       // Mask: 0x1, PropSize: 0x10x188(0x1)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_427 : 7;                                    // Fixing Bit-Field Size 
	enum class EVerseTrue                        _InvokeSureResultDummy_0;                          // 0x189(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_63CC[0x6];                                     // Fixing Size After Last Property 
	FVerseFunctionProperty_                      _Callee_1;                                         // 0x190(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_2;                                     // 0x1A0(0x10)(HasGetValueTypeHash)
	TArray<FVerseDynamicProperty_>               __verse_0xFFC68BC5_Array_2;                        // 0x1B0(0x10)(ContainsInstancedReference)
	FVerseFunctionProperty_                      _Callee_3;                                         // 0x1C0(0x10)(HasGetValueTypeHash)
	TArray<TArray<FVerseDynamicProperty_>>       _ExprResult_4;                                     // 0x1D0(0x10)(ContainsInstancedReference)
	TArray<FVerseStringProperty_>                __verse_0xFFC68BC5_Array_3;                        // 0x1E0(0x10)(ContainsInstancedReference)
	struct FTuple_L_Kchar_M_Kchar_R              __verse_0x00000000__4;                             // 0x1F0(0x20)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_5;                                     // 0x210(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResultStack_6;                                // 0x220(0x10)(HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_7;                                         // 0x230(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResultStack_8;                                // 0x240(0x10)(HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_9;                                         // 0x250(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResultDummy_10;                               // 0x260(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResultDummy_11;                               // 0x270(0x10)(HasGetValueTypeHash)
	TArray<TArray<FVerseDynamicProperty_>>       _ForResult_12;                                     // 0x280(0x10)(ContainsInstancedReference)
	int64                                        _ForIndex_13;                                      // 0x290(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        _ForLength_14;                                     // 0x298(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                        __verse_0xFB88B569_Item_6;                         // 0x2A0(0x10)(HasGetValueTypeHash)
	TArray<FVerseDynamicProperty_>               _ExprResult_15;                                    // 0x2B0(0x10)(ContainsInstancedReference)
	FVerseStringProperty_                        __verse_0xFFC68BC5_Array_7;                        // 0x2C0(0x10)(HasGetValueTypeHash)
	TArray<FVerseDynamicProperty_>               _ForResult_16;                                     // 0x2D0(0x10)(ContainsInstancedReference)
	int64                                        _ForIndex_17;                                      // 0x2E0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        _ForLength_18;                                     // 0x2E8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        __verse_0xFB88B569_Item_9;                         // 0x2F0(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_63CE[0x7];                                     // Fixing Size After Last Property 
	FVerseDynamicProperty_                       _ExprResult_19;                                    // 0x2F8(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ForResult_20;                                     // 0x308(0x10)(HasGetValueTypeHash)
	int64                                        _ForIndex_21;                                      // 0x318(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        _ForLength_22;                                     // 0x320(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       __verse_0xFB88B569_Item_11;                        // 0x328(0x10)(HasGetValueTypeHash)
	uint8                                        _ExprResult_23;                                    // 0x338(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_24;                               // 0x339(0x2)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                        _AsyncBeginCount_25 : 1;                           // Mask: 0x1, PropSize: 0x10x33B(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_428 : 7;                                    // Fixing Bit-Field Size 
	uint8                                        Pad_63CF[0x4];                                     // Fixing Size After Last Property 
	class UConcurrency_task*                     _AsyncTask_26;                                     // 0x340(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _AsyncTaskClass_27;                                // 0x348(0x10)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_28;                                    // 0x358(0x1)(HasGetValueTypeHash)
	uint8                                        Pad_63D0[0x7];                                     // Fixing Size After Last Property 
	int64                                        _AsyncResult_29;                                   // 0x360(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USimulation_agent*                     __verse_0xFE707B39_TargetCharacter_14;             // 0x368(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_30;                               // 0x370(0x8)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	enum class EAI_navigation_result             __verse_0x95D09D0E_Result_14;                      // 0x378(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_63D1[0x7];                                     // Fixing Size After Last Property 
	class UObject*                               __verse_0x00000000__15;                            // 0x380(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UConcurrency_task*                     _AsyncTask_31;                                     // 0x388(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _AsyncTaskClass_32;                                // 0x390(0x10)(HasGetValueTypeHash)
	struct FTuple_Lnavigation__target_M_QReachRadius_Nfloat_M_QAllowPartialPath_Nlogic_R _ExprResult_33;                                    // 0x3A0(0x1A)(HasGetValueTypeHash)
	uint8                                        Pad_63D2[0x6];                                     // Fixing Size After Last Property 
	class UAI_navigation_target*                 _ExprResultStack_35;                               // 0x3C0(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_36;                                        // 0x3C8(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_37;                                    // 0x3D8(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_38;                                    // 0x3E8(0x2)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_63D4[0x6];                                     // Fixing Size After Last Property 
	int64                                        _AsyncResult_39;                                   // 0x3F0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       InvokeResultDummy_40;                              // 0x3F8(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_41;                               // 0x408(0x18)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_42;                                    // 0x420(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_43;                                    // 0x430(0x10)(HasGetValueTypeHash)
	enum class EVerseTrue                        _InvokeSureResultDummy_44;                         // 0x440(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_63D6[0x7];                                     // Fixing Size After Last Property 
	FVerseFunctionProperty_                      _Callee_45;                                        // 0x448(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_46;                                    // 0x458(0x10)(HasGetValueTypeHash)
	enum class EAI_navigation_result             __verse_0x95D09D0E_Result_18;                      // 0x468(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_63D9[0x7];                                     // Fixing Size After Last Property 
	class UObject*                               __verse_0x00000000__19;                            // 0x470(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _AsyncTaskClass_47;                                // 0x478(0x10)(HasGetValueTypeHash)
	struct FTuple_Lnavigation__target_M_QReachRadius_Nfloat_M_QAllowPartialPath_Nlogic_R _ExprResult_48;                                    // 0x488(0x1A)(HasGetValueTypeHash)
	uint8                                        Pad_63DA[0x6];                                     // Fixing Size After Last Property 
	class UAI_navigation_target*                 _ExprResultStack_50;                               // 0x4A8(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_51;                                        // 0x4B0(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_52;                                    // 0x4C0(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_53;                                    // 0x4D0(0x2)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_63DD[0x6];                                     // Fixing Size After Last Property 
	FVerseDynamicProperty_                       InvokeResultDummy_54;                              // 0x4D8(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_55;                               // 0x4E8(0x18)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_56;                                    // 0x500(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_57;                                    // 0x510(0x10)(HasGetValueTypeHash)
	enum class EVerseTrue                        _InvokeSureResultDummy_58;                         // 0x520(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_63DE[0x7];                                     // Fixing Size After Last Property 
	FVerseFunctionProperty_                      _Callee_59;                                        // 0x528(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_60;                                    // 0x538(0x10)(HasGetValueTypeHash)
	enum class EVerseTrue                        _InvokeSureResultDummy_61;                         // 0x548(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_63DF[0x7];                                     // Fixing Size After Last Property 
	FVerseFunctionProperty_                      _Callee_62;                                        // 0x550(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_63;                                    // 0x560(0x10)(HasGetValueTypeHash)
	enum class EVerseTrue                        _InvokeSureResultDummy_64;                         // 0x570(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_63E2[0x7];                                     // Fixing Size After Last Property 
	FVerseFunctionProperty_                      _Callee_65;                                        // 0x578(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_66;                                    // 0x588(0x10)(HasGetValueTypeHash)
	TArray<FVerseDynamicProperty_>               __verse_0xFFC68BC5_Array_24;                       // 0x598(0x10)(ContainsInstancedReference)
	FVerseFunctionProperty_                      _Callee_67;                                        // 0x5A8(0x10)(HasGetValueTypeHash)
	TArray<TArray<FVerseDynamicProperty_>>       _ExprResult_68;                                    // 0x5B8(0x10)(ContainsInstancedReference)
	TArray<FVerseStringProperty_>                __verse_0xFFC68BC5_Array_25;                       // 0x5C8(0x10)(ContainsInstancedReference)
	struct FTuple_L_Kchar_M_Kchar_R              __verse_0x00000000__26;                            // 0x5D8(0x20)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_69;                                    // 0x5F8(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResultStack_70;                               // 0x608(0x10)(HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_71;                                        // 0x618(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResultStack_72;                               // 0x628(0x10)(HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_73;                                        // 0x638(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResultDummy_74;                               // 0x648(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResultDummy_75;                               // 0x658(0x10)(HasGetValueTypeHash)
	TArray<TArray<FVerseDynamicProperty_>>       _ForResult_76;                                     // 0x668(0x10)(ContainsInstancedReference)
	int64                                        _ForIndex_77;                                      // 0x678(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        _ForLength_78;                                     // 0x680(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                        __verse_0xFB88B569_Item_28;                        // 0x688(0x10)(HasGetValueTypeHash)
	TArray<FVerseDynamicProperty_>               _ExprResult_79;                                    // 0x698(0x10)(ContainsInstancedReference)
	FVerseStringProperty_                        __verse_0xFFC68BC5_Array_29;                       // 0x6A8(0x10)(HasGetValueTypeHash)
	TArray<FVerseDynamicProperty_>               _ForResult_80;                                     // 0x6B8(0x10)(ContainsInstancedReference)
	int64                                        _ForIndex_81;                                      // 0x6C8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        _ForLength_82;                                     // 0x6D0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        __verse_0xFB88B569_Item_31;                        // 0x6D8(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_63E4[0x7];                                     // Fixing Size After Last Property 
	FVerseDynamicProperty_                       _ExprResult_83;                                    // 0x6E0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ForResult_84;                                     // 0x6F0(0x10)(HasGetValueTypeHash)
	int64                                        _ForIndex_85;                                      // 0x700(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        _ForLength_86;                                     // 0x708(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       __verse_0xFB88B569_Item_33;                        // 0x710(0x10)(HasGetValueTypeHash)
	uint8                                        _ExprResult_87;                                    // 0x720(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_88;                               // 0x721(0x2)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                        _AsyncBeginCount_89 : 1;                           // Mask: 0x1, PropSize: 0x10x723(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_429 : 7;                                    // Fixing Bit-Field Size 
	uint8                                        Pad_63E5[0x4];                                     // Fixing Size After Last Property 
	class UConcurrency_task*                     _AsyncTask_90;                                     // 0x728(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _AsyncTaskClass_91;                                // 0x730(0x10)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_92;                                    // 0x740(0x1)(HasGetValueTypeHash)
	uint8                                        Pad_63E7[0x7];                                     // Fixing Size After Last Property 
	int64                                        _AsyncResult_93;                                   // 0x748(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USimulation_agent*                     __verse_0xFE707B39_TargetCharacter_36;             // 0x750(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_94;                               // 0x758(0x8)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	enum class EAI_navigation_result             __verse_0x95D09D0E_Result_36;                      // 0x760(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_63E9[0x7];                                     // Fixing Size After Last Property 
	class UObject*                               __verse_0x00000000__37;                            // 0x768(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UConcurrency_task*                     _AsyncTask_95;                                     // 0x770(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _AsyncTaskClass_96;                                // 0x778(0x10)(HasGetValueTypeHash)
	struct FTuple_Lnavigation__target_M_QReachRadius_Nfloat_M_QAllowPartialPath_Nlogic_R _ExprResult_97;                                    // 0x788(0x1A)(HasGetValueTypeHash)
	uint8                                        Pad_63EB[0x6];                                     // Fixing Size After Last Property 
	class UAI_navigation_target*                 _ExprResultStack_99;                               // 0x7A8(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_100;                                       // 0x7B0(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_101;                                   // 0x7C0(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_102;                                   // 0x7D0(0x2)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_63ED[0x6];                                     // Fixing Size After Last Property 
	int64                                        _AsyncResult_103;                                  // 0x7D8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       InvokeResultDummy_104;                             // 0x7E0(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_105;                              // 0x7F0(0x18)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_106;                                   // 0x808(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_107;                                   // 0x818(0x10)(HasGetValueTypeHash)
	enum class EVerseTrue                        _InvokeSureResultDummy_108;                        // 0x828(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_63EF[0x7];                                     // Fixing Size After Last Property 
	FVerseFunctionProperty_                      _Callee_109;                                       // 0x830(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_110;                                   // 0x840(0x10)(HasGetValueTypeHash)
	enum class EAI_navigation_result             __verse_0x95D09D0E_Result_40;                      // 0x850(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_63F0[0x7];                                     // Fixing Size After Last Property 
	class UObject*                               __verse_0x00000000__41;                            // 0x858(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _AsyncTaskClass_111;                               // 0x860(0x10)(HasGetValueTypeHash)
	struct FTuple_Lnavigation__target_M_QReachRadius_Nfloat_M_QAllowPartialPath_Nlogic_R _ExprResult_112;                                   // 0x870(0x1A)(HasGetValueTypeHash)
	uint8                                        Pad_63F1[0x6];                                     // Fixing Size After Last Property 
	class UAI_navigation_target*                 _ExprResultStack_114;                              // 0x890(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_115;                                       // 0x898(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_116;                                   // 0x8A8(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_117;                                   // 0x8B8(0x2)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_63F2[0x6];                                     // Fixing Size After Last Property 
	FVerseDynamicProperty_                       InvokeResultDummy_118;                             // 0x8C0(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_119;                              // 0x8D0(0x18)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_120;                                   // 0x8E8(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_121;                                   // 0x8F8(0x10)(HasGetValueTypeHash)
	enum class EVerseTrue                        _InvokeSureResultDummy_122;                        // 0x908(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_63F4[0x7];                                     // Fixing Size After Last Property 
	FVerseFunctionProperty_                      _Callee_123;                                       // 0x910(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_124;                                   // 0x920(0x10)(HasGetValueTypeHash)
	enum class EVerseTrue                        _InvokeSureResultDummy_125;                        // 0x930(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_63F5[0x7];                                     // Fixing Size After Last Property 
	FVerseFunctionProperty_                      _Callee_126;                                       // 0x938(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_127;                                   // 0x948(0x10)(HasGetValueTypeHash)

	static class UClass* StaticClass();
	static class UTask_CompanionAI_companion_ai_runtime_GoToPositionTask_L_Nvector3_M_N_Qagent_M_Nlogic_M_N_QReachRadius_Nfloat_20_3d_20_2e_2e_2e_M_N_QAllowPartialPath_Nlogic_20_3d_20_2e_2e_2e_R* GetDefaultObj();

	int64 Update(uint64 _InstancingGraph_34, uint64 _InstancingGraph_49, uint64 _InstancingGraph_98, uint64 _InstancingGraph_113);
};

// 0x710 (0x850 - 0x140)
// VerseClass CompanionAI.task_CompanionAI_companion_ai_runtime$HandleBackToMeCommand_L_Nping__info_R
class UTask_CompanionAI_companion_ai_runtime_HandleBackToMeCommand_L_Nping__info_R : public UConcurrency_task
{
public:
	class UCompanionAI_companion_ai_runtime*     _Self;                                             // 0x140(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FCompanionAI_ping_info                __verse_0xB2CDDD72_Argument;                       // 0x148(0x38)(Parm, NoDestructor)
	enum class EVerseTrue                        _InvokeSureResultDummy_0;                          // 0x180(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_63FB[0x7];                                     // Fixing Size After Last Property 
	FVerseFunctionProperty_                      _Callee_1;                                         // 0x188(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_2;                                     // 0x198(0x10)(HasGetValueTypeHash)
	class USimulation_agent*                     __verse_0xFD64D7AA_Emitter_2;                      // 0x1A8(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_3;                                // 0x1B0(0x8)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class UObject*                               __verse_0x6B4100B8_EmitterCharacter_2;             // 0x1B8(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_4;                                // 0x1C0(0x8)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_5;                                         // 0x1C8(0x10)(HasGetValueTypeHash)
	struct FTuple_Lagent_Mtuple_L_R_Mtuple_L_R_R _ExprResult_6;                                     // 0x1D8(0xA)(HasGetValueTypeHash)
	uint8                                        Pad_63FD[0x6];                                     // Fixing Size After Last Property 
	struct FTuple_L_R                            _ExprResult_7;                                     // 0x1E8(0x1)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_8;                                     // 0x1E9(0x1)(HasGetValueTypeHash)
	uint8                                        Pad_63FF[0x6];                                     // Fixing Size After Last Property 
	FVerseDynamicProperty_                       InvokeResultDummy_9;                               // 0x1F0(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_10;                               // 0x200(0x18)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_11;                                    // 0x218(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_12;                               // 0x228(0x8)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_13;                                        // 0x230(0x10)(HasGetValueTypeHash)
	struct FTuple_Lfort__character_Mtuple_L_R_Mtuple_L_R_R _ExprResult_14;                                    // 0x240(0xA)(HasGetValueTypeHash)
	uint8                                        Pad_6401[0x6];                                     // Fixing Size After Last Property 
	struct FTuple_L_R                            _ExprResult_15;                                    // 0x250(0x1)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_16;                                    // 0x251(0x1)(HasGetValueTypeHash)
	uint8                                        Pad_6402[0x6];                                     // Fixing Size After Last Property 
	FVerseDynamicProperty_                       _ExprResult_17;                                    // 0x258(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_18;                               // 0x268(0x8)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_19;                                        // 0x270(0x10)(HasGetValueTypeHash)
	struct FTuple_Lfort__character_Mtuple_L_R_Mtuple_L_R_R _ExprResult_20;                                    // 0x280(0xA)(HasGetValueTypeHash)
	uint8                                        Pad_6404[0x6];                                     // Fixing Size After Last Property 
	struct FTuple_L_R                            _ExprResult_21;                                    // 0x290(0x1)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_22;                                    // 0x291(0x1)(HasGetValueTypeHash)
	uint8                                        _AsyncBeginCount_23 : 1;                           // Mask: 0x1, PropSize: 0x10x292(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_42A : 7;                                    // Fixing Bit-Field Size 
	uint8                                        Pad_6406[0x5];                                     // Fixing Size After Last Property 
	class UConcurrency_task*                     _AsyncTask_24;                                     // 0x298(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _AsyncTaskClass_25;                                // 0x2A0(0x10)(HasGetValueTypeHash)
	int64                                        _AsyncResult_26;                                   // 0x2B0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        __verse_0x7EBDC403_HasReachedPosition_2 : 1;       // Mask: 0x1, PropSize: 0x10x2B8(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_42B : 7;                                    // Fixing Bit-Field Size 
	uint8                                        Pad_6407[0x7];                                     // Fixing Size After Last Property 
	class UConcurrency_task*                     _AsyncTask_27;                                     // 0x2C0(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _AsyncTaskClass_28;                                // 0x2C8(0x10)(HasGetValueTypeHash)
	struct FTuple_Lvector3_M_Qagent_Mlogic_M_QReachRadius_Ntype_7b2_2e000000e_2b02_7d_M_QAllowPartialPath_Nlogic_R _ExprResult_29;                                    // 0x2D8(0x3A)(HasGetValueTypeHash)
	uint8                                        Pad_6408[0x6];                                     // Fixing Size After Last Property 
	struct FSpatialMath_vector3                  _ExprResult_30;                                    // 0x318(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FOptionalProperty_                           _ExprResult_31;                                    // 0x330(0x8)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	uint8                                        __verse_0x19F8ABA1_Sprint_2 : 1;                   // Mask: 0x1, PropSize: 0x10x338(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_42C : 7;                                    // Fixing Bit-Field Size 
	uint8                                        Pad_6409[0x7];                                     // Fixing Size After Last Property 
	FOptionalProperty_                           _ExprResult_32;                                    // 0x340(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_33;                                    // 0x350(0x2)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_640B[0x6];                                     // Fixing Size After Last Property 
	int64                                        _AsyncResult_34;                                   // 0x358(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_35;                               // 0x360(0x2)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	enum class EVerseTrue                        _InvokeSureResultDummy_36;                         // 0x362(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_640C[0x5];                                     // Fixing Size After Last Property 
	FVerseFunctionProperty_                      _Callee_37;                                        // 0x368(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_38;                                    // 0x378(0x10)(HasGetValueTypeHash)
	uint8                                        __verse_0x684D9F77_IsFollowingEnabled_2 : 1;       // Mask: 0x1, PropSize: 0x10x388(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_42D : 7;                                    // Fixing Bit-Field Size 
	uint8                                        Pad_640D[0x7];                                     // Fixing Size After Last Property 
	class UObject*                               __verse_0x00000000__7;                             // 0x390(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_39;                                        // 0x398(0x10)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_40;                                    // 0x3A8(0x1)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_41;                               // 0x3A9(0x2)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	enum class EVerseTrue                        _InvokeSureResultDummy_42;                         // 0x3AB(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_640E[0x4];                                     // Fixing Size After Last Property 
	FVerseFunctionProperty_                      _Callee_43;                                        // 0x3B0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_44;                                    // 0x3C0(0x10)(HasGetValueTypeHash)
	uint8                                        _AsyncBeginCount_45 : 1;                           // Mask: 0x1, PropSize: 0x10x3D0(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_42E : 7;                                    // Fixing Bit-Field Size 
	uint8                                        _AsyncBeginCount_46 : 1;                           // Mask: 0x1, PropSize: 0x10x3D1(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_42F : 7;                                    // Fixing Bit-Field Size 
	uint8                                        Pad_640F[0x6];                                     // Fixing Size After Last Property 
	class UConcurrency_task*                     _AsyncTask_47;                                     // 0x3D8(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _AsyncTaskClass_48;                                // 0x3E0(0x10)(HasGetValueTypeHash)
	struct FTuple_Lfort__character_Mfloat_R      _ExprResult_49;                                    // 0x3F0(0x10)(HasGetValueTypeHash)
	int64                                        _AsyncResult_50;                                   // 0x400(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        _AsyncBeginCount_51 : 1;                           // Mask: 0x1, PropSize: 0x10x408(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_430 : 7;                                    // Fixing Bit-Field Size 
	uint8                                        Pad_6412[0x7];                                     // Fixing Size After Last Property 
	class UConcurrency_task*                     _AsyncTask_52;                                     // 0x410(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _AsyncTaskClass_53;                                // 0x418(0x10)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_54;                                    // 0x428(0x1)(HasGetValueTypeHash)
	uint8                                        Pad_6414[0x7];                                     // Fixing Size After Last Property 
	int64                                        _AsyncResult_55;                                   // 0x430(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        _AsyncBeginCount_56 : 1;                           // Mask: 0x1, PropSize: 0x10x438(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_431 : 7;                                    // Fixing Bit-Field Size 
	uint8                                        Pad_6415[0x7];                                     // Fixing Size After Last Property 
	class UConcurrency_task*                     _AsyncTask_57;                                     // 0x440(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _AsyncTaskClass_58;                                // 0x448(0x10)(HasGetValueTypeHash)
	int64                                        _AsyncResult_59;                                   // 0x458(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        _AsyncBeginCount_60 : 1;                           // Mask: 0x1, PropSize: 0x10x460(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_432 : 7;                                    // Fixing Bit-Field Size 
	uint8                                        Pad_6416[0x7];                                     // Fixing Size After Last Property 
	class UObject*                               __verse_0x00000000__10;                            // 0x468(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UConcurrency_task*                     _AsyncTask_61;                                     // 0x470(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _AsyncTaskClass_62;                                // 0x478(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_63;                                    // 0x488(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        _AsyncResult_64;                                   // 0x498(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class EVerseTrue                        _InvokeSureResultDummy_65;                         // 0x4A0(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_6418[0x7];                                     // Fixing Size After Last Property 
	FVerseFunctionProperty_                      _Callee_66;                                        // 0x4A8(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_67;                                    // 0x4B8(0x10)(HasGetValueTypeHash)
	class UObject*                               __verse_0x00000000__12;                            // 0x4C8(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	enum class EVerseTrue                        _InvokeSureResultDummy_68;                         // 0x4D0(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_6419[0x7];                                     // Fixing Size After Last Property 
	FVerseFunctionProperty_                      _Callee_69;                                        // 0x4D8(0x10)(HasGetValueTypeHash)
	enum class EVerseTrue                        _InvokeSureResultDummy_70;                         // 0x4E8(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_641A[0x7];                                     // Fixing Size After Last Property 
	FVerseFunctionProperty_                      _Callee_71;                                        // 0x4F0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_72;                                    // 0x500(0x10)(HasGetValueTypeHash)
	class USimulation_agent*                     __verse_0xFD64D7AA_Emitter_14;                     // 0x510(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_73;                               // 0x518(0x8)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class UObject*                               __verse_0x6B4100B8_EmitterCharacter_14;            // 0x520(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_74;                               // 0x528(0x8)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_75;                                        // 0x530(0x10)(HasGetValueTypeHash)
	struct FTuple_Lagent_Mtuple_L_R_Mtuple_L_R_R _ExprResult_76;                                    // 0x540(0xA)(HasGetValueTypeHash)
	uint8                                        Pad_641B[0x6];                                     // Fixing Size After Last Property 
	struct FTuple_L_R                            _ExprResult_77;                                    // 0x550(0x1)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_78;                                    // 0x551(0x1)(HasGetValueTypeHash)
	uint8                                        Pad_641C[0x6];                                     // Fixing Size After Last Property 
	FVerseDynamicProperty_                       InvokeResultDummy_79;                              // 0x558(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_80;                               // 0x568(0x18)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_81;                                    // 0x580(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_82;                               // 0x590(0x8)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_83;                                        // 0x598(0x10)(HasGetValueTypeHash)
	struct FTuple_Lfort__character_Mtuple_L_R_Mtuple_L_R_R _ExprResult_84;                                    // 0x5A8(0xA)(HasGetValueTypeHash)
	uint8                                        Pad_641E[0x6];                                     // Fixing Size After Last Property 
	struct FTuple_L_R                            _ExprResult_85;                                    // 0x5B8(0x1)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_86;                                    // 0x5B9(0x1)(HasGetValueTypeHash)
	uint8                                        Pad_641F[0x6];                                     // Fixing Size After Last Property 
	FVerseDynamicProperty_                       _ExprResult_87;                                    // 0x5C0(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_88;                               // 0x5D0(0x8)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_89;                                        // 0x5D8(0x10)(HasGetValueTypeHash)
	struct FTuple_Lfort__character_Mtuple_L_R_Mtuple_L_R_R _ExprResult_90;                                    // 0x5E8(0xA)(HasGetValueTypeHash)
	uint8                                        Pad_6420[0x6];                                     // Fixing Size After Last Property 
	struct FTuple_L_R                            _ExprResult_91;                                    // 0x5F8(0x1)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_92;                                    // 0x5F9(0x1)(HasGetValueTypeHash)
	uint8                                        _AsyncBeginCount_93 : 1;                           // Mask: 0x1, PropSize: 0x10x5FA(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_433 : 7;                                    // Fixing Bit-Field Size 
	uint8                                        Pad_6421[0x5];                                     // Fixing Size After Last Property 
	class UConcurrency_task*                     _AsyncTask_94;                                     // 0x600(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _AsyncTaskClass_95;                                // 0x608(0x10)(HasGetValueTypeHash)
	int64                                        _AsyncResult_96;                                   // 0x618(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        __verse_0x7EBDC403_HasReachedPosition_14 : 1;      // Mask: 0x1, PropSize: 0x10x620(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_434 : 7;                                    // Fixing Bit-Field Size 
	uint8                                        Pad_6422[0x7];                                     // Fixing Size After Last Property 
	class UConcurrency_task*                     _AsyncTask_97;                                     // 0x628(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _AsyncTaskClass_98;                                // 0x630(0x10)(HasGetValueTypeHash)
	struct FTuple_Lvector3_M_Qagent_Mlogic_M_QReachRadius_Ntype_7b2_2e000000e_2b02_7d_M_QAllowPartialPath_Nlogic_R _ExprResult_99;                                    // 0x640(0x3A)(HasGetValueTypeHash)
	uint8                                        Pad_6423[0x6];                                     // Fixing Size After Last Property 
	struct FSpatialMath_vector3                  _ExprResult_100;                                   // 0x680(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FOptionalProperty_                           _ExprResult_101;                                   // 0x698(0x8)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	uint8                                        __verse_0x19F8ABA1_Sprint_14 : 1;                  // Mask: 0x1, PropSize: 0x10x6A0(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_435 : 7;                                    // Fixing Bit-Field Size 
	uint8                                        Pad_6424[0x7];                                     // Fixing Size After Last Property 
	FOptionalProperty_                           _ExprResult_102;                                   // 0x6A8(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_103;                                   // 0x6B8(0x2)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_6426[0x6];                                     // Fixing Size After Last Property 
	int64                                        _AsyncResult_104;                                  // 0x6C0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_105;                              // 0x6C8(0x2)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	enum class EVerseTrue                        _InvokeSureResultDummy_106;                        // 0x6CA(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_6427[0x5];                                     // Fixing Size After Last Property 
	FVerseFunctionProperty_                      _Callee_107;                                       // 0x6D0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_108;                                   // 0x6E0(0x10)(HasGetValueTypeHash)
	uint8                                        __verse_0x684D9F77_IsFollowingEnabled_14 : 1;      // Mask: 0x1, PropSize: 0x10x6F0(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_436 : 7;                                    // Fixing Bit-Field Size 
	uint8                                        Pad_6428[0x7];                                     // Fixing Size After Last Property 
	class UObject*                               __verse_0x00000000__19;                            // 0x6F8(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_109;                                       // 0x700(0x10)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_110;                                   // 0x710(0x1)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_111;                              // 0x711(0x2)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	enum class EVerseTrue                        _InvokeSureResultDummy_112;                        // 0x713(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_642D[0x4];                                     // Fixing Size After Last Property 
	FVerseFunctionProperty_                      _Callee_113;                                       // 0x718(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_114;                                   // 0x728(0x10)(HasGetValueTypeHash)
	uint8                                        _AsyncBeginCount_115 : 1;                          // Mask: 0x1, PropSize: 0x10x738(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_437 : 7;                                    // Fixing Bit-Field Size 
	uint8                                        _AsyncBeginCount_116 : 1;                          // Mask: 0x1, PropSize: 0x10x739(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_438 : 7;                                    // Fixing Bit-Field Size 
	uint8                                        Pad_642F[0x6];                                     // Fixing Size After Last Property 
	class UConcurrency_task*                     _AsyncTask_117;                                    // 0x740(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _AsyncTaskClass_118;                               // 0x748(0x10)(HasGetValueTypeHash)
	struct FTuple_Lfort__character_Mfloat_R      _ExprResult_119;                                   // 0x758(0x10)(HasGetValueTypeHash)
	int64                                        _AsyncResult_120;                                  // 0x768(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        _AsyncBeginCount_121 : 1;                          // Mask: 0x1, PropSize: 0x10x770(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_439 : 7;                                    // Fixing Bit-Field Size 
	uint8                                        Pad_6433[0x7];                                     // Fixing Size After Last Property 
	class UConcurrency_task*                     _AsyncTask_122;                                    // 0x778(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _AsyncTaskClass_123;                               // 0x780(0x10)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_124;                                   // 0x790(0x1)(HasGetValueTypeHash)
	uint8                                        Pad_6435[0x7];                                     // Fixing Size After Last Property 
	int64                                        _AsyncResult_125;                                  // 0x798(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        _AsyncBeginCount_126 : 1;                          // Mask: 0x1, PropSize: 0x10x7A0(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_43A : 7;                                    // Fixing Bit-Field Size 
	uint8                                        Pad_6436[0x7];                                     // Fixing Size After Last Property 
	class UConcurrency_task*                     _AsyncTask_127;                                    // 0x7A8(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _AsyncTaskClass_128;                               // 0x7B0(0x10)(HasGetValueTypeHash)
	int64                                        _AsyncResult_129;                                  // 0x7C0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        _AsyncBeginCount_130 : 1;                          // Mask: 0x1, PropSize: 0x10x7C8(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_43B : 7;                                    // Fixing Bit-Field Size 
	uint8                                        Pad_6437[0x7];                                     // Fixing Size After Last Property 
	class UObject*                               __verse_0x00000000__22;                            // 0x7D0(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UConcurrency_task*                     _AsyncTask_131;                                    // 0x7D8(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _AsyncTaskClass_132;                               // 0x7E0(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_133;                                   // 0x7F0(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        _AsyncResult_134;                                  // 0x800(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class EVerseTrue                        _InvokeSureResultDummy_135;                        // 0x808(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_6439[0x7];                                     // Fixing Size After Last Property 
	FVerseFunctionProperty_                      _Callee_136;                                       // 0x810(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_137;                                   // 0x820(0x10)(HasGetValueTypeHash)
	class UObject*                               __verse_0x00000000__24;                            // 0x830(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	enum class EVerseTrue                        _InvokeSureResultDummy_138;                        // 0x838(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_643A[0x7];                                     // Fixing Size After Last Property 
	FVerseFunctionProperty_                      _Callee_139;                                       // 0x840(0x10)(HasGetValueTypeHash)

	static class UClass* StaticClass();
	static class UTask_CompanionAI_companion_ai_runtime_HandleBackToMeCommand_L_Nping__info_R* GetDefaultObj();

	int64 Update();
};

// 0xAF0 (0xC30 - 0x140)
// VerseClass CompanionAI.task_CompanionAI_companion_ai_runtime$HandleGoTo_L_Nping__info_R
class UTask_CompanionAI_companion_ai_runtime_HandleGoTo_L_Nping__info_R : public UConcurrency_task
{
public:
	class UCompanionAI_companion_ai_runtime*     _Self;                                             // 0x140(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FCompanionAI_ping_info                __verse_0xB2CDDD72_Argument;                       // 0x148(0x38)(Parm, NoDestructor)
	enum class EVerseTrue                        _InvokeSureResultDummy_0;                          // 0x180(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_643D[0x7];                                     // Fixing Size After Last Property 
	FVerseFunctionProperty_                      _Callee_1;                                         // 0x188(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_2;                                     // 0x198(0x10)(HasGetValueTypeHash)
	uint8                                        _AsyncBeginCount_3 : 1;                            // Mask: 0x1, PropSize: 0x10x1A8(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_43C : 7;                                    // Fixing Bit-Field Size 
	uint8                                        Pad_643E[0x7];                                     // Fixing Size After Last Property 
	class UConcurrency_task*                     _AsyncTask_4;                                      // 0x1B0(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _AsyncTaskClass_5;                                 // 0x1B8(0x10)(HasGetValueTypeHash)
	int64                                        _AsyncResult_6;                                    // 0x1C8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       InvokeResultDummy_7;                               // 0x1D0(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_8;                                // 0x1E0(0x18)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_9;                                     // 0x1F8(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_10;                                    // 0x208(0x10)(HasGetValueTypeHash)
	class UVerseEngine_Entity_entity*            __verse_0x459049A1_Target_3;                       // 0x218(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_11;                               // 0x220(0x8)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class UConcurrency_task*                     _AsyncTask_12;                                     // 0x228(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _AsyncTaskClass_13;                                // 0x230(0x10)(HasGetValueTypeHash)
	struct FTuple_Lvector3_M_Qagent_Mlogic_M_QReachRadius_Nfloat_20_3d_20_2e_2e_2e_M_QAllowPartialPath_Nlogic_20_3d_20_2e_2e_2e_R _ExprResult_14;                                    // 0x240(0x3A)(HasGetValueTypeHash)
	uint8                                        Pad_6441[0x6];                                     // Fixing Size After Last Property 
	struct FTuple_Lvector3_M_Qagent_Mlogic_M_QReachRadius_Ntype_7b1_2e000000e_2b02_7d_R __verse_0x00000000__4;                             // 0x280(0x38)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_15;                               // 0x2B8(0x8)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_16;                                        // 0x2C0(0x10)(HasGetValueTypeHash)
	struct FTuple_Lentity_Mtuple_L_R_Mtuple_L_R_R _ExprResult_17;                                    // 0x2D0(0xA)(HasGetValueTypeHash)
	uint8                                        Pad_6442[0x6];                                     // Fixing Size After Last Property 
	struct FTuple_L_R                            _ExprResult_18;                                    // 0x2E0(0x1)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_19;                                    // 0x2E1(0x1)(HasGetValueTypeHash)
	uint8                                        __verse_0x19F8ABA1_Sprint_4 : 1;                   // Mask: 0x1, PropSize: 0x10x2E2(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_43D : 7;                                    // Fixing Bit-Field Size 
	uint8                                        Pad_6443[0x5];                                     // Fixing Size After Last Property 
	FOptionalProperty_                           _ExprResult_20;                                    // 0x2E8(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_21;                                    // 0x2F8(0x2)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_6446[0x6];                                     // Fixing Size After Last Property 
	int64                                        _AsyncResult_22;                                   // 0x300(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       InvokeResultDummy_23;                              // 0x308(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_24;                               // 0x318(0x18)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_25;                                    // 0x330(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_26;                                    // 0x340(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       InvokeResultDummy_27;                              // 0x350(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_28;                               // 0x360(0x18)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_29;                                    // 0x378(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_30;                                    // 0x388(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       InvokeResultDummy_31;                              // 0x398(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_32;                               // 0x3A8(0x18)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_33;                                    // 0x3C0(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_34;                                    // 0x3D0(0x10)(HasGetValueTypeHash)
	uint8                                        _AsyncBeginCount_35 : 1;                           // Mask: 0x1, PropSize: 0x10x3E0(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_43E : 7;                                    // Fixing Bit-Field Size 
	uint8                                        _AsyncBeginCount_36 : 1;                           // Mask: 0x1, PropSize: 0x10x3E1(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_43F : 7;                                    // Fixing Bit-Field Size 
	uint8                                        Pad_6448[0x6];                                     // Fixing Size After Last Property 
	class UConcurrency_task*                     _AsyncTask_37;                                     // 0x3E8(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _AsyncTaskClass_38;                                // 0x3F0(0x10)(HasGetValueTypeHash)
	struct FTuple_Lvector3_M_Qagent_Mlogic_M_QReachRadius_Nfloat_20_3d_20_2e_2e_2e_M_QAllowPartialPath_Nlogic_20_3d_20_2e_2e_2e_R _ExprResult_39;                                    // 0x400(0x3A)(HasGetValueTypeHash)
	uint8                                        Pad_6449[0x6];                                     // Fixing Size After Last Property 
	struct FTuple_Lvector3_M_Qagent_Mlogic_M_QReachRadius_Ntype_7b1_2e000000e_2b02_7d_R __verse_0x00000000__6;                             // 0x440(0x38)(HasGetValueTypeHash)
	FOptionalProperty_                           __verse_0x459049A1_Target_6;                       // 0x478(0x8)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FOptionalProperty_                           __verse_0x00000000__7;                             // 0x480(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        _ExprResult_40 : 1;                                // Mask: 0x1, PropSize: 0x10x482(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_440 : 7;                                    // Fixing Bit-Field Size 
	FOptionalProperty_                           _ExprResultStack_41;                               // 0x483(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        __verse_0x19F8ABA1_Sprint_6 : 1;                   // Mask: 0x1, PropSize: 0x10x485(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_441 : 7;                                    // Fixing Bit-Field Size 
	uint8                                        Pad_644A[0x2];                                     // Fixing Size After Last Property 
	FOptionalProperty_                           _ExprResult_42;                                    // 0x488(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_43;                                    // 0x498(0x2)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_644B[0x6];                                     // Fixing Size After Last Property 
	int64                                        _AsyncResult_44;                                   // 0x4A0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        _AsyncBeginCount_45 : 1;                           // Mask: 0x1, PropSize: 0x10x4A8(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_442 : 7;                                    // Fixing Bit-Field Size 
	uint8                                        Pad_644C[0x7];                                     // Fixing Size After Last Property 
	class UConcurrency_task*                     _AsyncTask_46;                                     // 0x4B0(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _AsyncTaskClass_47;                                // 0x4B8(0x10)(HasGetValueTypeHash)
	int64                                        _AsyncResult_48;                                   // 0x4C8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_49;                               // 0x4D0(0x2)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                        _AsyncBeginCount_50 : 1;                           // Mask: 0x1, PropSize: 0x10x4D2(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_443 : 7;                                    // Fixing Bit-Field Size 
	uint8                                        _AsyncBeginCount_51 : 1;                           // Mask: 0x1, PropSize: 0x10x4D3(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_444 : 7;                                    // Fixing Bit-Field Size 
	uint8                                        Pad_644D[0x4];                                     // Fixing Size After Last Property 
	class UConcurrency_task*                     _AsyncTask_52;                                     // 0x4D8(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _AsyncTaskClass_53;                                // 0x4E0(0x10)(HasGetValueTypeHash)
	struct FTuple_Lvector3_M_Qagent_Mlogic_M_QReachRadius_Nfloat_20_3d_20_2e_2e_2e_M_QAllowPartialPath_Nlogic_20_3d_20_2e_2e_2e_R _ExprResult_54;                                    // 0x4F0(0x3A)(HasGetValueTypeHash)
	uint8                                        Pad_644E[0x6];                                     // Fixing Size After Last Property 
	struct FTuple_Lvector3_M_Qagent_Mlogic_M_QReachRadius_Ntype_7b10_2e000000_7d_R __verse_0x00000000__10;                            // 0x530(0x38)(HasGetValueTypeHash)
	FOptionalProperty_                           __verse_0x459049A1_Target_10;                      // 0x568(0x8)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FOptionalProperty_                           __verse_0x00000000__11;                            // 0x570(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        _ExprResult_55 : 1;                                // Mask: 0x1, PropSize: 0x10x572(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_445 : 7;                                    // Fixing Bit-Field Size 
