#pragma once

// Dumped with Dumper-7!


#include "../SDK.hpp"

namespace SDK
{
namespace Params
{
//---------------------------------------------------------------------------------------------------------------------
// PARAMETERS
//---------------------------------------------------------------------------------------------------------------------

// 0x130 (0x130 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Rprefix_U_2d_U_L_Nvector3_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Rprefix_U_2d_U_L_Nvector3_R_Params
{
public:
	struct FSpatialMath_vector3                  __verse_0xB2CDDD72_Argument;                       // 0x0(0x18)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FSpatialMath_vector3                  RetVal;                                            // 0x18(0x18)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_0;                                // 0x30(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_1;                                     // 0x80(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_2;                                     // 0x90(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_3;                                     // 0xA0(0x10)(HasGetValueTypeHash)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_4;                                // 0xB0(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_5;                                     // 0x100(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_6;                                     // 0x110(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_7;                                     // 0x120(0x10)(HasGetValueTypeHash)
};

// 0x100 (0x100 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Rprefix_U_2d_U_L_Nvector2_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Rprefix_U_2d_U_L_Nvector2_R_Params
{
public:
	struct FSpatialMath_vector2                  __verse_0xB2CDDD72_Argument;                       // 0x0(0x10)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FSpatialMath_vector2                  RetVal;                                            // 0x10(0x10)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_0;                                // 0x20(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_1;                                     // 0x70(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_2;                                     // 0x80(0x10)(HasGetValueTypeHash)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_3;                                // 0x90(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_4;                                     // 0xE0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_5;                                     // 0xF0(0x10)(HasGetValueTypeHash)
};

// 0x100 (0x100 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Rprefix_U_2d_U_L_Nvector2i_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Rprefix_U_2d_U_L_Nvector2i_R_Params
{
public:
	struct FSpatialMath_vector2i                 __verse_0xB2CDDD72_Argument;                       // 0x0(0x10)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FSpatialMath_vector2i                 RetVal;                                            // 0x10(0x10)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_0;                                // 0x20(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_1;                                     // 0x70(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_2;                                     // 0x80(0x10)(HasGetValueTypeHash)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_3;                                // 0x90(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_4;                                     // 0xE0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_5;                                     // 0xF0(0x10)(HasGetValueTypeHash)
};

// 0x108 (0x108 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2f_U_L_Nvector2_M_Nfloat_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2f_U_L_Nvector2_M_Nfloat_R_Params
{
public:
	struct FTuple_Lvector2_Mfloat_R              __verse_0xB2CDDD72_Argument;                       // 0x0(0x18)(Parm, HasGetValueTypeHash)
	struct FSpatialMath_vector2                  RetVal;                                            // 0x18(0x10)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_0;                                // 0x28(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_1;                                     // 0x78(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_2;                                     // 0x88(0x10)(HasGetValueTypeHash)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_3;                                // 0x98(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_4;                                     // 0xE8(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_5;                                     // 0xF8(0x10)(HasGetValueTypeHash)
};

// 0x148 (0x148 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2f_U_L_Nvector3_M_Nvector3_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2f_U_L_Nvector3_M_Nvector3_R_Params
{
public:
	struct FTuple_Lvector3_Mvector3_R            __verse_0xB2CDDD72_Argument;                       // 0x0(0x30)(Parm, HasGetValueTypeHash)
	struct FSpatialMath_vector3                  RetVal;                                            // 0x30(0x18)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_0;                                // 0x48(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_1;                                     // 0x98(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_2;                                     // 0xA8(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_3;                                     // 0xB8(0x10)(HasGetValueTypeHash)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_4;                                // 0xC8(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_5;                                     // 0x118(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_6;                                     // 0x128(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_7;                                     // 0x138(0x10)(HasGetValueTypeHash)
};

// 0x138 (0x138 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2f_U_L_Nvector3_M_Nfloat_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2f_U_L_Nvector3_M_Nfloat_R_Params
{
public:
	struct FTuple_Lvector3_Mfloat_R              __verse_0xB2CDDD72_Argument;                       // 0x0(0x20)(Parm, HasGetValueTypeHash)
	struct FSpatialMath_vector3                  RetVal;                                            // 0x20(0x18)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_0;                                // 0x38(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_1;                                     // 0x88(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_2;                                     // 0x98(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_3;                                     // 0xA8(0x10)(HasGetValueTypeHash)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_4;                                // 0xB8(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_5;                                     // 0x108(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_6;                                     // 0x118(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_7;                                     // 0x128(0x10)(HasGetValueTypeHash)
};

// 0x110 (0x110 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2f_U_L_Nvector2_M_Nvector2_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2f_U_L_Nvector2_M_Nvector2_R_Params
{
public:
	struct FTuple_Lvector2_Mvector2_R            __verse_0xB2CDDD72_Argument;                       // 0x0(0x20)(Parm, HasGetValueTypeHash)
	struct FSpatialMath_vector2                  RetVal;                                            // 0x20(0x10)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_0;                                // 0x30(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_1;                                     // 0x80(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_2;                                     // 0x90(0x10)(HasGetValueTypeHash)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_3;                                // 0xA0(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_4;                                     // 0xF0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_5;                                     // 0x100(0x10)(HasGetValueTypeHash)
};

// 0x58 (0x58 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eUnrotateVector_U_L_Nrotation_M_Ntuple_L_R_M_Nvector3_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eUnrotateVector_U_L_Nrotation_M_Ntuple_L_R_M_Nvector3_R_Params
{
public:
	struct FTuple_Lrotation_Mtuple_L_R_Mvector3_R __verse_0xB2CDDD72_Argument;                       // 0x0(0x40)(Parm, HasGetValueTypeHash)
	struct FSpatialMath_vector3                  RetVal;                                            // 0x40(0x18)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// 0x70 (0x70 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eUnrotateBy_U_L_Nrotation_M_Ntuple_L_R_M_Nrotation_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eUnrotateBy_U_L_Nrotation_M_Ntuple_L_R_M_Nrotation_R_Params
{
public:
	struct FTuple_Lrotation_Mtuple_L_R_Mrotation_R __verse_0xB2CDDD72_Argument;                       // 0x0(0x50)(Parm, HasGetValueTypeHash)
	struct FVerseRotation                        RetVal;                                            // 0x50(0x20)(Parm, OutParm, ReturnParm, NoDestructor)
};

// 0x58 (0x58 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eRotateVector_U_L_Nrotation_M_Ntuple_L_R_M_Nvector3_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eRotateVector_U_L_Nrotation_M_Ntuple_L_R_M_Nvector3_R_Params
{
public:
	struct FTuple_Lrotation_Mtuple_L_R_Mvector3_R __verse_0xB2CDDD72_Argument;                       // 0x0(0x40)(Parm, HasGetValueTypeHash)
	struct FSpatialMath_vector3                  RetVal;                                            // 0x40(0x18)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// 0x70 (0x70 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eRotateBy_U_L_Nrotation_M_Ntuple_L_R_M_Nrotation_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eRotateBy_U_L_Nrotation_M_Ntuple_L_R_M_Nrotation_R_Params
{
public:
	struct FTuple_Lrotation_Mtuple_L_R_Mrotation_R __verse_0xB2CDDD72_Argument;                       // 0x0(0x50)(Parm, HasGetValueTypeHash)
	struct FVerseRotation                        RetVal;                                            // 0x50(0x20)(Parm, OutParm, ReturnParm, NoDestructor)
};

// 0x40 (0x40 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eMakeUnitVector_U_L_Nvector3_M_Ntuple_L_R_M_Ntuple_L_R_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eMakeUnitVector_U_L_Nvector3_M_Ntuple_L_R_M_Ntuple_L_R_R_Params
{
public:
	struct FTuple_Lvector3_Mtuple_L_R_Mtuple_L_R_R __verse_0xB2CDDD72_Argument;                       // 0x0(0x1A)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_5DCB[0x6];                                     // Fixing Size After Last Property 
	FOptionalProperty_                           RetVal;                                            // 0x20(0x20)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// 0x30 (0x30 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eMakeUnitVector_U_L_Nvector2_M_Ntuple_L_R_M_Ntuple_L_R_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eMakeUnitVector_U_L_Nvector2_M_Ntuple_L_R_M_Ntuple_L_R_R_Params
{
public:
	struct FTuple_Lvector2_Mtuple_L_R_Mtuple_L_R_R __verse_0xB2CDDD72_Argument;                       // 0x0(0x12)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_5DCD[0x6];                                     // Fixing Size After Last Property 
	FOptionalProperty_                           RetVal;                                            // 0x18(0x18)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// 0xC2 (0xC2 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eLengthXY_U_L_Nvector3_M_Ntuple_L_R_M_Ntuple_L_R_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eLengthXY_U_L_Nvector3_M_Ntuple_L_R_M_Ntuple_L_R_R_Params
{
public:
	struct FTuple_Lvector3_Mtuple_L_R_Mtuple_L_R_R __verse_0xB2CDDD72_Argument;                       // 0x0(0x1A)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_5DD1[0x6];                                     // Fixing Size After Last Property 
	double                                       RetVal;                                            // 0x20(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_0;                                         // 0x28(0x10)(HasGetValueTypeHash)
	double                                       _ExprResultStack_1;                                // 0x38(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_2;                                         // 0x40(0x10)(HasGetValueTypeHash)
	struct FTuple_Lvector3_Mtuple_L_R_Mtuple_L_R_R _ExprResult_3;                                     // 0x50(0x1A)(HasGetValueTypeHash)
	uint8                                        Pad_5DD2[0x6];                                     // Fixing Size After Last Property 
	struct FTuple_L_R                            _ExprResult_4;                                     // 0x70(0x1)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_5;                                     // 0x71(0x1)(HasGetValueTypeHash)
	uint8                                        Pad_5DD3[0x6];                                     // Fixing Size After Last Property 
	FVerseFunctionProperty_                      _Callee_6;                                         // 0x78(0x10)(HasGetValueTypeHash)
	double                                       _ExprResultStack_7;                                // 0x88(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_8;                                         // 0x90(0x10)(HasGetValueTypeHash)
	struct FTuple_Lvector3_Mtuple_L_R_Mtuple_L_R_R _ExprResult_9;                                     // 0xA0(0x1A)(HasGetValueTypeHash)
	uint8                                        Pad_5DD4[0x6];                                     // Fixing Size After Last Property 
	struct FTuple_L_R                            _ExprResult_10;                                    // 0xC0(0x1)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_11;                                    // 0xC1(0x1)(HasGetValueTypeHash)
};

// 0x28 (0x28 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eLengthSquaredXY_U_L_Nvector3_M_Ntuple_L_R_M_Ntuple_L_R_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eLengthSquaredXY_U_L_Nvector3_M_Ntuple_L_R_M_Ntuple_L_R_R_Params
{
public:
	struct FTuple_Lvector3_Mtuple_L_R_Mtuple_L_R_R __verse_0xB2CDDD72_Argument;                       // 0x0(0x1A)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_5DD7[0x6];                                     // Fixing Size After Last Property 
	double                                       RetVal;                                            // 0x20(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x28 (0x28 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eLengthSquared_U_L_Nvector3_M_Ntuple_L_R_M_Ntuple_L_R_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eLengthSquared_U_L_Nvector3_M_Ntuple_L_R_M_Ntuple_L_R_R_Params
{
public:
	struct FTuple_Lvector3_Mtuple_L_R_Mtuple_L_R_R __verse_0xB2CDDD72_Argument;                       // 0x0(0x1A)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_5DD8[0x6];                                     // Fixing Size After Last Property 
	double                                       RetVal;                                            // 0x20(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x80 (0x80 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eLengthSquared_U_L_Nvector2_M_Ntuple_L_R_M_Ntuple_L_R_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eLengthSquared_U_L_Nvector2_M_Ntuple_L_R_M_Ntuple_L_R_R_Params
{
public:
	struct FTuple_Lvector2_Mtuple_L_R_Mtuple_L_R_R __verse_0xB2CDDD72_Argument;                       // 0x0(0x12)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_5DDA[0x6];                                     // Fixing Size After Last Property 
	double                                       RetVal;                                            // 0x18(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_0;                                         // 0x20(0x10)(HasGetValueTypeHash)
	struct FTuple_Lvector2_Mvector2_R            _ExprResult_1;                                     // 0x30(0x20)(HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_2;                                         // 0x50(0x10)(HasGetValueTypeHash)
	struct FTuple_Lvector2_Mvector2_R            _ExprResult_3;                                     // 0x60(0x20)(HasGetValueTypeHash)
};

// 0xAA (0xAA - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eLength_U_L_Nvector2_M_Ntuple_L_R_M_Ntuple_L_R_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eLength_U_L_Nvector2_M_Ntuple_L_R_M_Ntuple_L_R_R_Params
{
public:
	struct FTuple_Lvector2_Mtuple_L_R_Mtuple_L_R_R __verse_0xB2CDDD72_Argument;                       // 0x0(0x12)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_5DDE[0x6];                                     // Fixing Size After Last Property 
	double                                       RetVal;                                            // 0x18(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_0;                                         // 0x20(0x10)(HasGetValueTypeHash)
	double                                       _ExprResultStack_1;                                // 0x30(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_2;                                         // 0x38(0x10)(HasGetValueTypeHash)
	struct FTuple_Lvector2_Mtuple_L_R_Mtuple_L_R_R _ExprResult_3;                                     // 0x48(0x12)(HasGetValueTypeHash)
	uint8                                        Pad_5DDF[0x6];                                     // Fixing Size After Last Property 
	struct FTuple_L_R                            _ExprResult_4;                                     // 0x60(0x1)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_5;                                     // 0x61(0x1)(HasGetValueTypeHash)
	uint8                                        Pad_5DE1[0x6];                                     // Fixing Size After Last Property 
	FVerseFunctionProperty_                      _Callee_6;                                         // 0x68(0x10)(HasGetValueTypeHash)
	double                                       _ExprResultStack_7;                                // 0x78(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_8;                                         // 0x80(0x10)(HasGetValueTypeHash)
	struct FTuple_Lvector2_Mtuple_L_R_Mtuple_L_R_R _ExprResult_9;                                     // 0x90(0x12)(HasGetValueTypeHash)
	uint8                                        Pad_5DE2[0x6];                                     // Fixing Size After Last Property 
	struct FTuple_L_R                            _ExprResult_10;                                    // 0xA8(0x1)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_11;                                    // 0xA9(0x1)(HasGetValueTypeHash)
};

// 0xC2 (0xC2 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eLength_U_L_Nvector3_M_Ntuple_L_R_M_Ntuple_L_R_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eLength_U_L_Nvector3_M_Ntuple_L_R_M_Ntuple_L_R_R_Params
{
public:
	struct FTuple_Lvector3_Mtuple_L_R_Mtuple_L_R_R __verse_0xB2CDDD72_Argument;                       // 0x0(0x1A)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_5DEF[0x6];                                     // Fixing Size After Last Property 
	double                                       RetVal;                                            // 0x20(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_0;                                         // 0x28(0x10)(HasGetValueTypeHash)
	double                                       _ExprResultStack_1;                                // 0x38(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_2;                                         // 0x40(0x10)(HasGetValueTypeHash)
	struct FTuple_Lvector3_Mtuple_L_R_Mtuple_L_R_R _ExprResult_3;                                     // 0x50(0x1A)(HasGetValueTypeHash)
	uint8                                        Pad_5DF1[0x6];                                     // Fixing Size After Last Property 
	struct FTuple_L_R                            _ExprResult_4;                                     // 0x70(0x1)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_5;                                     // 0x71(0x1)(HasGetValueTypeHash)
	uint8                                        Pad_5DF2[0x6];                                     // Fixing Size After Last Property 
	FVerseFunctionProperty_                      _Callee_6;                                         // 0x78(0x10)(HasGetValueTypeHash)
	double                                       _ExprResultStack_7;                                // 0x88(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_8;                                         // 0x90(0x10)(HasGetValueTypeHash)
	struct FTuple_Lvector3_Mtuple_L_R_Mtuple_L_R_R _ExprResult_9;                                     // 0xA0(0x1A)(HasGetValueTypeHash)
	uint8                                        Pad_5DF3[0x6];                                     // Fixing Size After Last Property 
	struct FTuple_L_R                            _ExprResult_10;                                    // 0xC0(0x1)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_11;                                    // 0xC1(0x1)(HasGetValueTypeHash)
};

// 0x212 (0x212 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eIsFinite_U_L_Nvector2_M_Ntuple_L_R_M_Ntuple_L_R_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eIsFinite_U_L_Nvector2_M_Ntuple_L_R_M_Ntuple_L_R_R_Params
{
public:
	struct FTuple_Lvector2_Mtuple_L_R_Mtuple_L_R_R __verse_0xB2CDDD72_Argument;                       // 0x0(0x12)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_5DF9[0x6];                                     // Fixing Size After Last Property 
	FOptionalProperty_                           RetVal;                                            // 0x18(0x18)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	enum class EVerseFalse                       _ExprResult_0;                                     // 0x30(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_5DFA[0x7];                                     // Fixing Size After Last Property 
	struct FSpatialMath_vector2                  _ExprResult_1;                                     // 0x38(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_2;                                // 0x48(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_3;                                     // 0x98(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_4;                                     // 0xA8(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_5;                                // 0xB8(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_6;                                         // 0xC8(0x10)(HasGetValueTypeHash)
	struct FTuple_Lfloat_Mtuple_L_R_Mtuple_L_R_R _ExprResult_7;                                     // 0xD8(0xA)(HasGetValueTypeHash)
	uint8                                        Pad_5DFB[0x6];                                     // Fixing Size After Last Property 
	struct FTuple_L_R                            _ExprResult_8;                                     // 0xE8(0x1)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_9;                                     // 0xE9(0x1)(HasGetValueTypeHash)
	uint8                                        Pad_5DFC[0x6];                                     // Fixing Size After Last Property 
	FOptionalProperty_                           _ExprResultStack_10;                               // 0xF0(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_11;                                        // 0x100(0x10)(HasGetValueTypeHash)
	struct FTuple_Lfloat_Mtuple_L_R_Mtuple_L_R_R _ExprResult_12;                                    // 0x110(0xA)(HasGetValueTypeHash)
	uint8                                        Pad_5DFD[0x6];                                     // Fixing Size After Last Property 
	struct FTuple_L_R                            _ExprResult_13;                                    // 0x120(0x1)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_14;                                    // 0x121(0x1)(HasGetValueTypeHash)
	enum class EVerseFalse                       _ExprResult_15;                                    // 0x122(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_5DFF[0x5];                                     // Fixing Size After Last Property 
	struct FSpatialMath_vector2                  _ExprResult_16;                                    // 0x128(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_17;                               // 0x138(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_18;                                    // 0x188(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_19;                                    // 0x198(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_20;                               // 0x1A8(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_21;                                        // 0x1B8(0x10)(HasGetValueTypeHash)
	struct FTuple_Lfloat_Mtuple_L_R_Mtuple_L_R_R _ExprResult_22;                                    // 0x1C8(0xA)(HasGetValueTypeHash)
	uint8                                        Pad_5E02[0x6];                                     // Fixing Size After Last Property 
	struct FTuple_L_R                            _ExprResult_23;                                    // 0x1D8(0x1)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_24;                                    // 0x1D9(0x1)(HasGetValueTypeHash)
	uint8                                        Pad_5E03[0x6];                                     // Fixing Size After Last Property 
	FOptionalProperty_                           _ExprResultStack_25;                               // 0x1E0(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_26;                                        // 0x1F0(0x10)(HasGetValueTypeHash)
	struct FTuple_Lfloat_Mtuple_L_R_Mtuple_L_R_R _ExprResult_27;                                    // 0x200(0xA)(HasGetValueTypeHash)
	uint8                                        Pad_5E04[0x6];                                     // Fixing Size After Last Property 
	struct FTuple_L_R                            _ExprResult_28;                                    // 0x210(0x1)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_29;                                    // 0x211(0x1)(HasGetValueTypeHash)
};

// 0x2C2 (0x2C2 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eIsFinite_U_L_Nvector3_M_Ntuple_L_R_M_Ntuple_L_R_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eIsFinite_U_L_Nvector3_M_Ntuple_L_R_M_Ntuple_L_R_R_Params
{
public:
	struct FTuple_Lvector3_Mtuple_L_R_Mtuple_L_R_R __verse_0xB2CDDD72_Argument;                       // 0x0(0x1A)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_5E0F[0x6];                                     // Fixing Size After Last Property 
	FOptionalProperty_                           RetVal;                                            // 0x20(0x20)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	enum class EVerseFalse                       _ExprResult_0;                                     // 0x40(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_5E10[0x7];                                     // Fixing Size After Last Property 
	struct FSpatialMath_vector3                  _ExprResult_1;                                     // 0x48(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_2;                                // 0x60(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_3;                                     // 0xB0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_4;                                     // 0xC0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_5;                                     // 0xD0(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_6;                                // 0xE0(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_7;                                         // 0xF0(0x10)(HasGetValueTypeHash)
	struct FTuple_Lfloat_Mtuple_L_R_Mtuple_L_R_R _ExprResult_8;                                     // 0x100(0xA)(HasGetValueTypeHash)
	uint8                                        Pad_5E11[0x6];                                     // Fixing Size After Last Property 
	struct FTuple_L_R                            _ExprResult_9;                                     // 0x110(0x1)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_10;                                    // 0x111(0x1)(HasGetValueTypeHash)
	uint8                                        Pad_5E12[0x6];                                     // Fixing Size After Last Property 
	FOptionalProperty_                           _ExprResultStack_11;                               // 0x118(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_12;                                        // 0x128(0x10)(HasGetValueTypeHash)
	struct FTuple_Lfloat_Mtuple_L_R_Mtuple_L_R_R _ExprResult_13;                                    // 0x138(0xA)(HasGetValueTypeHash)
	uint8                                        Pad_5E13[0x6];                                     // Fixing Size After Last Property 
	struct FTuple_L_R                            _ExprResult_14;                                    // 0x148(0x1)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_15;                                    // 0x149(0x1)(HasGetValueTypeHash)
	uint8                                        Pad_5E14[0x6];                                     // Fixing Size After Last Property 
	FOptionalProperty_                           _ExprResultStack_16;                               // 0x150(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_17;                                        // 0x160(0x10)(HasGetValueTypeHash)
	struct FTuple_Lfloat_Mtuple_L_R_Mtuple_L_R_R _ExprResult_18;                                    // 0x170(0xA)(HasGetValueTypeHash)
	uint8                                        Pad_5E15[0x6];                                     // Fixing Size After Last Property 
	struct FTuple_L_R                            _ExprResult_19;                                    // 0x180(0x1)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_20;                                    // 0x181(0x1)(HasGetValueTypeHash)
	enum class EVerseFalse                       _ExprResult_21;                                    // 0x182(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_5E16[0x5];                                     // Fixing Size After Last Property 
	struct FSpatialMath_vector3                  _ExprResult_22;                                    // 0x188(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_23;                               // 0x1A0(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_24;                                    // 0x1F0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_25;                                    // 0x200(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_26;                                    // 0x210(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_27;                               // 0x220(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_28;                                        // 0x230(0x10)(HasGetValueTypeHash)
	struct FTuple_Lfloat_Mtuple_L_R_Mtuple_L_R_R _ExprResult_29;                                    // 0x240(0xA)(HasGetValueTypeHash)
	uint8                                        Pad_5E19[0x6];                                     // Fixing Size After Last Property 
	struct FTuple_L_R                            _ExprResult_30;                                    // 0x250(0x1)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_31;                                    // 0x251(0x1)(HasGetValueTypeHash)
	uint8                                        Pad_5E1A[0x6];                                     // Fixing Size After Last Property 
	FOptionalProperty_                           _ExprResultStack_32;                               // 0x258(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_33;                                        // 0x268(0x10)(HasGetValueTypeHash)
	struct FTuple_Lfloat_Mtuple_L_R_Mtuple_L_R_R _ExprResult_34;                                    // 0x278(0xA)(HasGetValueTypeHash)
	uint8                                        Pad_5E1B[0x6];                                     // Fixing Size After Last Property 
	struct FTuple_L_R                            _ExprResult_35;                                    // 0x288(0x1)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_36;                                    // 0x289(0x1)(HasGetValueTypeHash)
	uint8                                        Pad_5E1D[0x6];                                     // Fixing Size After Last Property 
	FOptionalProperty_                           _ExprResultStack_37;                               // 0x290(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_38;                                        // 0x2A0(0x10)(HasGetValueTypeHash)
	struct FTuple_Lfloat_Mtuple_L_R_Mtuple_L_R_R _ExprResult_39;                                    // 0x2B0(0xA)(HasGetValueTypeHash)
	uint8                                        Pad_5E1E[0x6];                                     // Fixing Size After Last Property 
	struct FTuple_L_R                            _ExprResult_40;                                    // 0x2C0(0x1)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_41;                                    // 0x2C1(0x1)(HasGetValueTypeHash)
};

// 0x60 (0x60 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eIsFinite_U_L_Nrotation_M_Ntuple_L_R_M_Ntuple_L_R_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eIsFinite_U_L_Nrotation_M_Ntuple_L_R_M_Ntuple_L_R_R_Params
{
public:
	struct FTuple_Lrotation_Mtuple_L_R_Mtuple_L_R_R __verse_0xB2CDDD72_Argument;                       // 0x0(0x22)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_5E27[0xE];                                     // Fixing Size After Last Property 
	FOptionalProperty_                           RetVal;                                            // 0x30(0x30)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor)
};

// 0x70 (0x70 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eIsAlmostZero_U_L_Nvector2_M_Ntuple_L_R_M_Nfloat_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eIsAlmostZero_U_L_Nvector2_M_Ntuple_L_R_M_Nfloat_R_Params
{
public:
	struct FTuple_Lvector2_Mtuple_L_R_Mfloat_R   __verse_0xB2CDDD72_Argument;                       // 0x0(0x20)(Parm, HasGetValueTypeHash)
	FOptionalProperty_                           RetVal;                                            // 0x20(0x2)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        _ExprResult_0 : 1;                                 // Mask: 0x1, PropSize: 0x10x22(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_383 : 7;                                    // Fixing Bit-Field Size 
	uint8                                        Pad_5E33[0x5];                                     // Fixing Size After Last Property 
	FOptionalProperty_                           _ExprResultStack_1;                                // 0x28(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_2;                                // 0x38(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        _ExprResult_3 : 1;                                 // Mask: 0x1, PropSize: 0x10x48(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_384 : 7;                                    // Fixing Bit-Field Size 
	uint8                                        Pad_5E36[0x7];                                     // Fixing Size After Last Property 
	FOptionalProperty_                           _ExprResultStack_4;                                // 0x50(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_5;                                // 0x60(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x98 (0x98 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eIsAlmostZero_U_L_Nvector3_M_Ntuple_L_R_M_Nfloat_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eIsAlmostZero_U_L_Nvector3_M_Ntuple_L_R_M_Nfloat_R_Params
{
public:
	struct FTuple_Lvector3_Mtuple_L_R_Mfloat_R   __verse_0xB2CDDD72_Argument;                       // 0x0(0x28)(Parm, HasGetValueTypeHash)
	FOptionalProperty_                           RetVal;                                            // 0x28(0x2)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        _ExprResult_0 : 1;                                 // Mask: 0x1, PropSize: 0x10x2A(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_385 : 7;                                    // Fixing Bit-Field Size 
	uint8                                        Pad_5E3E[0x5];                                     // Fixing Size After Last Property 
	FOptionalProperty_                           _ExprResultStack_1;                                // 0x30(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_2;                                // 0x40(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_3;                                // 0x50(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        _ExprResult_4 : 1;                                 // Mask: 0x1, PropSize: 0x10x60(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_386 : 7;                                    // Fixing Bit-Field Size 
	uint8                                        Pad_5E41[0x7];                                     // Fixing Size After Last Property 
	FOptionalProperty_                           _ExprResultStack_5;                                // 0x68(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_6;                                // 0x78(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_7;                                // 0x88(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x50 (0x50 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eInvert_U_L_Nrotation_M_Ntuple_L_R_M_Ntuple_L_R_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eInvert_U_L_Nrotation_M_Ntuple_L_R_M_Ntuple_L_R_R_Params
{
public:
	struct FTuple_Lrotation_Mtuple_L_R_Mtuple_L_R_R __verse_0xB2CDDD72_Argument;                       // 0x0(0x22)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_5E44[0xE];                                     // Fixing Size After Last Property 
	struct FVerseRotation                        RetVal;                                            // 0x30(0x20)(Parm, OutParm, ReturnParm, NoDestructor)
};

// 0x40 (0x40 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eGetYawPitchRollDegrees_U_L_Nrotation_M_Ntuple_L_R_M_Ntuple_L_R_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eGetYawPitchRollDegrees_U_L_Nrotation_M_Ntuple_L_R_M_Ntuple_L_R_R_Params
{
public:
	struct FTuple_Lrotation_Mtuple_L_R_Mtuple_L_R_R __verse_0xB2CDDD72_Argument;                       // 0x0(0x22)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_5E45[0xE];                                     // Fixing Size After Last Property 
	TArray<double>                               RetVal;                                            // 0x30(0x10)(Parm, OutParm, ReturnParm, ContainsInstancedReference)
};

// 0x230 (0x230 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eGetLocalUp_U_L_Nrotation_M_Ntuple_L_R_M_Ntuple_L_R_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eGetLocalUp_U_L_Nrotation_M_Ntuple_L_R_M_Ntuple_L_R_R_Params
{
public:
	struct FTuple_Lrotation_Mtuple_L_R_Mtuple_L_R_R __verse_0xB2CDDD72_Argument;                       // 0x0(0x22)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_5E48[0xE];                                     // Fixing Size After Last Property 
	struct FSpatialMath_vector3                  RetVal;                                            // 0x30(0x18)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_0;                                         // 0x48(0x10)(HasGetValueTypeHash)
	uint8                                        Pad_5E49[0x8];                                     // Fixing Size After Last Property 
	struct FTuple_Lrotation_Mtuple_L_R_Mvector3_R _ExprResult_1;                                     // 0x60(0x40)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_2;                                     // 0xA0(0x1)(HasGetValueTypeHash)
	uint8                                        Pad_5E4A[0x7];                                     // Fixing Size After Last Property 
	struct FSpatialMath_vector3                  _ExprResult_3;                                     // 0xA8(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_4;                                // 0xC0(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_5;                                     // 0x110(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_6;                                     // 0x120(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_7;                                     // 0x130(0x10)(HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_8;                                         // 0x140(0x10)(HasGetValueTypeHash)
	struct FTuple_Lrotation_Mtuple_L_R_Mvector3_R _ExprResult_9;                                     // 0x150(0x40)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_10;                                    // 0x190(0x1)(HasGetValueTypeHash)
	uint8                                        Pad_5E4C[0x7];                                     // Fixing Size After Last Property 
	struct FSpatialMath_vector3                  _ExprResult_11;                                    // 0x198(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_12;                               // 0x1B0(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_13;                                    // 0x200(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_14;                                    // 0x210(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_15;                                    // 0x220(0x10)(HasGetValueTypeHash)
};

// 0x230 (0x230 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eGetLocalRight_U_L_Nrotation_M_Ntuple_L_R_M_Ntuple_L_R_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eGetLocalRight_U_L_Nrotation_M_Ntuple_L_R_M_Ntuple_L_R_R_Params
{
public:
	struct FTuple_Lrotation_Mtuple_L_R_Mtuple_L_R_R __verse_0xB2CDDD72_Argument;                       // 0x0(0x22)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_5E54[0xE];                                     // Fixing Size After Last Property 
	struct FSpatialMath_vector3                  RetVal;                                            // 0x30(0x18)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_0;                                         // 0x48(0x10)(HasGetValueTypeHash)
	uint8                                        Pad_5E55[0x8];                                     // Fixing Size After Last Property 
	struct FTuple_Lrotation_Mtuple_L_R_Mvector3_R _ExprResult_1;                                     // 0x60(0x40)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_2;                                     // 0xA0(0x1)(HasGetValueTypeHash)
	uint8                                        Pad_5E56[0x7];                                     // Fixing Size After Last Property 
	struct FSpatialMath_vector3                  _ExprResult_3;                                     // 0xA8(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_4;                                // 0xC0(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_5;                                     // 0x110(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_6;                                     // 0x120(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_7;                                     // 0x130(0x10)(HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_8;                                         // 0x140(0x10)(HasGetValueTypeHash)
	struct FTuple_Lrotation_Mtuple_L_R_Mvector3_R _ExprResult_9;                                     // 0x150(0x40)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_10;                                    // 0x190(0x1)(HasGetValueTypeHash)
	uint8                                        Pad_5E57[0x7];                                     // Fixing Size After Last Property 
	struct FSpatialMath_vector3                  _ExprResult_11;                                    // 0x198(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_12;                               // 0x1B0(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_13;                                    // 0x200(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_14;                                    // 0x210(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_15;                                    // 0x220(0x10)(HasGetValueTypeHash)
};

// 0x230 (0x230 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eGetLocalForward_U_L_Nrotation_M_Ntuple_L_R_M_Ntuple_L_R_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eGetLocalForward_U_L_Nrotation_M_Ntuple_L_R_M_Ntuple_L_R_R_Params
{
public:
	struct FTuple_Lrotation_Mtuple_L_R_Mtuple_L_R_R __verse_0xB2CDDD72_Argument;                       // 0x0(0x22)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_5E5F[0xE];                                     // Fixing Size After Last Property 
	struct FSpatialMath_vector3                  RetVal;                                            // 0x30(0x18)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_0;                                         // 0x48(0x10)(HasGetValueTypeHash)
	uint8                                        Pad_5E60[0x8];                                     // Fixing Size After Last Property 
	struct FTuple_Lrotation_Mtuple_L_R_Mvector3_R _ExprResult_1;                                     // 0x60(0x40)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_2;                                     // 0xA0(0x1)(HasGetValueTypeHash)
	uint8                                        Pad_5E61[0x7];                                     // Fixing Size After Last Property 
	struct FSpatialMath_vector3                  _ExprResult_3;                                     // 0xA8(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_4;                                // 0xC0(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_5;                                     // 0x110(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_6;                                     // 0x120(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_7;                                     // 0x130(0x10)(HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_8;                                         // 0x140(0x10)(HasGetValueTypeHash)
	struct FTuple_Lrotation_Mtuple_L_R_Mvector3_R _ExprResult_9;                                     // 0x150(0x40)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_10;                                    // 0x190(0x1)(HasGetValueTypeHash)
	uint8                                        Pad_5E62[0x7];                                     // Fixing Size After Last Property 
	struct FSpatialMath_vector3                  _ExprResult_11;                                    // 0x198(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_12;                               // 0x1B0(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_13;                                    // 0x200(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_14;                                    // 0x210(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_15;                                    // 0x220(0x10)(HasGetValueTypeHash)
};

// 0x48 (0x48 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eGetAxis_U_L_Nrotation_M_Ntuple_L_R_M_Ntuple_L_R_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eGetAxis_U_L_Nrotation_M_Ntuple_L_R_M_Ntuple_L_R_R_Params
{
public:
	struct FTuple_Lrotation_Mtuple_L_R_Mtuple_L_R_R __verse_0xB2CDDD72_Argument;                       // 0x0(0x22)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_5E65[0xE];                                     // Fixing Size After Last Property 
	struct FSpatialMath_vector3                  RetVal;                                            // 0x30(0x18)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// 0x38 (0x38 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eGetAngle_U_L_Nrotation_M_Ntuple_L_R_M_Ntuple_L_R_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eGetAngle_U_L_Nrotation_M_Ntuple_L_R_M_Ntuple_L_R_R_Params
{
public:
	struct FTuple_Lrotation_Mtuple_L_R_Mtuple_L_R_R __verse_0xB2CDDD72_Argument;                       // 0x0(0x22)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_5E66[0xE];                                     // Fixing Size After Last Property 
	double                                       RetVal;                                            // 0x30(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x50 (0x50 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eApplyYaw_U_L_Nrotation_M_Ntuple_L_R_M_Nfloat_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eApplyYaw_U_L_Nrotation_M_Ntuple_L_R_M_Nfloat_R_Params
{
public:
	struct FTuple_Lrotation_Mtuple_L_R_Mfloat_R  __verse_0xB2CDDD72_Argument;                       // 0x0(0x30)(Parm, HasGetValueTypeHash)
	struct FVerseRotation                        RetVal;                                            // 0x30(0x20)(Parm, OutParm, ReturnParm, NoDestructor)
};

// 0x50 (0x50 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eApplyWorldRotationZ_U_L_Nrotation_M_Ntuple_L_R_M_Nfloat_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eApplyWorldRotationZ_U_L_Nrotation_M_Ntuple_L_R_M_Nfloat_R_Params
{
public:
	struct FTuple_Lrotation_Mtuple_L_R_Mfloat_R  __verse_0xB2CDDD72_Argument;                       // 0x0(0x30)(Parm, HasGetValueTypeHash)
	struct FVerseRotation                        RetVal;                                            // 0x30(0x20)(Parm, OutParm, ReturnParm, NoDestructor)
};

// 0x50 (0x50 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eApplyWorldRotationY_U_L_Nrotation_M_Ntuple_L_R_M_Nfloat_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eApplyWorldRotationY_U_L_Nrotation_M_Ntuple_L_R_M_Nfloat_R_Params
{
public:
	struct FTuple_Lrotation_Mtuple_L_R_Mfloat_R  __verse_0xB2CDDD72_Argument;                       // 0x0(0x30)(Parm, HasGetValueTypeHash)
	struct FVerseRotation                        RetVal;                                            // 0x30(0x20)(Parm, OutParm, ReturnParm, NoDestructor)
};

// 0x50 (0x50 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eApplyWorldRotationX_U_L_Nrotation_M_Ntuple_L_R_M_Nfloat_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eApplyWorldRotationX_U_L_Nrotation_M_Ntuple_L_R_M_Nfloat_R_Params
{
public:
	struct FTuple_Lrotation_Mtuple_L_R_Mfloat_R  __verse_0xB2CDDD72_Argument;                       // 0x0(0x30)(Parm, HasGetValueTypeHash)
	struct FVerseRotation                        RetVal;                                            // 0x30(0x20)(Parm, OutParm, ReturnParm, NoDestructor)
};

// 0x50 (0x50 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eApplyRoll_U_L_Nrotation_M_Ntuple_L_R_M_Nfloat_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eApplyRoll_U_L_Nrotation_M_Ntuple_L_R_M_Nfloat_R_Params
{
public:
	struct FTuple_Lrotation_Mtuple_L_R_Mfloat_R  __verse_0xB2CDDD72_Argument;                       // 0x0(0x30)(Parm, HasGetValueTypeHash)
	struct FVerseRotation                        RetVal;                                            // 0x30(0x20)(Parm, OutParm, ReturnParm, NoDestructor)
};

// 0x50 (0x50 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eApplyPitch_U_L_Nrotation_M_Ntuple_L_R_M_Nfloat_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eApplyPitch_U_L_Nrotation_M_Ntuple_L_R_M_Nfloat_R_Params
{
public:
	struct FTuple_Lrotation_Mtuple_L_R_Mfloat_R  __verse_0xB2CDDD72_Argument;                       // 0x0(0x30)(Parm, HasGetValueTypeHash)
	struct FVerseRotation                        RetVal;                                            // 0x30(0x20)(Parm, OutParm, ReturnParm, NoDestructor)
};

// 0x2A2 (0x2A2 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eApplyLocalRotationZ_U_L_Nrotation_M_Ntuple_L_R_M_Nfloat_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eApplyLocalRotationZ_U_L_Nrotation_M_Ntuple_L_R_M_Nfloat_R_Params
{
public:
	struct FTuple_Lrotation_Mtuple_L_R_Mfloat_R  __verse_0xB2CDDD72_Argument;                       // 0x0(0x30)(Parm, HasGetValueTypeHash)
	struct FVerseRotation                        RetVal;                                            // 0x30(0x20)(Parm, OutParm, ReturnParm, NoDestructor)
	FVerseFunctionProperty_                      _Callee_0;                                         // 0x50(0x10)(HasGetValueTypeHash)
	struct FTuple_Lrotation_Mtuple_L_R_Mrotation_R _ExprResult_1;                                     // 0x60(0x50)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_2;                                     // 0xB0(0x1)(HasGetValueTypeHash)
	uint8                                        Pad_5E7C[0xF];                                     // Fixing Size After Last Property 
	struct FVerseRotation                        _ExprResultStack_3;                                // 0xC0(0x20)(NoDestructor)
	FVerseFunctionProperty_                      _Callee_4;                                         // 0xE0(0x10)(HasGetValueTypeHash)
	struct FTuple_Lvector3_Mfloat_R              _ExprResult_5;                                     // 0xF0(0x20)(HasGetValueTypeHash)
	struct FSpatialMath_vector3                  _ExprResultStack_6;                                // 0x110(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_7;                                         // 0x128(0x10)(HasGetValueTypeHash)
	uint8                                        Pad_5E7E[0x8];                                     // Fixing Size After Last Property 
	struct FTuple_Lrotation_Mtuple_L_R_Mtuple_L_R_R _ExprResult_8;                                     // 0x140(0x22)(HasGetValueTypeHash)
	uint8                                        Pad_5E7F[0xE];                                     // Fixing Size After Last Property 
	struct FTuple_L_R                            _ExprResult_9;                                     // 0x170(0x1)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_10;                                    // 0x171(0x1)(HasGetValueTypeHash)
	uint8                                        Pad_5E80[0x6];                                     // Fixing Size After Last Property 
	FVerseFunctionProperty_                      _Callee_11;                                        // 0x178(0x10)(HasGetValueTypeHash)
	uint8                                        Pad_5E81[0x8];                                     // Fixing Size After Last Property 
	struct FTuple_Lrotation_Mtuple_L_R_Mrotation_R _ExprResult_12;                                    // 0x190(0x50)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_13;                                    // 0x1E0(0x1)(HasGetValueTypeHash)
	uint8                                        Pad_5E82[0xF];                                     // Fixing Size After Last Property 
	struct FVerseRotation                        _ExprResultStack_14;                               // 0x1F0(0x20)(NoDestructor)
	FVerseFunctionProperty_                      _Callee_15;                                        // 0x210(0x10)(HasGetValueTypeHash)
	struct FTuple_Lvector3_Mfloat_R              _ExprResult_16;                                    // 0x220(0x20)(HasGetValueTypeHash)
	struct FSpatialMath_vector3                  _ExprResultStack_17;                               // 0x240(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_18;                                        // 0x258(0x10)(HasGetValueTypeHash)
	uint8                                        Pad_5E83[0x8];                                     // Fixing Size After Last Property 
	struct FTuple_Lrotation_Mtuple_L_R_Mtuple_L_R_R _ExprResult_19;                                    // 0x270(0x22)(HasGetValueTypeHash)
	uint8                                        Pad_5E84[0xE];                                     // Fixing Size After Last Property 
	struct FTuple_L_R                            _ExprResult_20;                                    // 0x2A0(0x1)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_21;                                    // 0x2A1(0x1)(HasGetValueTypeHash)
};

// 0x2A2 (0x2A2 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eApplyLocalRotationY_U_L_Nrotation_M_Ntuple_L_R_M_Nfloat_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eApplyLocalRotationY_U_L_Nrotation_M_Ntuple_L_R_M_Nfloat_R_Params
{
public:
	struct FTuple_Lrotation_Mtuple_L_R_Mfloat_R  __verse_0xB2CDDD72_Argument;                       // 0x0(0x30)(Parm, HasGetValueTypeHash)
	struct FVerseRotation                        RetVal;                                            // 0x30(0x20)(Parm, OutParm, ReturnParm, NoDestructor)
	FVerseFunctionProperty_                      _Callee_0;                                         // 0x50(0x10)(HasGetValueTypeHash)
	struct FTuple_Lrotation_Mtuple_L_R_Mrotation_R _ExprResult_1;                                     // 0x60(0x50)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_2;                                     // 0xB0(0x1)(HasGetValueTypeHash)
	uint8                                        Pad_5E94[0xF];                                     // Fixing Size After Last Property 
	struct FVerseRotation                        _ExprResultStack_3;                                // 0xC0(0x20)(NoDestructor)
	FVerseFunctionProperty_                      _Callee_4;                                         // 0xE0(0x10)(HasGetValueTypeHash)
	struct FTuple_Lvector3_Mfloat_R              _ExprResult_5;                                     // 0xF0(0x20)(HasGetValueTypeHash)
	struct FSpatialMath_vector3                  _ExprResultStack_6;                                // 0x110(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_7;                                         // 0x128(0x10)(HasGetValueTypeHash)
	uint8                                        Pad_5E96[0x8];                                     // Fixing Size After Last Property 
	struct FTuple_Lrotation_Mtuple_L_R_Mtuple_L_R_R _ExprResult_8;                                     // 0x140(0x22)(HasGetValueTypeHash)
	uint8                                        Pad_5E97[0xE];                                     // Fixing Size After Last Property 
	struct FTuple_L_R                            _ExprResult_9;                                     // 0x170(0x1)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_10;                                    // 0x171(0x1)(HasGetValueTypeHash)
	uint8                                        Pad_5E98[0x6];                                     // Fixing Size After Last Property 
	FVerseFunctionProperty_                      _Callee_11;                                        // 0x178(0x10)(HasGetValueTypeHash)
	uint8                                        Pad_5E99[0x8];                                     // Fixing Size After Last Property 
	struct FTuple_Lrotation_Mtuple_L_R_Mrotation_R _ExprResult_12;                                    // 0x190(0x50)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_13;                                    // 0x1E0(0x1)(HasGetValueTypeHash)
	uint8                                        Pad_5E9A[0xF];                                     // Fixing Size After Last Property 
	struct FVerseRotation                        _ExprResultStack_14;                               // 0x1F0(0x20)(NoDestructor)
	FVerseFunctionProperty_                      _Callee_15;                                        // 0x210(0x10)(HasGetValueTypeHash)
	struct FTuple_Lvector3_Mfloat_R              _ExprResult_16;                                    // 0x220(0x20)(HasGetValueTypeHash)
	struct FSpatialMath_vector3                  _ExprResultStack_17;                               // 0x240(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_18;                                        // 0x258(0x10)(HasGetValueTypeHash)
	uint8                                        Pad_5E9C[0x8];                                     // Fixing Size After Last Property 
	struct FTuple_Lrotation_Mtuple_L_R_Mtuple_L_R_R _ExprResult_19;                                    // 0x270(0x22)(HasGetValueTypeHash)
	uint8                                        Pad_5E9D[0xE];                                     // Fixing Size After Last Property 
	struct FTuple_L_R                            _ExprResult_20;                                    // 0x2A0(0x1)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_21;                                    // 0x2A1(0x1)(HasGetValueTypeHash)
};

// 0x2A2 (0x2A2 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eApplyLocalRotationX_U_L_Nrotation_M_Ntuple_L_R_M_Nfloat_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eApplyLocalRotationX_U_L_Nrotation_M_Ntuple_L_R_M_Nfloat_R_Params
{
public:
	struct FTuple_Lrotation_Mtuple_L_R_Mfloat_R  __verse_0xB2CDDD72_Argument;                       // 0x0(0x30)(Parm, HasGetValueTypeHash)
	struct FVerseRotation                        RetVal;                                            // 0x30(0x20)(Parm, OutParm, ReturnParm, NoDestructor)
	FVerseFunctionProperty_                      _Callee_0;                                         // 0x50(0x10)(HasGetValueTypeHash)
	struct FTuple_Lrotation_Mtuple_L_R_Mrotation_R _ExprResult_1;                                     // 0x60(0x50)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_2;                                     // 0xB0(0x1)(HasGetValueTypeHash)
	uint8                                        Pad_5EAD[0xF];                                     // Fixing Size After Last Property 
	struct FVerseRotation                        _ExprResultStack_3;                                // 0xC0(0x20)(NoDestructor)
	FVerseFunctionProperty_                      _Callee_4;                                         // 0xE0(0x10)(HasGetValueTypeHash)
	struct FTuple_Lvector3_Mfloat_R              _ExprResult_5;                                     // 0xF0(0x20)(HasGetValueTypeHash)
	struct FSpatialMath_vector3                  _ExprResultStack_6;                                // 0x110(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_7;                                         // 0x128(0x10)(HasGetValueTypeHash)
	uint8                                        Pad_5EAE[0x8];                                     // Fixing Size After Last Property 
	struct FTuple_Lrotation_Mtuple_L_R_Mtuple_L_R_R _ExprResult_8;                                     // 0x140(0x22)(HasGetValueTypeHash)
	uint8                                        Pad_5EAF[0xE];                                     // Fixing Size After Last Property 
	struct FTuple_L_R                            _ExprResult_9;                                     // 0x170(0x1)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_10;                                    // 0x171(0x1)(HasGetValueTypeHash)
	uint8                                        Pad_5EB0[0x6];                                     // Fixing Size After Last Property 
	FVerseFunctionProperty_                      _Callee_11;                                        // 0x178(0x10)(HasGetValueTypeHash)
	uint8                                        Pad_5EB1[0x8];                                     // Fixing Size After Last Property 
	struct FTuple_Lrotation_Mtuple_L_R_Mrotation_R _ExprResult_12;                                    // 0x190(0x50)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_13;                                    // 0x1E0(0x1)(HasGetValueTypeHash)
	uint8                                        Pad_5EB2[0xF];                                     // Fixing Size After Last Property 
	struct FVerseRotation                        _ExprResultStack_14;                               // 0x1F0(0x20)(NoDestructor)
	FVerseFunctionProperty_                      _Callee_15;                                        // 0x210(0x10)(HasGetValueTypeHash)
	struct FTuple_Lvector3_Mfloat_R              _ExprResult_16;                                    // 0x220(0x20)(HasGetValueTypeHash)
	struct FSpatialMath_vector3                  _ExprResultStack_17;                               // 0x240(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_18;                                        // 0x258(0x10)(HasGetValueTypeHash)
	uint8                                        Pad_5EB3[0x8];                                     // Fixing Size After Last Property 
	struct FTuple_Lrotation_Mtuple_L_R_Mtuple_L_R_R _ExprResult_19;                                    // 0x270(0x22)(HasGetValueTypeHash)
	uint8                                        Pad_5EB4[0xE];                                     // Fixing Size After Last Property 
	struct FTuple_L_R                            _ExprResult_20;                                    // 0x2A0(0x1)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_21;                                    // 0x2A1(0x1)(HasGetValueTypeHash)
};

// 0x110 (0x110 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2d_U_L_Nvector2i_M_Nvector2i_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2d_U_L_Nvector2i_M_Nvector2i_R_Params
{
public:
	struct FTuple_Lvector2i_Mvector2i_R          __verse_0xB2CDDD72_Argument;                       // 0x0(0x20)(Parm, HasGetValueTypeHash)
	struct FSpatialMath_vector2i                 RetVal;                                            // 0x20(0x10)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_0;                                // 0x30(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_1;                                     // 0x80(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_2;                                     // 0x90(0x10)(HasGetValueTypeHash)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_3;                                // 0xA0(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_4;                                     // 0xF0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_5;                                     // 0x100(0x10)(HasGetValueTypeHash)
};

// 0x148 (0x148 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2d_U_L_Nvector3_M_Nvector3_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2d_U_L_Nvector3_M_Nvector3_R_Params
{
public:
	struct FTuple_Lvector3_Mvector3_R            __verse_0xB2CDDD72_Argument;                       // 0x0(0x30)(Parm, HasGetValueTypeHash)
	struct FSpatialMath_vector3                  RetVal;                                            // 0x30(0x18)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_0;                                // 0x48(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_1;                                     // 0x98(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_2;                                     // 0xA8(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_3;                                     // 0xB8(0x10)(HasGetValueTypeHash)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_4;                                // 0xC8(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_5;                                     // 0x118(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_6;                                     // 0x128(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_7;                                     // 0x138(0x10)(HasGetValueTypeHash)
};

// 0x110 (0x110 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2d_U_L_Nvector2_M_Nvector2_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2d_U_L_Nvector2_M_Nvector2_R_Params
{
public:
	struct FTuple_Lvector2_Mvector2_R            __verse_0xB2CDDD72_Argument;                       // 0x0(0x20)(Parm, HasGetValueTypeHash)
	struct FSpatialMath_vector2                  RetVal;                                            // 0x20(0x10)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_0;                                // 0x30(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_1;                                     // 0x80(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_2;                                     // 0x90(0x10)(HasGetValueTypeHash)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_3;                                // 0xA0(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_4;                                     // 0xF0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_5;                                     // 0x100(0x10)(HasGetValueTypeHash)
};

// 0x110 (0x110 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2b_U_L_Nvector2i_M_Nvector2i_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2b_U_L_Nvector2i_M_Nvector2i_R_Params
{
public:
	struct FTuple_Lvector2i_Mvector2i_R          __verse_0xB2CDDD72_Argument;                       // 0x0(0x20)(Parm, HasGetValueTypeHash)
	struct FSpatialMath_vector2i                 RetVal;                                            // 0x20(0x10)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_0;                                // 0x30(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_1;                                     // 0x80(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_2;                                     // 0x90(0x10)(HasGetValueTypeHash)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_3;                                // 0xA0(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_4;                                     // 0xF0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_5;                                     // 0x100(0x10)(HasGetValueTypeHash)
};

// 0x148 (0x148 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2b_U_L_Nvector3_M_Nvector3_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2b_U_L_Nvector3_M_Nvector3_R_Params
{
public:
	struct FTuple_Lvector3_Mvector3_R            __verse_0xB2CDDD72_Argument;                       // 0x0(0x30)(Parm, HasGetValueTypeHash)
	struct FSpatialMath_vector3                  RetVal;                                            // 0x30(0x18)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_0;                                // 0x48(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_1;                                     // 0x98(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_2;                                     // 0xA8(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_3;                                     // 0xB8(0x10)(HasGetValueTypeHash)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_4;                                // 0xC8(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_5;                                     // 0x118(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_6;                                     // 0x128(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_7;                                     // 0x138(0x10)(HasGetValueTypeHash)
};

// 0x110 (0x110 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2b_U_L_Nvector2_M_Nvector2_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2b_U_L_Nvector2_M_Nvector2_R_Params
{
public:
	struct FTuple_Lvector2_Mvector2_R            __verse_0xB2CDDD72_Argument;                       // 0x0(0x20)(Parm, HasGetValueTypeHash)
	struct FSpatialMath_vector2                  RetVal;                                            // 0x20(0x10)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_0;                                // 0x30(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_1;                                     // 0x80(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_2;                                     // 0x90(0x10)(HasGetValueTypeHash)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_3;                                // 0xA0(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_4;                                     // 0xF0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_5;                                     // 0x100(0x10)(HasGetValueTypeHash)
};

// 0x108 (0x108 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2a_U_L_Nvector2i_M_Nint_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2a_U_L_Nvector2i_M_Nint_R_Params
{
public:
	struct FTuple_Lvector2i_Mint_R               __verse_0xB2CDDD72_Argument;                       // 0x0(0x18)(Parm, HasGetValueTypeHash)
	struct FSpatialMath_vector2i                 RetVal;                                            // 0x18(0x10)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_0;                                // 0x28(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_1;                                     // 0x78(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_2;                                     // 0x88(0x10)(HasGetValueTypeHash)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_3;                                // 0x98(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_4;                                     // 0xE8(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_5;                                     // 0xF8(0x10)(HasGetValueTypeHash)
};

// 0x138 (0x138 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2a_U_L_Nfloat_M_Nvector3_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2a_U_L_Nfloat_M_Nvector3_R_Params
{
public:
	struct FTuple_Lfloat_Mvector3_R              __verse_0xB2CDDD72_Argument;                       // 0x0(0x20)(Parm, HasGetValueTypeHash)
	struct FSpatialMath_vector3                  RetVal;                                            // 0x20(0x18)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_0;                                // 0x38(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_1;                                     // 0x88(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_2;                                     // 0x98(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_3;                                     // 0xA8(0x10)(HasGetValueTypeHash)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_4;                                // 0xB8(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_5;                                     // 0x108(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_6;                                     // 0x118(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_7;                                     // 0x128(0x10)(HasGetValueTypeHash)
};

// 0x138 (0x138 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2a_U_L_Nvector3_M_Nfloat_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2a_U_L_Nvector3_M_Nfloat_R_Params
{
public:
	struct FTuple_Lvector3_Mfloat_R              __verse_0xB2CDDD72_Argument;                       // 0x0(0x20)(Parm, HasGetValueTypeHash)
	struct FSpatialMath_vector3                  RetVal;                                            // 0x20(0x18)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_0;                                // 0x38(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_1;                                     // 0x88(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_2;                                     // 0x98(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_3;                                     // 0xA8(0x10)(HasGetValueTypeHash)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_4;                                // 0xB8(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_5;                                     // 0x108(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_6;                                     // 0x118(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_7;                                     // 0x128(0x10)(HasGetValueTypeHash)
};

// 0x108 (0x108 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2a_U_L_Nfloat_M_Nvector2_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2a_U_L_Nfloat_M_Nvector2_R_Params
{
public:
	struct FTuple_Lfloat_Mvector2_R              __verse_0xB2CDDD72_Argument;                       // 0x0(0x18)(Parm, HasGetValueTypeHash)
	struct FSpatialMath_vector2                  RetVal;                                            // 0x18(0x10)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_0;                                // 0x28(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_1;                                     // 0x78(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_2;                                     // 0x88(0x10)(HasGetValueTypeHash)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_3;                                // 0x98(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_4;                                     // 0xE8(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_5;                                     // 0xF8(0x10)(HasGetValueTypeHash)
};

// 0x148 (0x148 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2a_U_L_Nvector3_M_Nvector3_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2a_U_L_Nvector3_M_Nvector3_R_Params
{
public:
	struct FTuple_Lvector3_Mvector3_R            __verse_0xB2CDDD72_Argument;                       // 0x0(0x30)(Parm, HasGetValueTypeHash)
	struct FSpatialMath_vector3                  RetVal;                                            // 0x30(0x18)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_0;                                // 0x48(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_1;                                     // 0x98(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_2;                                     // 0xA8(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_3;                                     // 0xB8(0x10)(HasGetValueTypeHash)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_4;                                // 0xC8(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_5;                                     // 0x118(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_6;                                     // 0x128(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_7;                                     // 0x138(0x10)(HasGetValueTypeHash)
};

// 0x108 (0x108 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2a_U_L_Nint_M_Nvector2i_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2a_U_L_Nint_M_Nvector2i_R_Params
{
public:
	struct FTuple_Lint_Mvector2i_R               __verse_0xB2CDDD72_Argument;                       // 0x0(0x18)(Parm, HasGetValueTypeHash)
	struct FSpatialMath_vector2i                 RetVal;                                            // 0x18(0x10)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_0;                                // 0x28(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_1;                                     // 0x78(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_2;                                     // 0x88(0x10)(HasGetValueTypeHash)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_3;                                // 0x98(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_4;                                     // 0xE8(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_5;                                     // 0xF8(0x10)(HasGetValueTypeHash)
};

// 0x108 (0x108 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2a_U_L_Nvector2_M_Nfloat_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2a_U_L_Nvector2_M_Nfloat_R_Params
{
public:
	struct FTuple_Lvector2_Mfloat_R              __verse_0xB2CDDD72_Argument;                       // 0x0(0x18)(Parm, HasGetValueTypeHash)
	struct FSpatialMath_vector2                  RetVal;                                            // 0x18(0x10)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_0;                                // 0x28(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_1;                                     // 0x78(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_2;                                     // 0x88(0x10)(HasGetValueTypeHash)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_3;                                // 0x98(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_4;                                     // 0xE8(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_5;                                     // 0xF8(0x10)(HasGetValueTypeHash)
};

// 0x120 (0x120 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RZero
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RZero_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_5F10[0x7];                                     // Fixing Size After Last Property 
	struct FSpatialMath_vector3                  RetVal;                                            // 0x8(0x18)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_0;                                // 0x20(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_1;                                     // 0x70(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_2;                                     // 0x80(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_3;                                     // 0x90(0x10)(HasGetValueTypeHash)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_4;                                // 0xA0(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_5;                                     // 0xF0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_6;                                     // 0x100(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_7;                                     // 0x110(0x10)(HasGetValueTypeHash)
};

// 0x120 (0x120 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RZAxis
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RZAxis_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_5F16[0x7];                                     // Fixing Size After Last Property 
	struct FSpatialMath_vector3                  RetVal;                                            // 0x8(0x18)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_0;                                // 0x20(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_1;                                     // 0x70(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_2;                                     // 0x80(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_3;                                     // 0x90(0x10)(HasGetValueTypeHash)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_4;                                // 0xA0(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_5;                                     // 0xF0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_6;                                     // 0x100(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_7;                                     // 0x110(0x10)(HasGetValueTypeHash)
};

// 0x120 (0x120 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RYAxis
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RYAxis_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_5F1C[0x7];                                     // Fixing Size After Last Property 
	struct FSpatialMath_vector3                  RetVal;                                            // 0x8(0x18)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_0;                                // 0x20(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_1;                                     // 0x70(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_2;                                     // 0x80(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_3;                                     // 0x90(0x10)(HasGetValueTypeHash)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_4;                                // 0xA0(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_5;                                     // 0xF0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_6;                                     // 0x100(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_7;                                     // 0x110(0x10)(HasGetValueTypeHash)
};

// 0x120 (0x120 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RXAxis
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RXAxis_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_5F25[0x7];                                     // Fixing Size After Last Property 
	struct FSpatialMath_vector3                  RetVal;                                            // 0x8(0x18)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_0;                                // 0x20(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_1;                                     // 0x70(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_2;                                     // 0x80(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_3;                                     // 0x90(0x10)(HasGetValueTypeHash)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_4;                                // 0xA0(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_5;                                     // 0xF0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_6;                                     // 0x100(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_7;                                     // 0x110(0x10)(HasGetValueTypeHash)
};

// 0x98 (0x98 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RTransformVectorNoScale_L_Ntransform_M_Nvector3_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RTransformVectorNoScale_L_Ntransform_M_Nvector3_R_Params
{
public:
	struct FTuple_Ltransform_Mvector3_R          __verse_0xB2CDDD72_Argument;                       // 0x0(0x78)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_5F27[0x8];                                     // Fixing Size After Last Property 
	struct FSpatialMath_vector3                  RetVal;                                            // 0x80(0x18)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// 0x98 (0x98 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RTransformVector_L_Ntransform_M_Nvector3_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RTransformVector_L_Ntransform_M_Nvector3_R_Params
{
public:
	struct FTuple_Ltransform_Mvector3_R          __verse_0xB2CDDD72_Argument;                       // 0x0(0x78)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_5F28[0x8];                                     // Fixing Size After Last Property 
	struct FSpatialMath_vector3                  RetVal;                                            // 0x80(0x18)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// 0x1A8 (0x1A8 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RToVector2i_L_Nvector2_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RToVector2i_L_Nvector2_R_Params
{
public:
	struct FSpatialMath_vector2                  __verse_0xB2CDDD72_Argument;                       // 0x0(0x10)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	FOptionalProperty_                           RetVal;                                            // 0x10(0x18)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	struct FSpatialMath_vector2i                 _ExprResult_0;                                     // 0x28(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_1;                                // 0x38(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_2;                                     // 0x88(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_3;                                     // 0x98(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_4;                                // 0xA8(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_5;                                         // 0xB8(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_6;                                // 0xC8(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_7;                                         // 0xD8(0x10)(HasGetValueTypeHash)
	struct FSpatialMath_vector2i                 _ExprResult_8;                                     // 0xE8(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_9;                                // 0xF8(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_10;                                    // 0x148(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_11;                                    // 0x158(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_12;                               // 0x168(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_13;                                        // 0x178(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_14;                               // 0x188(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_15;                                        // 0x198(0x10)(HasGetValueTypeHash)
};

// 0x100 (0x100 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RToVector2_L_Nvector2i_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RToVector2_L_Nvector2i_R_Params
{
public:
	struct FSpatialMath_vector2i                 __verse_0xB2CDDD72_Argument;                       // 0x0(0x10)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FSpatialMath_vector2                  RetVal;                                            // 0x10(0x10)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_0;                                // 0x20(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_1;                                     // 0x70(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_2;                                     // 0x80(0x10)(HasGetValueTypeHash)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_3;                                // 0x90(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_4;                                     // 0xE0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_5;                                     // 0xF0(0x10)(HasGetValueTypeHash)
};

// 0x20 (0x20 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RToString_L_Nvector2i_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RToString_L_Nvector2i_R_Params
{
public:
	struct FSpatialMath_vector2i                 __verse_0xB2CDDD72_Argument;                       // 0x0(0x10)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseStringProperty_                        RetVal;                                            // 0x10(0x10)(Parm, OutParm, ReturnParm, HasGetValueTypeHash)
};

// 0x28 (0x28 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RToString_L_Nvector3_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RToString_L_Nvector3_R_Params
{
public:
	struct FSpatialMath_vector3                  __verse_0xB2CDDD72_Argument;                       // 0x0(0x18)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseStringProperty_                        RetVal;                                            // 0x18(0x10)(Parm, OutParm, ReturnParm, HasGetValueTypeHash)
};

// 0x30 (0x30 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RToString_L_Nrotation_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RToString_L_Nrotation_R_Params
{
public:
	struct FVerseRotation                        __verse_0xB2CDDD72_Argument;                       // 0x0(0x20)(Parm, NoDestructor)
	FVerseStringProperty_                        RetVal;                                            // 0x20(0x10)(Parm, OutParm, ReturnParm, HasGetValueTypeHash)
};

// 0x20 (0x20 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RToString_L_Nvector2_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RToString_L_Nvector2_R_Params
{
public:
	struct FSpatialMath_vector2                  __verse_0xB2CDDD72_Argument;                       // 0x0(0x10)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseStringProperty_                        RetVal;                                            // 0x10(0x10)(Parm, OutParm, ReturnParm, HasGetValueTypeHash)
};

// 0x80 (0x80 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RSlerp_L_Nrotation_M_Nrotation_M_Nfloat_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RSlerp_L_Nrotation_M_Nrotation_M_Nfloat_R_Params
{
public:
	struct FTuple_Lrotation_Mrotation_Mfloat_R   __verse_0xB2CDDD72_Argument;                       // 0x0(0x48)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_5F48[0x8];                                     // Fixing Size After Last Property 
	FOptionalProperty_                           RetVal;                                            // 0x50(0x30)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor)
};

// 0x38 (0x38 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RReflectVector_L_Nvector2_M_Nvector2_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RReflectVector_L_Nvector2_M_Nvector2_R_Params
{
public:
	struct FTuple_Lvector2_Mvector2_R            __verse_0xB2CDDD72_Argument;                       // 0x0(0x20)(Parm, HasGetValueTypeHash)
	FOptionalProperty_                           RetVal;                                            // 0x20(0x18)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// 0x50 (0x50 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RReflectVector_L_Nvector3_M_Nvector3_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RReflectVector_L_Nvector3_M_Nvector3_R_Params
{
public:
	struct FTuple_Lvector3_Mvector3_R            __verse_0xB2CDDD72_Argument;                       // 0x0(0x30)(Parm, HasGetValueTypeHash)
	FOptionalProperty_                           RetVal;                                            // 0x30(0x20)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// 0x10 (0x10 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RRadiansToDegrees_L_Nfloat_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RRadiansToDegrees_L_Nfloat_R_Params
{
public:
	double                                       __verse_0xB2CDDD72_Argument;                       // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       RetVal;                                            // 0x8(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x120 (0x120 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_ROnes
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_ROnes_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_5F4F[0x7];                                     // Fixing Size After Last Property 
	struct FSpatialMath_vector3                  RetVal;                                            // 0x8(0x18)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_0;                                // 0x20(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_1;                                     // 0x70(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_2;                                     // 0x80(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_3;                                     // 0x90(0x10)(HasGetValueTypeHash)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_4;                                // 0xA0(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_5;                                     // 0xF0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_6;                                     // 0x100(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_7;                                     // 0x110(0x10)(HasGetValueTypeHash)
};

// 0x50 (0x50 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RMakeShortestRotationBetween_L_Nvector3_M_Nvector3_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RMakeShortestRotationBetween_L_Nvector3_M_Nvector3_R_Params
{
public:
	struct FTuple_Lvector3_Mvector3_R            __verse_0xB2CDDD72_Argument;                       // 0x0(0x30)(Parm, HasGetValueTypeHash)
	struct FVerseRotation                        RetVal;                                            // 0x30(0x20)(Parm, OutParm, ReturnParm, NoDestructor)
};

// 0x60 (0x60 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RMakeShortestRotationBetween_L_Nrotation_M_Nrotation_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RMakeShortestRotationBetween_L_Nrotation_M_Nrotation_R_Params
{
public:
	struct FTuple_Lrotation_Mrotation_R          __verse_0xB2CDDD72_Argument;                       // 0x0(0x40)(Parm, HasGetValueTypeHash)
	struct FVerseRotation                        RetVal;                                            // 0x40(0x20)(Parm, OutParm, ReturnParm, NoDestructor)
};

// 0x40 (0x40 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RMakeRotationFromYawPitchRollDegrees_L_Nfloat_M_Nfloat_M_Nfloat_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RMakeRotationFromYawPitchRollDegrees_L_Nfloat_M_Nfloat_M_Nfloat_R_Params
{
public:
	struct FTuple_Lfloat_Mfloat_Mfloat_R         __verse_0xB2CDDD72_Argument;                       // 0x0(0x18)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_5F5C[0x8];                                     // Fixing Size After Last Property 
	struct FVerseRotation                        RetVal;                                            // 0x20(0x20)(Parm, OutParm, ReturnParm, NoDestructor)
};

// 0x40 (0x40 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RMakeRotation_L_Nvector3_M_Nfloat_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RMakeRotation_L_Nvector3_M_Nfloat_R_Params
{
public:
	struct FTuple_Lvector3_Mfloat_R              __verse_0xB2CDDD72_Argument;                       // 0x0(0x20)(Parm, HasGetValueTypeHash)
	struct FVerseRotation                        RetVal;                                            // 0x20(0x20)(Parm, OutParm, ReturnParm, NoDestructor)
};

// 0x1D8 (0x1D8 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RLerp_L_Nvector2_M_Nvector2_M_Nfloat_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RLerp_L_Nvector2_M_Nvector2_M_Nfloat_R_Params
{
public:
	struct FTuple_Lvector2_Mvector2_Mfloat_R     __verse_0xB2CDDD72_Argument;                       // 0x0(0x28)(Parm, HasGetValueTypeHash)
	struct FSpatialMath_vector2                  RetVal;                                            // 0x28(0x10)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_0;                                // 0x38(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_1;                                     // 0x88(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_2;                                     // 0x98(0x10)(HasGetValueTypeHash)
	double                                       _ExprResultStack_3;                                // 0xA8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_4;                                         // 0xB0(0x10)(HasGetValueTypeHash)
	struct FTuple_Lfloat_Mfloat_Mfloat_R         _ExprResult_5;                                     // 0xC0(0x18)(HasGetValueTypeHash)
	double                                       _ExprResultStack_6;                                // 0xD8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_7;                                         // 0xE0(0x10)(HasGetValueTypeHash)
	struct FTuple_Lfloat_Mfloat_Mfloat_R         _ExprResult_8;                                     // 0xF0(0x18)(HasGetValueTypeHash)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_9;                                // 0x108(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_10;                                    // 0x158(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_11;                                    // 0x168(0x10)(HasGetValueTypeHash)
	double                                       _ExprResultStack_12;                               // 0x178(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_13;                                        // 0x180(0x10)(HasGetValueTypeHash)
	struct FTuple_Lfloat_Mfloat_Mfloat_R         _ExprResult_14;                                    // 0x190(0x18)(HasGetValueTypeHash)
	double                                       _ExprResultStack_15;                               // 0x1A8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_16;                                        // 0x1B0(0x10)(HasGetValueTypeHash)
	struct FTuple_Lfloat_Mfloat_Mfloat_R         _ExprResult_17;                                    // 0x1C0(0x18)(HasGetValueTypeHash)
};

// 0x270 (0x270 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RLerp_L_Nvector3_M_Nvector3_M_Nfloat_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RLerp_L_Nvector3_M_Nvector3_M_Nfloat_R_Params
{
public:
	struct FTuple_Lvector3_Mvector3_Mfloat_R     __verse_0xB2CDDD72_Argument;                       // 0x0(0x38)(Parm, HasGetValueTypeHash)
	struct FSpatialMath_vector3                  RetVal;                                            // 0x38(0x18)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_0;                                // 0x50(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_1;                                     // 0xA0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_2;                                     // 0xB0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_3;                                     // 0xC0(0x10)(HasGetValueTypeHash)
	double                                       _ExprResultStack_4;                                // 0xD0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_5;                                         // 0xD8(0x10)(HasGetValueTypeHash)
	struct FTuple_Lfloat_Mfloat_Mfloat_R         _ExprResult_6;                                     // 0xE8(0x18)(HasGetValueTypeHash)
	double                                       _ExprResultStack_7;                                // 0x100(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_8;                                         // 0x108(0x10)(HasGetValueTypeHash)
	struct FTuple_Lfloat_Mfloat_Mfloat_R         _ExprResult_9;                                     // 0x118(0x18)(HasGetValueTypeHash)
	double                                       _ExprResultStack_10;                               // 0x130(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_11;                                        // 0x138(0x10)(HasGetValueTypeHash)
	struct FTuple_Lfloat_Mfloat_Mfloat_R         _ExprResult_12;                                    // 0x148(0x18)(HasGetValueTypeHash)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_13;                               // 0x160(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_14;                                    // 0x1B0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_15;                                    // 0x1C0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_16;                                    // 0x1D0(0x10)(HasGetValueTypeHash)
	double                                       _ExprResultStack_17;                               // 0x1E0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_18;                                        // 0x1E8(0x10)(HasGetValueTypeHash)
	struct FTuple_Lfloat_Mfloat_Mfloat_R         _ExprResult_19;                                    // 0x1F8(0x18)(HasGetValueTypeHash)
	double                                       _ExprResultStack_20;                               // 0x210(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_21;                                        // 0x218(0x10)(HasGetValueTypeHash)
	struct FTuple_Lfloat_Mfloat_Mfloat_R         _ExprResult_22;                                    // 0x228(0x18)(HasGetValueTypeHash)
	double                                       _ExprResultStack_23;                               // 0x240(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_24;                                        // 0x248(0x10)(HasGetValueTypeHash)
	struct FTuple_Lfloat_Mfloat_Mfloat_R         _ExprResult_25;                                    // 0x258(0x18)(HasGetValueTypeHash)
};

// 0x78 (0x78 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RIsAlmostEqual_L_Nvector2_M_Nvector2_M_Nfloat_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RIsAlmostEqual_L_Nvector2_M_Nvector2_M_Nfloat_R_Params
{
public:
	struct FTuple_Lvector2_Mvector2_Mfloat_R     __verse_0xB2CDDD72_Argument;                       // 0x0(0x28)(Parm, HasGetValueTypeHash)
	FOptionalProperty_                           RetVal;                                            // 0x28(0x2)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        _ExprResult_0 : 1;                                 // Mask: 0x1, PropSize: 0x10x2A(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_3A4 : 7;                                    // Fixing Bit-Field Size 
	uint8                                        Pad_5F8A[0x5];                                     // Fixing Size After Last Property 
	FOptionalProperty_                           _ExprResultStack_1;                                // 0x30(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_2;                                // 0x40(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        _ExprResult_3 : 1;                                 // Mask: 0x1, PropSize: 0x10x50(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_3A6 : 7;                                    // Fixing Bit-Field Size 
	uint8                                        Pad_5F8C[0x7];                                     // Fixing Size After Last Property 
	FOptionalProperty_                           _ExprResultStack_4;                                // 0x58(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_5;                                // 0x68(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0xA8 (0xA8 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RIsAlmostEqual_L_Nvector3_M_Nvector3_M_Nfloat_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RIsAlmostEqual_L_Nvector3_M_Nvector3_M_Nfloat_R_Params
{
public:
	struct FTuple_Lvector3_Mvector3_Mfloat_R     __verse_0xB2CDDD72_Argument;                       // 0x0(0x38)(Parm, HasGetValueTypeHash)
	FOptionalProperty_                           RetVal;                                            // 0x38(0x2)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        _ExprResult_0 : 1;                                 // Mask: 0x1, PropSize: 0x10x3A(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_3A8 : 7;                                    // Fixing Bit-Field Size 
	uint8                                        Pad_5F9B[0x5];                                     // Fixing Size After Last Property 
	FOptionalProperty_                           _ExprResultStack_1;                                // 0x40(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_2;                                // 0x50(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_3;                                // 0x60(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        _ExprResult_4 : 1;                                 // Mask: 0x1, PropSize: 0x10x70(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_3A9 : 7;                                    // Fixing Bit-Field Size 
	uint8                                        Pad_5F9F[0x7];                                     // Fixing Size After Last Property 
	FOptionalProperty_                           _ExprResultStack_5;                                // 0x78(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_6;                                // 0x88(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_7;                                // 0x98(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x30 (0x30 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RIdentityRotation
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RIdentityRotation_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_5FA8[0xF];                                     // Fixing Size After Last Property 
	struct FVerseRotation                        RetVal;                                            // 0x10(0x20)(Parm, OutParm, ReturnParm, NoDestructor)
};

// 0x288 (0x288 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_REquals_L_Nvector2i_M_Nvector2i_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_REquals_L_Nvector2i_M_Nvector2i_R_Params
{
public:
	struct FTuple_Lvector2i_Mvector2i_R          __verse_0xB2CDDD72_Argument;                       // 0x0(0x20)(Parm, HasGetValueTypeHash)
	FOptionalProperty_                           RetVal;                                            // 0x20(0x18)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	enum class EVerseFalse                       _ExprResult_0;                                     // 0x38(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_5FB0[0x7];                                     // Fixing Size After Last Property 
	struct FSpatialMath_vector2i                 _ExprResult_1;                                     // 0x40(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_2;                                // 0x50(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_3;                                     // 0xA0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_4;                                     // 0xB0(0x10)(HasGetValueTypeHash)
	int64                                        _ExprResult_5;                                     // 0xC0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResultStack_6;                                // 0xC8(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_7;                                // 0xD8(0x18)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_8;                                     // 0xF0(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_9;                                     // 0x100(0x10)(HasGetValueTypeHash)
	int64                                        _ExprResult_10;                                    // 0x110(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResultStack_11;                               // 0x118(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_12;                               // 0x128(0x18)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_13;                                    // 0x140(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_14;                                    // 0x150(0x10)(HasGetValueTypeHash)
	enum class EVerseFalse                       _ExprResult_15;                                    // 0x160(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_5FB4[0x7];                                     // Fixing Size After Last Property 
	struct FSpatialMath_vector2i                 _ExprResult_16;                                    // 0x168(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_17;                               // 0x178(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_18;                                    // 0x1C8(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_19;                                    // 0x1D8(0x10)(HasGetValueTypeHash)
	int64                                        _ExprResult_20;                                    // 0x1E8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResultStack_21;                               // 0x1F0(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_22;                               // 0x200(0x18)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_23;                                    // 0x218(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_24;                                    // 0x228(0x10)(HasGetValueTypeHash)
	int64                                        _ExprResult_25;                                    // 0x238(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResultStack_26;                               // 0x240(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_27;                               // 0x250(0x18)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_28;                                    // 0x268(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_29;                                    // 0x278(0x10)(HasGetValueTypeHash)
};

// 0x28 (0x28 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDotProduct_L_Nvector2i_M_Nvector2i_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDotProduct_L_Nvector2i_M_Nvector2i_R_Params
{
public:
	struct FTuple_Lvector2i_Mvector2i_R          __verse_0xB2CDDD72_Argument;                       // 0x0(0x20)(Parm, HasGetValueTypeHash)
	int64                                        RetVal;                                            // 0x20(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x28 (0x28 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDotProduct_L_Nvector2_M_Nvector2_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDotProduct_L_Nvector2_M_Nvector2_R_Params
{
public:
	struct FTuple_Lvector2_Mvector2_R            __verse_0xB2CDDD72_Argument;                       // 0x0(0x20)(Parm, HasGetValueTypeHash)
	double                                       RetVal;                                            // 0x20(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x38 (0x38 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDotProduct_L_Nvector3_M_Nvector3_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDotProduct_L_Nvector3_M_Nvector3_R_Params
{
public:
	struct FTuple_Lvector3_Mvector3_R            __verse_0xB2CDDD72_Argument;                       // 0x0(0x30)(Parm, HasGetValueTypeHash)
	double                                       RetVal;                                            // 0x30(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x38 (0x38 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDistanceXY_L_Nvector3_M_Nvector3_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDistanceXY_L_Nvector3_M_Nvector3_R_Params
{
public:
	struct FTuple_Lvector3_Mvector3_R            __verse_0xB2CDDD72_Argument;                       // 0x0(0x30)(Parm, HasGetValueTypeHash)
	double                                       RetVal;                                            // 0x30(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x38 (0x38 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDistanceSquaredXY_L_Nvector3_M_Nvector3_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDistanceSquaredXY_L_Nvector3_M_Nvector3_R_Params
{
public:
	struct FTuple_Lvector3_Mvector3_R            __verse_0xB2CDDD72_Argument;                       // 0x0(0x30)(Parm, HasGetValueTypeHash)
	double                                       RetVal;                                            // 0x30(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x38 (0x38 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDistanceSquared_L_Nvector3_M_Nvector3_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDistanceSquared_L_Nvector3_M_Nvector3_R_Params
{
public:
	struct FTuple_Lvector3_Mvector3_R            __verse_0xB2CDDD72_Argument;                       // 0x0(0x30)(Parm, HasGetValueTypeHash)
	double                                       RetVal;                                            // 0x30(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x28 (0x28 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDistanceSquared_L_Nvector2_M_Nvector2_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDistanceSquared_L_Nvector2_M_Nvector2_R_Params
{
public:
	struct FTuple_Lvector2_Mvector2_R            __verse_0xB2CDDD72_Argument;                       // 0x0(0x20)(Parm, HasGetValueTypeHash)
	double                                       RetVal;                                            // 0x20(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x28 (0x28 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDistance_L_Nvector2_M_Nvector2_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDistance_L_Nvector2_M_Nvector2_R_Params
{
public:
	struct FTuple_Lvector2_Mvector2_R            __verse_0xB2CDDD72_Argument;                       // 0x0(0x20)(Parm, HasGetValueTypeHash)
	double                                       RetVal;                                            // 0x20(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x38 (0x38 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDistance_L_Nvector3_M_Nvector3_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDistance_L_Nvector3_M_Nvector3_R_Params
{
public:
	struct FTuple_Lvector3_Mvector3_R            __verse_0xB2CDDD72_Argument;                       // 0x0(0x30)(Parm, HasGetValueTypeHash)
	double                                       RetVal;                                            // 0x30(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x48 (0x48 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDistance_L_Nrotation_M_Nrotation_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDistance_L_Nrotation_M_Nrotation_R_Params
{
public:
	struct FTuple_Lrotation_Mrotation_R          __verse_0xB2CDDD72_Argument;                       // 0x0(0x40)(Parm, HasGetValueTypeHash)
	double                                       RetVal;                                            // 0x40(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x10 (0x10 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDegreesToRadians_L_Nfloat_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDegreesToRadians_L_Nfloat_R_Params
{
public:
	double                                       __verse_0xB2CDDD72_Argument;                       // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       RetVal;                                            // 0x8(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x48 (0x48 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RCrossProduct_L_Nvector3_M_Nvector3_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RCrossProduct_L_Nvector3_M_Nvector3_R_Params
{
public:
	struct FTuple_Lvector3_Mvector3_R            __verse_0xB2CDDD72_Argument;                       // 0x0(0x30)(Parm, HasGetValueTypeHash)
	struct FSpatialMath_vector3                  RetVal;                                            // 0x30(0x18)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// 0x48 (0x48 - 0x0)
// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RAngularDistance_L_Nrotation_M_Nrotation_R
struct USpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RAngularDistance_L_Nrotation_M_Nrotation_R_Params
{
public:
	struct FTuple_Lrotation_Mrotation_R          __verse_0xB2CDDD72_Argument;                       // 0x0(0x40)(Parm, HasGetValueTypeHash)
	double                                       RetVal;                                            // 0x40(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0xF2 (0xF2 - 0x0)
// Function EpicGamesTemporary.SpatialMath.SpatialMath_vector3$OverrideFactory
struct USpatialMath_SpatialMath_vector3_OverrideFactory_Params
{
public:
	struct FSpatialMath_vector3                  RetVal;                                            // 0x0(0x18)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           __verse_0xFB48ED96__InitOverrideMap;               // 0x18(0x50)(ConstParm, Parm, ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResultStack_0;                                // 0x68(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_1;                                     // 0x78(0x2)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_5FC8[0x6];                                     // Fixing Size After Last Property 
	FVerseStringProperty_                        _ExprResultStack_2;                                // 0x80(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_3;                                     // 0x90(0x2)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_5FCA[0x6];                                     // Fixing Size After Last Property 
	FVerseStringProperty_                        _ExprResultStack_4;                                // 0x98(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_5;                                     // 0xA8(0x2)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_5FCB[0x6];                                     // Fixing Size After Last Property 
	FVerseStringProperty_                        _ExprResultStack_6;                                // 0xB0(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_7;                                     // 0xC0(0x2)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_5FCC[0x6];                                     // Fixing Size After Last Property 
	FVerseStringProperty_                        _ExprResultStack_8;                                // 0xC8(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_9;                                     // 0xD8(0x2)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_5FCD[0x6];                                     // Fixing Size After Last Property 
	FVerseStringProperty_                        _ExprResultStack_10;                               // 0xE0(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_11;                                    // 0xF0(0x2)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

// 0x18 (0x18 - 0x0)
// Function EpicGamesTemporary.SpatialMath.SpatialMath_vector3$Factory
struct USpatialMath_SpatialMath_vector3_Factory_Params
{
public:
	struct FSpatialMath_vector3                  RetVal;                                            // 0x0(0x18)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// 0xBA (0xBA - 0x0)
// Function EpicGamesTemporary.SpatialMath.SpatialMath_vector2i$OverrideFactory
struct USpatialMath_SpatialMath_vector2i_OverrideFactory_Params
{
public:
	struct FSpatialMath_vector2i                 RetVal;                                            // 0x0(0x10)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           __verse_0xFB48ED96__InitOverrideMap;               // 0x10(0x50)(ConstParm, Parm, ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResultStack_0;                                // 0x60(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_1;                                     // 0x70(0x2)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_5FD1[0x6];                                     // Fixing Size After Last Property 
	FVerseStringProperty_                        _ExprResultStack_2;                                // 0x78(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_3;                                     // 0x88(0x2)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_5FD2[0x6];                                     // Fixing Size After Last Property 
	FVerseStringProperty_                        _ExprResultStack_4;                                // 0x90(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_5;                                     // 0xA0(0x2)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_5FD3[0x6];                                     // Fixing Size After Last Property 
	FVerseStringProperty_                        _ExprResultStack_6;                                // 0xA8(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_7;                                     // 0xB8(0x2)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

// 0x10 (0x10 - 0x0)
// Function EpicGamesTemporary.SpatialMath.SpatialMath_vector2i$Factory
struct USpatialMath_SpatialMath_vector2i_Factory_Params
{
public:
	struct FSpatialMath_vector2i                 RetVal;                                            // 0x0(0x10)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// 0xBA (0xBA - 0x0)
// Function EpicGamesTemporary.SpatialMath.SpatialMath_vector2$OverrideFactory
struct USpatialMath_SpatialMath_vector2_OverrideFactory_Params
{
public:
	struct FSpatialMath_vector2                  RetVal;                                            // 0x0(0x10)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           __verse_0xFB48ED96__InitOverrideMap;               // 0x10(0x50)(ConstParm, Parm, ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResultStack_0;                                // 0x60(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_1;                                     // 0x70(0x2)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_5FD9[0x6];                                     // Fixing Size After Last Property 
	FVerseStringProperty_                        _ExprResultStack_2;                                // 0x78(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_3;                                     // 0x88(0x2)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_5FDA[0x6];                                     // Fixing Size After Last Property 
	FVerseStringProperty_                        _ExprResultStack_4;                                // 0x90(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_5;                                     // 0xA0(0x2)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_5FDB[0x6];                                     // Fixing Size After Last Property 
	FVerseStringProperty_                        _ExprResultStack_6;                                // 0xA8(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_7;                                     // 0xB8(0x2)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

// 0x10 (0x10 - 0x0)
// Function EpicGamesTemporary.SpatialMath.SpatialMath_vector2$Factory
struct USpatialMath_SpatialMath_vector2_Factory_Params
{
public:
	struct FSpatialMath_vector2                  RetVal;                                            // 0x0(0x10)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// 0x418 (0x418 - 0x0)
// Function EpicGamesTemporary.SpatialMath.SpatialMath_transform$OverrideFactory
struct USpatialMath_SpatialMath_transform_OverrideFactory_Params
{
public:
	struct FSpatialMath_transform                RetVal;                                            // 0x0(0x60)(Parm, OutParm, ReturnParm, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           __verse_0xFB48ED96__InitOverrideMap;               // 0x60(0x50)(ConstParm, Parm, ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResultStack_0;                                // 0xB0(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_1;                                     // 0xC0(0x2)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_5FE1[0x6];                                     // Fixing Size After Last Property 
	struct FSpatialMath_vector3                  _ExprResult_2;                                     // 0xC8(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_3;                                // 0xE0(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_4;                                     // 0x130(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_5;                                     // 0x140(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_6;                                     // 0x150(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResultStack_7;                                // 0x160(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_8;                                     // 0x170(0x2)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_5FE2[0xE];                                     // Fixing Size After Last Property 
	struct FVerseRotation                        _ExprResultStack_9;                                // 0x180(0x20)(NoDestructor)
	FVerseFunctionProperty_                      _Callee_10;                                        // 0x1A0(0x10)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_11;                                    // 0x1B0(0x1)(HasGetValueTypeHash)
	uint8                                        Pad_5FE3[0x7];                                     // Fixing Size After Last Property 
	FVerseStringProperty_                        _ExprResultStack_12;                               // 0x1B8(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_13;                                    // 0x1C8(0x2)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_5FE4[0x6];                                     // Fixing Size After Last Property 
	struct FSpatialMath_vector3                  _ExprResult_14;                                    // 0x1D0(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_15;                               // 0x1E8(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_16;                                    // 0x238(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_17;                                    // 0x248(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_18;                                    // 0x258(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResultStack_19;                               // 0x268(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_20;                                    // 0x278(0x2)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_5FE5[0x6];                                     // Fixing Size After Last Property 
	struct FSpatialMath_vector3                  _ExprResult_21;                                    // 0x280(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_22;                               // 0x298(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_23;                                    // 0x2E8(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_24;                                    // 0x2F8(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_25;                                    // 0x308(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResultStack_26;                               // 0x318(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_27;                                    // 0x328(0x2)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_5FE6[0x6];                                     // Fixing Size After Last Property 
	struct FVerseRotation                        _ExprResultStack_28;                               // 0x330(0x20)(NoDestructor)
	FVerseFunctionProperty_                      _Callee_29;                                        // 0x350(0x10)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_30;                                    // 0x360(0x1)(HasGetValueTypeHash)
	uint8                                        Pad_5FE7[0x7];                                     // Fixing Size After Last Property 
	FVerseStringProperty_                        _ExprResultStack_31;                               // 0x368(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_32;                                    // 0x378(0x2)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_5FE9[0x6];                                     // Fixing Size After Last Property 
	struct FSpatialMath_vector3                  _ExprResult_33;                                    // 0x380(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_34;                               // 0x398(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_35;                                    // 0x3E8(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_36;                                    // 0x3F8(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_37;                                    // 0x408(0x10)(HasGetValueTypeHash)
};

// 0x340 (0x340 - 0x0)
// Function EpicGamesTemporary.SpatialMath.SpatialMath_transform$Factory
struct USpatialMath_SpatialMath_transform_Factory_Params
{
public:
	struct FSpatialMath_transform                RetVal;                                            // 0x0(0x60)(Parm, OutParm, ReturnParm, NoDestructor)
	struct FSpatialMath_vector3                  _ExprResult_0;                                     // 0x60(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_1;                                // 0x78(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_2;                                     // 0xC8(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_3;                                     // 0xD8(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_4;                                     // 0xE8(0x10)(HasGetValueTypeHash)
	uint8                                        Pad_5FED[0x8];                                     // Fixing Size After Last Property 
	struct FVerseRotation                        _ExprResultStack_5;                                // 0x100(0x20)(NoDestructor)
	FVerseFunctionProperty_                      _Callee_6;                                         // 0x120(0x10)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_7;                                     // 0x130(0x1)(HasGetValueTypeHash)
	uint8                                        Pad_5FEE[0x7];                                     // Fixing Size After Last Property 
	struct FSpatialMath_vector3                  _ExprResult_8;                                     // 0x138(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_9;                                // 0x150(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_10;                                    // 0x1A0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_11;                                    // 0x1B0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_12;                                    // 0x1C0(0x10)(HasGetValueTypeHash)
	struct FSpatialMath_vector3                  _ExprResult_13;                                    // 0x1D0(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_14;                               // 0x1E8(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_15;                                    // 0x238(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_16;                                    // 0x248(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_17;                                    // 0x258(0x10)(HasGetValueTypeHash)
	uint8                                        Pad_5FF0[0x8];                                     // Fixing Size After Last Property 
	struct FVerseRotation                        _ExprResultStack_18;                               // 0x270(0x20)(NoDestructor)
	FVerseFunctionProperty_                      _Callee_19;                                        // 0x290(0x10)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_20;                                    // 0x2A0(0x1)(HasGetValueTypeHash)
	uint8                                        Pad_5FF1[0x7];                                     // Fixing Size After Last Property 
	struct FSpatialMath_vector3                  _ExprResult_21;                                    // 0x2A8(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_22;                               // 0x2C0(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_23;                                    // 0x310(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_24;                                    // 0x320(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_25;                                    // 0x330(0x10)(HasGetValueTypeHash)
};

// 0x0 (0x0 - 0x0)
// Function EpicGamesTemporary.SpatialMath.$InitCDO
struct USpatialMath__InitCDO_Params
{
public:
};

}
}


