#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x0 (0x2A8 - 0x2A8)
// Class FortniteUI.AthenaChallengeComponentWidget
class UAthenaChallengeComponentWidget : public UUserWidget
{
public:

	static class UClass* StaticClass();
	static class UAthenaChallengeComponentWidget* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class FortniteUI.AthenaChallengeListEntryContextInterface
class UAthenaChallengeListEntryContextInterface : public UInterface
{
public:

	static class UClass* StaticClass();
	static class UAthenaChallengeListEntryContextInterface* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class FortniteUI.AthenaFrontendFlowInterruptInterface
class UAthenaFrontendFlowInterruptInterface : public UInterface
{
public:

	static class UClass* StaticClass();
	static class UAthenaFrontendFlowInterruptInterface* GetDefaultObj();

};

// 0x58 (0x440 - 0x3E8)
// Class FortniteUI.AthenaFullScreenMapBrowsingControlsWidget
class UAthenaFullScreenMapBrowsingControlsWidget : public UCommonActivatableWidget
{
public:
	class UPanelWidget*                          Panel_PanGroup;                                    // 0x3E8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UPanelWidget*                          Panel_ZoomGroup;                                   // 0x3F0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USizeBox*                              SizeBox_PlaceMarker;                               // 0x3F8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonTextBlock*                      Text_PlaceMarker;                                  // 0x400(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USizeBox*                              SizeBox_TeleportToMarker;                          // 0x408(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FText                                  TextPlaceMarker;                                   // 0x410(0x18)(Edit, Protected, NativeAccessSpecifierProtected)
	class FText                                  TextRemoveMarker;                                  // 0x428(0x18)(Edit, Protected, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UAthenaFullScreenMapBrowsingControlsWidget* GetDefaultObj();

};

// 0x40 (0x310 - 0x2D0)
// Class FortniteUI.FortHUDElementWidget
class UFortHUDElementWidget : public UCommonUserWidget
{
public:
	uint8                                        Pad_2C77[0x8];                                     // Fixing Size After Last Property 
	struct FGameplayTag                          ElementTag;                                        // 0x2D8(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_2C78[0x4];                                     // Fixing Size After Last Property 
	struct FGameplayTagContainer                 HUDElementTag;                                     // 0x2E0(0x20)(Edit, BlueprintVisible, Protected, NativeAccessSpecifierProtected)
	enum class ESlateVisibility                  HiddenVisibility;                                  // 0x300(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_2C79[0x7];                                     // Fixing Size After Last Property 
	class UTutorialHighlight*                    TutorialHighlight;                                 // 0x308(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UFortHUDElementWidget* GetDefaultObj();

	void OnVisibilitySetEvent(enum class ESlateVisibility InVisibility);
	bool HasAnyTags(struct FGameplayTagContainer& InTags);
	void HandleOnHUDElementVisibilityChanged(struct FGameplayTagContainer& HiddenHUDElementTags);
	void HandleGetHUDElementWidgetsForTags(struct FGameplayTagContainer& HUDElementTags, TArray<class UFortHUDElementWidget*>* OutWidgets);
	void AppendHUDElementTags(struct FGameplayTagContainer& AdditionalTags);
};

// 0x90 (0x3A0 - 0x310)
// Class FortniteUI.AthenaHUDFeedbackLine
class UAthenaHUDFeedbackLine : public UFortHUDElementWidget
{
public:
	uint8                                        Pad_2C7C[0x8];                                     // Fixing Size After Last Property 
	class UFortKeybindWidget*                    Keybind_Feedback;                                  // 0x318(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonRichTextBlock*                  RichText_Feedback;                                 // 0x320(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2C7D[0x78];                                    // Fixing Size Of Struct

	static class UClass* StaticClass();
	static class UAthenaHUDFeedbackLine* GetDefaultObj();

	void OnShowEnabledUpdated(bool bShowEnabled);
};

// 0x10 (0x3B0 - 0x3A0)
// Class FortniteUI.AthenaHUDFeedbackLineCooldown
class UAthenaHUDFeedbackLineCooldown : public UAthenaHUDFeedbackLine
{
public:
	uint8                                        Pad_2C98[0x10];                                    // Fixing Size Of Struct

	static class UClass* StaticClass();
	static class UAthenaHUDFeedbackLineCooldown* GetDefaultObj();

	void RegisterAbilityNotify(class UFortPlayerController* PlayerController, class UActor* OldViewTarget, class UActor* NewViewTarget);
	void OnCooldownUpdated(float CooldownDuration, float CooldownRemaining, float CooldownPercentage);
	void OnCooldownTagChanged(const struct FGameplayTag& CooldownTag, int32 Count);
	void OnCooldownStarted();
	void OnCooldownFinished();
};

// 0x0 (0x28 - 0x28)
// Class FortniteUI.FortPrimaryContentInterface
class UFortPrimaryContentInterface : public UInterface
{
public:

	static class UClass* StaticClass();
	static class UFortPrimaryContentInterface* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class FortniteUI.AthenaHUDPrimaryContentInterface
class UAthenaHUDPrimaryContentInterface : public UFortPrimaryContentInterface
{
public:

	static class UClass* StaticClass();
	static class UAthenaHUDPrimaryContentInterface* GetDefaultObj();

};

// 0x28 (0x2F8 - 0x2D0)
// Class FortniteUI.AthenaInventoryGroupBase
class UAthenaInventoryGroupBase : public UCommonUserWidget
{
public:
	TWeakObjectPtr<class UAthenaInventoryPanel>  ParentInventoryPanel;                              // 0x2D0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortItemTileView*                     ItemTileView;                                      // 0x2D8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<enum class EFortItemType>             FilteredItemTypes;                                 // 0x2E0(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	int32                                        DefaultNumEntries;                                 // 0x2F0(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EInventoryContentSortType         InventoryContentSortType;                          // 0x2F4(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_2CAA[0x3];                                     // Fixing Size Of Struct

	static class UClass* StaticClass();
	static class UAthenaInventoryGroupBase* GetDefaultObj();

};

// 0x40 (0x338 - 0x2F8)
// Class FortniteUI.AthenaInventoryGroupResources
class UAthenaInventoryGroupResources : public UAthenaInventoryGroupBase
{
public:
	struct FGameplayTagContainer                 CurrencyItemTags;                                  // 0x2F8(0x20)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FGameplayTagContainer                 IngredientItemTags;                                // 0x318(0x20)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaInventoryGroupResources* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class FortniteUI.FortTabInterface
class UFortTabInterface : public UInterface
{
public:

	static class UClass* StaticClass();
	static class UFortTabInterface* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class FortniteUI.AthenaInventoryTabInterface
class UAthenaInventoryTabInterface : public UFortTabInterface
{
public:

	static class UClass* StaticClass();
	static class UAthenaInventoryTabInterface* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class FortniteUI.AthenaItemShopSectionInterface
class UAthenaItemShopSectionInterface : public UInterface
{
public:

	static class UClass* StaticClass();
	static class UAthenaItemShopSectionInterface* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class FortniteUI.AthenaMapScreenAnalyticsInterface
class UAthenaMapScreenAnalyticsInterface : public UInterface
{
public:

	static class UClass* StaticClass();
	static class UAthenaMapScreenAnalyticsInterface* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class FortniteUI.AthenaMapScreenContainerTabInterface
class UAthenaMapScreenContainerTabInterface : public UInterface
{
public:

	static class UClass* StaticClass();
	static class UAthenaMapScreenContainerTabInterface* GetDefaultObj();

	void OnTabAddedToMapScreenContainer();
};

// 0x18 (0x400 - 0x3E8)
// Class FortniteUI.FortUIStateWidgetBase
class UFortUIStateWidgetBase : public UCommonActivatableWidget
{
public:
	uint8                                        Pad_2CC3[0x10];                                    // Fixing Size After Last Property 
	class UCommonActivatableWidgetStack*         WidgetStack_PrimaryContent;                        // 0x3F8(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UFortUIStateWidgetBase* GetDefaultObj();

};

// 0x180 (0x580 - 0x400)
// Class FortniteUI.AthenaHUDBase
class UAthenaHUDBase : public UFortUIStateWidgetBase
{
public:
	uint8                                        Pad_2CFE[0x30];                                    // Fixing Size After Last Property 
	TArray<class UUserWidget*>                   MinigameWidgets;                                   // 0x430(0x10)(ExportObject, ZeroConstructor, ContainsInstancedReference, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TSubclassOf<class UUserWidget>               KairosHUDLayerClass;                               // 0x440(0x8)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FMutatorAddedWidgets>          MutatorAddedWidgets;                               // 0x448(0x10)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_2D00[0x60];                                    // Fixing Size After Last Property 
	class UAthenaMapScreenContainer*             MapScreenContainer;                                // 0x4B8(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaHUDMenu*                        AthenaHUDMenu;                                     // 0x4C0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonActivatableWidget*              TitleBar;                                          // 0x4C8(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSet<enum class EUIExtensionSlot>            RelevantExtensionSlots;                            // 0x4D0(0x50)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	TSoftClassPtr<class UCommonActivatableWidget> NewEmotePicker;                                    // 0x520(0x20)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftClassPtr<class UCommonActivatableWidget> SquadComsPickerClass;                              // 0x540(0x20)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftClassPtr<class UFortWeaponWheel>        WeaponWheelClass;                                  // 0x560(0x20)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaHUDBase* GetDefaultObj();

	void SetZoneCompleted(bool bValue);
	void OnHUDScaleChanged(float HUDScale);
	void OnExtensionWidgetRemoved(enum class EUIExtensionSlot ExtensionSlot, class UUserWidget* Widget);
	void OnExtensionWidgetCreated(enum class EUIExtensionSlot ExtensionSlot, class UUserWidget* Widget);
	void HandleUpdateMinigameUIExtensions(class UFortMinigame* Minigame);
	void HandleRecoverFromPostGame();
	void HandlePickerOpenRequest(enum class EFortPickerMode Mode, int32 InitialOption, bool bIgnoreFirstAccept);
	void HandleOnMutatorRemoved(class UFortGameplayMutator* NewMutator);
	void HandleOnMutatorAdded(class UFortGameplayMutator* NewMutator);
	void HandleNewPanelFromMutator(TSubclassOf<class UUserWidget> PanelClass);
	void HandleMinigamePlayModeChanged(class UFortMinigame* Minigame, bool bIsInPlayMode);
	void HandleMinigameHideHUD(bool bLoading);
	void HandleCursorModeChanging(bool bCursorModeEnabled, class FName ActionName);
	void HandleCursorModeChanged(bool bCursorModeEnabled, class FName ActionName, class UUserWidget* CustomWidget);
	bool GetZoneCompleted();
	void BindVolumeEvents();
};

// 0x20 (0x5A0 - 0x580)
// Class FortniteUI.AthenaMobileHUD
class UAthenaMobileHUD : public UAthenaHUDBase
{
public:
	TArray<struct FUIExtension>                  TournamentUIExtensions;                            // 0x580(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TArray<struct FUIExtension>                  ArenaTournamentUIExtensions;                       // 0x590(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UAthenaMobileHUD* GetDefaultObj();

};

// 0x8 (0x2B0 - 0x2A8)
// Class FortniteUI.AthenaQuestCustomMapWidget
class UAthenaQuestCustomMapWidget : public UUserWidget
{
public:
	uint8                                        Pad_2D13[0x8];                                     // Fixing Size Of Struct

	static class UClass* StaticClass();
	static class UAthenaQuestCustomMapWidget* GetDefaultObj();

	void BP_OnWidgetComponentClassLoaded(class FName WidgetComponentId, TSubclassOf<class UUserWidget> WidgetClass);
};

// 0x0 (0x2B0 - 0x2B0)
// Class FortniteUI.AthenaNPCQuestRewardsPanel
class UAthenaNPCQuestRewardsPanel : public UAthenaQuestCustomMapWidget
{
public:

	static class UClass* StaticClass();
	static class UAthenaNPCQuestRewardsPanel* GetDefaultObj();

	void BP_Show(class FText& NPCTitle, TSoftObjectPtr<class UObject>& NPCPicture, bool bIsLocked);
};

// 0x8 (0x2B8 - 0x2B0)
// Class FortniteUI.AthenaNPCQuestServicesPanel
class UAthenaNPCQuestServicesPanel : public UAthenaQuestCustomMapWidget
{
public:
	class UCollectionNPCServiceContainer*        Services;                                          // 0x2B0(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UAthenaNPCQuestServicesPanel* GetDefaultObj();

	void BP_Show(class FText& NPCTitle, TSoftObjectPtr<class UObject>& NPCPicture);
};

// 0x0 (0x28 - 0x28)
// Class FortniteUI.AthenaPlayerInfoBaseWidgetInterface
class UAthenaPlayerInfoBaseWidgetInterface : public UInterface
{
public:

	static class UClass* StaticClass();
	static class UAthenaPlayerInfoBaseWidgetInterface* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class FortniteUI.AthenaPostMatchScreenContainerTabInterface
class UAthenaPostMatchScreenContainerTabInterface : public UInterface
{
public:

	static class UClass* StaticClass();
	static class UAthenaPostMatchScreenContainerTabInterface* GetDefaultObj();

};

// 0x30 (0x2D8 - 0x2A8)
// Class FortniteUI.AthenaQuestCategoryCompletedTracker
class UAthenaQuestCategoryCompletedTracker : public UUserWidget
{
public:
	uint8                                        Pad_2D22[0x8];                                     // Fixing Size After Last Property 
	class FText                                  MoreInTimerCompletionText;                         // 0x2B0(0x18)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	bool                                         bShowCompletionTextUpperCase;                      // 0x2C8(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2D25[0x7];                                     // Fixing Size After Last Property 
	class UAthenaChallengeDateTimeTextBlock*     DateTimeText_MoreQuestsLater;                      // 0x2D0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaQuestCategoryCompletedTracker* GetDefaultObj();

	bool GetIsProgressBarEnabled();
};

// 0x158 (0x180 - 0x28)
// Class FortniteUI.AthenaReplayActionFeedRowProxyInstance
class UAthenaReplayActionFeedRowProxyInstance : public UObject
{
public:
	uint8                                        Pad_2D2A[0x8];                                     // Fixing Size After Last Property 
	struct FReplayEliminationEventInfo           RowData;                                           // 0x30(0x150)(BlueprintVisible, BlueprintReadOnly, Transient, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UAthenaReplayActionFeedRowProxyInstance* GetDefaultObj();

};

// 0x40 (0x68 - 0x28)
// Class FortniteUI.AthenaReplayBrowserRowProxyInstance
class UAthenaReplayBrowserRowProxyInstance : public UObject
{
public:
	uint8                                        Pad_2D2F[0x40];                                    // Fixing Size Of Struct

	static class UClass* StaticClass();
	static class UAthenaReplayBrowserRowProxyInstance* GetDefaultObj();

};

// 0x40 (0x70 - 0x30)
// Class FortniteUI.AthenaSeasonalDataSurvivorTiersDisplay
class UAthenaSeasonalDataSurvivorTiersDisplay : public UDataAsset
{
public:
	TSoftObjectPtr<class UTexture2D>             SeasonIconSmallOverride;                           // 0x30(0x20)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UTexture2D>             SeasonIconLargeOverride;                           // 0x50(0x20)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UAthenaSeasonalDataSurvivorTiersDisplay* GetDefaultObj();

};

// 0x50 (0x80 - 0x30)
// Class FortniteUI.AthenaVariantPickerConfig
class UAthenaVariantPickerConfig : public UDataAsset
{
public:
	TMap<struct FGameplayTag, struct FAthenaVariantFilterSet> FilterSets;                                        // 0x30(0x50)(Edit, Protected, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UAthenaVariantPickerConfig* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class FortniteUI.BattlePassInputData
class UBattlePassInputData : public UObject
{
public:

	static class UClass* StaticClass();
	static class UBattlePassInputData* GetDefaultObj();

};

// 0x8 (0x30 - 0x28)
// Class FortniteUI.BattlePassEnabledInputData
class UBattlePassEnabledInputData : public UBattlePassInputData
{
public:
	uint8                                        Pad_2D50[0x8];                                     // Fixing Size Of Struct

	static class UClass* StaticClass();
	static class UBattlePassEnabledInputData* GetDefaultObj();

	void GetData(bool* InIsEnabled);
};

// 0x10 (0x38 - 0x28)
// Class FortniteUI.BattlePassBulkBuyInputData
class UBattlePassBulkBuyInputData : public UBattlePassInputData
{
public:
	uint8                                        Pad_2D5F[0x10];                                    // Fixing Size Of Struct

	static class UClass* StaticClass();
	static class UBattlePassBulkBuyInputData* GetDefaultObj();

	void GetData(bool* IsPageCompleted, int32* StartingPage, int32* EndingPage, int32* PurchaseCost);
};

// 0x0 (0x28 - 0x28)
// Class FortniteUI.CheckDismissableActivatableWidget
class UCheckDismissableActivatableWidget : public UInterface
{
public:

	static class UClass* StaticClass();
	static class UCheckDismissableActivatableWidget* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class FortniteUI.CreativeContentBrowserTab_CreationCondition
class UCreativeContentBrowserTab_CreationCondition : public UObject
{
public:

	static class UClass* StaticClass();
	static class UCreativeContentBrowserTab_CreationCondition* GetDefaultObj();

};

// 0x950 (0xC20 - 0x2D0)
// Class FortniteUI.DonutChallengeIdleGame
class UDonutChallengeIdleGame : public UCommonUserWidget
{
public:
	FMulticastInlineDelegateProperty_            OnNewHighScore;                                    // 0x2D0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnDistanceScoreChanged;                            // 0x2E0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnSpeedScoreChanged;                               // 0x2F0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnStyleScoreChanged;                               // 0x300(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnEndMatchScore;                                   // 0x310(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnDayNightCycleChanged;                            // 0x320(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                        Pad_2DA5[0x140];                                   // Fixing Size After Last Property 
	struct FLinearColor                          BoundsColor;                                       // 0x470(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        DayNightCycleTime;                                 // 0x480(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        PlayerTopSpeed;                                    // 0x484(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        BumpyRideSpeedReduction;                           // 0x488(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2DA7[0x4];                                     // Fixing Size After Last Property 
	struct FVector2D                             MapSize;                                           // 0x490(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FVector2D                             PlayerCollisionOffset;                             // 0x4A0(0x10)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FVector2D                             PlayerCollisionSize;                               // 0x4B0(0x10)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        MapScale;                                          // 0x4C0(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        MaxNumLevels;                                      // 0x4C4(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        ObjectSpawnPlacementRadius;                        // 0x4C8(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                        NumOfTreeSpawnAttempts;                            // 0x4CC(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                        NumOfRockSpawnAttempts;                            // 0x4D0(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                        NumOfBigRockSpawnAttempts;                         // 0x4D4(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                        NumOfJumpPadSpawnAttempts;                         // 0x4D8(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2DA9[0x4];                                     // Fixing Size After Last Property 
	class UCurveFloat*                           Curve_BonusSpawn_Trees;                            // 0x4E0(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCurveFloat*                           Curve_BonusSpawn_SmallBumps;                       // 0x4E8(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCurveFloat*                           Curve_BonusSpawn_Bumps;                            // 0x4F0(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCurveFloat*                           Curve_BonusSpawn_JumpPads;                         // 0x4F8(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                  Param_Player_Direction;                            // 0x500(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                  Param_Player_FacingLeft;                           // 0x504(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2DAF[0x8];                                     // Fixing Size After Last Property 
	struct FSlateBrush                           PlayerBrush;                                       // 0x510(0xC0)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FSlateBrush                           TreeBrush;                                         // 0x5D0(0xC0)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FSlateBrush                           RockBrush;                                         // 0x690(0xC0)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FSlateBrush                           BigRockBrush;                                      // 0x750(0xC0)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FSlateBrush                           JumpPadBrush;                                      // 0x810(0xC0)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FSlateBrush                           TorchBrush;                                        // 0x8D0(0xC0)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FSlateBrush                           MonsterBrush;                                      // 0x990(0xC0)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FSlateBrush                           ChimiBrush;                                        // 0xA50(0xC0)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FSlateBrush                           ArmBrush;                                          // 0xB10(0xC0)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	class UWidgetAnimation*                      Anim_Jump;                                         // 0xBD0(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UWidgetAnimation*                      Anim_MediumJump;                                   // 0xBD8(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UWidgetAnimation*                      Anim_SuperJump;                                    // 0xBE0(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UWidgetAnimation*                      Anim_BumpyRide;                                    // 0xBE8(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UImage*                                Image_Player;                                      // 0xBF0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UImage*                                Image_MobileInput;                                 // 0xBF8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UImage*                                Image_MobileInput_Background;                      // 0xC00(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonLegacy*                   Button_Jump;                                       // 0xC08(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonLegacy*                   Button_MobileJump;                                 // 0xC10(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2DB6[0x8];                                     // Fixing Size Of Struct

	static class UClass* StaticClass();
	static class UDonutChallengeIdleGame* GetDefaultObj();

	void TryJump();
	void StartGame();
	void EndSuperJump();
	void EndJump();
	void EndBumpyRide();
	void DebugBPFloat(float InFloat);
	void BPUpdateStyle(int32 NewStyle);
	void BPUpdateSpeed(int32 NewSpeed);
	void BPUpdateDistance(int32 NewDistance);
	void BPShowHighScore(int32 InNewHighScore);
	void BPOnSpeedUpdated(int32 NewCurSpeed);
	void BPOnNextLevelReached();
	void BPOnMonsterNearChanged(bool bIsNearLevelMonster);
	void BPOnJump();
	void BPOnGameInitialized();
	void BPOnFailedJumpPress();
	void BPOnFacingDirectionChanged(bool bIsLeftFacing);
	void BPOnCrash();
	void BPOnCollision(enum class EFortDonutIdleGameObject ObjectType);
	void BPGameOver();
};

// 0x38 (0x558 - 0x520)
// Class FortniteUI.FortActivatablePanel
class UFortActivatablePanel : public UCommonActivatablePanelLegacy
{
public:
	uint8                                        Pad_2DCF[0x8];                                     // Fixing Size After Last Property 
	bool                                         bIsPushedOnToContentPanelStack;                    // 0x528(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIsAlreadyOnContentPanelStack;                     // 0x529(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EInputPriority                    InputPriority;                                     // 0x52A(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIsClosableByPlayerInput;                          // 0x52B(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPrimaryContentSetup                  PrimaryContentSetup;                               // 0x52C(0x3)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_2DD1[0x29];                                    // Fixing Size Of Struct

	static class UClass* StaticClass();
	static class UFortActivatablePanel* GetDefaultObj();

	void RestoreScrollWidget(class UWidget* FallbackWidget);
	void RestoreCenterWidget(class UWidget* FallbackWidget);
	void AsyncPlaySound2D(class UObject* WorldContextObject, TSoftObjectPtr<class USoundBase> SoundToLoad, float VolumeMultiplier, float PitchMultiplier, float StartTime);
};

// 0x10 (0x568 - 0x558)
// Class FortniteUI.DonutIdleGameScreen
class UDonutIdleGameScreen : public UFortActivatablePanel
{
public:
	class UWidgetAnimation*                      Anim_Intro;                                        // 0x558(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UDonutChallengeIdleGame*               Widget_GameLayer;                                  // 0x560(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UDonutIdleGameScreen* GetDefaultObj();

};

// 0x0 (0x178 - 0x178)
// Class FortniteUI.FortFireModeStreamingVideo
class UFortFireModeStreamingVideo : public UFortBaseStreamingVideo
{
public:

	static class UClass* StaticClass();
	static class UFortFireModeStreamingVideo* GetDefaultObj();

};

// 0x68 (0x450 - 0x3E8)
// Class FortniteUI.FortActivityBrowserAttributionsModal
class UFortActivityBrowserAttributionsModal : public UCommonActivatableWidget
{
public:
	uint8                                        Pad_2DE7[0x10];                                    // Fixing Size After Last Property 
	class UCommonButtonBase*                     Button_Back;                                       // 0x3F8(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                     Button_OpenLink;                                   // 0x400(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonRichTextBlock*                  RichText_Description;                              // 0x408(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UScrollBox*                            ScrollBox_Details;                                 // 0x410(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      Text_ActivityName;                                 // 0x418(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonRichTextBlock*                  Text_ActivityOrigin;                               // 0x420(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonRichTextBlock*                  Text_LinkCode;                                     // 0x428(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        ScrollAmount;                                      // 0x430(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2DEB[0x1C];                                    // Fixing Size Of Struct

	static class UClass* StaticClass();
	static class UFortActivityBrowserAttributionsModal* GetDefaultObj();

	void OnCreditsModalInitialized();
	void OnAttributionsModalInitialized();
	class FText GetLinkCodeTextFormat(class FText& LinkCode);
	class FText GetCreatorTextFormat(class FText& CreatorName);
	class FText GetAttributionsTextFormat(class FText& Title, class FText& Author, class FText& License);
};

// 0x98 (0x100 - 0x68)
// Class FortniteUI.FortActivityViewModel
class UFortActivityViewModel : public UMVVMViewModelBase
{
public:
	bool                                         IsLeader;                                          // 0x68(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2E39[0x3];                                     // Fixing Size After Last Property 
	int32                                        PartySize;                                         // 0x6C(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2E3A[0x18];                                    // Fixing Size After Last Property 
	TMap<uint32, enum class ECreativeLinkPreviewSize> MinColumnSizeToImageSize;                          // 0x88(0x50)(Config, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2E3B[0x28];                                    // Fixing Size Of Struct

	static class UClass* StaticClass();
	static class UFortActivityViewModel* GetDefaultObj();

	bool IsFavorite();
	bool IsEpicOriginalCreated();
	bool IsEpicLabsCreated();
	bool IsEpicCreated();
	bool IsActivityLocked();
	int32 GetTeamSizeRangeMin();
	int32 GetTeamSizeRangeMax();
	int32 GetNumFriendsPlaying();
	int32 GetMaxTeamSize();
	int32 GetMaxPlayersRangeMin();
	int32 GetMaxPlayersRangeMax();
	class FString GetIslandCreatorName();
	enum class EFortInvalidActivityReason GetInvalidActivityReason();
	class UTexture* GetImageTexture();
	enum class EActivityImageLoadingState GetImageLoadingState();
	class FText GetDisplaySubName();
	class FText GetDisplayName();
	class FText GetDescription();
	int32 GetCCUCount();
	bool DoesActivityRequirePurchase();
};

// 0x28 (0x2D0 - 0x2A8)
// Class FortniteUI.FortAthenaSurvivorTierBadge
class UFortAthenaSurvivorTierBadge : public UUserWidget
{
public:
	TArray<struct FSurvivorTierPresigeData>      PrestigeLevelData;                                 // 0x2A8(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	class UFortPersistentResourceItemDefinition* SurvivorRewardItemDefinition;                      // 0x2B8(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EFortAthenaSurvivorTierBadgeSize  BadgeSize;                                         // 0x2C0(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_2E50[0xF];                                     // Fixing Size Of Struct

	static class UClass* StaticClass();
	static class UFortAthenaSurvivorTierBadge* GetDefaultObj();

	void SetBadgeSize(enum class EFortAthenaSurvivorTierBadgeSize InBadgeSize);
	void OverrideTierAndPrestigeLevel(int32 CustomTier, int32 CustomPrestigeLvl);
	void HandlePostMatchVisibility();
	struct FSurvivorTierPresigeData GetPrestigeData(int32 PrestigeLevel);
	void BP_OnSurvivorTierStateChanged(int32 Tier, int32 PrestigeLevel);
	void BP_OnBadgeSizeChanged();
};

// 0x0 (0x2A8 - 0x2A8)
// Class FortniteUI.FortAthenaSurvivorTiersQuestRewardsPanel
class UFortAthenaSurvivorTiersQuestRewardsPanel : public UUserWidget
{
public:

	static class UClass* StaticClass();
	static class UFortAthenaSurvivorTiersQuestRewardsPanel* GetDefaultObj();

	void BP_OnSurvivorTierStateChanged(int32 Tier, int32 PrestigeLevel);
};

// 0x28 (0x338 - 0x310)
// Class FortniteUI.FortMobileHUDElement
class UFortMobileHUDElement : public UFortHUDElementWidget
{
public:
	struct FGameplayTag                          SizePropertyTag;                                   // 0x310(0x4)(Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_2E5C[0x14];                                    // Fixing Size After Last Property 
	int32                                        ForcedZOrder;                                      // 0x328(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2E5D[0x4];                                     // Fixing Size After Last Property 
	class UScaleBox*                             ScaleBox_HUDWidgetScale;                           // 0x330(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UFortMobileHUDElement* GetDefaultObj();

};

// 0x80 (0x3B8 - 0x338)
// Class FortniteUI.FortMobileHUDElementProxy
class UFortMobileHUDElementProxy : public UFortMobileHUDElement
{
public:
	class FText                                  WidgetName;                                        // 0x338(0x18)(Edit, NativeAccessSpecifierPrivate)
	bool                                         AppendWidgetAndBehaviorNames;                      // 0x350(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2E63[0x3];                                     // Fixing Size After Last Property 
	struct FLinearColor                          InBoundsHighlightColor;                            // 0x354(0x10)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FLinearColor                          OutOfBoundsProxyHighlightColor;                    // 0x364(0x10)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2E64[0x34];                                    // Fixing Size After Last Property 
	class UImage*                                Image_SelectionHighlight;                          // 0x3A8(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UImage*                                Image_OutOfBoundsIndicator;                        // 0x3B0(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UFortMobileHUDElementProxy* GetDefaultObj();

};

// 0x8 (0x3C0 - 0x3B8)
// Class FortniteUI.FortAutorunLockHUDElementProxy
class UFortAutorunLockHUDElementProxy : public UFortMobileHUDElementProxy
{
public:
	class UOverlay*                              Overlay_AutorunLockZone;                           // 0x3B8(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UFortAutorunLockHUDElementProxy* GetDefaultObj();

};

// 0x20 (0x358 - 0x338)
// Class FortniteUI.BacchusHUDElement
class UBacchusHUDElement : public UFortMobileHUDElement
{
public:
	bool                                         bHideWhenNotUsingTouch;                            // 0x338(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bUpdatesWithHUDState;                              // 0x339(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bAlwaysShow;                                       // 0x33A(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBacchusHUDStateType              OnInBuildMode;                                     // 0x33B(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBacchusHUDStateType              OnInCombatMode;                                    // 0x33C(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBacchusHUDStateType              OnInEditMode;                                      // 0x33D(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBacchusHUDStateType              OnInCreativeMode;                                  // 0x33E(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBacchusHUDStateType              OnInBattleLabMode;                                 // 0x33F(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBacchusHUDStateType              IsFreeFalling;                                     // 0x340(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBacchusHUDStateType              IsGliding;                                         // 0x341(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBacchusHUDStateType              CanOpenChute;                                      // 0x342(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBacchusHUDStateType              InLockedBus;                                       // 0x343(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBacchusHUDStateType              InUnlockedBus;                                     // 0x344(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBacchusHUDStateType              OnTargeting;                                       // 0x345(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBacchusHUDStateType              OnUsingScopeTargeting;                             // 0x346(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBacchusHUDStateType              OnCanTarget;                                       // 0x347(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBacchusHUDStateType              OnCanUseScopeTargeting;                            // 0x348(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBacchusHUDStateType              OnCrouching;                                       // 0x349(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBacchusHUDStateType              OnCanUseSecondaryAbility;                          // 0x34A(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBacchusHUDStateType              OnDBNO;                                            // 0x34B(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBacchusHUDStateType              OnCarryingDBNO;                                    // 0x34C(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBacchusHUDStateType              OnCarryingHeldObject;                              // 0x34D(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBacchusHUDStateType              OnImprovedDBNO;                                    // 0x34E(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBacchusHUDStateType              OnControllingRCPawn;                               // 0x34F(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBacchusHUDStateType              OnInVehicle;                                       // 0x350(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBacchusHUDStateType              OnDrivingVehicle;                                  // 0x351(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBacchusHUDStateType              OnZiplining;                                       // 0x352(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_2E83[0x5];                                     // Fixing Size Of Struct

	static class UClass* StaticClass();
	static class UBacchusHUDElement* GetDefaultObj();

	void ShowHighlight(bool Show);
	void OnHUDStateUpdate(struct FFortHUDState& NewState);
	void HandleInputMethodChanged(enum class ECommonInputType CurrentInputType);
};

// 0x8 (0x360 - 0x358)
// Class FortniteUI.FortAutorunLockZoneButton
class UFortAutorunLockZoneButton : public UBacchusHUDElement
{
public:
	class UFortAutorunLockZone*                  AutorunLockZone;                                   // 0x358(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UFortAutorunLockZoneButton* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class FortniteUI.FortBangWrapperContentInterface
class UFortBangWrapperContentInterface : public UInterface
{
public:

	static class UClass* StaticClass();
	static class UFortBangWrapperContentInterface* GetDefaultObj();

	void OnStopCallout();
	void OnStartCallout(class FName TutorialObjectiveName, enum class ETutorialType TutorialType);
	void OnBangStateChanged(bool bEnabled, int32 Count);
};

// 0x98 (0x340 - 0x2A8)
// Class FortniteUI.FortCabinEmailManagementWidget
class UFortCabinEmailManagementWidget : public UUserWidget
{
public:
	class UOverlay*                              Overlay_EmailEntry;                                // 0x2A8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonTextBlock*                      Text_Warning;                                      // 0x2B0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonTextBlock*                      Text_MainDescription;                              // 0x2B8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                     Button_Done;                                       // 0x2C0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                     Button_Cancel;                                     // 0x2C8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortCTAButton*                        Button_ResendEmail;                                // 0x2D0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortCTAButton*                        Button_EditEmail;                                  // 0x2D8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortInputField*                       InputField_Email;                                  // 0x2E0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonTextBlock*                      Text_Email;                                        // 0x2E8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_2EA3[0x50];                                    // Fixing Size Of Struct

	static class UClass* StaticClass();
	static class UFortCabinEmailManagementWidget* GetDefaultObj();

	void OnShowFailureReason(class FText& ErrorText);
	void OnScreenStateChange(enum class ECabinEmailViewState NewState);
	void OnChangeEmailEditMode(bool bIsInEditMode);
	void HandleConfirmEmail(class FText& NewText, enum class ETextCommit CommitInfo);
};

// 0x8 (0x38 - 0x30)
// Class FortniteUI.FortColorPickerConfiguration
class UFortColorPickerConfiguration : public UDataAsset
{
public:
	bool                                         bNoColorOptionAvailable;                           // 0x30(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	enum class EColorPickerType                  ColorPickerType;                                   // 0x31(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bInitializeCustomColorFromSelectedSwatch;          // 0x32(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	enum class EColorPickerColorRepresentation   CustomColorRepresentation;                         // 0x33(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2EA8[0x4];                                     // Fixing Size Of Struct

	static class UClass* StaticClass();
	static class UFortColorPickerConfiguration* GetDefaultObj();

};

// 0xA0 (0x488 - 0x3E8)
// Class FortniteUI.FortCreativeCreateBuildModal
class UFortCreativeCreateBuildModal : public UCommonActivatableWidget
{
public:
	class UCommonAnimatedSwitcher*               Switcher_Content;                                  // 0x3E8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPanelWidget*                          Panel_CreateBuild;                                 // 0x3F0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPanelWidget*                          Panel_CreateBuildInProgress;                       // 0x3F8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPanelWidget*                          Panel_CreateBuildSucceeded;                        // 0x400(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPanelWidget*                          Panel_CreateBuildFailed;                           // 0x408(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                     Button_PrimaryFunction;                            // 0x410(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                     Button_CloseTouch;                                 // 0x418(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                     Button_CopyMnemonic;                               // 0x420(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UButton*                               Button_CreatorPortalUrl;                           // 0x428(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      Text_CreatorPortalUrl;                             // 0x430(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      Text_Mnemonic;                                     // 0x438(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      Text_CreateBuildError;                             // 0x440(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortLazyImage*                        LazyImage_CreatorPortalQrCode;                     // 0x448(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bCreateBuildInProgress;                            // 0x450(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bClearPersistentData;                              // 0x451(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2ED5[0x6];                                     // Fixing Size After Last Property 
	class FString                                CreatedMnemonic;                                   // 0x458(0x10)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                   ClearPersistentDataInputRowHandle;                 // 0x468(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2ED6[0x10];                                    // Fixing Size Of Struct

	static class UClass* StaticClass();
	static class UFortCreativeCreateBuildModal* GetDefaultObj();

	void SetClearPersistentDataInputEnabled(bool bEnabled);
	void SetClearPersistentData(bool bInClearPersistentData);
	void OnQrCodeImageUpdated();
	void OnMnemonicCopied();
	void OnCreateBuildSucceeded();
	void OnCreateBuildStarted();
	void OnCreateBuildFailed(const class FString& ErrorCode);
	void OnContentSwitcherTransitioningChanged(bool bIsTransitioning);
	void OnContentSwitcherActiveWidgetChanged(class UWidget* ActiveWidget);
	void OnClearPersistentDataSet();
	void HandleCreatorPortalUrlButtonClicked();
	void BP_Reset();
};

// 0x158 (0x540 - 0x3E8)
// Class FortniteUI.FortCreativeCreatorAttributions
class UFortCreativeCreatorAttributions : public UCommonActivatableWidget
{
public:
	class UFortDynamicEntryBox*                  DynamicEntryBox_CreditsContainer;                  // 0x3E8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FText                                  CreatorTitle;                                      // 0x3F0(0x18)(Edit, NativeAccessSpecifierPrivate)
	class FText                                  AttributionsTitle;                                 // 0x408(0x18)(Edit, NativeAccessSpecifierPrivate)
	class UUserWidget*                           AttributionsTitleWidget;                           // 0x420(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FText                                  CreditsTitle;                                      // 0x428(0x18)(Edit, NativeAccessSpecifierPrivate)
	class UUserWidget*                           CreditsTitleWidget;                                // 0x440(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FText                                  AttributionsTextFormat;                            // 0x448(0x18)(Edit, NativeAccessSpecifierPrivate)
	TSubclassOf<class UFortCreativeCreditsTeamTitleCard> CreditsTeamTitleCardClass;                         // 0x460(0x8)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UFortCreativeCreditsAttributions> CreditsCreatorAttributionsClass;                   // 0x468(0x8)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftClassPtr<class UFortActivityBrowserAttributionsModal> CreditsAttributionsModalClass;                     // 0x470(0x20)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortCreativeCreditsTeamTitleCard*     Button_CreditsTeamTitleCard;                       // 0x490(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortCreativeCreditsAttributions*      Button_CreditsAttributions;                        // 0x498(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortCreativeCreditsAttributions*      Button_Credits;                                    // 0x4A0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FMargin                               SectionTitlePadding;                               // 0x4A8(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, NativeAccessSpecifierPrivate)
	struct FMargin                               TitleCardButtonPadding;                            // 0x4B8(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, NativeAccessSpecifierPrivate)
	struct FMargin                               TeamMemberButtonPadding;                           // 0x4C8(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, NativeAccessSpecifierPrivate)
	struct FMargin                               AttributionsButtonPadding;                         // 0x4D8(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, NativeAccessSpecifierPrivate)
	struct FMargin                               CreditsButtonPadding;                              // 0x4E8(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, NativeAccessSpecifierPrivate)
	class UFortGameActivity*                     CurrentGameActivity;                               // 0x4F8(0x8)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2EEC[0x40];                                    // Fixing Size Of Struct

	static class UClass* StaticClass();
	static class UFortCreativeCreatorAttributions* GetDefaultObj();

	void OnTitleCardButtonCreated();
	void OnTeamMemberTitleCardButtonCreated(class UFortCreativeCreditsTeamTitleCard* TeamMemberButton);
	void OnSectionTitleCreated(class UFortCreativeCreditsSectionTitle* SectionTitle);
	void OnCreditsButtonCreated();
	void OnAttributionsButtonCreated();
};

// 0x20 (0x1490 - 0x1470)
// Class FortniteUI.FortCreativeCreditsAttributions
class UFortCreativeCreditsAttributions : public UCommonButtonBase
{
public:
	class UTimelineComponent*                    HoverAnimationTimeline;                            // 0x1470(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonRichTextBlock*                  RichText_CreditsAttributionsShortDescription;      // 0x1478(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                        AttributionsPreviewTextWordLimit;                  // 0x1480(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_2EF5[0x4];                                     // Fixing Size After Last Property 
	class UCurveLinearColor*                     HoverAnimationCurve;                               // 0x1488(0x8)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UFortCreativeCreditsAttributions* GetDefaultObj();

	void OnAnimationUpdate(const struct FLinearColor& Color);
	float GetHoverAnimationLength();
};

// 0x8 (0x2D8 - 0x2D0)
// Class FortniteUI.FortCreativeCreditsSectionTitle
class UFortCreativeCreditsSectionTitle : public UCommonUserWidget
{
public:
	class UCommonTextBlock*                      Text_Title;                                        // 0x2D0(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UFortCreativeCreditsSectionTitle* GetDefaultObj();

	void SetTitleText(class FText& TitleText);
};

// 0x20 (0x1490 - 0x1470)
// Class FortniteUI.FortCreativeCreditsTeamTitleCard
class UFortCreativeCreditsTeamTitleCard : public UCommonButtonBase
{
public:
	class UCommonTextBlock*                      Text_CreatorTitle;                                 // 0x1470(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      Text_CreatorName;                                  // 0x1478(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      Text_CreatorDescription;                           // 0x1480(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2EFD[0x8];                                     // Fixing Size Of Struct

	static class UClass* StaticClass();
	static class UFortCreativeCreditsTeamTitleCard* GetDefaultObj();

};

// 0x70 (0xD8 - 0x68)
// Class FortniteUI.FortCreativeIslandInfoViewModel
class UFortCreativeIslandInfoViewModel : public UMVVMViewModelBase
{
public:
	FMulticastInlineDelegateProperty_            OnIslandMetaDataUpdateComplete;                    // 0x68(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnFailedToUpdateCreativePlotData;                  // 0x78(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TArray<class FText>                          IslandIntroduction;                                // 0x88(0x10)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPrivate)
	enum class EDynamicXpCalibrationPhase        XpCalibrationPhase;                                // 0x98(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2F1A[0x7];                                     // Fixing Size After Last Property 
	class UTexture2DDynamic*                     ThumbnailTexture;                                  // 0xA0(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bIsUpdatingIslandMetaData;                         // 0xA8(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2F1B[0x2F];                                    // Fixing Size Of Struct

	static class UClass* StaticClass();
	static class UFortCreativeIslandInfoViewModel* GetDefaultObj();

	void UpdateCreativePlotData(const class FString& NewIslandTitle, TArray<class FString>& NewIslandIntroductions);
	void UnbindViewModel();
	void SetIslandDescriptionTags(TArray<struct FCreativeIslandDescriptionTag>& IslandDescriptionTags);
	void OnIslandMetaDataUpdateComplete__DelegateSignature(const class FString& Error);
	void OnFailedToUpdateCreativePlotData__DelegateSignature(struct FCreativeIslandInfo& IslandInfo);
	bool IsPlayerInAnExperienceTheyOwn();
	void InitializeViewModel();
	void HandleLinkDataQueryComplete(bool bSuccess, const class FString& ErrorMessage, struct FCreativeLoadedLinkData& LinkData);
	void HandleIslandMetaDataUpdateComplete(const class FString& Error);
	void HandleDownloadThumbnailComplete(bool bSuccess, class UTexture2DDynamic* InThumbnailTexture);
	class FText GetIslandTitle();
	TArray<struct FCreativeIslandDescriptionTag> GetIslandDescriptionTags();
	class FText GetIslandCode();
	class FText GetCreatorName();
};

// 0x1F0 (0x5D8 - 0x3E8)
// Class FortniteUI.FortMatchmakingKnobsModal
class UFortMatchmakingKnobsModal : public UCommonActivatableWidget
{
public:
	float                                        MobileOptionListEntrySpacing;                      // 0x3E8(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2F81[0x4];                                     // Fixing Size After Last Property 
	TArray<class FString>                        ScrolledOffWhitelistedPlayers;                     // 0x3F0(0x10)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	bool                                         bInitializeDataInNativeConstruct;                  // 0x400(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_2F82[0x27];                                    // Fixing Size After Last Property 
	class UPlaylistUserOptions*                  OptionsAsset;                                      // 0x428(0x8)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class UObject*>                       OptionDataProviders;                               // 0x430(0x10)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2F84[0x10];                                    // Fixing Size After Last Property 
	TMap<class FString, class FString>           LoadedOptionValues;                                // 0x450(0x50)(Transient, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2F85[0x38];                                    // Fixing Size After Last Property 
	class UCommonListView*                       OptionsList;                                       // 0x4D8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonTextBlock*                      TextBlock_TitleText;                               // 0x4E0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonTextBlock*                      TextBlock_DescriptionText;                         // 0x4E8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UImage*                                Image_DisplayImage;                                // 0x4F0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                   RestoreDefaultsInputRowHandle;                     // 0x4F8(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPrivate)
	TSubclassOf<class UUserWidget>               SubcategoryHeaderWidgetClass;                      // 0x508(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TMap<struct FGameplayTag, class UFortCreativePropertySubcategoryHeaderListItem*> SubcategoryHeaderTagToListItems;                   // 0x510(0x50)(Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2F86[0x78];                                    // Fixing Size Of Struct

	static class UClass* StaticClass();
	static class UFortMatchmakingKnobsModal* GetDefaultObj();

	void SetOptionCategoryTagFilter(struct FGameplayTagContainer& InOptionCategoryTagFilter);
	void SetListDataSource(enum class EUFortMatchmakingKnobsDataSource ListType);
	void OnSetInGameMode();
	void OnSelectionUpdated(class UFortMatchmakingKnobsSpinnerButton* CurrentSelection);
	void OnInitForUserOptionValues(TScriptInterface<class UUserOptionValuesInterface>& UserOptionValues);
	void OnInitForOptionsComponent(class UFortActorOptionsComponent* OptionsComponent);
	void OnHoveredItemChanged(class UObject* Item, bool bIsHovered);
	void OnDataInitialized();
	void OnCurrentItemSelectionChanged(class UObject* Item);
	void OnAcceptAnimationComplete();
	void InitializeData();
	void InitForToyOptionsActor(class UActor* InActor);
	bool HasNonEventProperties();
	bool HasMatchingTags(class UObject* Option, struct FGameplayTagContainer& CategoryTags, struct FGameplayTagContainer& ContextTags);
	bool HasEventFunctionProperty();
	bool HasEventDescriptorProperty();
	void HandleRestorePropertiesClicked();
	void HandleRestoreFunctionsClicked();
	void HandleRestoreEventsClicked();
	void HandleRestoreClicked(bool bRestoreAllOptions);
	void HandleLeaveIsland(class UFortPlayerPawn* PlayerPawn);
	void HandleForcedOffIsland();
	void HandleCancelClicked();
	enum class EFortModifiedStatus GetSpinnerModificationStatus(class UFortMatchmakingKnobsSpinnerButton* SpinnerButton);
	TArray<class FString> GetScrolledOffWhitelistedPlayers();
	enum class EFortModifiedStatus GetModificationStatus(class UObject* Option);
	bool DoesContainString(class UObject* Option, const class FString& String);
	TScriptInterface<class UUserOptionValuesInterface> BP_GetUserOptionValuesInterface();
	class UFortActorOptionsComponent* BP_GetOptionsComponent();
	TScriptInterface<class UFortActorLabelOverrideInterface> BP_GetLabelOverrideInterface();
	void ApplyChanges(bool bApplySettingsFromCachedData);
};

// 0x18 (0x5F0 - 0x5D8)
// Class FortniteUI.FortCreativeMyIslandContentDebugPanel
class UFortCreativeMyIslandContentDebugPanel : public UFortMatchmakingKnobsModal
{
public:
	uint8                                        Pad_2F8D[0x8];                                     // Fixing Size After Last Property 
	TArray<class FString>                        OwnerPermissionAllowList;                          // 0x5E0(0x10)(ZeroConstructor, Config, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UFortCreativeMyIslandContentDebugPanel* GetDefaultObj();

};

// 0x8 (0x5E0 - 0x5D8)
// Class FortniteUI.FortCreativeMyIslandContentKnobsPanel
class UFortCreativeMyIslandContentKnobsPanel : public UFortMatchmakingKnobsModal
{
public:
	uint8                                        Pad_2F90[0x8];                                     // Fixing Size Of Struct

	static class UClass* StaticClass();
	static class UFortCreativeMyIslandContentKnobsPanel* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class FortniteUI.FortCreativeMyIslandContentPanelInterface
class UFortCreativeMyIslandContentPanelInterface : public UInterface
{
public:

	static class UClass* StaticClass();
	static class UFortCreativeMyIslandContentPanelInterface* GetDefaultObj();

	void BP_ShouldShowPanel(bool* bOutShouldShowPanel, enum class EFortMinigameState MinigameState, bool bIsInReadOnlyExperience, bool bIsOwnerOfCurrentExperience);
};

// 0x1A8 (0x590 - 0x3E8)
// Class FortniteUI.FortCreativeSettingsFlow
class UFortCreativeSettingsFlow : public UCommonActivatableWidget
{
public:
	uint8                                        Pad_2F9B[0x8];                                     // Fixing Size After Last Property 
	class UWidgetSwitcher*                       Switcher_EditorConnected;                          // 0x3F0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                  TabNameID;                                         // 0x3F8(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2F9C[0x4];                                     // Fixing Size After Last Property 
	struct FFortTabButtonLabelInfo               TabButtonLabelInfo;                                // 0x400(0xF0)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                   ChannelBrowserInputRowHandle;                      // 0x4F0(0x10)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPrivate)
	TSoftClassPtr<class UFortCreativeChannelBrowser> SoftChannelBrowserClass;                           // 0x500(0x20)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                   DeviceBrowserInputRowHandle;                       // 0x520(0x10)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPrivate)
	TSoftClassPtr<class UFortCreativeDeviceBrowser> SoftDeviceBrowserClass;                            // 0x530(0x20)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2F9D[0x40];                                    // Fixing Size Of Struct

	static class UClass* StaticClass();
	static class UFortCreativeSettingsFlow* GetDefaultObj();

};

// 0xE0 (0x670 - 0x590)
// Class FortniteUI.FortCreativeMyIslandPanel
class UFortCreativeMyIslandPanel : public UFortCreativeSettingsFlow
{
public:
	uint8                                        Pad_2FE0[0x8];                                     // Fixing Size After Last Property 
	class UFortTabListWidgetBase*                TabList_MainContent;                               // 0x598(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonAnimatedSwitcher*               Switcher_MainContent;                              // 0x5A0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FAthenaMapScreenContainerTabInfo      MapScreenContainerTabInfo;                         // 0x5A8(0x48)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	bool                                         bLinkTabListToSwitcher;                            // 0x5F0(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2FE1[0x7];                                     // Fixing Size After Last Property 
	struct FDataTableRowHandle                   StartEndMinigameInputRowHandle;                    // 0x5F8(0x10)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPrivate)
	class FText                                  StartMinigameText;                                 // 0x608(0x18)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	class FText                                  EndMinigameText;                                   // 0x620(0x18)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	TArray<class FName>                          BlockedTabNames;                                   // 0x638(0x10)(ZeroConstructor, Config, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2FE3[0x28];                                    // Fixing Size Of Struct

	static class UClass* StaticClass();
	static class UFortCreativeMyIslandPanel* GetDefaultObj();

	void ShouldShowTab(bool* bOutShouldShowTab, class FName TabId, enum class EFortMinigameState MinigameState, bool bIsInReadOnlyExperience, bool bIsOwnerOfCurrentExperience);
	void OnTabVisibilitiesUpdated();
	void OnMinigameStateChanged(enum class EFortMinigameState MinigameState);
	void OnMinigameSettingsChanged(class UFortMinigameSettingsBuilding* MinigameSettings);
	void OnActiveMainContentWidgetChanged(class UWidget* ActiveWidget, int32 ActiveWidgetIndex);
	bool IsOwnerOfCurrentExperience();
	void HandleMinigameStateChanged(class UFortMinigame* Minigame, enum class EFortMinigameState MinigameState);
	void HandleMinigameSettingsMachineChanged(class UFortMinigameVolumeComponent* MinigameVolumeComponent, class UFortMinigameSettingsBuilding* MinigameSettings);
	void HandleCreativePermissionsChanged();
	class UFortMinigameVolumeComponent* GetMinigameVolumeComponent();
	class UFortMinigameSettingsBuilding* GetMinigameSettingsMachine();
};

// 0x40 (0x68 - 0x28)
// Class FortniteUI.FortCreativePropertySubcategoryHeaderListItem
class UFortCreativePropertySubcategoryHeaderListItem : public UObject
{
public:
	FMulticastInlineDelegateProperty_            OnIsExpandedChangedDynamicDelegate;                // 0x28(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	TArray<class UObject*>                       Options;                                           // 0x38(0x10)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2FFC[0x20];                                    // Fixing Size Of Struct

	static class UClass* StaticClass();
	static class UFortCreativePropertySubcategoryHeaderListItem* GetDefaultObj();

	void SetIsExpanded(bool bInIsExpanded);
	void OnIsExpandedChangedDynamic__DelegateSignature(bool bIsExpanded);
	bool IsExpanded();
	struct FGameplayTag GetSubcategoryTag();
};

// 0x50 (0x80 - 0x30)
// Class FortniteUI.FortCreativePropertySubcategoryTagToTextMap
class UFortCreativePropertySubcategoryTagToTextMap : public UDataAsset
{
public:
	TMap<struct FGameplayTag, class FText>       SubcategoryTagToTextMap;                           // 0x30(0x50)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UFortCreativePropertySubcategoryTagToTextMap* GetDefaultObj();

	class FText GetSubcategoryDisplayName(struct FGameplayTag& SubcategoryTag);
};

// 0x10 (0x530 - 0x520)
// Class FortniteUI.FortCreativeScoreboardPanel
class UFortCreativeScoreboardPanel : public UCommonActivatablePanelLegacy
{
public:
	struct FDataTableRowHandle                   MainMenuInputRowHandle;                            // 0x520(0x10)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UFortCreativeScoreboardPanel* GetDefaultObj();

};

// 0x58 (0x3D0 - 0x378)
// Class FortniteUI.FortEventDateTimeTextBlock
class UFortEventDateTimeTextBlock : public UCommonTextBlock
{
public:
	uint8                                        Pad_3024[0x58];                                    // Fixing Size Of Struct

	static class UClass* StaticClass();
	static class UFortEventDateTimeTextBlock* GetDefaultObj();

	void SetTimespanValue(const struct FTimespan& InTimespan, enum class EDateFormat InFormatStyle);
	void SetDateTimeValue(const struct FDateTime& InDateTime, enum class EDateFormat InFormatStyle, float InRefreshDelay);
	void SetCountDownCompletionText(class FText InCompletionText);
	void OnCurrentTimeTextBlockUpdated__DelegateSignature(double Seconds);
	struct FDateTime GetDateTime();
};

// 0x60 (0x90 - 0x30)
// Class FortniteUI.FortEventLevelData
class UFortEventLevelData : public UDataAsset
{
public:
	class FString                                EventLevelStoreFrontName;                          // 0x30(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UAthenaRewardEventGraph> EventLevelRewards;                                 // 0x40(0x20)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UFortActivatableVideoPanel> CinematicMovieWidget;                              // 0x60(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortStreamMediaSource*                ElectraMediaSource;                                // 0x68(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMediaPlayer*                          StreamedMediaPlayer;                               // 0x70(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  CinematicVideoName;                                // 0x78(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_302B[0x4];                                     // Fixing Size After Last Property 
	struct FDataTableRowHandle                   InteractionHandle;                                 // 0x80(0x10)(Edit, NoDestructor, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UFortEventLevelData* GetDefaultObj();

};

// 0x148 (0x3F0 - 0x2A8)
// Class FortniteUI.FortEditableFilteredCountedTextBox
class UFortEditableFilteredCountedTextBox : public UUserWidget
{
public:
	int32                                        EntryCharLimit;                                    // 0x2A8(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EVirtualKeyboardTrigger           VirtualKeyboardTrigger;                            // 0x2AC(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_305E[0x3];                                     // Fixing Size After Last Property 
	int32                                        EnforcedEntryCharLimit;                            // 0x2B0(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_3061[0x4];                                     // Fixing Size After Last Property 
	class FText                                  SuggestionText;                                    // 0x2B8(0x18)(Edit, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_3063[0x1];                                     // Fixing Size After Last Property 
	bool                                         bShouldValidatePersistentID;                       // 0x2D1(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bAllowLineBreaks;                                  // 0x2D2(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bAllowStyleEditing;                                // 0x2D3(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bIgnoreCharLimitValidation;                        // 0x2D4(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_3065[0x3];                                     // Fixing Size After Last Property 
	struct FCharRangeList                        AllowedCharacters;                                 // 0x2D8(0x10)(Edit, Protected, NativeAccessSpecifierProtected)
	bool                                         bReplaceUserTextWithSanitizedString;               // 0x2E8(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bAllowSanitizedStrings;                            // 0x2E9(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bUseToxicityServiceSanitization;                   // 0x2EA(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_3068[0x5];                                     // Fixing Size After Last Property 
	class FText                                  DefaultSanitizationErrorText;                      // 0x2F0(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	class FText                                  AdditionalValidationErrorText;                     // 0x308(0x18)(BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	bool                                         bCurrentlyValid;                                   // 0x320(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_306B[0x7];                                     // Fixing Size After Last Property 
	class UEditableTextBox*                      EditText;                                          // 0x328(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_306C[0xB8];                                    // Fixing Size After Last Property 
	class UCommonTextBlock*                      Text_CharCount;                                    // 0x3E8(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UFortEditableFilteredCountedTextBox* GetDefaultObj();

	void ValidatePersistentID(class FText& Text);
	void UpdateCharacterCount();
	void SetTextWithForcedSanitization(class FText& Text);
	void SetEntryCharLimit(int32 InCharLimit);
	void OnDirtyTextAttempted(bool bIsBadText, bool bAdditionalValidationFailed);
	void HandleTextCommitted(class FText& Text, enum class ETextCommit CommitMethod);
	void HandleTextChanged(class FText& Text);
	bool GetIgnoreCharLimitValidation();
	int32 GetEntryCharLimit();
	bool GetAllowStyleEditing();
	bool GetAllowLineBreaks();
	class FString GetAllowedCharactersAsString();
	void ForceSetText(class FText& Text);
};

// 0x30 (0x420 - 0x3F0)
// Class FortniteUI.FortFilteredNameEntryWidget
class UFortFilteredNameEntryWidget : public UFortEditableFilteredCountedTextBox
{
public:
	enum class ETextCommit                       LastTextCommittedType;                             // 0x3F0(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_3079[0x7];                                     // Fixing Size After Last Property 
	class UCommonButtonBase*                     Button_RenameInputButton;                          // 0x3F8(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	FMulticastInlineDelegateProperty_            OnTextCommitByEnter;                               // 0x400(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnRenameInput;                                     // 0x410(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UFortFilteredNameEntryWidget* GetDefaultObj();

	void HandleOnTextCommitted(class FText& Text, enum class ETextCommit CommitMethod);
};

// 0x0 (0x28 - 0x28)
// Class FortniteUI.FortFrontendOverlayInterface
class UFortFrontendOverlayInterface : public UInterface
{
public:

	static class UClass* StaticClass();
	static class UFortFrontendOverlayInterface* GetDefaultObj();

};

// 0x10 (0x2B8 - 0x2A8)
// Class FortniteUI.FortFrontendSurvivorTier
class UFortFrontendSurvivorTier : public UUserWidget
{
public:
	struct FGameplayTag                          AssociatedQuestCategory;                           // 0x2A8(0x4)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_3080[0x4];                                     // Fixing Size After Last Property 
	class UCommonButtonBase*                     Button_GoToQuests;                                 // 0x2B0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UFortFrontendSurvivorTier* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class FortniteUI.FortGameSettingRegistryExtension
class UFortGameSettingRegistryExtension : public UFortGameSettingRegistryExtensionBase
{
public:

	static class UClass* StaticClass();
	static class UFortGameSettingRegistryExtension* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class FortniteUI.FortGlobalActionDetailsDataSource
class UFortGlobalActionDetailsDataSource : public UInterface
{
public:

	static class UClass* StaticClass();
	static class UFortGlobalActionDetailsDataSource* GetDefaultObj();

	void RemoveOnChangeDelegate(FDelegateProperty_& InDelegate);
	struct FFortGlobalActionDetails GetValue();
	void AddOnChangeDelegate(FDelegateProperty_& InDelegate);
};

// 0x0 (0x28 - 0x28)
// Class FortniteUI.FortGlobalVMResolver
class UFortGlobalVMResolver : public UMVVMViewModelContextResolver
{
public:

	static class UClass* StaticClass();
	static class UFortGlobalVMResolver* GetDefaultObj();

};

// 0x8 (0x3F0 - 0x3E8)
// Class FortniteUI.FortHabaneroInfoEntry
class UFortHabaneroInfoEntry : public UCommonActivatableWidget
{
public:
	class UFortHabaneroDisplayData*              HabaneroDisplayData;                               // 0x3E8(0x8)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UFortHabaneroInfoEntry* GetDefaultObj();

	void OnSetGameMode(const class FString& GameMode);
};

// 0x50 (0x438 - 0x3E8)
// Class FortniteUI.FortHabaneroInfoModal
class UFortHabaneroInfoModal : public UCommonActivatableWidget
{
public:
	class UVerticalBox*                          Vbox_Panels;                                       // 0x3E8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                     Button_Close;                                      // 0x3F0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                     Button_Close_Alt;                                  // 0x3F8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                     Button_CloseTouch;                                 // 0x400(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAthenaScrollBox*                      ScrollBox_Panels;                                  // 0x408(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_30A7[0x10];                                    // Fixing Size After Last Property 
	bool                                         bIsHabaneroTimerEnabled;                           // 0x420(0x1)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_30A8[0x17];                                    // Fixing Size Of Struct

	static class UClass* StaticClass();
	static class UFortHabaneroInfoModal* GetDefaultObj();

	void SetTimerVisibility(enum class ESlateVisibility TimerVisibility);
	void SetTimerText(struct FTimespan& Timespan);
	void SetProgress(const class FString& ProgressKey, int32 CurrentHabanero, int32 CurrentPosition, float ProgressPercent);
	void BP_OnScrollCompleted(bool bScrolledDown);
};

// 0x28 (0x410 - 0x3E8)
// Class FortniteUI.FortHabaneroTierWidget
class UFortHabaneroTierWidget : public UCommonActivatableWidget
{
public:
	uint8                                        Pad_30B5[0x18];                                    // Fixing Size After Last Property 
	class UFortHabaneroDisplayData*              HabaneroDisplayData;                               // 0x400(0x8)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bInitializeToRepresentLocalUser;                   // 0x408(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_30B6[0x7];                                     // Fixing Size Of Struct

	static class UClass* StaticClass();
	static class UFortHabaneroTierWidget* GetDefaultObj();

	void UpdateWidgetDisplay(struct FFortHabaneroTier& DisplayData);
	void StartQueryForRank();
	void FailedToFindRank();
};

// 0x18 (0x428 - 0x410)
// Class FortniteUI.FortHabaneroLobbyWidget
class UFortHabaneroLobbyWidget : public UFortHabaneroTierWidget
{
public:
	class UCommonButtonBase*                     Button_Info;                                       // 0x410(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTag                          RankedInfoBangTag;                                 // 0x418(0x4)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_30BA[0x4];                                     // Fixing Size After Last Property 
	TSubclassOf<class UFortHabaneroInfoModal>    InfoModalClass;                                    // 0x420(0x8)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UFortHabaneroLobbyWidget* GetDefaultObj();

	void UpdateProgressToNextHabanero(int32 UnrealRankPlayerPosition, float ProgressPercent);
	void SetBangVisible(bool bIsVisible);
};

// 0x40 (0x70 - 0x30)
// Class FortniteUI.FortHUDVisibilityData
class UFortHUDVisibilityData : public UDataAsset
{
public:
	struct FGameplayTag                          HUDVisibilityGameplayTag;                          // 0x30(0x4)(BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_30BB[0x4];                                     // Fixing Size After Last Property 
	class FText                                  DisplayText;                                       // 0x38(0x18)(BlueprintVisible, NativeAccessSpecifierPublic)
	class FText                                  ToolTipText;                                       // 0x50(0x18)(BlueprintVisible, NativeAccessSpecifierPublic)
	bool                                         Visible;                                           // 0x68(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_30BC[0x7];                                     // Fixing Size Of Struct

	static class UClass* StaticClass();
	static class UFortHUDVisibilityData* GetDefaultObj();

};

// 0x158 (0x180 - 0x28)
// Class FortniteUI.FortSetting
class UFortSetting : public UObject
{
public:
	uint8                                        Pad_30DD[0x48];                                    // Fixing Size After Last Property 
	class UFortLocalPlayer*                      LocalPlayer;                                       // 0x70(0x8)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortSetting*                          SettingParent;                                     // 0x78(0x8)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortSettingRegistry*                  OwningRegistry;                                    // 0x80(0x8)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_30DE[0x60];                                    // Fixing Size After Last Property 
	struct FFortSettingNameExtensions            CustomExtensions;                                  // 0xE8(0x18)(Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_30DF[0x80];                                    // Fixing Size Of Struct

	static class UClass* StaticClass();
	static class UFortSetting* GetDefaultObj();

	class FText GetWarningRichText();
	class FText GetDynamicDetails();
	enum class ESlateVisibility GetDisplayNameVisibility();
	class FText GetDisplayName();
	class FString GetDevName();
	class FText GetDescriptionRichText();
};

// 0x0 (0x180 - 0x180)
// Class FortniteUI.FortSettingValue
class UFortSettingValue : public UFortSetting
{
public:

	static class UClass* StaticClass();
	static class UFortSettingValue* GetDefaultObj();

};

// 0x8 (0x188 - 0x180)
// Class FortniteUI.FortInputSettingBase
class UFortInputSettingBase : public UFortSettingValue
{
public:
	uint8                                        Pad_30E5[0x8];                                     // Fixing Size Of Struct

	static class UClass* StaticClass();
	static class UFortInputSettingBase* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class FortniteUI.FortItemManagementMulchPanel
class UFortItemManagementMulchPanel : public UInterface
{
public:

	static class UClass* StaticClass();
	static class UFortItemManagementMulchPanel* GetDefaultObj();

	void ShowMulchConfirmationModal();
	void NotifyPanelDeactivated();
	void NotifyPanelActivated();
	void HideMulchConfirmationModal();
};

// 0x0 (0x28 - 0x28)
// Class FortniteUI.FortFrontendInventoryFilterFunctionLibrary
class UFortFrontendInventoryFilterFunctionLibrary : public UBlueprintFunctionLibrary
{
public:

	static class UClass* StaticClass();
	static class UFortFrontendInventoryFilterFunctionLibrary* GetDefaultObj();

	class FText ToText(enum class EFortFrontendInventoryFilter FrontendInventoryFilter);
};

// 0xC8 (0xF0 - 0x28)
// Class FortniteUI.FortPresentationItemLootInfo
class UFortPresentationItemLootInfo : public UObject
{
public:
	struct FFortReceivedItemLootInfo             ItemReceivedInfo;                                  // 0x28(0xC8)(NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UFortPresentationItemLootInfo* GetDefaultObj();

};

// 0x18 (0x2C0 - 0x2A8)
// Class FortniteUI.ItemReceivedHeaderBase
class UItemReceivedHeaderBase : public UUserWidget
{
public:
	class UFortGiftBoxItem*                      GiftBoxItem;                                       // 0x2A8(0x8)(BlueprintVisible, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                FromUsername;                                      // 0x2B0(0x10)(BlueprintVisible, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UItemReceivedHeaderBase* GetDefaultObj();

	void SetBlueprintGiftBoxItem(class UFortGiftBoxItem* GiftBox, const class FString& FromUser, TArray<struct FFortReceivedItemLootInfo>& ItemDefs, bool bSelfGift);
	void InitFromGiftBoxItem_BP();
};

// 0x0 (0x28 - 0x28)
// Class FortniteUI.FortLoadingScreenCustomWidgetInterface
class UFortLoadingScreenCustomWidgetInterface : public UInterface
{
public:

	static class UClass* StaticClass();
	static class UFortLoadingScreenCustomWidgetInterface* GetDefaultObj();

};

// 0x20 (0x2F0 - 0x2D0)
// Class FortniteUI.FortMatchmakingSuggestionWidget
class UFortMatchmakingSuggestionWidget : public UCommonUserWidget
{
public:
	class UWidget*                               SharedDataTestVoting_Container;                    // 0x2D0(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                     Button_SharedDataTest_Accept;                      // 0x2D8(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                     Button_SharedDataTest_Reject;                      // 0x2E0(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      Text_RequestedTextChange;                          // 0x2E8(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UFortMatchmakingSuggestionWidget* GetDefaultObj();

};

// 0x20 (0x48 - 0x28)
// Class FortniteUI.FortMobileButtonBehaviorComponent
class UFortMobileButtonBehaviorComponent : public UObject
{
public:
	class UFortMobileActionButtonBehavior*       ButtonBehavior;                                    // 0x28(0x8)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UFortButtonBehaviorComponentOverride*> ButtonBehaviorComponentOverrides;                  // 0x30(0x10)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_3121[0x8];                                     // Fixing Size Of Struct

	static class UClass* StaticClass();
	static class UFortMobileButtonBehaviorComponent* GetDefaultObj();

};

// 0x0 (0x48 - 0x48)
// Class FortniteUI.FortMobileButtonBehaviorComponent_IconPicker
class UFortMobileButtonBehaviorComponent_IconPicker : public UFortMobileButtonBehaviorComponent
{
public:

	static class UClass* StaticClass();
	static class UFortMobileButtonBehaviorComponent_IconPicker* GetDefaultObj();

};

// 0x10 (0x58 - 0x48)
// Class FortniteUI.FortMobileButtonBehaviorComboComponent_IconPicker
class UFortMobileButtonBehaviorComboComponent_IconPicker : public UFortMobileButtonBehaviorComponent_IconPicker
{
public:
	TArray<struct FQueriedResultIconAssignment>  IconAssignementQueries;                            // 0x48(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, ContainsInstancedReference, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UFortMobileButtonBehaviorComboComponent_IconPicker* GetDefaultObj();

};

// 0x0 (0x48 - 0x48)
// Class FortniteUI.FortMobileButtonBehaviorComponent_Visibility
class UFortMobileButtonBehaviorComponent_Visibility : public UFortMobileButtonBehaviorComponent
{
public:

	static class UClass* StaticClass();
	static class UFortMobileButtonBehaviorComponent_Visibility* GetDefaultObj();

};

// 0x10 (0x58 - 0x48)
// Class FortniteUI.FortMobileButtonBehaviorComboComponent_Visibility
class UFortMobileButtonBehaviorComboComponent_Visibility : public UFortMobileButtonBehaviorComponent_Visibility
{
public:
	TArray<struct FQueriedResultVisibilityAssignment> VisibilityAssignementQueries;                      // 0x48(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, ContainsInstancedReference, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UFortMobileButtonBehaviorComboComponent_Visibility* GetDefaultObj();

};

// 0x58 (0x390 - 0x338)
// Class FortniteUI.FortMobileEasyLootGrid
class UFortMobileEasyLootGrid : public UFortMobileHUDElement
{
public:
	class UButton*                               Button_AutoPickUp;                                 // 0x338(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UButton*                               Button_CollapsedList;                              // 0x340(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UVerticalBox*                          LootGridListBox;                                   // 0x348(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UImage*                                Panel_Background;                                  // 0x350(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonListView*                       ListView_Items;                                    // 0x358(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UOverlay*                              Overlay_FullBackpack;                              // 0x360(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TWeakObjectPtr<class UFortControllerComponent_Interaction> InteractionComponent;                              // 0x368(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_3219[0x8];                                     // Fixing Size After Last Property 
	TArray<class UFortMobileEasyLootGridItemEntry*> LootGridListItems;                                 // 0x378(0x10)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	uint8                                        Pad_321A[0x8];                                     // Fixing Size Of Struct

	static class UClass* StaticClass();
	static class UFortMobileEasyLootGrid* GetDefaultObj();

	void UpdateListPostAnimation();
	void OnLootFeedBack(bool bEnable);
	void OnCollapsedListPressed(bool bShouldCollapseList);
	void OnBackpackFullChanged(bool bFull);
	void OnAutoPickupPressed(bool bEnable);
	bool IsEasyLootGridEnabledForActor(class UFortPlayerController* FortPC, class UActor* PickUpItem);
	bool IsEasyLootGridEnabled(class UFortPlayerController* FortPC);
	void HandleCollapsedListPressed();
	void HandleAutoPickUpPressed();
};

// 0x10 (0x38 - 0x28)
// Class FortniteUI.FortMobileEasyLootGridItemEntry
class UFortMobileEasyLootGridItemEntry : public UObject
{
public:
	TWeakObjectPtr<class UActor>                 LootGridItem;                                      // 0x28(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_321E[0x8];                                     // Fixing Size Of Struct

	static class UClass* StaticClass();
	static class UFortMobileEasyLootGridItemEntry* GetDefaultObj();

};

// 0x48 (0x2F0 - 0x2A8)
// Class FortniteUI.FortMobileEasyLootGridListEntry
class UFortMobileEasyLootGridListEntry : public UUserWidget
{
public:
	uint8                                        Pad_323C[0x8];                                     // Fixing Size After Last Property 
	class UCommonButtonBase*                     Button_PickUp;                                     // 0x2B0(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                     Button_Consume;                                    // 0x2B8(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USizeBox*                              Box_SecondaryAbility;                              // 0x2C0(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UTextBlock*                            Text_WeaponName;                                   // 0x2C8(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UTextBlock*                            Text_WeaponRarity;                                 // 0x2D0(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaItemIcon*                       ItemIcon;                                          // 0x2D8(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TWeakObjectPtr<class UFortMobileEasyLootGridItemEntry> LootGridItemEntry;                                 // 0x2E0(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bAnimItemAdded;                                    // 0x2E8(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_323E[0x7];                                     // Fixing Size Of Struct

	static class UClass* StaticClass();
	static class UFortMobileEasyLootGridListEntry* GetDefaultObj();

	void SecondaryButtonClicked();
	void PrimaryButtonClicked();
	void OnItemRemoved(class UFortMobileEasyLootGrid* List);
	void OnItemAdded();
};

// 0x38 (0x60 - 0x28)
// Class FortniteUI.FortMobileHUDWidgetCustomPropertyModel
class UFortMobileHUDWidgetCustomPropertyModel : public UObject
{
public:
	bool                                         bIsVisibleToTheUser;                               // 0x28(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_3243[0x7];                                     // Fixing Size After Last Property 
	class FString                                PropertyDevName;                                   // 0x30(0x10)(Edit, ZeroConstructor, EditConst, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FText                                  PropertyDisplayName;                               // 0x40(0x18)(Edit, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTag                          PropertyTag;                                       // 0x58(0x4)(Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_3244[0x4];                                     // Fixing Size Of Struct

	static class UClass* StaticClass();
	static class UFortMobileHUDWidgetCustomPropertyModel* GetDefaultObj();

};

// 0x8 (0x68 - 0x60)
// Class FortniteUI.FortMobileHUDWidgetCustomPropertyModel_Bool
class UFortMobileHUDWidgetCustomPropertyModel_Bool : public UFortMobileHUDWidgetCustomPropertyModel
{
public:
	bool                                         DefaultValue;                                      // 0x60(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_3247[0x7];                                     // Fixing Size Of Struct

	static class UClass* StaticClass();
	static class UFortMobileHUDWidgetCustomPropertyModel_Bool* GetDefaultObj();

};

// 0x0 (0x68 - 0x68)
// Class FortniteUI.FortMobileHUDWidgetCustomPropertyModel_AutorunPreference
class UFortMobileHUDWidgetCustomPropertyModel_AutorunPreference : public UFortMobileHUDWidgetCustomPropertyModel_Bool
{
public:

	static class UClass* StaticClass();
	static class UFortMobileHUDWidgetCustomPropertyModel_AutorunPreference* GetDefaultObj();

};

// 0x10 (0x40 - 0x30)
// Class FortniteUI.FortModalContainerData
class UFortModalContainerData : public UDataAsset
{
public:
	TArray<struct FFortModalContainerSizeEntry>  Entries;                                           // 0x30(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UFortModalContainerData* GetDefaultObj();

};

// 0x30 (0x3E8 - 0x3B8)
// Class FortniteUI.FortMoveStickHUDElementProxy
class UFortMoveStickHUDElementProxy : public UFortMobileHUDElementProxy
{
public:
	class UOverlay*                              Overlay_Highlights;                                // 0x3B8(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USizeBox*                              SizeBox_AutorunLockZoneHidden;                     // 0x3C0(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USizeBox*                              SizeBox_AutorunLockZoneSize;                       // 0x3C8(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USizeBox*                              SizeBox_AutorunDirectionArrowSpaceSize;            // 0x3D0(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FGameplayTag                          AutorunLockZoneSizePropertyTag;                    // 0x3D8(0x4)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        DefaultAutorunLockZoneSize;                        // 0x3DC(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        DefaultAutorunLockZoneTopPadding;                  // 0x3E0(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_324F[0x4];                                     // Fixing Size Of Struct

	static class UClass* StaticClass();
	static class UFortMoveStickHUDElementProxy* GetDefaultObj();

};

// 0x28 (0x2D0 - 0x2A8)
// Class FortniteUI.FortMPItemShopRow
class UFortMPItemShopRow : public UUserWidget
{
public:
	FMulticastInlineDelegateProperty_            OnOfferTileFocusedEvent;                           // 0x2A8(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class FString                                FocusedOfferId;                                    // 0x2B8(0x10)(BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortDynamicEntryBox*                  FortDynamicEntryBox_Row;                           // 0x2C8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UFortMPItemShopRow* GetDefaultObj();

	void OnOfferTileFocused__DelegateSignature(const class FString& OfferId);
	class UCommonButtonBase* CreateEntryTile(class UFortItemShopOfferVM* OfferVM);
};

// 0x0 (0x28 - 0x28)
// Class FortniteUI.FortNodeCanvasEntityInterface
class UFortNodeCanvasEntityInterface : public UInterface
{
public:

	static class UClass* StaticClass();
	static class UFortNodeCanvasEntityInterface* GetDefaultObj();

};

// 0x8 (0x408 - 0x400)
// Class FortniteUI.FortNullHUD
class UFortNullHUD : public UFortUIStateWidgetBase
{
public:
	class UCommonUserWidget*                     ActionBar_BottomBar;                               // 0x400(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UFortNullHUD* GetDefaultObj();

};

// 0x8 (0x70 - 0x68)
// Class FortniteUI.FortSocialUserViewModel
class UFortSocialUserViewModel : public UMVVMViewModelBase
{
public:
	TWeakObjectPtr<class UFortSocialUser>        SocialUser;                                        // 0x68(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UFortSocialUserViewModel* GetDefaultObj();

	void SetSocialUser(class UFortSocialUser* InSocialUser);
	class UFortSocialUser* GetSocialUser();
};

// 0x8 (0x78 - 0x70)
// Class FortniteUI.FortOnlineStatusViewModel
class UFortOnlineStatusViewModel : public UFortSocialUserViewModel
{
public:
	enum class EPresenceIndicatorState           OnlineStatus;                                      // 0x70(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bHideStatus;                                       // 0x71(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_3283[0x6];                                     // Fixing Size Of Struct

	static class UClass* StaticClass();
	static class UFortOnlineStatusViewModel* GetDefaultObj();

};

// 0x18 (0x40 - 0x28)
// Class FortniteUI.FortOptionsCategoryHeader
class UFortOptionsCategoryHeader : public UObject
{
public:
	class FText                                  DisplayText;                                       // 0x28(0x18)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UFortOptionsCategoryHeader* GetDefaultObj();

};

// 0xD8 (0x108 - 0x30)
// Class FortniteUI.FortOptionsMenuInputData
class UFortOptionsMenuInputData : public UDataAsset
{
public:
	class FName                                  ActionName;                                        // 0x30(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_328C[0x4];                                     // Fixing Size After Last Property 
	class FText                                  DisplayText;                                       // 0x38(0x18)(BlueprintVisible, NativeAccessSpecifierPublic)
	class FText                                  PrimaryText;                                       // 0x50(0x18)(BlueprintVisible, NativeAccessSpecifierPublic)
	class FText                                  SecondaryText;                                     // 0x68(0x18)(BlueprintVisible, NativeAccessSpecifierPublic)
	int32                                        ElementNumber;                                     // 0x80(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_328E[0x4];                                     // Fixing Size After Last Property 
	class UCommonTextBlock*                      TabText;                                           // 0x88(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFortActionKeyMapping                 ActionKeyMapping;                                  // 0x90(0x78)(NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UFortOptionsMenuInputData* GetDefaultObj();

	float GetInputScale();
	enum class EFortInputActionGroup GetInputActionGroup();
};

// 0x0 (0x28 - 0x28)
// Class FortniteUI.FortPersistentTabObject
class UFortPersistentTabObject : public UObject
{
public:

	static class UClass* StaticClass();
	static class UFortPersistentTabObject* GetDefaultObj();

	void OnTabInitialized();
	void OnTabExited();
	void OnTabEntered();
	void OnTabDestroyed();
};

// 0x0 (0x2A8 - 0x2A8)
// Class FortniteUI.FortPlayerAvatar
class UFortPlayerAvatar : public UUserWidget
{
public:

	static class UClass* StaticClass();
	static class UFortPlayerAvatar* GetDefaultObj();

	void ResetPlayerAvatar();
	void RepresentLocalPlayer();
	void OnSetSocialUser(class UFortSocialUser* InUser);
};

// 0x30 (0xA0 - 0x70)
// Class FortniteUI.FortPlayerAvatarViewModel
class UFortPlayerAvatarViewModel : public UFortSocialUserViewModel
{
public:
	bool                                         bUseLargeImage;                                    // 0x70(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_32A1[0x7];                                     // Fixing Size After Last Property 
	class UTexture2D*                            AvatarTexture;                                     // 0x78(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bLoading;                                          // 0x80(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_32A2[0x3];                                     // Fixing Size After Last Property 
	struct FColor                                BackgroundColor;                                   // 0x84(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FColor                                HighlightColor;                                    // 0x88(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_32A3[0x14];                                    // Fixing Size Of Struct

	static class UClass* StaticClass();
	static class UFortPlayerAvatarViewModel* GetDefaultObj();

};

// 0x10 (0x1480 - 0x1470)
// Class FortniteUI.FortPlayerSurveyResponseChoiceBase
class UFortPlayerSurveyResponseChoiceBase : public UCommonButtonBase
{
public:
	class UCommonTextBlock*                      Text_Response;                                     // 0x1470(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_32AD[0x8];                                     // Fixing Size Of Struct

	static class UClass* StaticClass();
	static class UFortPlayerSurveyResponseChoiceBase* GetDefaultObj();

	void SetChoiceType(enum class EFortPlayerSurveyResponseChoiceType Type);
	void OnSurveyResetChoice();
};

// 0x30 (0x418 - 0x3E8)
// Class FortniteUI.FortPlayerSurveyResponseWidget
class UFortPlayerSurveyResponseWidget : public UCommonActivatableWidget
{
public:
	uint8                                        Pad_32B0[0x30];                                    // Fixing Size Of Struct

	static class UClass* StaticClass();
	static class UFortPlayerSurveyResponseWidget* GetDefaultObj();

};

// 0x10 (0x2B8 - 0x2A8)
// Class FortniteUI.FortPopupModal
class UFortPopupModal : public UUserWidget
{
public:
	class UCommonButtonBase*                     IconTextButton_Close;                              // 0x2A8(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                     Button_CloseTouch;                                 // 0x2B0(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UFortPopupModal* GetDefaultObj();

};

// 0x8 (0x30 - 0x28)
// Class FortniteUI.FortRichTextTextureDecorator
class UFortRichTextTextureDecorator : public URichTextBlockDecorator
{
public:
	class UObject*                               LoadedResourceObject;                              // 0x28(0x8)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UFortRichTextTextureDecorator* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class FortniteUI.FortRichTextTextureDecoratorHelpers
class UFortRichTextTextureDecoratorHelpers : public UBlueprintFunctionLibrary
{
public:

	static class UClass* StaticClass();
	static class UFortRichTextTextureDecoratorHelpers* GetDefaultObj();

	class FText MakeFortRichTextTexture(TSoftObjectPtr<class UTexture2D> InTexture, bool bUseDesiredSize, int32 Width, int32 Height);
	class FText MakeFortRichTextMaterial(TSoftObjectPtr<class UMaterialInterface> InMaterial, bool bUseDesiredSize, int32 Width, int32 Height);
};

// 0x100 (0x130 - 0x30)
// Class FortniteUI.FortServerBrowserActionData
class UFortServerBrowserActionData : public UPrimaryDataAsset
{
public:
	enum class EFortServerBrowserAction          ActionType;                                        // 0x30(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_32BF[0x7];                                     // Fixing Size After Last Property 
	class FText                                  Title;                                             // 0x38(0x18)(Edit, NativeAccessSpecifierPublic)
	class FText                                  Description;                                       // 0x50(0x18)(Edit, NativeAccessSpecifierPublic)
	uint8                                        Pad_32C2[0x8];                                     // Fixing Size After Last Property 
	struct FSlateBrush                           TileImage;                                         // 0x70(0xC0)(Edit, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UFortServerBrowserActionData* GetDefaultObj();

};

// 0x20 (0x150 - 0x130)
// Class FortniteUI.FortServerBrowserActionDataPopup
class UFortServerBrowserActionDataPopup : public UFortServerBrowserActionData
{
public:
	TSoftClassPtr<class UCommonActivatableWidget> PopupClass;                                        // 0x130(0x20)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UFortServerBrowserActionDataPopup* GetDefaultObj();

};

// 0x0 (0x180 - 0x180)
// Class FortniteUI.FortSettingValueDiscrete
class UFortSettingValueDiscrete : public UFortSettingValue
{
public:

	static class UClass* StaticClass();
	static class UFortSettingValueDiscrete* GetDefaultObj();

	TArray<class FText> GetDiscreteOptions();
	int32 GetDiscreteOptionInitialIndex();
	int32 GetDiscreteOptionIndex();
	int32 GetDiscreteOptionDefaultIndex();
	TArray<class FText> GetDisabledOptionsReasons();
	TArray<class FText> GetDisabledOptions();
};

// 0x68 (0x1E8 - 0x180)
// Class FortniteUI.FortSettingValueDiscreteDynamic
class UFortSettingValueDiscreteDynamic : public UFortSettingValueDiscrete
{
public:
	uint8                                        Pad_32CF[0x68];                                    // Fixing Size Of Struct

	static class UClass* StaticClass();
	static class UFortSettingValueDiscreteDynamic* GetDefaultObj();

};

// 0x0 (0x1E8 - 0x1E8)
// Class FortniteUI.FortSettingValueDiscreteDynamic_Vector2D
class UFortSettingValueDiscreteDynamic_Vector2D : public UFortSettingValueDiscreteDynamic
{
public:

	static class UClass* StaticClass();
	static class UFortSettingValueDiscreteDynamic_Vector2D* GetDefaultObj();

};

// 0x0 (0x1E8 - 0x1E8)
// Class FortniteUI.FortSettingValueDiscreteDynamic_Anchors
class UFortSettingValueDiscreteDynamic_Anchors : public UFortSettingValueDiscreteDynamic_Vector2D
{
public:

	static class UClass* StaticClass();
	static class UFortSettingValueDiscreteDynamic_Anchors* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class FortniteUI.FortSocialPanelContainerInterface
class UFortSocialPanelContainerInterface : public UInterface
{
public:

	static class UClass* StaticClass();
	static class UFortSocialPanelContainerInterface* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class FortniteUI.FortSocialSidebarPanelInterface
class UFortSocialSidebarPanelInterface : public UInterface
{
public:

	static class UClass* StaticClass();
	static class UFortSocialSidebarPanelInterface* GetDefaultObj();

};

// 0x9A60 (0x9A90 - 0x30)
// Class FortniteUI.FortSocialStyle
class UFortSocialStyle : public UDataAsset
{
public:
	struct FSocialStyle                          Style;                                             // 0x30(0x9A50)(Edit, NativeAccessSpecifierPublic)
	class USocialStyleDataAsset*                 OverrideStyle;                                     // 0x9A80(0x8)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_32D9[0x8];                                     // Fixing Size Of Struct

	static class UClass* StaticClass();
	static class UFortSocialStyle* GetDefaultObj();

};

// 0x58 (0x300 - 0x2A8)
// Class FortniteUI.FortSqueegeeWidgetInjectionSlot
class UFortSqueegeeWidgetInjectionSlot : public UUserWidget
{
public:
	enum class ESqueegeeWidgetInjection          DesiredInjection;                                  // 0x2A8(0x1)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_32DB[0x7];                                     // Fixing Size After Last Property 
	struct FSqueegeeStyleParams                  StyleParams;                                       // 0x2B0(0x30)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	class UNamedSlot*                            InjectionSlot;                                     // 0x2E0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortSqueegeeWidget*                   InjectedSqueegeeWidget;                            // 0x2E8(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_32DC[0x10];                                    // Fixing Size Of Struct

	static class UClass* StaticClass();
	static class UFortSqueegeeWidgetInjectionSlot* GetDefaultObj();

};

// 0x10 (0x2E0 - 0x2D0)
// Class FortniteUI.FortSqueegeeWidget
class UFortSqueegeeWidget : public UCommonUserWidget
{
public:
	uint8                                        Pad_32DF[0x10];                                    // Fixing Size Of Struct

	static class UClass* StaticClass();
	static class UFortSqueegeeWidget* GetDefaultObj();

};

// 0x10 (0x78 - 0x68)
// Class FortniteUI.UIKitTabGroupViewModel
class UUIKitTabGroupViewModel : public UMVVMViewModelBase
{
public:
	TArray<class UUIKitSelectableButtonViewModel*> Tabs;                                              // 0x68(0x10)(Edit, BlueprintVisible, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UUIKitTabGroupViewModel* GetDefaultObj();

};

// 0x18 (0x90 - 0x78)
// Class FortniteUI.FortTabGroupViewModel
class UFortTabGroupViewModel : public UUIKitTabGroupViewModel
{
public:
	TArray<class UUIKitSelectableButtonViewModel*> UnfilteredTabs;                                    // 0x78(0x10)(ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	bool                                         bIsShowingHome;                                    // 0x88(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_32E8[0x7];                                     // Fixing Size Of Struct

	static class UClass* StaticClass();
	static class UFortTabGroupViewModel* GetDefaultObj();

};

// 0x20 (0x88 - 0x68)
// Class FortniteUI.UIKitSelectableButtonViewModel
class UUIKitSelectableButtonViewModel : public UMVVMViewModelBase
{
public:
	class FText                                  Label;                                             // 0x68(0x18)(Edit, BlueprintVisible, NativeAccessSpecifierPrivate)
	class UTexture2D*                            Icon;                                              // 0x80(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UUIKitSelectableButtonViewModel* GetDefaultObj();

};

// 0x148 (0x1D0 - 0x88)
// Class FortniteUI.FortTabViewModel
class UFortTabViewModel : public UUIKitSelectableButtonViewModel
{
public:
	bool                                         bEnabled;                                          // 0x88(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bCollapsed;                                        // 0x89(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_32FC[0x6];                                     // Fixing Size After Last Property 
	struct FFortTopBarTabButtonInfo              TabInfo;                                           // 0x90(0x140)(Transient, Protected, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UFortTabViewModel* GetDefaultObj();

	enum class EFortUIFeature GetLinkedUIFeature();
	enum class EFFortTopBarTabButtonGroup GetButtonGroup();
	enum class EFortBangType GetBangType();
};

// 0x0 (0x28 - 0x28)
// Class FortniteUI.FortTimespanDataSource
class UFortTimespanDataSource : public UInterface
{
public:

	static class UClass* StaticClass();
	static class UFortTimespanDataSource* GetDefaultObj();

	void RemoveOnChangeDelegate(FDelegateProperty_& InDelegate);
	struct FTimespan GetValue();
	void AddOnChangeDelegate(FDelegateProperty_& InDelegate);
};

// 0x0 (0x28 - 0x28)
// Class FortniteUI.FortUIGameFeatureAction
class UFortUIGameFeatureAction : public UGameFeatureAction
{
public:

	static class UClass* StaticClass();
	static class UFortUIGameFeatureAction* GetDefaultObj();

};

// 0x78 (0xA0 - 0x28)
// Class FortniteUI.FortUIGameFeatureAction_SetLobbyData
class UFortUIGameFeatureAction_SetLobbyData : public UFortUIGameFeatureAction
{
public:
	struct FFrontendLobbyData                    FrontendLobbyData;                                 // 0x28(0x78)(Edit, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UFortUIGameFeatureAction_SetLobbyData* GetDefaultObj();

};

// 0x28 (0x58 - 0x30)
// Class FortniteUI.FortUISpecialEventSubsystem
class UFortUISpecialEventSubsystem : public UGameInstanceSubsystem
{
public:
	FMulticastInlineDelegateProperty_            OnNewUISpecialEventState;                          // 0x30(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnTemporarySpecialUIEvent;                         // 0x40(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                        Pad_3350[0x8];                                     // Fixing Size Of Struct

	static class UClass* StaticClass();
	static class UFortUISpecialEventSubsystem* GetDefaultObj();

	void SpecialUIEventDelegate__DelegateSignature(enum class EFortUISpecialEvents InEventName);
	void SetCurrentUISpecialEventState(enum class EFortUISpecialEvents InNewEventState);
	enum class EFortUISpecialEvents GetCurrentUIEventState();
	void CallTemporarySpecialUIEvent(enum class EFortUISpecialEvents InNewTemporaryEvent);
};

// 0xEC0 (0xEF0 - 0x30)
// Class FortniteUI.FortUIStyleDefinitionAsset
class UFortUIStyleDefinitionAsset : public UDataAsset
{
public:
	struct FFortUIStyleDefinition                StyleDefinition;                                   // 0x30(0xEC0)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UFortUIStyleDefinitionAsset* GetDefaultObj();

};

// 0x10 (0x2B8 - 0x2A8)
// Class FortniteUI.FortUserWidget
class UFortUserWidget : public UUserWidget
{
public:
	uint8                                        Pad_3361[0x8];                                     // Fixing Size After Last Property 
	bool                                         bConsumePointerInput;                              // 0x2B0(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_3362[0x7];                                     // Fixing Size Of Struct

	static class UClass* StaticClass();
	static class UFortUserWidget* GetDefaultObj();

};

// 0x0 (0x2B8 - 0x2B8)
// Class FortniteUI.FortUserChoiceWidget
class UFortUserChoiceWidget : public UFortUserWidget
{
public:

	static class UClass* StaticClass();
	static class UFortUserChoiceWidget* GetDefaultObj();

	void SetChoices(struct FChoiceData& ChoiceItems);
};

// 0xF0 (0x120 - 0x30)
// Class FortniteUI.FortViewModelsManager
class UFortViewModelsManager : public UGameInstanceSubsystem
{
public:
	TMap<class UObject*, enum class EFortViewModelsDestructionType> ViewModelCache;                                    // 0x30(0x50)(Transient, NativeAccessSpecifierPrivate)
	uint8                                        Pad_3371[0xA0];                                    // Fixing Size Of Struct

	static class UClass* StaticClass();
	static class UFortViewModelsManager* GetDefaultObj();

};

// 0x8 (0x2B0 - 0x2A8)
// Class FortniteUI.FortWeaponReticleRechargeStackBasePipBase
class UFortWeaponReticleRechargeStackBasePipBase : public UUserWidget
{
public:
	class UImage*                                ImagePip;                                          // 0x2A8(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UFortWeaponReticleRechargeStackBasePipBase* GetDefaultObj();

	void SetPipProgressColor(const struct FLinearColor& Color, class FName PipColorMatParamName);
	void SetImagePip(class UImage* Image);
	void SetFillPercent(float FillPercent, class FName PipPercentMatParamName);
};

// 0x10 (0x2B8 - 0x2A8)
// Class FortniteUI.FortWeaponReticleRechargeStackBasePipCollectionBase
class UFortWeaponReticleRechargeStackBasePipCollectionBase : public UUserWidget
{
public:
	class UDynamicEntryBox*                      PipDynamicEntryBox;                                // 0x2A8(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                        CurrentCount;                                      // 0x2B0(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_33C9[0x4];                                     // Fixing Size Of Struct

	static class UClass* StaticClass();
	static class UFortWeaponReticleRechargeStackBasePipCollectionBase* GetDefaultObj();

	void UpdateRemainingRechargeTimeAtIndex(float FillPercent, int32 Index, class FName PipPercentMatParamName, bool ShouldSetPipColor, const struct FLinearColor& NotReadyColor, const struct FLinearColor& ReadyColor, class FName PipColorMatParamName);
	void UpdateRemainingRechargeTime(float TimeRemaining, float TotalDuration, class FName PipPercentMatParamName, bool ShouldSetPipColor, const struct FLinearColor& NotReadyColor, const struct FLinearColor& ReadyColor, class FName PipColorMatParamName);
	void SetPipColor(float Progress, int32 Index, const struct FLinearColor& NotReadyColor, const struct FLinearColor& ReadyColor, class FName PipColorMatParamName);
	void SetDynamicEntryBox(class UDynamicEntryBox* DynamicEntryBox);
	class UDynamicEntryBox* GetDynamicEntryBox();
	int32 GetCurrentCount();
};

// 0x8 (0x318 - 0x310)
// Class FortniteUI.GamePhaseWidget
class UGamePhaseWidget : public UFortHUDElementWidget
{
public:
	uint8                                        Pad_33DF[0x8];                                     // Fixing Size Of Struct

	static class UClass* StaticClass();
	static class UGamePhaseWidget* GetDefaultObj();

	void OnMinigameStateChanged(class UFortMinigame* Minigame, enum class EFortMinigameState NewMinigameState);
	void OnMinigameReady(class UFortMinigame* Minigame);
	void MinigameStateChangedEvent(class UFortMinigame* Minigame, enum class EFortMinigameState NewMinigameState);
	void HandleGamePhaseStepChanged(TScriptInterface<class UFortSafeZoneInterface>& InSafeZoneInterface, enum class EAthenaGamePhaseStep GamePhaseStep);
};

// 0x0 (0x28 - 0x28)
// Class FortniteUI.HudBindingCheckInterface
class UHudBindingCheckInterface : public UInterface
{
public:

	static class UClass* StaticClass();
	static class UHudBindingCheckInterface* GetDefaultObj();

	void ShowBindWidgets();
	bool ShouldShowPromptInHud();
	void HideBindWidgets();
	void GetBindActions(TArray<class FName>* OutActions);
};

// 0x48 (0x318 - 0x2D0)
// Class FortniteUI.HUDLayoutToolV2_WidgetPreview
class UHUDLayoutToolV2_WidgetPreview : public UCommonUserWidget
{
public:
	class UCreateHUDWidgetDragDropOperation*     CreateHUDWidgetOperation;                          // 0x2D0(0x8)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_33F2[0x10];                                    // Fixing Size After Last Property 
	float                                        DragDistanceThresholdMillimeters;                  // 0x2E8(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_33F3[0x1C];                                    // Fixing Size After Last Property 
	class UCommonTextBlock*                      TextBlock_InstancesLeftCounter;                    // 0x308(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UBorder*                               Border_Background;                                 // 0x310(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UHUDLayoutToolV2_WidgetPreview* GetDefaultObj();

	void HandleOperationDrop(class UDragDropOperation* Operation);
};

// 0x8 (0x320 - 0x318)
// Class FortniteUI.HUDLayoutToolV2_AutorunPreview
class UHUDLayoutToolV2_AutorunPreview : public UHUDLayoutToolV2_WidgetPreview
{
public:
	class UOverlay*                              Overlay_AutorunLockZone;                           // 0x318(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UHUDLayoutToolV2_AutorunPreview* GetDefaultObj();

};

// 0x10 (0x328 - 0x318)
// Class FortniteUI.HUDLayoutToolV2_MoveStickPreview
class UHUDLayoutToolV2_MoveStickPreview : public UHUDLayoutToolV2_WidgetPreview
{
public:
	class UOverlay*                              Overlay_ImprovedMoveStick;                         // 0x318(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UOverlay*                              Overlay_OriginalMoveStick;                         // 0x320(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UHUDLayoutToolV2_MoveStickPreview* GetDefaultObj();

};

// 0x0 (0x1470 - 0x1470)
// Class FortniteUI.RebootRallyQRCode
class URebootRallyQRCode : public UCommonButtonBase
{
public:

	static class UClass* StaticClass();
	static class URebootRallyQRCode* GetDefaultObj();

	void SetIsInvite(bool bIsInvite);
};

// 0x10 (0x1480 - 0x1470)
// Class FortniteUI.SidebarListEmptyPanelButton
class USidebarListEmptyPanelButton : public UCommonButtonBase
{
public:
	class UCommonTextBlock*                      ButtonText;                                        // 0x1470(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3405[0x8];                                     // Fixing Size Of Struct

	static class UClass* StaticClass();
	static class USidebarListEmptyPanelButton* GetDefaultObj();

};

// 0x18 (0x48 - 0x30)
// Class FortniteUI.AthenaSpatialStyleChallengeScreenData
class UAthenaSpatialStyleChallengeScreenData : public UDataAsset
{
public:
	TArray<struct FAthenaSpatialStyleCharacterData> CharacterStyleChallenges;                          // 0x30(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	class UFortChallengeBundleScheduleDefinition* CharacterStyleChallengesSchedule;                  // 0x40(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UAthenaSpatialStyleChallengeScreenData* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class FortniteUI.SpatialWidgetInterface
class USpatialWidgetInterface : public UInterface
{
public:

	static class UClass* StaticClass();
	static class USpatialWidgetInterface* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class FortniteUI.FortSubscriptionContentInterface
class UFortSubscriptionContentInterface : public UInterface
{
public:

	static class UClass* StaticClass();
	static class UFortSubscriptionContentInterface* GetDefaultObj();

};

// 0x8 (0xC10 - 0xC08)
// Class FortniteUI.ThresholdScrollBox
class UThresholdScrollBox : public UScrollBox
{
public:
	float                                        ScrollThreshold;                                   // 0xC08(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_3415[0x4];                                     // Fixing Size Of Struct

	static class UClass* StaticClass();
	static class UThresholdScrollBox* GetDefaultObj();

};

// 0x20 (0x80 - 0x60)
// Class FortniteUI.FortMobileHUDWidgetCustomPropertyModel_Scalar
class UFortMobileHUDWidgetCustomPropertyModel_Scalar : public UFortMobileHUDWidgetCustomPropertyModel
{
public:
	double                                       DefaultValue;                                      // 0x60(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	double                                       PropertyLowerBound;                                // 0x68(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	double                                       PropertyUpperBound;                                // 0x70(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	double                                       PropertyStepSize;                                  // 0x78(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UFortMobileHUDWidgetCustomPropertyModel_Scalar* GetDefaultObj();

};

// 0x0 (0x80 - 0x80)
// Class FortniteUI.FortMobileHUDWidgetCustomPropertyModel_Scalar_AutorunPreference
class UFortMobileHUDWidgetCustomPropertyModel_Scalar_AutorunPreference : public UFortMobileHUDWidgetCustomPropertyModel_Scalar
{
public:

	static class UClass* StaticClass();
	static class UFortMobileHUDWidgetCustomPropertyModel_Scalar_AutorunPreference* GetDefaultObj();

};

// 0x30 (0x2D8 - 0x2A8)
// Class FortniteUI.UIKitBlock
class UUIKitBlock : public UUserWidget
{
public:
	struct FUIKitBlockTiming                     TransitionTiming;                                  // 0x2A8(0x2C)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_3454[0x4];                                     // Fixing Size Of Struct

	static class UClass* StaticClass();
	static class UUIKitBlock* GetDefaultObj();

	void SetBlockTiming(struct FUIKitBlockTiming& Timing);
	void RequestTransition(enum class EUIKitBlockVisualState State);
	void RequestInstantTransition(enum class EUIKitBlockInstantTransitionState State);
	void PlayTransition(class UWidgetAnimation* Animation, bool bPlayForward);
	void OnTransitionUnhoveredRequested();
	void OnTransitionUnfocusedRequested();
	void OnTransitionSelectedRequested();
	void OnTransitionReleasedRequested();
	void OnTransitionPressedRequested();
	void OnTransitionHoveredRequested();
	void OnTransitionFocusedRequested();
	void OnTransitionEnabledRequested();
	void OnTransitionDisabledRequested();
	void OnTransitionDeselectedIdleRequested();
	void OnTransitionDeselectedFocusedRequested();
	void OnInstantTransitionToUnlocked();
	void OnInstantTransitionToSelected();
	void OnInstantTransitionToLocked();
	void OnInstantTransitionToEnabled();
	void OnInstantTransitionToDisabled();
	void OnInstantTransitionToDeselected();
	float GetTransitionTime(enum class EUIKitBlockVisualState State);
};

// 0x0 (0x28 - 0x28)
// Class FortniteUI.UIKitBlueprintFunctionLibrary
class UUIKitBlueprintFunctionLibrary : public UBlueprintFunctionLibrary
{
public:

	static class UClass* StaticClass();
	static class UUIKitBlueprintFunctionLibrary* GetDefaultObj();

	void PlayAnimationDuringTime(class UUserWidget* Widget, class UWidgetAnimation* Animation, float PlayTime, bool bPlayForward);
};

// 0x40 (0x428 - 0x3E8)
// Class FortniteUI.UIKitTabGroup
class UUIKitTabGroup : public UCommonActivatableWidget
{
public:
	class UCommonButtonGroupBase*                ButtonGroup_Tabs;                                  // 0x3E8(0x8)(BlueprintVisible, ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3495[0x28];                                    // Fixing Size After Last Property 
	TArray<class UUIKitSelectableButtonViewModel*> LocalTabsViewModels;                               // 0x418(0x10)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UUIKitTabGroup* GetDefaultObj();

	void SetInputActions(const struct FDataTableRowHandle& NextTab, const struct FDataTableRowHandle& PreviousTab);
	void HandlePreviousTabInput();
	void HandleNextTabInput();
};

// 0x8 (0x2D8 - 0x2D0)
// Class FortniteUI.FortActiveFriendsViolator
class UFortActiveFriendsViolator : public UCommonUserWidget
{
public:
	class UCommonTextBlock*                      Text_ActivePlayerCount;                            // 0x2D0(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UFortActiveFriendsViolator* GetDefaultObj();

};

// 0xB0 (0x498 - 0x3E8)
// Class FortniteUI.FortServerBrowser
class UFortServerBrowser : public UCommonActivatableWidget
{
public:
	uint8                                        Pad_349A[0x10];                                    // Fixing Size After Last Property 
	TArray<class UFortServerBrowserActionData*>  SupportedActions;                                  // 0x3F8(0x10)(Edit, ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TArray<TSoftObjectPtr<class UFortServerBrowserActionData>> ExcludedSupportedActions;                          // 0x408(0x10)(ZeroConstructor, Config, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UFortServerBrowserActionData> DefaultSelectedAction;                             // 0x418(0x20)(Edit, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortServerBrowserListView*            ListView_ServerBrowser;                            // 0x438(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                   NavigateLeftInputAction;                           // 0x440(0x10)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                   NavigateRightInputAction;                          // 0x450(0x10)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                        Pad_349F[0x10];                                    // Fixing Size After Last Property 
	class UCommonButtonLegacy*                   Button_Cancel;                                     // 0x470(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonLegacy*                   Button_CloseTouch;                                 // 0x478(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_34A0[0x18];                                    // Fixing Size Of Struct

	static class UClass* StaticClass();
	static class UFortServerBrowser* GetDefaultObj();

};

// 0x68 (0x500 - 0x498)
// Class FortniteUI.FortServerBrowserCreative
class UFortServerBrowserCreative : public UFortServerBrowser
{
public:
	TSoftObjectPtr<class UFortServerBrowserActionData> DefaultActionIfDiscoveryDisabled;                  // 0x498(0x20)(Edit, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_34A3[0x48];                                    // Fixing Size Of Struct

	static class UClass* StaticClass();
	static class UFortServerBrowserCreative* GetDefaultObj();

};

// 0x68 (0x90 - 0x28)
// Class FortniteUI.FortServerBrowserHelper
class UFortServerBrowserHelper : public UObject
{
public:
	uint8                                        Pad_34A5[0x68];                                    // Fixing Size Of Struct

	static class UClass* StaticClass();
	static class UFortServerBrowserHelper* GetDefaultObj();

};

// 0x148 (0x3D8 - 0x290)
// Class FortniteUI.FortServerBrowserListView
class UFortServerBrowserListView : public UListViewBase
{
public:
	uint8                                        Pad_34AA[0xE8];                                    // Fixing Size After Last Property 
	enum class EOrientation                      Orientation;                                       // 0x378(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_34AB[0x3];                                     // Fixing Size After Last Property 
	float                                        EntrySpacing;                                      // 0x37C(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_34AC[0x18];                                    // Fixing Size After Last Property 
	TSubclassOf<class UFortCreativeServerInfoTile> CreativeServerInfoTileEntryClass;                  // 0x398(0x8)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UFortServerActionTile>     ServerActionTileEntryClass;                        // 0x3A0(0x8)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UFortServerActionTile>     OwnServerActionTileEntryClass;                     // 0x3A8(0x8)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UFortPlaylistSelectionActionTile> PlaylistSelectionActionTileEntryClass;             // 0x3B0(0x8)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_34AF[0x20];                                    // Fixing Size Of Struct

	static class UClass* StaticClass();
	static class UFortServerBrowserListView* GetDefaultObj();

};

// 0x18 (0x4B0 - 0x498)
// Class FortniteUI.FortServerBrowserPlayground
class UFortServerBrowserPlayground : public UFortServerBrowser
{
public:
	uint8                                        Pad_34B1[0x18];                                    // Fixing Size Of Struct

	static class UClass* StaticClass();
	static class UFortServerBrowserPlayground* GetDefaultObj();

};

// 0x8 (0x2D8 - 0x2D0)
// Class FortniteUI.FortServerInfoFriendEntry
class UFortServerInfoFriendEntry : public UCommonUserWidget
{
public:
	class UCommonTextBlock*                      Text_FriendName;                                   // 0x2D0(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UFortServerInfoFriendEntry* GetDefaultObj();

};

// 0x48 (0x1508 - 0x14C0)
// Class FortniteUI.FortServerTileBase
class UFortServerTileBase : public UCommonButtonLegacy
{
public:
	uint8                                        Pad_34B7[0x38];                                    // Fixing Size After Last Property 
	class UCommonTextBlock*                      Text_ServerWarning;                                // 0x14F8(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonLegacy*                   Button_Launch;                                     // 0x1500(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UFortServerTileBase* GetDefaultObj();

	void OnLaunchButtonEnableChanged(bool bEnableValue);
};

// 0x8 (0x1510 - 0x1508)
// Class FortniteUI.FortServerActionTile
class UFortServerActionTile : public UFortServerTileBase
{
public:
	uint8                                        Pad_34C0[0x8];                                     // Fixing Size Of Struct

	static class UClass* StaticClass();
	static class UFortServerActionTile* GetDefaultObj();

};

// 0x20 (0x1530 - 0x1510)
// Class FortniteUI.FortNamedServerActionTile
class UFortNamedServerActionTile : public UFortServerActionTile
{
public:
	class UCommonTextBlock*                      Text_ActionTitle;                                  // 0x1510(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      Text_ActionDescription;                            // 0x1518(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UImage*                                Image_Background;                                  // 0x1520(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_34D7[0x8];                                     // Fixing Size Of Struct

	static class UClass* StaticClass();
	static class UFortNamedServerActionTile* GetDefaultObj();

	void UpdateButtonText();
	bool IsActionIslandSelectType();
};

// 0x0 (0x1530 - 0x1530)
// Class FortniteUI.FortPlaylistSelectionActionTile
class UFortPlaylistSelectionActionTile : public UFortNamedServerActionTile
{
public:

	static class UClass* StaticClass();
	static class UFortPlaylistSelectionActionTile* GetDefaultObj();

};

// 0x20 (0x1528 - 0x1508)
// Class FortniteUI.FortServerInfoTileBase
class UFortServerInfoTileBase : public UFortServerTileBase
{
public:
	class UCommonTextBlock*                      Text_PlayerCount;                                  // 0x1508(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UDynamicEntryBox*                      EntryBox_ServerFriendList;                         // 0x1510(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      Text_OwnerName;                                    // 0x1518(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UVerticalBox*                          VerticalBox_Ownership;                             // 0x1520(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UFortServerInfoTileBase* GetDefaultObj();

	void RequestUpdateBackgroundImage(int32 FriendListHash);
	void OnOwnerNameUpdated();
};

// 0x18 (0x1540 - 0x1528)
// Class FortniteUI.FortCreativeServerInfoTile
class UFortCreativeServerInfoTile : public UFortServerInfoTileBase
{
public:
	class UCommonTextBlock*                      Text_FriendsPlaying;                               // 0x1528(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class URichTextBlock*                        RichText_RemainingFriends;                         // 0x1530(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_34DC[0x8];                                     // Fixing Size Of Struct

	static class UClass* StaticClass();
	static class UFortCreativeServerInfoTile* GetDefaultObj();

};

// 0x20 (0x2C8 - 0x2A8)
// Class FortniteUI.ApolloIntroShimBase
class UApolloIntroShimBase : public UUserWidget
{
public:
	uint8                                        Pad_34DD[0x20];                                    // Fixing Size Of Struct

	static class UClass* StaticClass();
	static class UApolloIntroShimBase* GetDefaultObj();

};

// 0x28 (0x58 - 0x30)
// Class FortniteUI.FortAsyncAction_CheckForStwMfaReward
class UFortAsyncAction_CheckForStwMfaReward : public UBlueprintAsyncActionBase
{
public:
	FMulticastInlineDelegateProperty_            OnCompleted;                                       // 0x30(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnFailed;                                          // 0x40(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UFortPlayerController*                 PlayerController;                                  // 0x50(0x8)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UFortAsyncAction_CheckForStwMfaReward* GetDefaultObj();

	class UFortAsyncAction_CheckForStwMfaReward* CheckForStwMfaReward(class UFortPlayerController* PlayerController);
};

// 0x60 (0x90 - 0x30)
// Class FortniteUI.FortAsyncAction_CreateWidgetAsync
class UFortAsyncAction_CreateWidgetAsync : public UBlueprintAsyncActionBase
{
public:
	FMulticastInlineDelegateProperty_            OnComplete;                                        // 0x30(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                        Pad_3515[0x50];                                    // Fixing Size Of Struct

	static class UClass* StaticClass();
	static class UFortAsyncAction_CreateWidgetAsync* GetDefaultObj();

	class UFortAsyncAction_CreateWidgetAsync* CreateWidgetAsync(class UObject* WorldContextObject, TSoftClassPtr<class UUserWidget> UserWidgetSoftClass, class UPlayerController* OwningPlayer, bool bSuspendInputUntilComplete);
};

// 0x40 (0x70 - 0x30)
// Class FortniteUI.FortAsyncAction_LoadBannerAsset
class UFortAsyncAction_LoadBannerAsset : public UBlueprintAsyncActionBase
{
public:
	FMulticastInlineDelegateProperty_            BannerAssetLoadComplete;                           // 0x30(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                        Pad_3536[0x30];                                    // Fixing Size Of Struct

	static class UClass* StaticClass();
	static class UFortAsyncAction_LoadBannerAsset* GetDefaultObj();

	class UFortAsyncAction_LoadBannerAsset* AsyncLoadBannerAsset(class UObject* WorldContextObject, TSoftObjectPtr<class UObject> AssetToLoad, class UMaterialInstanceDynamic* MIDRef, class FName BannerColorName);
};

// 0x28 (0x58 - 0x30)
// Class FortniteUI.FortAsyncAction_LoadCurrentSubgameProfiles
class UFortAsyncAction_LoadCurrentSubgameProfiles : public UBlueprintAsyncActionBase
{
public:
	FMulticastInlineDelegateProperty_            OnSuccess;                                         // 0x30(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnFailure;                                         // 0x40(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UFortPlayerController*                 PlayerController;                                  // 0x50(0x8)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UFortAsyncAction_LoadCurrentSubgameProfiles* GetDefaultObj();

	class UFortAsyncAction_LoadCurrentSubgameProfiles* LoadCurrentSubgameProfiles(class UFortPlayerController* PlayerController);
};

// 0x190 (0x1C0 - 0x30)
// Class FortniteUI.FortAsyncAction_ShowConfirmation_NUI
class UFortAsyncAction_ShowConfirmation_NUI : public UBlueprintAsyncActionBase
{
public:
	FMulticastInlineDelegateProperty_            DialogResult;                                      // 0x30(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UObject*                               WorldContextObject;                                // 0x40(0x8)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortLocalPlayer*                      TargetLocalPlayer;                                 // 0x48(0x8)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FFortDialogDescription_NUI            Description;                                       // 0x50(0x160)(ContainsInstancedReference, NativeAccessSpecifierPrivate)
	uint8                                        Pad_356A[0x10];                                    // Fixing Size Of Struct

	static class UClass* StaticClass();
	static class UFortAsyncAction_ShowConfirmation_NUI* GetDefaultObj();

	class UFortAsyncAction_ShowConfirmation_NUI* ShowSimpleConfirmationDialog_NUI(class UObject* InWorldContextObject, const struct FSlateBrush& Icon, class FText Title, class FText Message, bool bShowConfirm, bool bShowDecline, class UWidget* AdditionalContent, class UWidget* LeftAdditionalContent, class ULocalPlayer* TargetPlayer);
	class UFortAsyncAction_ShowConfirmation_NUI* ShowSimpleConfirmationDialog_CustomInput(class UObject* InWorldContextObject, const struct FSlateBrush& Icon, class FText Title, class FText Message, class FName ConfirmAction, class FName DeclineAction, class UWidget* AdditionalContent, class UWidget* LeftAdditionalContent, bool Cancelable, class ULocalPlayer* TargetPlayer);
	class UFortAsyncAction_ShowConfirmation_NUI* ShowConfirmationDialog_NUI(class UObject* InWorldContextObject, const struct FSlateBrush& Icon, class FText Title, class FText Message, TArray<struct FConfirmationDialogAction>& ConfirmButtonInputActions, class FName& DeclineButtonInputAction, class UWidget* AdditionalContent, class UWidget* LeftAdditionalContent, class ULocalPlayer* TargetPlayer);
};

// 0x40 (0x70 - 0x30)
// Class FortniteUI.FortAsyncAction_PushPrimaryContent
class UFortAsyncAction_PushPrimaryContent : public UBlueprintAsyncActionBase
{
public:
	FMulticastInlineDelegateProperty_            OnPrimaryContentPushed;                            // 0x30(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                        Pad_357B[0x30];                                    // Fixing Size Of Struct

	static class UClass* StaticClass();
	static class UFortAsyncAction_PushPrimaryContent* GetDefaultObj();

	class UFortAsyncAction_PushPrimaryContent* PushPrimaryContentSoftClassAsyncForPlayer(class UPlayerController* ContextPC, TSoftClassPtr<class UCommonActivatableWidget> SoftWidgetClass);
	class UFortAsyncAction_PushPrimaryContent* PushPrimaryContentSoftClassAsync(class UUserWidget* ContextWidget, TSoftClassPtr<class UCommonActivatableWidget> SoftWidgetClass);
	class UFortAsyncAction_PushPrimaryContent* PushPrimaryContentClassAsyncForPlayer(class UPlayerController* ContextPC, TSubclassOf<class UCommonActivatableWidget> WidgetClass);
	class UFortAsyncAction_PushPrimaryContent* PushPrimaryContentClassAsync(class UUserWidget* ContextWidget, TSubclassOf<class UCommonActivatableWidget> WidgetClass);
	void OnPrimaryContentPushed__DelegateSignature(class UCommonActivatableWidget* ActivatableWidget);
};

// 0x48 (0x78 - 0x30)
// Class FortniteUI.FortAsyncAction_QueueModalWidget
class UFortAsyncAction_QueueModalWidget : public UBlueprintAsyncActionBase
{
public:
	FMulticastInlineDelegateProperty_            OnModalWidgetQueued;                               // 0x30(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                        Pad_358D[0x38];                                    // Fixing Size Of Struct

	static class UClass* StaticClass();
	static class UFortAsyncAction_QueueModalWidget* GetDefaultObj();

	class UFortAsyncAction_QueueModalWidget* QueueModalWidgetSoftClassAsyncForPlayer(class UPlayerController* PlayerController, TSoftClassPtr<class UCommonActivatableWidget> SoftWidgetClass);
	class UFortAsyncAction_QueueModalWidget* QueueModalWidgetSoftClassAsyncForLocalPlayer(class ULocalPlayer* LocalPlayer, TSoftClassPtr<class UCommonActivatableWidget> SoftWidgetClass);
	class UFortAsyncAction_QueueModalWidget* QueueModalWidgetSoftClassAsync(class UUserWidget* ContextWidget, TSoftClassPtr<class UCommonActivatableWidget> SoftWidgetClass);
	class UFortAsyncAction_QueueModalWidget* QueueModalWidgetClassAsyncForPlayer(class UPlayerController* PlayerController, TSubclassOf<class UCommonActivatableWidget> WidgetClass);
	class UFortAsyncAction_QueueModalWidget* QueueModalWidgetClassAsyncForLocalPlayer(class ULocalPlayer* LocalPlayer, TSubclassOf<class UCommonActivatableWidget> WidgetClass);
	class UFortAsyncAction_QueueModalWidget* QueueModalWidgetClassAsync(class UUserWidget* ContextWidget, TSubclassOf<class UCommonActivatableWidget> WidgetClass);
	void OnModalWidgetQueued__DelegateSignature(class UCommonActivatableWidget* ActivatableWidget);
};

// 0x20 (0x2F0 - 0x2D0)
// Class FortniteUI.AthenaFPSBase
class UAthenaFPSBase : public UCommonUserWidget
{
public:
	class UCommonTextBlock*                      FPS;                                               // 0x2D0(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_3592[0x18];                                    // Fixing Size Of Struct

	static class UClass* StaticClass();
	static class UAthenaFPSBase* GetDefaultObj();

	void HandleShowFPSChanged(bool bInShowFPS);
};

// 0x10 (0x188 - 0x178)
// Class FortniteUI.AthenaMinimap
class UAthenaMinimap : public UWidget
{
public:
	struct FVector2D                             DesiredSize;                                       // 0x178(0x10)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UAthenaMinimap* GetDefaultObj();

};

// 0x0 (0x310 - 0x310)
// Class FortniteUI.AthenaRecordingBase
class UAthenaRecordingBase : public UFortHUDElementWidget
{
public:

	static class UClass* StaticClass();
	static class UAthenaRecordingBase* GetDefaultObj();

};

// 0x10 (0x2E0 - 0x2D0)
// Class FortniteUI.AthenaTemperatureBase
class UAthenaTemperatureBase : public UCommonUserWidget
{
public:
	class UTextBlock*                            Temperature;                                       // 0x2D0(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_359B[0x8];                                     // Fixing Size Of Struct

	static class UClass* StaticClass();
	static class UAthenaTemperatureBase* GetDefaultObj();

	void StopTimer();
	void StartTimer();
};

// 0x20 (0x548 - 0x528)
// Class FortniteUI.AthenaLoadingScreenPreviewPanelBase
class UAthenaLoadingScreenPreviewPanelBase : public UAthenaLoadingScreenPreviewPanel
{
public:
	class UNativeWidgetHost*                     LoadingScreenSlot;                                 // 0x528(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_359E[0x8];                                     // Fixing Size After Last Property 
	class UCommonButtonBase*                     Button_Close;                                      // 0x538(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                     Button_CloseTouch;                                 // 0x540(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UAthenaLoadingScreenPreviewPanelBase* GetDefaultObj();

};

// 0x8 (0x550 - 0x548)
// Class FortniteUI.ApolloIntroLoadingPanel
class UApolloIntroLoadingPanel : public UAthenaLoadingScreenPreviewPanelBase
{
public:
	class UFortPlaylistAthena*                   ApolloIntroPlaylist;                               // 0x548(0x8)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UApolloIntroLoadingPanel* GetDefaultObj();

};

// 0x18 (0x328 - 0x310)
// Class FortniteUI.AthenaAIKillsBase
class UAthenaAIKillsBase : public UFortHUDElementWidget
{
public:
	class UTextBlock*                            KillsText;                                         // 0x310(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UObject*                               KillsSource;                                       // 0x318(0x8)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bCustomKillSource;                                 // 0x320(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_35B1[0x7];                                     // Fixing Size Of Struct

	static class UClass* StaticClass();
	static class UAthenaAIKillsBase* GetDefaultObj();

	void SetKillsSourcePlayerState(class UFortPlayerStateAthena* InPlayerState);
	void SetKillsSourcePlayerController(class UFortPlayerControllerAthena* InPlayerController);
};

// 0x20 (0x330 - 0x310)
// Class FortniteUI.AthenaAvailableSquadSlotsListBase
class UAthenaAvailableSquadSlotsListBase : public UFortHUDElementWidget
{
public:
	int32                                        MaxNumberOfAvailableSquadSlots;                    // 0x310(0x4)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bAlwaysDisplayTopEntryAsDetailed;                  // 0x314(0x1)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_35DE[0xB];                                     // Fixing Size After Last Property 
	class UDynamicEntryBox*                      EntryBox_AvailableSlotsList;                       // 0x320(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaPlayerViewModel*                CachedPlayerVM;                                    // 0x328(0x8)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaAvailableSquadSlotsListBase* GetDefaultObj();

	void UpdateSquadFromMinigameOptionChange();
	void UpdateIsTeamMiniGameOnMinigameVolumeChanged(class UFortVolume* Volume);
	void UpdateIsTeamMiniGameOnGameStateChanged(class UFortMinigame* Minigame, enum class EFortMinigameState MinigameState);
	void HandleSquadMemberDisconnected(class UFortPlayerStateAthena* Player);
	void HandlePlayerUniqueIdReplicated(struct FUniqueNetIdRepl& UniqueID);
	void HandlePlayerExitVolume(class UPlayerState* ClientPlayerState, class UFortVolume* Volume);
	void HandlePlayerEnterVolume(class UPlayerState* ClientPlayerState, class UFortVolume* Volume);
	void HandleGameMemberChanged(uint8 InSquadId, uint8 InTeamIndex, class UFortPlayerStateAthena* ChangedPS);
};

// 0x8 (0x318 - 0x310)
// Class FortniteUI.AthenaAvailableSquadSlotsListEntryBase
class UAthenaAvailableSquadSlotsListEntryBase : public UFortHUDElementWidget
{
public:
	enum class EAvailableSquadSlotsListEntryState CurrentEntryState;                                 // 0x310(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_35E2[0x7];                                     // Fixing Size Of Struct

	static class UClass* StaticClass();
	static class UAthenaAvailableSquadSlotsListEntryBase* GetDefaultObj();

	void BP_OnEntryStateUpdated(enum class EAvailableSquadSlotsListEntryState NewEntryState);
};

// 0xA8 (0x5C8 - 0x520)
// Class FortniteUI.AthenaCareerScreen
class UAthenaCareerScreen : public UCommonActivatablePanelLegacy
{
public:
	TSoftClassPtr<class UAthenaLeaderboardScreenBase> LeaderboardsScreenClass;                           // 0x520(0x20)(Edit, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftClassPtr<class UAthenaReplayBrowserScreenBase> ReplayBrowserScreenClass;                          // 0x540(0x20)(Edit, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                   BackToSocialTabInputActionRowHandle;               // 0x560(0x10)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	class UCommonTextBlock*                      Text_AccountLevel;                                 // 0x570(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                     Button_Leaderboards;                               // 0x578(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                     Button_Replays;                                    // 0x580(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaFeatTimelineListView*           ListView_FeatTimeline;                             // 0x588(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      Text_ChapterContext;                               // 0x590(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UBacchusCloseButton*                   Button_TouchClose;                                 // 0x598(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      Text_MobileTabLabel;                               // 0x5A0(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UImage*                                Image_LeftFill;                                    // 0x5A8(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UImage*                                Image_RightFill;                                   // 0x5B0(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UImage*                                Image_Gradient;                                    // 0x5B8(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_35F4[0x8];                                     // Fixing Size Of Struct

	static class UClass* StaticClass();
	static class UAthenaCareerScreen* GetDefaultObj();

	void ShowFeats(bool bHasCompletedFeats);
};

// 0x8 (0x2B0 - 0x2A8)
// Class FortniteUI.AthenaChallengeEntry
class UAthenaChallengeEntry : public UUserWidget
{
public:
	class UCommonRichTextBlock*                  Text_CurrentTask;                                  // 0x2A8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UAthenaChallengeEntry* GetDefaultObj();

};

// 0xA8 (0x3B8 - 0x310)
// Class FortniteUI.AthenaChallengesWidget
class UAthenaChallengesWidget : public UFortHUDElementWidget
{
public:
	uint8                                        Pad_3603[0x40];                                    // Fixing Size After Last Property 
	class UCommonTextBlock*                      Text_Challenges;                                   // 0x350(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDynamicEntryBox*                      DynamicEntryBox_ChallengeEntries;                  // 0x358(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_3604[0x50];                                    // Fixing Size After Last Property 
	struct FFortPrioritizedWidgetData            PrioritizedWidgetData;                             // 0x3B0(0x2)(Edit, BlueprintVisible, NoDestructor, Protected, NativeAccessSpecifierProtected)
	bool                                         bXPSystemRequiredForChallenges;                    // 0x3B2(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_3605[0x5];                                     // Fixing Size Of Struct

	static class UClass* StaticClass();
	static class UAthenaChallengesWidget* GetDefaultObj();

	bool IsXPSystemRequiredForChallenges();
	void HandleDisplayDynamicQuestUpdate(class UFortQuestObjectiveInfo* QuestObjective, bool DisplayStatusUpdate, bool DisplayAnnouncementUpdate);
	void BP_WidgetIsFinished();
	void BP_OnWidgetActivated();
};

// 0x148 (0x530 - 0x3E8)
// Class FortniteUI.AthenaCollectionScreenContainer
class UAthenaCollectionScreenContainer : public UCommonActivatableWidget
{
public:
	uint8                                        Pad_360B[0x20];                                    // Fixing Size After Last Property 
	struct FAthenaMapScreenContainerTabInfo      MapTabInfo;                                        // 0x408(0x48)(Edit, NativeAccessSpecifierPublic)
	class UCommonVisibilitySwitcher*             VisibilitySwitcher_Content;                        // 0x450(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FAthenaCollectionScreenContainerTabInfo> TabInfos;                                          // 0x458(0x10)(Edit, ZeroConstructor, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                   NextTabInputAction;                                // 0x468(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                   PreviousTabInputAction;                            // 0x478(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPrivate)
	class UDynamicEntryBox*                      EntryBox_TabButtons;                               // 0x488(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      Text_TabTitle;                                     // 0x490(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<struct FAthenaCollectionScreenContainerTabInfo> ActiveTabInfos;                                    // 0x498(0x10)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	uint8                                        Pad_360E[0x88];                                    // Fixing Size Of Struct

	static class UClass* StaticClass();
	static class UAthenaCollectionScreenContainer* GetDefaultObj();

	void EnableTabActions();
	void DisableTabActions();
	void BP_OnShowTabsSet(bool bShowTabs);
};

// 0x60 (0x1520 - 0x14C0)
// Class FortniteUI.AthenaCollectionScreenContainerTabButton
class UAthenaCollectionScreenContainerTabButton : public UCommonButtonLegacy
{
public:
	class UCommonLazyImage*                      LazyImage_Icon;                                    // 0x14C0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                CollectionType;                                    // 0x14C8(0x10)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FVector2D                             ImageSize_Mobile;                                  // 0x14D8(0x10)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FText                                  TabTitle;                                          // 0x14E8(0x18)(NativeAccessSpecifierPrivate)
	struct FGameplayTagContainer                 CategoryTags;                                      // 0x1500(0x20)(NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaCollectionScreenContainerTabButton* GetDefaultObj();

	void SetIcon(TSoftObjectPtr<class UObject> LazyObject);
	void BP_ShowBang(bool bShow);
};

// 0x48 (0x358 - 0x310)
// Class FortniteUI.AthenaCommonPrioritizedWidget
class UAthenaCommonPrioritizedWidget : public UFortHUDElementWidget
{
public:
	uint8                                        Pad_361B[0x40];                                    // Fixing Size After Last Property 
	bool                                         bAutoManagePriorityByVisibility;                   // 0x350(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FFortPrioritizedWidgetData            PrioritizationData;                                // 0x351(0x2)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_361C[0x5];                                     // Fixing Size Of Struct

	static class UClass* StaticClass();
	static class UAthenaCommonPrioritizedWidget* GetDefaultObj();

	void OnStompFailed();
	void OnStompedByOtherWidget();
	void K2_OnBecomeInactive();
	void K2_OnBecomeActive();
};

// 0x610 (0x920 - 0x310)
// Class FortniteUI.AthenaCompassBase
class UAthenaCompassBase : public UFortHUDElementWidget
{
public:
	class UMaterialInstanceDynamic*              CompassMaterial;                                   // 0x310(0x8)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UImage*                                Image_Compass;                                     // 0x318(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FSlateBrush                           MarkerBrush;                                       // 0x320(0xC0)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FSlateBrush                           HeadingIndicatorBrush;                             // 0x3E0(0xC0)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FSlateBrush                           StormIndicatorBrush;                               // 0x4A0(0xC0)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	float                                        MarkerVerticalOffset;                              // 0x560(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        DistanceTextVerticalOffset;                        // 0x564(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        DistanceTextHorizontalOffset;                      // 0x568(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_3626[0x4];                                     // Fixing Size After Last Property 
	struct FSlateFontInfo                        HeadingFont;                                       // 0x570(0x58)(Edit, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FSlateFontInfo                        DistanceTextFont;                                  // 0x5C8(0x58)(Edit, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FSlateBrush                           TeammateGunshotIndicatorBrush;                     // 0x620(0xC0)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FSlateBrush                           EnemyGunshotIndicatorBrush;                        // 0x6E0(0xC0)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	float                                        TimeToShowGunshotIndicators;                       // 0x7A0(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_362B[0x4];                                     // Fixing Size After Last Property 
	class UCurveFloat*                           GunshotIndicatorScaleOverTime;                     // 0x7A8(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCurveFloat*                           GunshotIndicatorScaleByStrength;                   // 0x7B0(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCurveFloat*                           GunshotIndicatorAlphaOverTime;                     // 0x7B8(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCurveFloat*                           GunshotIndicatorAlphaByHeading;                    // 0x7C0(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_362F[0x8];                                     // Fixing Size After Last Property 
	struct FSlateBrush                           DefaultPinnedQuestIconBrush;                       // 0x7D0(0xC0)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	float                                        PinnedQuestAlphaRotCutoff;                         // 0x890(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        PinnedQuestDistanceRotCutoff;                      // 0x894(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        PinnedQuestIconVerticalOffset;                     // 0x898(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        PinnedQuestDistanceTextVerticalOffset;             // 0x89C(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FSlateFontInfo                        PinnedQuestDistanceTextFont;                       // 0x8A0(0x58)(Edit, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_3630[0x28];                                    // Fixing Size Of Struct

	static class UClass* StaticClass();
	static class UAthenaCompassBase* GetDefaultObj();

};

// 0x80 (0x468 - 0x3E8)
// Class FortniteUI.AthenaConfirmationWindow
class UAthenaConfirmationWindow : public UCommonActivatableWidget
{
public:
	class UCommonTextBlock*                      Text_Title;                                        // 0x3E8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      Text_PostConfirmation;                             // 0x3F0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonRichTextBlock*                  RichText_Description;                              // 0x3F8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortLazyImage*                        Image_MainIcon;                                    // 0x400(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UDynamicEntryBox*                      EntryBox_Buttons;                                  // 0x408(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UBacchusCloseButton*                   Button_TouchClose;                                 // 0x410(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonBorder*                         Border_TapToCloseZone;                             // 0x418(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UWidgetAnimation*                      BoundAnim_PostConfirm;                             // 0x420(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                   CancelAction;                                      // 0x428(0x10)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPrivate)
	TSubclassOf<class UCommonButtonBase>         ConfirmButtonClass;                                // 0x438(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UCommonButtonBase>         DeclineButtonClass;                                // 0x440(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UCommonButtonBase>         CancelButtonClass;                                 // 0x448(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_3648[0x18];                                    // Fixing Size Of Struct

	static class UClass* StaticClass();
	static class UAthenaConfirmationWindow* GetDefaultObj();

	void OnShowConfirmationContent();
	void OnSetButtonText(class UCommonButtonBase* Button, class FText& Text);
	struct FEventReply HandleTapToCloseZoneMouseButtonDown(const struct FGeometry& MyGeometry, struct FPointerEvent& MouseEvent);
};

// 0xA8 (0x3B8 - 0x310)
// Class FortniteUI.FortActorIndicatorWidget
class UFortActorIndicatorWidget : public UFortHUDElementWidget
{
public:
	uint8                                        Pad_3656[0x8];                                     // Fixing Size After Last Property 
	class UActor*                                IndicatedActor;                                    // 0x318(0x8)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UPrimitiveComponent*                   IndicatedActorComponent;                           // 0x320(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                               RelativeLocation;                                  // 0x328(0x18)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        MaxDistance;                                       // 0x340(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bClampOnScreen;                                    // 0x344(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bShowClampToScreenArrow;                           // 0x345(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_3659[0x2];                                     // Fixing Size After Last Property 
	struct FElevationArrowData                   ElevationArrowData;                                // 0x348(0x1C)(Edit, BlueprintVisible, NoDestructor, Protected, NativeAccessSpecifierProtected)
	bool                                         bUseScreenSpacePosition;                           // 0x364(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_365A[0x3];                                     // Fixing Size After Last Property 
	struct FVector2D                             ScreenSpaceRelativeOffset;                         // 0x368(0x10)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        ScreenPriority;                                    // 0x378(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_365B[0x3C];                                    // Fixing Size Of Struct

	static class UClass* StaticClass();
	static class UFortActorIndicatorWidget* GetDefaultObj();

	void SetIndicatedActor(class UActor* NewIndicatorActor);
	void OnTargetActorChanged(class UActor* TargetedActor);
	bool IsIndicatingActor(class UActor* OtherActor);
	void Init(class UActor* TargetedActor);
	void Deinit();
};

// 0x270 (0x628 - 0x3B8)
// Class FortniteUI.AthenaMarkedActorIndicator
class UAthenaMarkedActorIndicator : public UFortActorIndicatorWidget
{
public:
	uint8                                        Pad_365F[0x30];                                    // Fixing Size After Last Property 
	struct FFortWorldMarkerData                  MarkerData;                                        // 0x3E8(0x168)(BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	struct FMarkedActorDisplayInfo               MarkerDisplay;                                     // 0x550(0xA8)(BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	class UFortMarkerDetailsTable*               DetailsTable;                                      // 0x5F8(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        FreshLargeItemShowTime;                            // 0x600(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        IndicatorDotSizeThreshold;                         // 0x604(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UWidgetSwitcher*                       Switcher_IndicatorSize;                            // 0x608(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPanelWidget*                          Panel_SmallIndicator;                              // 0x610(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPanelWidget*                          Panel_LargeIndicator;                              // 0x618(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      Text_Distance;                                     // 0x620(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaMarkedActorIndicator* GetDefaultObj();

	void OnSetMarkerData(struct FFortWorldMarkerData& FortWorldMarkerData);
};

// 0x40 (0x668 - 0x628)
// Class FortniteUI.AthenaContextTutorialIndicator
class UAthenaContextTutorialIndicator : public UAthenaMarkedActorIndicator
{
public:
	float                                        OffscreenMaxTreshold;                              // 0x628(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_3676[0x4];                                     // Fixing Size After Last Property 
	class UOverlay*                              Overlay_Icon_1;                                    // 0x630(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_3677[0x4];                                     // Fixing Size After Last Property 
	float                                        ScreenEdgePaddingSizePercent;                      // 0x63C(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_3678[0x28];                                    // Fixing Size Of Struct

	static class UClass* StaticClass();
	static class UAthenaContextTutorialIndicator* GetDefaultObj();

	void SwitchIndicatorSize();
	void SetScreenPercent(float Percent);
	void SetIndicatorText(class FText& Text);
	void PlayOutAnimation();
	void PlayInAnimation();
	void PlayBounceAnimation();
	float GetMinTreshold();
	float GetMaxTreshold();
	float GetMaxOffscreenTreshold();
	float GetCurrentDotProduct();
};

// 0x0 (0x3B8 - 0x3B8)
// Class FortniteUI.AthenaContextualChallengesWidget
class UAthenaContextualChallengesWidget : public UAthenaChallengesWidget
{
public:

	static class UClass* StaticClass();
	static class UAthenaContextualChallengesWidget* GetDefaultObj();

	bool ShouldOutroAutomatically();
	void OnResetOutroDelay();
	void OnNewContextualHeader(class FText& NewText);
	void HandleToggleFullscreenMap(bool bFullscreenMapVisible);
	void HandleNewContextualObjectives(TArray<class UFortQuestItem*>& InContextualQuests);
	float GetOutroDelay();
};

// 0x58 (0x328 - 0x2D0)
// Class FortniteUI.AthenaCosmeticUnlockingInfo
class UAthenaCosmeticUnlockingInfo : public UCommonUserWidget
{
public:
	class UCommonRichTextBlock*                  RichText_StaticUnlockingText;                      // 0x2D0(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonRichTextBlock*                  RichText_UnlockingText;                            // 0x2D8(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UProgressBar*                          ProgressBar_StepsCompleted;                        // 0x2E0(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonRichTextBlock*                  RichText_ProgressCompletion;                       // 0x2E8(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FString                                EmphasisStyle;                                     // 0x2F0(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FString                                ProgressCompletionNumericStyle;                    // 0x300(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaCosmeticItemDefinition*         CosmeticItemDef;                                   // 0x310(0x8)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_36B5[0x10];                                    // Fixing Size Of Struct

	static class UClass* StaticClass();
	static class UAthenaCosmeticUnlockingInfo* GetDefaultObj();

	void ShowUnlockingInfoForCosmeticVariant(class UAthenaCosmeticItemDefinition* InCosmeticItemDef, struct FGameplayTag& InVariantChannel, struct FGameplayTag& InVariant);
	void ShowUnlockingInfoForCosmetic(class UAthenaCosmeticItemDefinition* InCosmeticItemDef);
	void ShowUnlockingInfo(class UAthenaCosmeticItemDefinition* UnlockItem, class UFortItemDefinition* UnlockSource);
	void ShowSeasonUnlockingInfo(int32 SeasonNumber, int32 TierNumber);
	void RequestUpdateAnim();
	void RequestOutroAnim();
	void RequestIntroAnim();
	void OutroAnimFinished();
	void OnUnlockingInfoSet(bool bShowProgression);
	void HideUnlockingInfo();
};

// 0x48 (0x358 - 0x310)
// Class FortniteUI.AthenaCountdownWidgetBase
class UAthenaCountdownWidgetBase : public UFortHUDElementWidget
{
public:
	uint8                                        Pad_36D4[0x40];                                    // Fixing Size After Last Property 
	struct FFortPrioritizedWidgetData            PrioritizationData;                                // 0x350(0x2)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_36D5[0x6];                                     // Fixing Size Of Struct

	static class UClass* StaticClass();
	static class UAthenaCountdownWidgetBase* GetDefaultObj();

	void OnDisplayWarningMessage(class FText& FirstLineText, class FText& SecondLineText);
	void OnCountdownUpdate(int32 TimeRemaining, class FText& CountdownUpdateText);
	void OnCountdownStopped();
	void OnCountdownStarted(int32 TimeRemaining, class FText& CountdownIntroText);
	void OnCountdownFinished();
	void HandleGamePhaseStepChanged(TScriptInterface<class UFortSafeZoneInterface>& SafeZoneInterface, enum class EAthenaGamePhaseStep GamePhaseStep);
	void HandleCountdownUpdate(int32 TimeRemaining);
	void HandleCountdownStopped();
	void HandleCountdownStarted(int32 TimeRemaining);
	void HandleCountdownFinished();
};

// 0x48 (0x358 - 0x310)
// Class FortniteUI.AthenaCurieStatusWidget
class UAthenaCurieStatusWidget : public UFortHUDElementWidget
{
public:
	uint8                                        Pad_36F1[0x48];                                    // Fixing Size Of Struct

	static class UClass* StaticClass();
	static class UAthenaCurieStatusWidget* GetDefaultObj();

	void SetPlayerState(class UFortPlayerStateAthena* PlayerState);
	void OnPlayerStatePawnChanged();
	void OnHandleSpectatingChanged(class UFortPlayerStateZone* NewSpectatingTarget);
	void OnCurieStateRemoved(struct FGameplayTag& RemovedState);
	void OnCurieStateDetachedFromSpectator(class UObject* InOwner, const struct FCurieContainerHandle& ContainerHandle, struct FGameplayTag& ElementIdentifier);
	void OnCurieStateAttachedToSpectator(class UObject* InOwner, const struct FCurieContainerHandle& ContainerHandle, struct FGameplayTag& ElementIdentifier);
	void OnCurieStateAdded(struct FGameplayTag& AddedState);
	bool HasState(const struct FGameplayTag& CurieState);
};

// 0x138 (0x408 - 0x2D0)
// Class FortniteUI.FortItemPickerBase
class UFortItemPickerBase : public UCommonUserWidget
{
public:
	FMulticastInlineDelegateProperty_            OnSelectionChangedEvent;                           // 0x2D0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                        Pad_370C[0x18];                                    // Fixing Size After Last Property 
	FMulticastInlineDelegateProperty_            OnSelectionCommittedEvent;                         // 0x2F8(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                        Pad_370E[0x48];                                    // Fixing Size After Last Property 
	FMulticastInlineDelegateProperty_            OnItemHoveredEvent;                                // 0x350(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                        Pad_370F[0x18];                                    // Fixing Size After Last Property 
	FMulticastInlineDelegateProperty_            OnItemUnhovered;                                   // 0x378(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                        Pad_3711[0x18];                                    // Fixing Size After Last Property 
	class UFortItemTileView*                     PickerTileView;                                    // 0x3A0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UListView*                             ItemListViewWidget;                                // 0x3A8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_3713[0x10];                                    // Fixing Size After Last Property 
	bool                                         bConfirmSelectionIfAlreadySelectedAfterOneClick;   // 0x3C0(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_3714[0x7];                                     // Fixing Size After Last Property 
	TScriptInterface<class UFortItemViewContextInterface> ItemViewContext;                                   // 0x3C8(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_3715[0x30];                                    // Fixing Size Of Struct

	static class UClass* StaticClass();
	static class UFortItemPickerBase* GetDefaultObj();

	bool TryCommitSelectedItem();
	void SetSelectedItem(class UFortItem* ItemToSelect);
	bool SetSelectedIndex(int32 Index);
	void OnItemSelectionScriptDelegate__DelegateSignature(class UFortItem* SelectedItem);
	bool IsNullItemExplicitlySelected();
	class UFortItem* GetSelectedItem();
	TScriptInterface<class UFortItemListViewInterface> GetListViewInterface();
	int32 GetIndexForItem(class UFortItem* Item);
	void ClearSelection();
	void CenterSelectedItemTileWidget();
	bool CanItemBeComitted(class UFortItem* ItemToCommit);
};

// 0x168 (0x570 - 0x408)
// Class FortniteUI.AthenaCustomizationPicker
class UAthenaCustomizationPicker : public UFortItemPickerBase
{
public:
	FMulticastInlineDelegateProperty_            OnCosmeticSelectionSaving;                         // 0x408(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnCosmeticSelectionSaved;                          // 0x418(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMap<enum class EInventoryContentSortType, class FText> SortLabels;                                        // 0x428(0x50)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TArray<struct FFortAthenaItemManagementInventoryFilterTabLabelInfo> FilterTabLabelInfoArray;                           // 0x478(0x10)(Edit, EditFixedSize, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                     Button_JumpToTop;                                  // 0x488(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                     Button_TextSearch;                                 // 0x490(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                     Button_SortAndFilter;                              // 0x498(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                  CurrentFilterName;                                 // 0x4A0(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_373A[0x26];                                    // Fixing Size After Last Property 
	bool                                         bArchiveFiltering;                                 // 0x4CA(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_373B[0x5];                                     // Fixing Size After Last Property 
	class UCommonTextBlock*                      Text_SortTag;                                      // 0x4D0(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      Text_FilterTag;                                    // 0x4D8(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      Text_NumArchived;                                  // 0x4E0(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UWidget*                               Widget_ArchivedTag;                                // 0x4E8(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	enum class EAthenaCustomizationCategory      CustomizeCategory;                                 // 0x4F0(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_373F[0x3];                                     // Fixing Size After Last Property 
	int32                                        SubslotIndex;                                      // 0x4F4(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        ItemOffsetForJumpToTopButton;                      // 0x4F8(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_3740[0x4];                                     // Fixing Size After Last Property 
	class UAthenaCustomizationPickerSortAndFilterBlade* Blade_SortAndFilter;                               // 0x500(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UUserWidget*                           Tooltip_ArchiveFilter;                             // 0x508(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bAllowCommits;                                     // 0x510(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_3741[0x17];                                    // Fixing Size After Last Property 
	TArray<class UObject*>                       InitialPickerItems;                                // 0x528(0x10)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	class UFortItem*                             ItemListeningTo;                                   // 0x538(0x8)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaCosmeticAccountItem*            LocalCampaignHeroItem;                             // 0x540(0x8)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_3742[0x28];                                    // Fixing Size Of Struct

	static class UClass* StaticClass();
	static class UAthenaCustomizationPicker* GetDefaultObj();

	void SetFilter(class FName FilterName);
	void SearchText(class FText& Text);
	void OnUpdateArchiveFilterTooltipText(class FText& Text);
	void OnShowArchiveFilterTooltip(bool bShowTooltip);
	void OnSearchEnabled(bool bEnabled);
	void OnNoItemsAvailableInFilter(class FText& EmptyDisplayText);
	void OnItemsAvailableInFilter();
	void OnCosmeticChangeSaveEvent__DelegateSignature();
	bool HasSelectableTile();
	void HandleSelectedItemHasChanged(bool ItemChanged, bool AmmoChanged, bool IngredientsChanged);
	void HandleButtonTextSearchClicked();
	void HandleArchiveFilterTooltipDismissed();
	class FText GetQualifiedFilterDisplayName(enum class EAthenaFilterDisplayType InTopFilterDisplaySetting);
	void EndCustomizationCategory();
	void BP_OnUpdateNumArchivedItems(int32 InNumArchivedItems);
	void BeginCustomizationCategory(enum class EAthenaCustomizationCategory Category, int32 SubslotToEdit);
};

// 0x158 (0x428 - 0x2D0)
// Class FortniteUI.AthenaCustomizationPickerSortAndFilterBlade
class UAthenaCustomizationPickerSortAndFilterBlade : public UCommonUserWidget
{
public:
	class UWidget*                               Widget_Sorts;                                      // 0x2D0(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UWidget*                               Widget_Filters;                                    // 0x2D8(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortDynamicEntryBox*                  DynamicEntryBox_SortButtons;                       // 0x2E0(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortDynamicEntryBox*                  DynamicEntryBox_FilterButtons;                     // 0x2E8(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonGroupBase*                ButtonGroup_Sorts;                                 // 0x2F0(0x8)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonGroupBase*                ButtonGroup_Filters;                               // 0x2F8(0x8)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_3767[0x128];                                   // Fixing Size Of Struct

	static class UClass* StaticClass();
	static class UAthenaCustomizationPickerSortAndFilterBlade* GetDefaultObj();

	bool IsBladeOpen();
	void HandleCloseAnimationFinished();
	class UCommonButtonBase* GetSortButtonAtIndex(int32 DesiredIndex);
	int32 GetNumSorts();
	int32 GetNumFilters();
	class UCommonButtonBase* GetFilterButtonAtIndex(int32 DesiredIndex);
	TArray<class UUserWidget*> GetAllSortAndFilterButtons();
	void CloseBlade();
	void BP_SetSortOrFilterButtonDisplayName(class UCommonButtonBase* SortOrFilterButton, class FText& DisplayName);
	void BP_OnSortOrFilterButtonCreated(class UCommonButtonBase* NewButton);
	void BP_OnBladeOpen();
	void BP_OnBladeClose();
	void BP_OnArchiveFilteringSet(bool bEnabled);
	void BP_HighlightSortOrFilterButton(class UCommonButtonBase* SortOrFilterButton, bool bHighlight);
};

// 0x20 (0x14E0 - 0x14C0)
// Class FortniteUI.FortCosmeticItemTileButton
class UFortCosmeticItemTileButton : public UCommonButtonLegacy
{
public:
	uint8                                        Pad_376D[0x8];                                     // Fixing Size After Last Property 
	class UFortCosmeticItemCard*                 ItemWidget;                                        // 0x14C8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class UFortItem>              Item;                                              // 0x14D0(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        ItemCardWidth;                                     // 0x14D8(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        MobileScalingFactor;                               // 0x14DC(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UFortCosmeticItemTileButton* GetDefaultObj();

};

// 0x20 (0x1500 - 0x14E0)
// Class FortniteUI.AthenaCustomizationPickerTileButton
class UAthenaCustomizationPickerTileButton : public UFortCosmeticItemTileButton
{
public:
	uint8                                        Pad_377A[0x8];                                     // Fixing Size After Last Property 
	class UFortBangWrapper_NUI*                  Bang;                                              // 0x14E8(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UImage*                                Image_Favorite;                                    // 0x14F0(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UImage*                                Image_ClassIcon;                                   // 0x14F8(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaCustomizationPickerTileButton* GetDefaultObj();

	void OnUpdateExclusiveWarning(bool bShouldWarn);
	void OnChangeOwnedState(bool bOwned);
	void OnArchivedStatusUpdated(bool bShowAsArchived, bool bUseAnimations);
};

// 0x1B0 (0x708 - 0x558)
// Class FortniteUI.FortItemPreviewScreen
class UFortItemPreviewScreen : public UFortActivatablePanel
{
public:
	uint8                                        Pad_3786[0x10];                                    // Fixing Size After Last Property 
	struct FDataTableRowHandle                   ItemViewUnifiedSupportsCameraControlInputAction;   // 0x568(0x10)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                   ItemViewUnifiedZoomInputAction;                    // 0x578(0x10)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                   ItemViewZoomOutInputAction;                        // 0x588(0x10)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                   ItemViewZoomInInputAction;                         // 0x598(0x10)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                   ItemViewRotateInputAction;                         // 0x5A8(0x10)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	class UWidgetAnimation*                      AnimationToHideItemInfo;                           // 0x5B8(0x8)(BlueprintVisible, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bAutoShowDetails;                                  // 0x5C0(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bItemDetailsHidden;                                // 0x5C1(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_378C[0x2];                                     // Fixing Size After Last Property 
	float                                        HideItemInfoHeaderDurationSecs;                    // 0x5C4(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_378D[0x8];                                     // Fixing Size After Last Property 
	bool                                         bAllowItemRotation;                                // 0x5D0(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bAllowItemZooming;                                 // 0x5D1(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	enum class EFrontEndCamera                   FrontEndCamera;                                    // 0x5D2(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_378E[0x1];                                     // Fixing Size After Last Property 
	struct FGameplayTag                          PreviewSceneChangerTag;                            // 0x5D4(0x4)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FGameplayTag                          PreviewSceneChangerOverrideTag;                    // 0x5D8(0x4)(Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_378F[0x4];                                     // Fixing Size After Last Property 
	class UFortItemPreviewSceneChanger*          PreviewSceneChanger;                               // 0x5E0(0x8)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortItemView*                         ItemViewObject;                                    // 0x5E8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, InstancedReference, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        CameraEntryTransitionDuration;                     // 0x5F0(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_3794[0x4];                                     // Fixing Size After Last Property 
	class UCurveFloat*                           CameraEntryTransitionCurve;                        // 0x5F8(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_3795[0x80];                                    // Fixing Size After Last Property 
	class UWidget*                               Widget_CameraFrame;                                // 0x680(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                     Button_PreviewAction;                              // 0x688(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                     Button_PreviewAction1;                             // 0x690(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                     Button_Camera;                                     // 0x698(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSet<class UCommonButtonBase*>               PreviewActionButtons;                              // 0x6A0(0x50)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ContainsInstancedReference, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	class UCommonActivatableWidget*              OverrideFocusWidget;                               // 0x6F0(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortItemDownloadIndicator*            ItemDownloadIndicator;                             // 0x6F8(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonTextBlock*                      Text_DebugPreviewDetails;                          // 0x700(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UFortItemPreviewScreen* GetDefaultObj();

	void ShowItemDetails();
	void OnPreviewActionButtonUpdated(class FText& RowDisplayName, class UCommonButtonBase* Button);
	void HideItemDetails();
};

// 0xD8 (0x7E0 - 0x708)
// Class FortniteUI.AthenaCustomizationScreenBase
class UAthenaCustomizationScreenBase : public UFortItemPreviewScreen
{
public:
	bool                                         bCustomizationSelectionBeingProcessed;             // 0x708(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_37C1[0x3];                                     // Fixing Size After Last Property 
	struct FAthenaCustomizationParams            CustomizationParams;                               // 0x70C(0x8)(BlueprintVisible, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_37C3[0x24];                                    // Fixing Size After Last Property 
	TSubclassOf<class UAthenaItemSelectorScreenBase> ItemSelectorScreenClass;                           // 0x738(0x8)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UFortActivatablePanel>     LoadoutSelectorScreenClass;                        // 0x740(0x8)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UFortBannerSelectModal>    BannerSelectModalClass;                            // 0x748(0x8)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UFortNameLoadoutPopup>     NameLoadoutPopupClass;                             // 0x750(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                     LastHoveredSlot;                                   // 0x758(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<enum class EAthenaCustomizationCategory> BuiltInEmoteCategoryPriorities;                    // 0x760(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	class UWidgetAnimation*                      BoundAnim_Outro;                                   // 0x770(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPanelWidget*                          Panel_GearSlotRow;                                 // 0x778(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaCustomizationSlotSelectorButton* Slot_Pickaxe;                                      // 0x780(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaCustomizationSlotSelectorButton* Slot_Glider;                                       // 0x788(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaCustomizationSlotSelectorButton* Slot_Contrail;                                     // 0x790(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPanelWidget*                          Panel_EmoteSlotRow;                                // 0x798(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPanelWidget*                          Panel_WrapSlotRow;                                 // 0x7A0(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPanelWidget*                          Panel_AccountSlotRow;                              // 0x7A8(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortBannerSlotButton*                 Banner_Button;                                     // 0x7B0(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaLockerItemInfo*                 ItemInfo_Display;                                  // 0x7B8(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                     Button_BackToGame;                                 // 0x7C0(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_37CA[0x18];                                    // Fixing Size Of Struct

	static class UClass* StaticClass();
	static class UAthenaCustomizationScreenBase* GetDefaultObj();

	void ShowLockerSlot(enum class EAthenaCustomizationCategory CustomizationCategory, int32 SlotIndex, bool bCanShowEmpty);
	bool ShouldShowQuickSaveTooltip();
	bool ShouldShowActionBarTooltip();
	void SetCustomizationSelectionBeingProcessed(bool bIsBeingProcessed);
	void QuickSaveToolTipSeen();
	void QuickRenameClicked();
	void OnBeginPickingCustomizationSlot(class UAthenaCustomizationSlotSelectorButton* SlotButton);
	void HandleInventoryUpdated(TSet<class FString>& ItemChangeFlags, int64 ProfileRevision);
	class UFortItem* GetFavoriteItemForCategory(enum class EAthenaCustomizationCategory CustomizationType, int32 SubslotIndex);
	void ActionBarToolTipSeen();
};

// 0xC0 (0x1580 - 0x14C0)
// Class FortniteUI.AthenaCustomizationSlotSelectorButton
class UAthenaCustomizationSlotSelectorButton : public UCommonButtonLegacy
{
public:
	class FText                                  CategoryDisplayName;                               // 0x14C0(0x18)(Edit, Protected, NativeAccessSpecifierProtected)
	class FText                                  CategoryDescription;                               // 0x14D8(0x18)(Edit, Protected, NativeAccessSpecifierProtected)
	enum class EAthenaCustomizationCategory      CustomizationType;                                 // 0x14F0(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_37FC[0x3];                                     // Fixing Size After Last Property 
	int32                                        SubslotIndex;                                      // 0x14F4(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EFortBangType                     BangType;                                          // 0x14F8(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_37FE[0x7];                                     // Fixing Size After Last Property 
	class UFortCosmeticItemCard*                 ItemWidget;                                        // 0x1500(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTag                          RequiredSlotGameplayTag;                           // 0x1508(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_3800[0x4];                                     // Fixing Size After Last Property 
	TSoftObjectPtr<class UTexture2D>             DefaultEmptyTexture;                               // 0x1510(0x20)(Edit, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        CardWidth;                                         // 0x1530(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_3801[0x2C];                                    // Fixing Size After Last Property 
	class UFortItem*                             LocalCampaignHeroPartItem;                         // 0x1560(0x8)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UImage*                                Image_Favorite;                                    // 0x1568(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UImage*                                Image_ClassIcon;                                   // 0x1570(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortBangWrapper_NUI*                  Bang_Wrapper;                                      // 0x1578(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaCustomizationSlotSelectorButton* GetDefaultObj();

	void SetCustomizationType(enum class EAthenaCustomizationCategory NewType, int32 InSubslotIndex, struct FGameplayTag& RequiredSlotTag);
	void SetCardDefaultImageAndWidth(TSoftObjectPtr<class UTexture2D>& InDefaultImage, float InWidth);
	void OnUpdateExclusiveWarning(bool bShouldWarn);
	void OnModifiedStatusUpdated(bool bIsModified);
	void OnCustomizationSlotActiveStateChanged(bool bInAttachableCosmeticAvailable, bool bInActive);
	void OnCardImageAndWidthChanged(TSoftObjectPtr<class UTexture2D>& Image, float Width);
	void OnArchivedStatusUpdated(bool bArchived);
	bool IsSlotFilled();
	void HandleDifferentHeroLoadoutActivated(class UFortMcpProfileCampaign* Profile);
	void GetCustomizationSlotActiveState(bool* bOutAttachableCosmeticAvailable, bool* bOutActive);
	class UFortItem* GetCampaignHeroPartItem();
};

// 0x58 (0x368 - 0x310)
// Class FortniteUI.AthenaDiscoverabilityBase
class UAthenaDiscoverabilityBase : public UFortHUDElementWidget
{
public:
	uint8                                        Pad_3808[0x48];                                    // Fixing Size After Last Property 
	struct FFortPrioritizedWidgetData            PrioritizationData;                                // 0x358(0x2)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_3809[0x6];                                     // Fixing Size After Last Property 
	class UFortControllerComponent_MapDiscoverability* AssociatedComponent;                               // 0x360(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UAthenaDiscoverabilityBase* GetDefaultObj();

	void OnStompFailed();
	void OnStompedByOtherWidget();
	void K2_OnBecomeInactive();
	void K2_OnBecomeActive();
	void CommonVisitedEvent(struct FGameplayTag& NewTag);
	void CommonDiscoveredEvent(struct FGameplayTag& NewTag);
	void CommonArrivalEvent(struct FGameplayTag& NewTag);
};

// 0x8 (0x360 - 0x358)
// Class FortniteUI.AthenaDiscoverabilityDisplay_Extension
class UAthenaDiscoverabilityDisplay_Extension : public UAthenaCommonPrioritizedWidget
{
public:
	bool                                         bShouldHandleLastPOITag;                           // 0x358(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_380B[0x7];                                     // Fixing Size Of Struct

	static class UClass* StaticClass();
	static class UAthenaDiscoverabilityDisplay_Extension* GetDefaultObj();

	void OnCommonArrivalEvent(struct FGameplayTag& NewTag);
};

// 0xE0 (0x448 - 0x368)
// Class FortniteUI.AthenaDiscoveredAreaOverlay
class UAthenaDiscoveredAreaOverlay : public UAthenaDiscoverabilityBase
{
public:
	uint8                                        Pad_3816[0xE0];                                    // Fixing Size Of Struct

	static class UClass* StaticClass();
	static class UAthenaDiscoveredAreaOverlay* GetDefaultObj();

	void OnNewDiscovery(class FText& LocalizedLocationName, TSoftObjectPtr<class USoundCue>& DiscoveredSoundCue, bool bIsNamedLocation, bool bIsDiscovered);
	void BP_HandlePlaylistExtensionWidgetCreated(class UUserWidget* Widget, enum class EUIExtensionSlot SlotType);
};

// 0x8 (0x630 - 0x628)
// Class FortniteUI.AthenaEliminationIndicator
class UAthenaEliminationIndicator : public UAthenaMarkedActorIndicator
{
public:
	uint8                                        Pad_3819[0x8];                                     // Fixing Size Of Struct

	static class UClass* StaticClass();
	static class UAthenaEliminationIndicator* GetDefaultObj();

};

// 0x0 (0x2A8 - 0x2A8)
// Class FortniteUI.AthenaEliminationOverlayBase
class UAthenaEliminationOverlayBase : public UUserWidget
{
public:

	static class UClass* StaticClass();
	static class UAthenaEliminationOverlayBase* GetDefaultObj();

};

// 0xA8 (0x400 - 0x358)
// Class FortniteUI.AthenaEquippedItemBase
class UAthenaEquippedItemBase : public UBacchusHUDElement
{
public:
	enum class EEquippedWeaponDisplay            CurrentMode;                                       // 0x358(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_3868[0xB];                                     // Fixing Size After Last Property 
	int32                                        AmountConsideredInfinite;                          // 0x364(0x4)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FText                                  DefaultOutOfAmmoText;                              // 0x368(0x18)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	class UCommonVisibilitySwitcher*             Switcher_Content;                                  // 0x380(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPanelWidget*                          Panel_ResourceContent;                             // 0x388(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPanelWidget*                          Panel_AmmoContent;                                 // 0x390(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPanelWidget*                          Panel_UtilityContent;                              // 0x398(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UImage*                                Image_AmmoIcon;                                    // 0x3A0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UImage*                                Image_ResourceIcon;                                // 0x3A8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UImage*                                Image_UtilityIcon;                                 // 0x3B0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      Text_MagazineAmmoCount;                            // 0x3B8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      Text_SurplusAmmoCount;                             // 0x3C0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      Text_ResourceCount;                                // 0x3C8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      Text_UtilityAmmoCount;                             // 0x3D0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      Text_OutOfAmmo;                                    // 0x3D8(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UScaleBox*                             RootScaleBox;                                      // 0x3E0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	enum class ESlateVisibility                  WeaponEquipVisibility;                             // 0x3E8(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_3877[0x7];                                     // Fixing Size After Last Property 
	TArray<struct FGameplayAttribute>            TrackedAttributes;                                 // 0x3F0(0x10)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaEquippedItemBase* GetDefaultObj();

	void HandleWorldItemsChanged();
	void HandleWeaponTargetingChanged(bool bIsTargeting);
	void HandleWeaponReloadStarted(float ReloadTime, enum class EFortWeaponReloadType ReloadType);
	void HandleWeaponReloadCancelled();
	void HandleWeaponOverheatValueChanged(float CurrentValue, float MaxValue, enum class EFortWeaponOverheatState State, bool bIsInCooldown);
	void HandleWeaponEquipped(class UFortWeapon* NewWeapon, class UFortWeapon* PrevWeapon);
	void HandleViewTargetChanged();
	void HandleSecondaryFireReleased(class UFortWeapon* Weapon);
	void HandleSecondaryFirePressed(class UFortWeapon* Weapon);
	void HandleLocalAmmoChanged(int32 LocalCount, int32 LocalRemaining);
	void HandleBuildingMaterialChanged();
	void BP_HandleWeaponTargetingChanged(bool bIsTargeting);
	void BP_HandleWeaponReloadStarted(float ReloadTime, enum class EFortWeaponReloadType ReloadType);
	void BP_HandleWeaponReloadCancelled(class UFortWeapon* Weapon);
	void BP_HandleWeaponOverheatValueChanged(float CurrentValue, float MaxValue, enum class EFortWeaponOverheatState State, bool bIsInCooldown);
	void BP_HandleWeaponModeChanged(enum class EEquippedWeaponDisplay Mode);
	void BP_HandleWeaponEquipped(class UFortWeapon* NewWeapon, class UFortWeapon* PrevWeapon);
	void BP_HandleSecondaryFireReleased();
	void BP_HandleSecondaryFirePressed();
	void BP_HandleResourceTypeChanged(class UFortResourceItemDefinition* Item, int32 ResourceCount);
	void BP_HandleResourceCountChanged(int32 ResourceCount);
	void BP_HandleHideReserveAmmoChanged(bool bHideReserveAmmo);
	void BP_HandleHasBulletsPerClipChanged(bool bHasBulletsPerClip);
	void BP_HandleHasAmmoChanged(bool bHasAmmo);
	void BP_HandleAmmoCountChanged(int32 MagazineAmmoCount, int32 SurplusAmmoCount, int32 TotalRemaining);
};

// 0x0 (0x558 - 0x558)
// Class FortniteUI.AthenaEventGamesBase
class UAthenaEventGamesBase : public UFortActivatablePanel
{
public:

	static class UClass* StaticClass();
	static class UAthenaEventGamesBase* GetDefaultObj();

};

// 0x30 (0x348 - 0x318)
// Class FortniteUI.AthenaGamePhaseWidgetBase
class UAthenaGamePhaseWidgetBase : public UGamePhaseWidget
{
public:
	class UTextBlock*                            Text_RemainingTime;                                // 0x318(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMaterialInterface*                    StormComingFontMaterial;                           // 0x320(0x8)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        StormComingWarningTime;                            // 0x328(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_3897[0x1C];                                    // Fixing Size Of Struct

	static class UClass* StaticClass();
	static class UAthenaGamePhaseWidgetBase* GetDefaultObj();

	void OnUpdateGamePhaseIcon(enum class EAthenaGamePhaseStep GamePhaseStep);
	void HandleCountdownUpdate(int32 TimeRemaining);
};

// 0x40 (0x350 - 0x310)
// Class FortniteUI.AthenaGenericHUDTimerWidgetBase
class UAthenaGenericHUDTimerWidgetBase : public UFortHUDElementWidget
{
public:
	uint8                                        Pad_389E[0x10];                                    // Fixing Size After Last Property 
	class UTextBlock*                            TimeText;                                          // 0x320(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_38A0[0x28];                                    // Fixing Size Of Struct

	static class UClass* StaticClass();
	static class UAthenaGenericHUDTimerWidgetBase* GetDefaultObj();

};

// 0x8 (0x2D8 - 0x2D0)
// Class FortniteUI.AthenaGlobalCurrencyWidget
class UAthenaGlobalCurrencyWidget : public UCommonUserWidget
{
public:
	class UCommonNumericTextBlock*               CurrencyTotalText;                                 // 0x2D0(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaGlobalCurrencyWidget* GetDefaultObj();

	void HandleOnItemCountChanged(class UFortItemDefinition* Definition, int32 Delta);
};

// 0x58 (0x370 - 0x318)
// Class FortniteUI.AthenaHUDGamePhaseChangingBase
class UAthenaHUDGamePhaseChangingBase : public UGamePhaseWidget
{
public:
	uint8                                        Pad_38BA[0x40];                                    // Fixing Size After Last Property 
	struct FFortPrioritizedWidgetData            PrioritizationData;                                // 0x358(0x2)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_38BB[0x16];                                    // Fixing Size Of Struct

	static class UClass* StaticClass();
	static class UAthenaHUDGamePhaseChangingBase* GetDefaultObj();

	void BP_UpdateMessaging(enum class EAthenaGamePhaseStep Step, class FText& Message, class FText& TimeText);
	void BP_SetRankedProgress(const class FString& ProgressKey, int32 RankedTier, int32 RankedPosition, float RankedPercent);
	void BP_SetPlaylistName(class FText& PlaylistName);
	void BP_SetIsRanked(bool bIsRanked);
	void BP_HandleGamePhaseStepChanged(enum class EAthenaGamePhaseStep Step);
};

// 0x20 (0x330 - 0x310)
// Class FortniteUI.AthenaHUDPlayerActionAlertBase
class UAthenaHUDPlayerActionAlertBase : public UFortHUDElementWidget
{
public:
	struct FGameplayTag                          HideStormAlertTag;                                 // 0x310(0x4)(Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_38CB[0x1C];                                    // Fixing Size Of Struct

	static class UClass* StaticClass();
	static class UAthenaHUDPlayerActionAlertBase* GetDefaultObj();

	void RequestNextAlert();
	void BP_ShowAlert(enum class EAthenaPlayerActionAlert Alert, class FText& DetailText, struct FRankedProgressReplicatedData& RankedProgress);
	void BP_OnAlertsCleared();
};

// 0xD0 (0x3E0 - 0x310)
// Class FortniteUI.AthenaIndicatorLayerBase
class UAthenaIndicatorLayerBase : public UFortHUDElementWidget
{
public:
	class UFortActorCanvas*                      GeneralIndicators;                                 // 0x310(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortActorCanvas*                      NameIndicators;                                    // 0x318(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UAthenaPlayerIndicatorBase> PlayerIndicatorClass;                              // 0x320(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                        PlayerIndicatorPoolSize;                           // 0x328(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_38D9[0x4];                                     // Fixing Size After Last Property 
	struct FUserWidgetPool                       PlayerIndicatorWidgetPool;                         // 0x330(0x88)(Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	class UAthenaPlayerViewModel*                PlayerVM;                                          // 0x3B8(0x8)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USlateVectorArtData*                   TeamIndicatorMesh;                                 // 0x3C0(0x8)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bWasTargeting;                                     // 0x3C8(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_38DA[0x17];                                    // Fixing Size Of Struct

	static class UClass* StaticClass();
	static class UAthenaIndicatorLayerBase* GetDefaultObj();

	void OnTargetingChanged(bool bTargeting);
	void OnTargetChangedNative(bool bTargeting);
	void HandleIndicatorModeChanged(bool bIndicatorsEnabled);
};

// 0x30 (0x14F0 - 0x14C0)
// Class FortniteUI.AthenaInventoryEquipButtonBase
class UAthenaInventoryEquipButtonBase : public UCommonButtonLegacy
{
public:
	class UFortMultiSizeItemCard*                ItemWidget;                                        // 0x14C0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UWidget*                               EmptyImage;                                        // 0x14C8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        SlotIndex;                                         // 0x14D0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_38DC[0x4];                                     // Fixing Size After Last Property 
	TArray<struct FVector2D>                     ButtonSizeBySlotUsage;                             // 0x14D8(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_38DD[0x8];                                     // Fixing Size Of Struct

	static class UClass* StaticClass();
	static class UAthenaInventoryEquipButtonBase* GetDefaultObj();

};

// 0x20 (0x14E0 - 0x14C0)
// Class FortniteUI.AthenaInventoryItemTileButton
class UAthenaInventoryItemTileButton : public UCommonButtonLegacy
{
public:
	uint8                                        Pad_38E4[0x8];                                     // Fixing Size After Last Property 
	class UAthenaItemIcon*                       ItemIcon;                                          // 0x14C8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_38E5[0x10];                                    // Fixing Size Of Struct

	static class UClass* StaticClass();
	static class UAthenaInventoryItemTileButton* GetDefaultObj();

	void OnItemChanged(class UFortItem* Item);
	class UFortItem* GetItemToRepresent();
};

// 0x308 (0xA10 - 0x708)
// Class FortniteUI.AthenaItemSelectorScreenBase
class UAthenaItemSelectorScreenBase : public UFortItemPreviewScreen
{
public:
	uint8                                        Pad_3912[0xC];                                     // Fixing Size After Last Property 
	float                                        PendingItemPreviewDelay;                           // 0x714(0x4)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UCommonButtonBase>         TabButtonType;                                     // 0x718(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TMap<enum class EAthenaCustomizationCategory, struct FFortTabButtonLabelInfo> ItemCategoryButtonLabelInfo;                       // 0x720(0x50)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	struct FFortTabButtonLabelInfo               VariantButtonLabelInfo;                            // 0x770(0xF0)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                     Button_ConfirmSelection;                           // 0x860(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                     Button_EditStyle;                                  // 0x868(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                     Button_ConfirmStyle;                               // 0x870(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                     Button_CommitArchiveChange;                        // 0x878(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                     Button_ApplyToAll;                                 // 0x880(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                     Button_CloseSortAndFilterBlade;                    // 0x888(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                     Button_Back;                                       // 0x890(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                     Button_Favorite;                                   // 0x898(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                     Button_Unfavorite;                                 // 0x8A0(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UWidget*                               Widget_ArchiveModeButtonContainer;                 // 0x8A8(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortCTAButton*                        Button_ArchiveMode;                                // 0x8B0(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortCTAButton*                        Button_UnarchiveMode;                              // 0x8B8(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortCTAButton*                        Button_ViewInBattlePass;                           // 0x8C0(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UWidget*                               Widget_ShowArchivedItemsButtonContainer;           // 0x8C8(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                     Button_ShowArchivedItems;                          // 0x8D0(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                     Button_HideArchivedItems;                          // 0x8D8(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                     Button_CloseTouch;                                 // 0x8E0(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDynamicEntryBox*                      EntryBox_CustomBottomBarActions;                   // 0x8E8(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAthenaCustomizationPicker*            Picker_ItemSelector;                               // 0x8F0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAthenaCustomizationPickerSortAndFilterBlade* Blade_SortAndFilter;                               // 0x8F8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UVerticalBox*                          ItemInfo;                                          // 0x900(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortItemBaseWidget*                   Item_HeaderInfo;                                   // 0x908(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bVariantZoomUsesSnap;                              // 0x910(0x1)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_3919[0x7];                                     // Fixing Size After Last Property 
	class UFortItem*                             CurrentPreviewItem;                                // 0x918(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAthenaCosmeticItemDefinition*         CurrentPreviewItemDef;                             // 0x920(0x8)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FMcpVariantChannelInfo>        CurrentPreviewVariantChannels;                     // 0x928(0x10)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<struct FMcpVariantChannelInfo>        CachedVariantChannels;                             // 0x938(0x10)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_391B[0x1];                                     // Fixing Size After Last Property 
	enum class ELockerScreenState                LockerState;                                       // 0x949(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_391D[0x6];                                     // Fixing Size After Last Property 
	class UFortVariantPicker*                    Picker_VariantSelector;                            // 0x950(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaCosmeticUnlockingInfo*          UnlockingInfo;                                     // 0x958(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_391E[0x31];                                    // Fixing Size After Last Property 
	enum class EAthenaCustomizationCategory      CustomizeCategory;                                 // 0x991(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_3920[0x6];                                     // Fixing Size After Last Property 
	TSoftClassPtr<class ULockerConfirmationModal> LockerConfirmationModalClass;                      // 0x998(0x20)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                  ArchiveMaterialParameterName;                      // 0x9B8(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        ArchiveMaterialParameterEquippingValue;            // 0x9BC(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        ArchiveMaterialParameterArchivingValue;            // 0x9C0(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_3922[0x3C];                                    // Fixing Size After Last Property 
	int32                                        SubslotIndex;                                      // 0xA00(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_3923[0xC];                                     // Fixing Size Of Struct

	static class UClass* StaticClass();
	static class UAthenaItemSelectorScreenBase* GetDefaultObj();

	void SaveAndExit(bool bApplyToAllSlots);
	void OnUpdateLockerArchivingCleanupTooltipText(class FText& Text);
	void OnUpdateExclusiveItemCallout(bool bShouldShow, class FText& CalloutText);
	void OnUpdateArchiveModeTooltipText(class FText& Text);
	void OnUpdateArchivedItemsTooltipText(class FText& Text);
	void OnTabSelectionChanged(bool bShowingVariants);
	void OnShowLockerArchivingCleanupTooltip(bool bShowTooltip);
	void OnShowArchiveModeTooltip(bool bShowTooltip);
	void OnShowArchivedItemsTooltip(bool bShowTooltip);
	void OnLockerScreenStateChanged();
	void OnItemSelectionCommited(class UFortItem* SelectedItem);
	void OnItemSelectedChanged(class UFortItem* SelectedItem);
	void OnHideItemInfoHeader(bool bShouldHide);
	void OnFinishedItemSetup();
	void OnFinishedItemSave();
	void OnCurrentItemChanged(class UFortItem* SelectedItem);
	bool IsItemOwned(class UFortItem* Item);
	void IsAlternateActionHovered(bool bAlternateActionHovered);
	void HandleShowArchivedItemsTooltipDismissed();
	void HandleSearchTextChanged(class FText& NewText);
	void HandleScreenAnalytics(bool bItemChanged);
	void HandlePickerMarkedItemsChanged(int32 MarkedCount);
	void HandleLockerArchivingCleanupTooltipDismissed();
	void HandleCommitArchiveChangeClicked();
	void HandleArchiveModeTooltipDismissed();
	void HandleAboutToClose();
	void ExitEditStyle();
	void EnterEditStyle();
	void BP_HandleBack();
};

// 0x238 (0x790 - 0x558)
// Class FortniteUI.AthenaLeaderboardScreenBase
class UAthenaLeaderboardScreenBase : public UFortActivatablePanel
{
public:
	class UFortTabListWidgetBase_Legacy*         LeaderboardTabList;                                // 0x558(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonRotator*                        MatchRotator;                                      // 0x560(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonRotator*                        LeaderboardTypeRotator;                            // 0x568(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonTextBlock*                      RefreshTimeText;                                   // 0x570(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonTextBlock*                      NoDataMessageText;                                 // 0x578(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonBorder*                         BorderLocalUserFocus;                              // 0x580(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UWidget*                               Widget_ProfileStats;                               // 0x588(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortProfileStatsRow*                  AthenaStats_Wins;                                  // 0x590(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortProfileStatsRow*                  AthenaStats_SecondTierFinishes;                    // 0x598(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortProfileStatsRow*                  AthenaStats_ThirdTierFinishes;                     // 0x5A0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortProfileStatsRow*                  AthenaStats_Eliminations;                          // 0x5A8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortProfileStatsRow*                  AthenaStats_MatchesPlayer;                         // 0x5B0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                  LTMPlaylistDefaultName;                            // 0x5B8(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_3947[0x4];                                     // Fixing Size After Last Property 
	TMap<class FName, class UFortProfileStatsRow*> ActiveProfileRows;                                 // 0x5C0(0x50)(ExportObject, Transient, ContainsInstancedReference, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	uint8                                        Pad_394B[0x90];                                    // Fixing Size After Last Property 
	class UDataTable*                            PlaylistsData;                                     // 0x6A0(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TMap<class FName, class UCommonButtonBase*>  ActiveTabButtons;                                  // 0x6A8(0x50)(BlueprintVisible, ExportObject, Transient, ContainsInstancedReference, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TArray<class UFortLeaderboardRowProxyInstance*> RowProxies;                                        // 0x6F8(0x10)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
