#pragma once

// Dumped with Dumper-7!


#include "../SDK.hpp"

namespace SDK
{
namespace Params
{
//---------------------------------------------------------------------------------------------------------------------
// PARAMETERS
//---------------------------------------------------------------------------------------------------------------------

// 0x30 (0x30 - 0x0)
// Function GrindRail_Player_LayerAnimBP.GrindRail_Player_LayerAnimBP_C.MovementMode_LowerBodyOverride
struct UGrindRail_Player_LayerAnimBP_C_MovementMode_LowerBodyOverride_Params
{
public:
	struct FPoseLink                             InLowerBodyPose;                                   // 0x0(0x10)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                             InSourcePose;                                      // 0x10(0x10)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                             MovementMode_LowerBodyOverride;                    // 0x20(0x10)(Parm, OutParm, NoDestructor)
};

// 0x20 (0x20 - 0x0)
// Function GrindRail_Player_LayerAnimBP.GrindRail_Player_LayerAnimBP_C.MovementMode_LocomotionAdditives
struct UGrindRail_Player_LayerAnimBP_C_MovementMode_LocomotionAdditives_Params
{
public:
	struct FPoseLink                             InLocomotionAdditivesPose;                         // 0x0(0x10)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                             MovementMode_LocomotionAdditives;                  // 0x10(0x10)(Parm, OutParm, NoDestructor)
};

// 0x20 (0x20 - 0x0)
// Function GrindRail_Player_LayerAnimBP.GrindRail_Player_LayerAnimBP_C.MovementMode_SourcePose
struct UGrindRail_Player_LayerAnimBP_C_MovementMode_SourcePose_Params
{
public:
	struct FPoseLink                             InSourcePoseBase;                                  // 0x0(0x10)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                             MovementMode_SourcePose;                           // 0x10(0x10)(Parm, OutParm, NoDestructor)
};

// 0x20 (0x20 - 0x0)
// Function GrindRail_Player_LayerAnimBP.GrindRail_Player_LayerAnimBP_C.MovementMode_FullBodyOverride
struct UGrindRail_Player_LayerAnimBP_C_MovementMode_FullBodyOverride_Params
{
public:
	struct FPoseLink                             InputPoseFullBody;                                 // 0x0(0x10)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                             MovementMode_FullBodyOverride;                     // 0x10(0x10)(Parm, OutParm, NoDestructor)
};

// 0x20 (0x20 - 0x0)
// Function GrindRail_Player_LayerAnimBP.GrindRail_Player_LayerAnimBP_C.MovementMode_FinalPoseOverride
struct UGrindRail_Player_LayerAnimBP_C_MovementMode_FinalPoseOverride_Params
{
public:
	struct FPoseLink                             InFinalPose;                                       // 0x0(0x10)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                             MovementMode_FinalPoseOverride;                    // 0x10(0x10)(Parm, OutParm, NoDestructor)
};

// 0x30 (0x30 - 0x0)
// Function GrindRail_Player_LayerAnimBP.GrindRail_Player_LayerAnimBP_C.MovementMode_AimOffset
struct UGrindRail_Player_LayerAnimBP_C_MovementMode_AimOffset_Params
{
public:
	struct FPoseLink                             InAimOffsetsPose;                                  // 0x0(0x10)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                             InSourcePosePreAimOffsets;                         // 0x10(0x10)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                             MovementMode_AimOffset;                            // 0x20(0x10)(Parm, OutParm, NoDestructor)
};

// 0x20 (0x20 - 0x0)
// Function GrindRail_Player_LayerAnimBP.GrindRail_Player_LayerAnimBP_C.LocomotionAdditiveGroup
struct UGrindRail_Player_LayerAnimBP_C_LocomotionAdditiveGroup_Params
{
public:
	struct FPoseLink                             InPoseLocomotionAdditive;                          // 0x0(0x10)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                             LocomotionAdditiveGroup;                           // 0x10(0x10)(Parm, OutParm, NoDestructor)
};

// 0x10 (0x10 - 0x0)
// Function GrindRail_Player_LayerAnimBP.GrindRail_Player_LayerAnimBP_C.AnimGraph
struct UGrindRail_Player_LayerAnimBP_C_AnimGraph_Params
{
public:
	struct FPoseLink                             AnimGraph;                                         // 0x0(0x10)(Parm, OutParm, NoDestructor)
};

// 0x0 (0x0 - 0x0)
// Function GrindRail_Player_LayerAnimBP.GrindRail_Player_LayerAnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_GrindRail_Player_LayerAnimBP_AnimGraphNode_TransitionResult_1A4025C94AC4E34FBC9B23AB49CFD72E
struct UGrindRail_Player_LayerAnimBP_C_EvaluateGraphExposedInputs_ExecuteUbergraph_GrindRail_Player_LayerAnimBP_AnimGraphNode_TransitionResult_1A4025C94AC4E34FBC9B23AB49CFD72E_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function GrindRail_Player_LayerAnimBP.GrindRail_Player_LayerAnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_GrindRail_Player_LayerAnimBP_AnimGraphNode_TransitionResult_CFB7F39F4D881298D08C1D96AD6AA6FA
struct UGrindRail_Player_LayerAnimBP_C_EvaluateGraphExposedInputs_ExecuteUbergraph_GrindRail_Player_LayerAnimBP_AnimGraphNode_TransitionResult_CFB7F39F4D881298D08C1D96AD6AA6FA_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function GrindRail_Player_LayerAnimBP.GrindRail_Player_LayerAnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_GrindRail_Player_LayerAnimBP_AnimGraphNode_TransitionResult_FD09E8AA456E65281CC87F8A6C4113AC
struct UGrindRail_Player_LayerAnimBP_C_EvaluateGraphExposedInputs_ExecuteUbergraph_GrindRail_Player_LayerAnimBP_AnimGraphNode_TransitionResult_FD09E8AA456E65281CC87F8A6C4113AC_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function GrindRail_Player_LayerAnimBP.GrindRail_Player_LayerAnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_GrindRail_Player_LayerAnimBP_AnimGraphNode_TransitionResult_DF95C1FE4A2F5813CB01DE80C013E1C6
struct UGrindRail_Player_LayerAnimBP_C_EvaluateGraphExposedInputs_ExecuteUbergraph_GrindRail_Player_LayerAnimBP_AnimGraphNode_TransitionResult_DF95C1FE4A2F5813CB01DE80C013E1C6_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function GrindRail_Player_LayerAnimBP.GrindRail_Player_LayerAnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_GrindRail_Player_LayerAnimBP_AnimGraphNode_TransitionResult_5697EE674F17ADBB80BF75A833AFA309
struct UGrindRail_Player_LayerAnimBP_C_EvaluateGraphExposedInputs_ExecuteUbergraph_GrindRail_Player_LayerAnimBP_AnimGraphNode_TransitionResult_5697EE674F17ADBB80BF75A833AFA309_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function GrindRail_Player_LayerAnimBP.GrindRail_Player_LayerAnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_GrindRail_Player_LayerAnimBP_AnimGraphNode_TransitionResult_3BE669A04B6B559EC4783B8E897AD836
struct UGrindRail_Player_LayerAnimBP_C_EvaluateGraphExposedInputs_ExecuteUbergraph_GrindRail_Player_LayerAnimBP_AnimGraphNode_TransitionResult_3BE669A04B6B559EC4783B8E897AD836_Params
{
public:
};

// 0xF (0xF - 0x0)
// Function GrindRail_Player_LayerAnimBP.GrindRail_Player_LayerAnimBP_C.ExecuteUbergraph_GrindRail_Player_LayerAnimBP
struct UGrindRail_Player_LayerAnimBP_C_ExecuteUbergraph_GrindRail_Player_LayerAnimBP_Params
{
public:
	int32                                        EntryPoint;                                        // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         CallFunc_BooleanOR_ReturnValue;                    // 0x4(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         CallFunc_Not_PreBool_ReturnValue;                  // 0x5(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         CallFunc_Not_PreBool_ReturnValue_1;                // 0x6(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         CallFunc_Not_PreBool_ReturnValue_2;                // 0x7(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         CallFunc_BooleanAND_ReturnValue;                   // 0x8(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         CallFunc_BooleanAND_ReturnValue_1;                 // 0x9(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         CallFunc_Not_PreBool_ReturnValue_3;                // 0xA(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         CallFunc_BooleanAND_ReturnValue_2;                 // 0xB(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         CallFunc_Not_PreBool_ReturnValue_4;                // 0xC(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         CallFunc_BooleanOR_ReturnValue_1;                  // 0xD(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         CallFunc_BooleanOR_ReturnValue_2;                  // 0xE(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}
}


