#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// ENUMS
//---------------------------------------------------------------------------------------------------------------------


//---------------------------------------------------------------------------------------------------------------------
// STRUCTS
//---------------------------------------------------------------------------------------------------------------------

// 0xB40 (0xB40 - 0x0)
// UserDefinedStruct RBANParamsStruct.RBANParamsStruct
struct FRBANParamsStruct
{
public:
	struct FRBANSettingStruct                    Skydive_GoingUp_56_C026BDA74BFBABA6672DFE8FFDAAFC1B; // 0x0(0x90)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRBANSettingStruct                    Skydive_FloatingDown_57_2CBF3D3F421785F8994502931454A81F; // 0x90(0x90)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRBANSettingStruct                    Skydive_DivingDown_58_EC7BEC4D406A8A98E60D7B9374C5E457; // 0x120(0x90)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRBANSettingStruct                    Skydive_Parachuting_60_A88C4A0A407F497561D31287CB20250F; // 0x1B0(0x90)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRBANSettingStruct                    OnGround_Standing_59_267DB1464D0D3A29D99E94ADFCB4AFEC; // 0x240(0x90)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRBANSettingStruct                    OnGround_Moving_65_807A66B64D7B3B2FCF080B833B8A6254; // 0x2D0(0x90)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRBANSettingStruct                    OnGround_Crouch_Moving_61_CE0B8BFB4E3417C0F790F7AE38DD7735; // 0x360(0x90)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRBANSettingStruct                    EmoteOrMelee_62_CFCF66B5492987CBD638EC98EB34D572;  // 0x3F0(0x90)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRBANSettingStruct                    Swimming_64_33CE87CE4D4F712B1384E29115845962;      // 0x480(0x90)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRBANSettingStruct                    Front_End_63_C7A4562A48E9BC9B4CD34D963CFC6490;     // 0x510(0x90)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRBANSettingStruct                    DBNO_68_2D70D4004D0E9B117F6CE9A09C362B74;          // 0x5A0(0x90)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRBANSettingStruct                    DBNO_Carried_67_99829B99495FCFE3488A9A86B549ECE5;  // 0x630(0x90)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRBANSettingStruct                    OnGround_Falling_66_CDAA0F4D476157E4137548BDCE8776F2; // 0x6C0(0x90)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRBANSettingStruct                    Ziplining_75_BCCDB7E1431A4C174F1040ABC81FD8A8;     // 0x750(0x90)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRBANSettingStruct                    Skydive_Surfing_74_408E65FF484AA54111E1ED8A69D8240D; // 0x7E0(0x90)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRBANSettingStruct                    Riding_Standing_69_952A2A43408C37C44E4CBFAE3F3001B0; // 0x870(0x90)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRBANSettingStruct                    Riding_Moving_72_EE7A01794460B9753E5076A5A3B3080A; // 0x900(0x90)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRBANSettingStruct                    Riding_Moving_Targeting_73_2F57FD9E477C515D70B3DA9D75453357; // 0x990(0x90)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRBANSettingStruct                    Tactical_Sprint_70_5B2273A1499D34BDEC52E6A8E3F274D4; // 0xA20(0x90)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRBANSettingStruct                    Rail_Grinding_71_DEEB00A04DB992DF5EEB40BD6518EA4E; // 0xAB0(0x90)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}


