#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// ENUMS
//---------------------------------------------------------------------------------------------------------------------


//---------------------------------------------------------------------------------------------------------------------
// STRUCTS
//---------------------------------------------------------------------------------------------------------------------

// 0xC0 (0xC0 - 0x0)
// UserDefinedStruct S_UI_DialogText.S_UI_DialogText
struct FS_UI_DialogText
{
public:
	struct FS_UI_Placement                       Placement_67_A94CBD4C4E96C298CF51F6B49895AE3D;     // 0x0(0x40)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateFontInfo                        Font_45_B587C32B43943172D2272F8558ACC8B2;          // 0x40(0x58)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FSlateColor                           Color_65_9CB9A5174FD065187E30878106948A3B;         // 0x98(0x14)(Edit, BlueprintVisible)
	enum class ETextTransformPolicy              TransformPolicy_49_52395AC7440E291527A8768E37D08B2A; // 0xAC(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class ETextJustify                      Justification_52_5897D4F946C704E9C5D67E9DD207EF16; // 0xAD(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_9439[0x2];                                     // Fixing Size After Last Property 
	double                                       LineHeightPercentage_55_2509C2B04F6144283C7BADBF36AAA8F6; // 0xB0(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         AutoWrapText_58_064D5C3A4DD3D362216942A761DDC8D0;  // 0xB8(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_943A[0x3];                                     // Fixing Size After Last Property 
	int32                                        WrapTextAt_68_39091237442DEAE1CAFAE3AB75A757F1;    // 0xBC(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}


