#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// ENUMS
//---------------------------------------------------------------------------------------------------------------------


//---------------------------------------------------------------------------------------------------------------------
// STRUCTS
//---------------------------------------------------------------------------------------------------------------------

// 0x80 (0x80 - 0x0)
// UserDefinedStruct S_UI_SizeBox.S_UI_SizeBox
struct FS_UI_SizeBox
{
public:
	bool                                         UseWidthOverride_72_BA6840BC46D2FCB3C33564AA0BCC88B7; // 0x0(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_940B[0x7];                                     // Fixing Size After Last Property 
	double                                       WidthOverride_28_A94CBD4C4E96C298CF51F6B49895AE3D; // 0x8(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         UseHeightOverride_73_4C3EEBD24F01FABDFDF46EA8948AAB5D; // 0x10(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_940C[0x7];                                     // Fixing Size After Last Property 
	double                                       HeightOverride_30_985448F847722BFC0ECD01B46F54E873; // 0x18(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         UseMinDesiredWidth_74_D5A0686649714C9EFFA370887C3F1CAA; // 0x20(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_940D[0x7];                                     // Fixing Size After Last Property 
	double                                       MinDesiredWidth_32_AB4B30464E6C5F6D4923D7BB59F1DCA1; // 0x28(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         UseMinDesiredHeight_75_2437CEFB49C112B12BDAD5B825FA1CA0; // 0x30(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_940E[0x7];                                     // Fixing Size After Last Property 
	double                                       MinDesiredHeight_34_F14D30CC4F7BF3A05A0342AFF4F2C7FF; // 0x38(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         UseMaxDesiredWidth_76_65A135704F09BC785AF7EDB477AD84A4; // 0x40(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_9410[0x7];                                     // Fixing Size After Last Property 
	double                                       MaxDesiredWidth_36_74DF0470480CF4662560B786F6878973; // 0x48(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         UseMaxDesiredHeight_77_3DD826AB4F381CD08BF25787E9DB9BD5; // 0x50(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_9411[0x7];                                     // Fixing Size After Last Property 
	double                                       MaxDesiredHeight_38_F6C9BD4C471DCA757638EB8D32FC28C7; // 0x58(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         UseMinAspectRatio_78_1F5494B4432A23F9546CAFAA1051E04C; // 0x60(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_9412[0x7];                                     // Fixing Size After Last Property 
	double                                       MinAspectRatio_40_0E556247436783AE9300D3939DB064AA; // 0x68(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         UseMaxAspectRatio_80_EC81EB044C1A0BD57CCB4FA58394E246; // 0x70(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_9413[0x7];                                     // Fixing Size After Last Property 
	double                                       MaxAspectRatio_42_F1DC874242251011C0B1E2BD2F2B46D3; // 0x78(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}


