#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// ENUMS
//---------------------------------------------------------------------------------------------------------------------


//---------------------------------------------------------------------------------------------------------------------
// STRUCTS
//---------------------------------------------------------------------------------------------------------------------

// 0x478 (0x478 - 0x0)
// UserDefinedStruct S_UI_DialogStyle.S_UI_DialogStyle
struct FS_UI_DialogStyle
{
public:
	struct FS_UI_SizeBox                         DialogSize_55_CE6987424DF46947352F678CF5E52CC1;    // 0x0(0x80)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_UI_Placement                       DialogPlacement_65_59E2551640BABE52A5754CA2E5941FCF; // 0x80(0x40)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateBrush                           BackgroundMaterial_52_853CB3A44926A4DC7A0AF6AFEDF77E4A; // 0xC0(0xC0)(Edit, BlueprintVisible)
	struct FSlateBrush                           BottomBarMaterial_72_59B1CCA84957A7878829E9819798B47E; // 0x180(0xC0)(Edit, BlueprintVisible)
	struct FS_UI_DialogText                      Title_47_7E0D422D440CE71F166354B2BFE6C254;         // 0x240(0xC0)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FS_UI_DialogText                      Text_48_23B8288A403C2D3FE669F581F37D77B0;          // 0x300(0xC0)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FS_UI_DialogImage                     Image_69_F993EDF444B2B22A5DEFDDBA00055A97;         // 0x3C0(0x50)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_UI_DialogButtons                   ButtonsGroup_66_9B96F603486F8FBAC3896087AA45CDDB;  // 0x410(0x64)(Edit, BlueprintVisible, HasGetValueTypeHash)
	uint8                                        Pad_94C0[0x4];                                     // Fixing Size Of Struct
};

}


