#pragma once

// Dumped with Dumper-7!


#include "../SDK.hpp"

namespace SDK
{
namespace Params
{
//---------------------------------------------------------------------------------------------------------------------
// PARAMETERS
//---------------------------------------------------------------------------------------------------------------------

// 0x18 (0x18 - 0x0)
// Function VerseFortnite.AI._L_2fFortnite_2ecom_2fAI_N_Roperator_U_2eGetNavigatable_U_L_Nfort__character_M_Ntuple_L_R_M_Ntuple_L_R_R
struct UAI__L_2fFortnite_2ecom_2fAI_N_Roperator_U_2eGetNavigatable_U_L_Nfort__character_M_Ntuple_L_R_M_Ntuple_L_R_R_Params
{
public:
	struct FTuple_Lfort__character_Mtuple_L_R_Mtuple_L_R_R __verse_0xB2CDDD72_Argument;                       // 0x0(0xA)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_391A[0x6];                                     // Fixing Size After Last Property 
	FOptionalProperty_                           RetVal;                                            // 0x10(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};

// 0x18 (0x18 - 0x0)
// Function VerseFortnite.AI._L_2fFortnite_2ecom_2fAI_N_Roperator_U_2eGetFortThreatPerception_U_L_Nfort__character_M_Ntuple_L_R_M_Ntuple_L_R_R
struct UAI__L_2fFortnite_2ecom_2fAI_N_Roperator_U_2eGetFortThreatPerception_U_L_Nfort__character_M_Ntuple_L_R_M_Ntuple_L_R_R_Params
{
public:
	struct FTuple_Lfort__character_Mtuple_L_R_Mtuple_L_R_R __verse_0xB2CDDD72_Argument;                       // 0x0(0xA)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_3924[0x6];                                     // Fixing Size After Last Property 
	FOptionalProperty_                           RetVal;                                            // 0x10(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};

// 0x18 (0x18 - 0x0)
// Function VerseFortnite.AI._L_2fFortnite_2ecom_2fAI_N_Roperator_U_2eGetFortLeashable_U_L_Nfort__character_M_Ntuple_L_R_M_Ntuple_L_R_R
struct UAI__L_2fFortnite_2ecom_2fAI_N_Roperator_U_2eGetFortLeashable_U_L_Nfort__character_M_Ntuple_L_R_M_Ntuple_L_R_R_Params
{
public:
	struct FTuple_Lfort__character_Mtuple_L_R_Mtuple_L_R_R __verse_0xB2CDDD72_Argument;                       // 0x0(0xA)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_3927[0x6];                                     // Fixing Size After Last Property 
	FOptionalProperty_                           RetVal;                                            // 0x10(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};

// 0x18 (0x18 - 0x0)
// Function VerseFortnite.AI._L_2fFortnite_2ecom_2fAI_N_Roperator_U_2eGetFocusInterface_U_L_Nfort__character_M_Ntuple_L_R_M_Ntuple_L_R_R
struct UAI__L_2fFortnite_2ecom_2fAI_N_Roperator_U_2eGetFocusInterface_U_L_Nfort__character_M_Ntuple_L_R_M_Ntuple_L_R_R_Params
{
public:
	struct FTuple_Lfort__character_Mtuple_L_R_Mtuple_L_R_R __verse_0xB2CDDD72_Argument;                       // 0x0(0xA)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_3930[0x6];                                     // Fixing Size After Last Property 
	FOptionalProperty_                           RetVal;                                            // 0x10(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};

// 0x18 (0x18 - 0x0)
// Function VerseFortnite.AI._L_2fFortnite_2ecom_2fAI_N_RMakeNavigationTarget_L_Nagent_R
struct UAI__L_2fFortnite_2ecom_2fAI_N_RMakeNavigationTarget_L_Nagent_R_Params
{
public:
	class USimulation_agent*                     __verse_0xB2CDDD72_Argument;                       // 0x0(0x8)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                       InstancingGraph;                                   // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAI_navigation_target*                 __verse_0xB482F2DD_CurrentlyInstantiatedObject;    // 0x10(0x8)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// 0x48 (0x48 - 0x0)
// Function VerseFortnite.AI._L_2fFortnite_2ecom_2fAI_N_RMakeNavigationTarget_L_Nfort__threat__info_R
struct UAI__L_2fFortnite_2ecom_2fAI_N_RMakeNavigationTarget_L_Nfort__threat__info_R_Params
{
public:
	struct FAI_fort_threat_info                  __verse_0xB2CDDD72_Argument;                       // 0x0(0x38)(Parm, NoDestructor)
	uint64                                       InstancingGraph;                                   // 0x38(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAI_navigation_target*                 __verse_0xB482F2DD_CurrentlyInstantiatedObject;    // 0x40(0x8)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// 0x28 (0x28 - 0x0)
// Function VerseFortnite.AI._L_2fFortnite_2ecom_2fAI_N_RMakeNavigationTarget_L_Nvector3_R
struct UAI__L_2fFortnite_2ecom_2fAI_N_RMakeNavigationTarget_L_Nvector3_R_Params
{
public:
	struct FSpatialMath_vector3                  __verse_0xB2CDDD72_Argument;                       // 0x0(0x18)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint64                                       InstancingGraph;                                   // 0x18(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAI_navigation_target*                 __verse_0xB482F2DD_CurrentlyInstantiatedObject;    // 0x20(0x8)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// 0x50 (0x50 - 0x0)
// Function VerseFortnite.AI._L_2fFortnite_2ecom_2fAI_N_RGetThreatLocation_L_Nfort__threat__info_R
struct UAI__L_2fFortnite_2ecom_2fAI_N_RGetThreatLocation_L_Nfort__threat__info_R_Params
{
public:
	struct FAI_fort_threat_info                  __verse_0xB2CDDD72_Argument;                       // 0x0(0x38)(Parm, NoDestructor)
	struct FSpatialMath_vector3                  RetVal;                                            // 0x38(0x18)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// 0x88 (0x88 - 0x0)
// Function VerseFortnite.AI.AI_fort_threat_info$OverrideFactory
struct UAI_AI_fort_threat_info_OverrideFactory_Params
{
public:
	struct FAI_fort_threat_info                  RetVal;                                            // 0x0(0x38)(Parm, OutParm, ReturnParm, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           __verse_0xFB48ED96__InitOverrideMap;               // 0x38(0x50)(ConstParm, Parm, ContainsInstancedReference)
};

// 0x38 (0x38 - 0x0)
// Function VerseFortnite.AI.AI_fort_threat_info$Factory
struct UAI_AI_fort_threat_info_Factory_Params
{
public:
	struct FAI_fort_threat_info                  RetVal;                                            // 0x0(0x38)(Parm, OutParm, ReturnParm, NoDestructor)
};

// 0x0 (0x0 - 0x0)
// Function VerseFortnite.AI.$InitCDO
struct UAI__InitCDO_Params
{
public:
};

// 0x1 (0x1 - 0x0)
// Function VerseFortnite.AI_ai_behavior._L_2fFortnite_2ecom_2fAI_2fai__behavior_N_ROnEnd
struct UAI_ai_behavior__L_2fFortnite_2ecom_2fAI_2fai__behavior_N_ROnEnd_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
};

// 0x28 (0x28 - 0x0)
// Function VerseFortnite.AI_ai_behavior.OnBegin
struct UAI_ai_behavior_OnBegin_Params
{
public:
	class UConcurrency_task*                     __verse_0xC1E81372_CallingTask;                    // 0x0(0x8)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                        __verse_0xA3A00DDB_CallerResumeState;              // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        __verse_0x2AC0E4D8_CallerCancelState;              // 0x10(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x18(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_3946[0x7];                                     // Fixing Size After Last Property 
	class UConcurrency_task*                     RetVal;                                            // 0x20(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// 0x10 (0x10 - 0x0)
// Function VerseFortnite.AI_ai_behavior._L_2fFortnite_2ecom_2fAI_2fai__behavior_N_RGetAgent
struct UAI_ai_behavior__L_2fFortnite_2ecom_2fAI_2fai__behavior_N_RGetAgent_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_394C[0x7];                                     // Fixing Size After Last Property 
	FOptionalProperty_                           RetVal;                                            // 0x8(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};

// 0x0 (0x0 - 0x0)
// Function VerseFortnite.AI_ai_behavior.$InitInstance
struct UAI_ai_behavior__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseFortnite.AI_ai_behavior.$Block
struct UAI_ai_behavior__Block_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseFortnite.AI_ai_behavior.$InitCDO
struct UAI_ai_behavior__InitCDO_Params
{
public:
};

// 0x38 (0x38 - 0x0)
// Function VerseFortnite.AI_focus_interface.MaintainFocus_L_Nvector3_R
struct UAI_focus_interface_MaintainFocus_L_Nvector3_R_Params
{
public:
	class UConcurrency_task*                     __verse_0xC1E81372_CallingTask;                    // 0x0(0x8)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                        __verse_0xA3A00DDB_CallerResumeState;              // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        __verse_0x2AC0E4D8_CallerCancelState;              // 0x10(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSpatialMath_vector3                  __verse_0xB2CDDD72_Argument;                       // 0x18(0x18)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class UConcurrency_task*                     RetVal;                                            // 0x30(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// 0x28 (0x28 - 0x0)
// Function VerseFortnite.AI_focus_interface.MaintainFocus_L_Nagent_R
struct UAI_focus_interface_MaintainFocus_L_Nagent_R_Params
{
public:
	class UConcurrency_task*                     __verse_0xC1E81372_CallingTask;                    // 0x0(0x8)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                        __verse_0xA3A00DDB_CallerResumeState;              // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        __verse_0x2AC0E4D8_CallerCancelState;              // 0x10(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USimulation_agent*                     __verse_0xB2CDDD72_Argument;                       // 0x18(0x8)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UConcurrency_task*                     RetVal;                                            // 0x20(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// 0x28 (0x28 - 0x0)
// Function VerseFortnite.AI_fort_leashable._L_2fFortnite_2ecom_2fAI_2ffort__leashable_N_RSetLeashPosition_L_Nvector3_M_Nfloat_M_Nfloat_R
struct UAI_fort_leashable__L_2fFortnite_2ecom_2fAI_2ffort__leashable_N_RSetLeashPosition_L_Nvector3_M_Nfloat_M_Nfloat_R_Params
{
public:
	struct FTuple_Lvector3_Mfloat_Mfloat_R       __verse_0xB2CDDD72_Argument;                       // 0x0(0x28)(Parm, HasGetValueTypeHash)
};

// 0x18 (0x18 - 0x0)
// Function VerseFortnite.AI_fort_leashable._L_2fFortnite_2ecom_2fAI_2ffort__leashable_N_RSetLeashAgent_L_Nagent_M_Nfloat_M_Nfloat_R
struct UAI_fort_leashable__L_2fFortnite_2ecom_2fAI_2ffort__leashable_N_RSetLeashAgent_L_Nagent_M_Nfloat_M_Nfloat_R_Params
{
public:
	struct FTuple_Lagent_Mfloat_Mfloat_R         __verse_0xB2CDDD72_Argument;                       // 0x0(0x18)(Parm, HasGetValueTypeHash)
};

// 0x1 (0x1 - 0x0)
// Function VerseFortnite.AI_fort_leashable._L_2fFortnite_2ecom_2fAI_2ffort__leashable_N_RClearLeash
struct UAI_fort_leashable__L_2fFortnite_2ecom_2fAI_2ffort__leashable_N_RClearLeash_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
};

// 0x20 (0x20 - 0x0)
// Function VerseFortnite.AI_fort_threat_perception_interface._L_2fFortnite_2ecom_2fAI_2ffort__threat__perception__interface_N_RGetThreatsInfo
struct UAI_fort_threat_perception_interface__L_2fFortnite_2ecom_2fAI_2ffort__threat__perception__interface_N_RGetThreatsInfo_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_3970[0x7];                                     // Fixing Size After Last Property 
	FOptionalProperty_                           RetVal;                                            // 0x8(0x18)(Parm, OutParm, ZeroConstructor, ReturnParm, ContainsInstancedReference)
};

// 0x48 (0x48 - 0x0)
// Function VerseFortnite.AI_fort_threat_perception_interface._L_2fFortnite_2ecom_2fAI_2ffort__threat__perception__interface_N_RGetThreatInfo_L_Nagent_R
struct UAI_fort_threat_perception_interface__L_2fFortnite_2ecom_2fAI_2ffort__threat__perception__interface_N_RGetThreatInfo_L_Nagent_R_Params
{
public:
	class USimulation_agent*                     __verse_0xB2CDDD72_Argument;                       // 0x0(0x8)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FOptionalProperty_                           RetVal;                                            // 0x8(0x40)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor)
};

// 0x30 (0x30 - 0x0)
// Function VerseFortnite.AI_navigatable.Wait_L_N_QDuration_Nfloat_20_3d_20_2e_2e_2e_R
struct UAI_navigatable_Wait_L_N_QDuration_Nfloat_20_3d_20_2e_2e_2e_R_Params
{
public:
	class UConcurrency_task*                     __verse_0xC1E81372_CallingTask;                    // 0x0(0x8)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                        __verse_0xA3A00DDB_CallerResumeState;              // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        __verse_0x2AC0E4D8_CallerCancelState;              // 0x10(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FOptionalProperty_                           __verse_0xB2CDDD72_Argument;                       // 0x18(0x10)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UConcurrency_task*                     RetVal;                                            // 0x28(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// 0x1 (0x1 - 0x0)
// Function VerseFortnite.AI_navigatable._L_2fFortnite_2ecom_2fAI_2fnavigatable_N_RStopNavigation
struct UAI_navigatable__L_2fFortnite_2ecom_2fAI_2fnavigatable_N_RStopNavigation_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
};

// 0x40 (0x40 - 0x0)
// Function VerseFortnite.AI_navigatable.NavigateTo_L_Nnavigation__target_M_N_QReachRadius_Nfloat_20_3d_20_2e_2e_2e_M_N_QAllowPartialPath_Nlogic_20_3d_20_2e_2e_2e_R
struct UAI_navigatable_NavigateTo_L_Nnavigation__target_M_N_QReachRadius_Nfloat_20_3d_20_2e_2e_2e_M_N_QAllowPartialPath_Nlogic_20_3d_20_2e_2e_2e_R_Params
{
public:
	class UConcurrency_task*                     __verse_0xC1E81372_CallingTask;                    // 0x0(0x8)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                        __verse_0xA3A00DDB_CallerResumeState;              // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        __verse_0x2AC0E4D8_CallerCancelState;              // 0x10(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTuple_Lnavigation__target_M_QReachRadius_Nfloat_20_3d_20_2e_2e_2e_M_QAllowPartialPath_Nlogic_20_3d_20_2e_2e_2e_R __verse_0xB2CDDD72_Argument;                       // 0x18(0x1A)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_3993[0x6];                                     // Fixing Size After Last Property 
	class UConcurrency_task*                     RetVal;                                            // 0x38(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// 0x28 (0x28 - 0x0)
// Function VerseFortnite.AI_navigatable._L_2fFortnite_2ecom_2fAI_2fnavigatable_N_RGetCurrentDestination
struct UAI_navigatable__L_2fFortnite_2ecom_2fAI_2fnavigatable_N_RGetCurrentDestination_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_3999[0x7];                                     // Fixing Size After Last Property 
	FOptionalProperty_                           RetVal;                                            // 0x8(0x20)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// 0x0 (0x0 - 0x0)
// Function VerseFortnite.AI_navigation_target.$InitInstance
struct UAI_navigation_target__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseFortnite.AI_navigation_target.$Block
struct UAI_navigation_target__Block_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseFortnite.AI_navigation_target.$InitCDO
struct UAI_navigation_target__InitCDO_Params
{
public:
};

// 0x18 (0x18 - 0x0)
// Function VerseFortnite.Characters._L_2fFortnite_2ecom_2fCharacters_N_Roperator_U_2eGetInstigatorAgent_U_L_Ngame__action__instigator_M_Ntuple_L_R_M_Ntuple_L_R_R
struct UCharacters__L_2fFortnite_2ecom_2fCharacters_N_Roperator_U_2eGetInstigatorAgent_U_L_Ngame__action__instigator_M_Ntuple_L_R_M_Ntuple_L_R_R_Params
{
public:
	struct FTuple_Lgame__action__instigator_Mtuple_L_R_Mtuple_L_R_R __verse_0xB2CDDD72_Argument;                       // 0x0(0xA)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_39AD[0x6];                                     // Fixing Size After Last Property 
	FOptionalProperty_                           RetVal;                                            // 0x10(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};

// 0x18 (0x18 - 0x0)
// Function VerseFortnite.Characters._L_2fFortnite_2ecom_2fCharacters_N_Roperator_U_2eGetInstigator_U_L_Nagent_M_Ntuple_L_R_M_Ntuple_L_R_R
struct UCharacters__L_2fFortnite_2ecom_2fCharacters_N_Roperator_U_2eGetInstigator_U_L_Nagent_M_Ntuple_L_R_M_Ntuple_L_R_R_Params
{
public:
	struct FTuple_Lagent_Mtuple_L_R_Mtuple_L_R_R __verse_0xB2CDDD72_Argument;                       // 0x0(0xA)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_39B1[0x6];                                     // Fixing Size After Last Property 
	class UObject*                               RetVal;                                            // 0x10(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// 0x18 (0x18 - 0x0)
// Function VerseFortnite.Characters._L_2fFortnite_2ecom_2fCharacters_N_Roperator_U_2eGetFortCharacter_U_L_Nagent_M_Ntuple_L_R_M_Ntuple_L_R_R
struct UCharacters__L_2fFortnite_2ecom_2fCharacters_N_Roperator_U_2eGetFortCharacter_U_L_Nagent_M_Ntuple_L_R_M_Ntuple_L_R_R_Params
{
public:
	struct FTuple_Lagent_Mtuple_L_R_Mtuple_L_R_R __verse_0xB2CDDD72_Argument;                       // 0x0(0xA)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_39B4[0x6];                                     // Fixing Size After Last Property 
	FOptionalProperty_                           RetVal;                                            // 0x10(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};

// 0xE2 (0xE2 - 0x0)
// Function VerseFortnite.Characters.Characters_stasis_args$OverrideFactory
struct UCharacters_Characters_stasis_args_OverrideFactory_Params
{
public:
	struct FCharacters_stasis_args               RetVal;                                            // 0x0(0x3)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                        Pad_39BD[0x5];                                     // Fixing Size After Last Property 
	TMap<FVerseStringProperty_, uint8>           __verse_0xFB48ED96__InitOverrideMap;               // 0x8(0x50)(ConstParm, Parm, ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResultStack_0;                                // 0x58(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_1;                                     // 0x68(0x2)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_39BE[0x6];                                     // Fixing Size After Last Property 
	FVerseStringProperty_                        _ExprResultStack_2;                                // 0x70(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_3;                                     // 0x80(0x2)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_39BF[0x6];                                     // Fixing Size After Last Property 
	FVerseStringProperty_                        _ExprResultStack_4;                                // 0x88(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_5;                                     // 0x98(0x2)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_39C0[0x6];                                     // Fixing Size After Last Property 
	FVerseStringProperty_                        _ExprResultStack_6;                                // 0xA0(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_7;                                     // 0xB0(0x2)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_39C1[0x6];                                     // Fixing Size After Last Property 
	FVerseStringProperty_                        _ExprResultStack_8;                                // 0xB8(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_9;                                     // 0xC8(0x2)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_39C2[0x6];                                     // Fixing Size After Last Property 
	FVerseStringProperty_                        _ExprResultStack_10;                               // 0xD0(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_11;                                    // 0xE0(0x2)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

// 0x3 (0x3 - 0x0)
// Function VerseFortnite.Characters.Characters_stasis_args$Factory
struct UCharacters_Characters_stasis_args_Factory_Params
{
public:
	struct FCharacters_stasis_args               RetVal;                                            // 0x0(0x3)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// 0x0 (0x0 - 0x0)
// Function VerseFortnite.Characters.$InitCDO
struct UCharacters__InitCDO_Params
{
public:
};

// 0x42 (0x42 - 0x0)
// Function VerseFortnite.Characters_fort_character._L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RTeleportTo_L_Nvector3_M_Nrotation_R
struct UCharacters_fort_character__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RTeleportTo_L_Nvector3_M_Nrotation_R_Params
{
public:
	struct FTuple_Lvector3_Mrotation_R           __verse_0xB2CDDD72_Argument;                       // 0x0(0x40)(Parm, HasGetValueTypeHash)
	FOptionalProperty_                           RetVal;                                            // 0x40(0x2)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x10 (0x10 - 0x0)
// Function VerseFortnite.Characters_fort_character._L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RSprintedEvent
struct UCharacters_fort_character__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RSprintedEvent_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_39DC[0x7];                                     // Fixing Size After Last Property 
	class UObject*                               RetVal;                                            // 0x8(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// 0x1 (0x1 - 0x0)
// Function VerseFortnite.Characters_fort_character._L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RShow
struct UCharacters_fort_character__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RShow_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
};

// 0x1 (0x1 - 0x0)
// Function VerseFortnite.Characters_fort_character._L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RSetVulnerability_L_Nlogic_R
struct UCharacters_fort_character__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RSetVulnerability_L_Nlogic_R_Params
{
public:
	uint8                                        __verse_0xB2CDDD72_Argument : 1;                   // Mask: 0x1, PropSize: 0x10x0(0x1)(Parm, NoDestructor, HasGetValueTypeHash)
};

// 0x1 (0x1 - 0x0)
// Function VerseFortnite.Characters_fort_character._L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RReleaseFromStasis
struct UCharacters_fort_character__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RReleaseFromStasis_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
};

// 0x3 (0x3 - 0x0)
// Function VerseFortnite.Characters_fort_character._L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RPutInStasis_L_Nstasis__args_R
struct UCharacters_fort_character__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RPutInStasis_L_Nstasis__args_R_Params
{
public:
	struct FCharacters_stasis_args               __verse_0xB2CDDD72_Argument;                       // 0x0(0x3)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// 0x10 (0x10 - 0x0)
// Function VerseFortnite.Characters_fort_character._L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RJumpedEvent
struct UCharacters_fort_character__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RJumpedEvent_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_39EE[0x7];                                     // Fixing Size After Last Property 
	class UObject*                               RetVal;                                            // 0x8(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// 0x3 (0x3 - 0x0)
// Function VerseFortnite.Characters_fort_character._L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RIsVulnerable
struct UCharacters_fort_character__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RIsVulnerable_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	FOptionalProperty_                           RetVal;                                            // 0x1(0x2)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x3 (0x3 - 0x0)
// Function VerseFortnite.Characters_fort_character._L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RIsOnGround
struct UCharacters_fort_character__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RIsOnGround_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	FOptionalProperty_                           RetVal;                                            // 0x1(0x2)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x3 (0x3 - 0x0)
// Function VerseFortnite.Characters_fort_character._L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RIsInWater
struct UCharacters_fort_character__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RIsInWater_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	FOptionalProperty_                           RetVal;                                            // 0x1(0x2)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x3 (0x3 - 0x0)
// Function VerseFortnite.Characters_fort_character._L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RIsInAir
struct UCharacters_fort_character__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RIsInAir_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	FOptionalProperty_                           RetVal;                                            // 0x1(0x2)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x3 (0x3 - 0x0)
// Function VerseFortnite.Characters_fort_character._L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RIsGliding
struct UCharacters_fort_character__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RIsGliding_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	FOptionalProperty_                           RetVal;                                            // 0x1(0x2)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x3 (0x3 - 0x0)
// Function VerseFortnite.Characters_fort_character._L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RIsFlying
struct UCharacters_fort_character__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RIsFlying_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	FOptionalProperty_                           RetVal;                                            // 0x1(0x2)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x3 (0x3 - 0x0)
// Function VerseFortnite.Characters_fort_character._L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RIsFalling
struct UCharacters_fort_character__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RIsFalling_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	FOptionalProperty_                           RetVal;                                            // 0x1(0x2)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x3 (0x3 - 0x0)
// Function VerseFortnite.Characters_fort_character._L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RIsDownButNotOut
struct UCharacters_fort_character__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RIsDownButNotOut_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	FOptionalProperty_                           RetVal;                                            // 0x1(0x2)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x3 (0x3 - 0x0)
// Function VerseFortnite.Characters_fort_character._L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RIsCrouching
struct UCharacters_fort_character__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RIsCrouching_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	FOptionalProperty_                           RetVal;                                            // 0x1(0x2)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x3 (0x3 - 0x0)
// Function VerseFortnite.Characters_fort_character._L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RIsActive
struct UCharacters_fort_character__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RIsActive_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	FOptionalProperty_                           RetVal;                                            // 0x1(0x2)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x1 (0x1 - 0x0)
// Function VerseFortnite.Characters_fort_character._L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RHide
struct UCharacters_fort_character__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RHide_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
};

// 0x30 (0x30 - 0x0)
// Function VerseFortnite.Characters_fort_character._L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RGetViewRotation
struct UCharacters_fort_character__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RGetViewRotation_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_3A10[0xF];                                     // Fixing Size After Last Property 
	struct FVerseRotation                        RetVal;                                            // 0x10(0x20)(Parm, OutParm, ReturnParm, NoDestructor)
};

// 0x20 (0x20 - 0x0)
// Function VerseFortnite.Characters_fort_character._L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RGetViewLocation
struct UCharacters_fort_character__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RGetViewLocation_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_3A12[0x7];                                     // Fixing Size After Last Property 
	struct FSpatialMath_vector3                  RetVal;                                            // 0x8(0x18)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// 0x10 (0x10 - 0x0)
// Function VerseFortnite.Characters_fort_character._L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RGetAgent
struct UCharacters_fort_character__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RGetAgent_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_3A14[0x7];                                     // Fixing Size After Last Property 
	FOptionalProperty_                           RetVal;                                            // 0x8(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};

// 0x10 (0x10 - 0x0)
// Function VerseFortnite.Characters_fort_character._L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_REliminatedEvent
struct UCharacters_fort_character__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_REliminatedEvent_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_3A17[0x7];                                     // Fixing Size After Last Property 
	class UObject*                               RetVal;                                            // 0x8(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// 0x10 (0x10 - 0x0)
// Function VerseFortnite.Characters_fort_character._L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RCrouchedEvent
struct UCharacters_fort_character__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RCrouchedEvent_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_3A1A[0x7];                                     // Fixing Size After Last Property 
	class UObject*                               RetVal;                                            // 0x8(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// 0x42 (0x42 - 0x0)
// Function VerseFortnite.Characters_fort_character_impl._L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RTeleportTo_L_Nvector3_M_Nrotation_R
struct UCharacters_fort_character_impl__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RTeleportTo_L_Nvector3_M_Nrotation_R_Params
{
public:
	struct FTuple_Lvector3_Mrotation_R           __verse_0xB2CDDD72_Argument;                       // 0x0(0x40)(Parm, HasGetValueTypeHash)
	FOptionalProperty_                           RetVal;                                            // 0x40(0x2)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x10 (0x10 - 0x0)
// Function VerseFortnite.Characters_fort_character_impl._L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RSprintedEvent
struct UCharacters_fort_character_impl__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RSprintedEvent_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_3A23[0x7];                                     // Fixing Size After Last Property 
	class UObject*                               RetVal;                                            // 0x8(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// 0x1 (0x1 - 0x0)
// Function VerseFortnite.Characters_fort_character_impl._L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RShow
struct UCharacters_fort_character_impl__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RShow_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
};

// 0x1 (0x1 - 0x0)
// Function VerseFortnite.Characters_fort_character_impl._L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RSetVulnerability_L_Nlogic_R
struct UCharacters_fort_character_impl__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RSetVulnerability_L_Nlogic_R_Params
{
public:
	uint8                                        __verse_0xB2CDDD72_Argument : 1;                   // Mask: 0x1, PropSize: 0x10x0(0x1)(Parm, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function VerseFortnite.Characters_fort_character_impl._L_2fFortnite_2ecom_2fGame_2fshieldable_N_RSetShield_L_Nfloat_R
struct UCharacters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fshieldable_N_RSetShield_L_Nfloat_R_Params
{
public:
	double                                       __verse_0xB2CDDD72_Argument;                       // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function VerseFortnite.Characters_fort_character_impl._L_2fFortnite_2ecom_2fGame_2fshieldable_N_RSetMaxShield_L_Nfloat_R
struct UCharacters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fshieldable_N_RSetMaxShield_L_Nfloat_R_Params
{
public:
	double                                       __verse_0xB2CDDD72_Argument;                       // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function VerseFortnite.Characters_fort_character_impl._L_2fFortnite_2ecom_2fGame_2fhealthful_N_RSetMaxHealth_L_Nfloat_R
struct UCharacters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fhealthful_N_RSetMaxHealth_L_Nfloat_R_Params
{
public:
	double                                       __verse_0xB2CDDD72_Argument;                       // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function VerseFortnite.Characters_fort_character_impl._L_2fFortnite_2ecom_2fGame_2fhealthful_N_RSetHealth_L_Nfloat_R
struct UCharacters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fhealthful_N_RSetHealth_L_Nfloat_R_Params
{
public:
	double                                       __verse_0xB2CDDD72_Argument;                       // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x1 (0x1 - 0x0)
// Function VerseFortnite.Characters_fort_character_impl._L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RReleaseFromStasis
struct UCharacters_fort_character_impl__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RReleaseFromStasis_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
};

// 0x3 (0x3 - 0x0)
// Function VerseFortnite.Characters_fort_character_impl._L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RPutInStasis_L_Nstasis__args_R
struct UCharacters_fort_character_impl__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RPutInStasis_L_Nstasis__args_R_Params
{
public:
	struct FCharacters_stasis_args               __verse_0xB2CDDD72_Argument;                       // 0x0(0x3)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// 0x10 (0x10 - 0x0)
// Function VerseFortnite.Characters_fort_character_impl._L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RJumpedEvent
struct UCharacters_fort_character_impl__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RJumpedEvent_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_3A3F[0x7];                                     // Fixing Size After Last Property 
	class UObject*                               RetVal;                                            // 0x8(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// 0x3 (0x3 - 0x0)
// Function VerseFortnite.Characters_fort_character_impl._L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RIsVulnerable
struct UCharacters_fort_character_impl__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RIsVulnerable_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	FOptionalProperty_                           RetVal;                                            // 0x1(0x2)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x3 (0x3 - 0x0)
// Function VerseFortnite.Characters_fort_character_impl._L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RIsOnGround
struct UCharacters_fort_character_impl__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RIsOnGround_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	FOptionalProperty_                           RetVal;                                            // 0x1(0x2)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x3 (0x3 - 0x0)
// Function VerseFortnite.Characters_fort_character_impl._L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RIsInWater
struct UCharacters_fort_character_impl__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RIsInWater_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	FOptionalProperty_                           RetVal;                                            // 0x1(0x2)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x3 (0x3 - 0x0)
// Function VerseFortnite.Characters_fort_character_impl._L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RIsInAir
struct UCharacters_fort_character_impl__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RIsInAir_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	FOptionalProperty_                           RetVal;                                            // 0x1(0x2)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x3 (0x3 - 0x0)
// Function VerseFortnite.Characters_fort_character_impl._L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RIsGliding
struct UCharacters_fort_character_impl__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RIsGliding_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	FOptionalProperty_                           RetVal;                                            // 0x1(0x2)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x3 (0x3 - 0x0)
// Function VerseFortnite.Characters_fort_character_impl._L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RIsFlying
struct UCharacters_fort_character_impl__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RIsFlying_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	FOptionalProperty_                           RetVal;                                            // 0x1(0x2)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x3 (0x3 - 0x0)
// Function VerseFortnite.Characters_fort_character_impl._L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RIsFalling
struct UCharacters_fort_character_impl__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RIsFalling_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	FOptionalProperty_                           RetVal;                                            // 0x1(0x2)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x3 (0x3 - 0x0)
// Function VerseFortnite.Characters_fort_character_impl._L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RIsDownButNotOut
struct UCharacters_fort_character_impl__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RIsDownButNotOut_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	FOptionalProperty_                           RetVal;                                            // 0x1(0x2)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x3 (0x3 - 0x0)
// Function VerseFortnite.Characters_fort_character_impl._L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RIsCrouching
struct UCharacters_fort_character_impl__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RIsCrouching_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	FOptionalProperty_                           RetVal;                                            // 0x1(0x2)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x3 (0x3 - 0x0)
// Function VerseFortnite.Characters_fort_character_impl._L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RIsActive
struct UCharacters_fort_character_impl__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RIsActive_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	FOptionalProperty_                           RetVal;                                            // 0x1(0x2)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x1 (0x1 - 0x0)
// Function VerseFortnite.Characters_fort_character_impl._L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RHide
struct UCharacters_fort_character_impl__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RHide_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
};

// 0x10 (0x10 - 0x0)
// Function VerseFortnite.Characters_fort_character_impl._L_2fFortnite_2ecom_2fGame_2fshieldable_N_RHealedShieldEvent
struct UCharacters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fshieldable_N_RHealedShieldEvent_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_3A84[0x7];                                     // Fixing Size After Last Property 
	class UObject*                               RetVal;                                            // 0x8(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// 0x10 (0x10 - 0x0)
// Function VerseFortnite.Characters_fort_character_impl._L_2fFortnite_2ecom_2fGame_2fhealable_N_RHealedEvent
struct UCharacters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fhealable_N_RHealedEvent_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_3A86[0x7];                                     // Fixing Size After Last Property 
	class UObject*                               RetVal;                                            // 0x8(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// 0x18 (0x18 - 0x0)
// Function VerseFortnite.Characters_fort_character_impl._L_2fFortnite_2ecom_2fGame_2fhealable_N_RHeal_L_Nhealing__args_R
struct UCharacters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fhealable_N_RHeal_L_Nhealing__args_R_Params
{
public:
	struct FGame_healing_args                    __verse_0xB2CDDD72_Argument;                       // 0x0(0x18)(Parm, NoDestructor)
};

// 0x8 (0x8 - 0x0)
// Function VerseFortnite.Characters_fort_character_impl._L_2fFortnite_2ecom_2fGame_2fhealable_N_RHeal_L_Nfloat_R
struct UCharacters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fhealable_N_RHeal_L_Nfloat_R_Params
{
public:
	double                                       __verse_0xB2CDDD72_Argument;                       // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x30 (0x30 - 0x0)
// Function VerseFortnite.Characters_fort_character_impl._L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RGetViewRotation
struct UCharacters_fort_character_impl__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RGetViewRotation_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_3A93[0xF];                                     // Fixing Size After Last Property 
	struct FVerseRotation                        RetVal;                                            // 0x10(0x20)(Parm, OutParm, ReturnParm, NoDestructor)
};

// 0x20 (0x20 - 0x0)
// Function VerseFortnite.Characters_fort_character_impl._L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RGetViewLocation
struct UCharacters_fort_character_impl__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RGetViewLocation_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_3A98[0x7];                                     // Fixing Size After Last Property 
	struct FSpatialMath_vector3                  RetVal;                                            // 0x8(0x18)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// 0x70 (0x70 - 0x0)
// Function VerseFortnite.Characters_fort_character_impl._L_2fFortnite_2ecom_2fGame_2fpositional_N_RGetTransform
struct UCharacters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fpositional_N_RGetTransform_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_3A9A[0xF];                                     // Fixing Size After Last Property 
	struct FSpatialMath_transform                RetVal;                                            // 0x10(0x60)(Parm, OutParm, ReturnParm, NoDestructor)
};

// 0x10 (0x10 - 0x0)
// Function VerseFortnite.Characters_fort_character_impl._L_2fFortnite_2ecom_2fGame_2fshieldable_N_RGetShield
struct UCharacters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fshieldable_N_RGetShield_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_3A9C[0x7];                                     // Fixing Size After Last Property 
	double                                       RetVal;                                            // 0x8(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x10 (0x10 - 0x0)
// Function VerseFortnite.Characters_fort_character_impl._L_2fFortnite_2ecom_2fGame_2fshieldable_N_RGetMaxShield
struct UCharacters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fshieldable_N_RGetMaxShield_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_3AA0[0x7];                                     // Fixing Size After Last Property 
	double                                       RetVal;                                            // 0x8(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x10 (0x10 - 0x0)
// Function VerseFortnite.Characters_fort_character_impl._L_2fFortnite_2ecom_2fGame_2fhealthful_N_RGetMaxHealth
struct UCharacters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fhealthful_N_RGetMaxHealth_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_3AA3[0x7];                                     // Fixing Size After Last Property 
	double                                       RetVal;                                            // 0x8(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x10 (0x10 - 0x0)
// Function VerseFortnite.Characters_fort_character_impl._L_2fFortnite_2ecom_2fGame_2fhealthful_N_RGetHealth
struct UCharacters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fhealthful_N_RGetHealth_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_3AA4[0x7];                                     // Fixing Size After Last Property 
	double                                       RetVal;                                            // 0x8(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x10 (0x10 - 0x0)
// Function VerseFortnite.Characters_fort_character_impl._L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RGetAgent
struct UCharacters_fort_character_impl__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RGetAgent_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_3AA5[0x7];                                     // Fixing Size After Last Property 
	FOptionalProperty_                           RetVal;                                            // 0x8(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};

// 0x10 (0x10 - 0x0)
// Function VerseFortnite.Characters_fort_character_impl._L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_REliminatedEvent
struct UCharacters_fort_character_impl__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_REliminatedEvent_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_3AAA[0x7];                                     // Fixing Size After Last Property 
	class UObject*                               RetVal;                                            // 0x8(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// 0x10 (0x10 - 0x0)
// Function VerseFortnite.Characters_fort_character_impl._L_2fFortnite_2ecom_2fGame_2fshieldable_N_RDamagedShieldEvent
struct UCharacters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fshieldable_N_RDamagedShieldEvent_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_3AAF[0x7];                                     // Fixing Size After Last Property 
	class UObject*                               RetVal;                                            // 0x8(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// 0x10 (0x10 - 0x0)
// Function VerseFortnite.Characters_fort_character_impl._L_2fFortnite_2ecom_2fGame_2fdamageable_N_RDamagedEvent
struct UCharacters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fdamageable_N_RDamagedEvent_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_3AB3[0x7];                                     // Fixing Size After Last Property 
	class UObject*                               RetVal;                                            // 0x8(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function VerseFortnite.Characters_fort_character_impl._L_2fFortnite_2ecom_2fGame_2fdamageable_N_RDamage_L_Nfloat_R
struct UCharacters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fdamageable_N_RDamage_L_Nfloat_R_Params
{
public:
	double                                       __verse_0xB2CDDD72_Argument;                       // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x18 (0x18 - 0x0)
// Function VerseFortnite.Characters_fort_character_impl._L_2fFortnite_2ecom_2fGame_2fdamageable_N_RDamage_L_Ndamage__args_R
struct UCharacters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fdamageable_N_RDamage_L_Ndamage__args_R_Params
{
public:
	struct FGame_damage_args                     __verse_0xB2CDDD72_Argument;                       // 0x0(0x18)(Parm, NoDestructor)
};

// 0x10 (0x10 - 0x0)
// Function VerseFortnite.Characters_fort_character_impl._L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RCrouchedEvent
struct UCharacters_fort_character_impl__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RCrouchedEvent_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_3AB5[0x7];                                     // Fixing Size After Last Property 
	class UObject*                               RetVal;                                            // 0x8(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// 0x0 (0x0 - 0x0)
// Function VerseFortnite.Characters_fort_character_impl.$InitInstance
struct UCharacters_fort_character_impl__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseFortnite.Characters_fort_character_impl.$Block
struct UCharacters_fort_character_impl__Block_Params
{
public:
};

// 0x100 (0x100 - 0x0)
// Function VerseFortnite.Characters_fort_character_impl.$InitCDO
struct UCharacters_fort_character_impl__InitCDO_Params
{
public:
	class UVerseEngine_subscribable_event*       _ExprResult_0;                                     // 0x0(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                       _InstancingGraph_1;                                // 0x8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerseEngine_subscribable_event*       _ExprResult_2;                                     // 0x10(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                       _InstancingGraph_3;                                // 0x18(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerseEngine_subscribable_event*       _ExprResult_4;                                     // 0x20(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                       _InstancingGraph_5;                                // 0x28(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerseEngine_subscribable_event*       _ExprResult_6;                                     // 0x30(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                       _InstancingGraph_7;                                // 0x38(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerseEngine_subscribable_event*       _ExprResult_8;                                     // 0x40(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                       _InstancingGraph_9;                                // 0x48(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerseEngine_subscribable_event*       _ExprResult_10;                                    // 0x50(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                       _InstancingGraph_11;                               // 0x58(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerseEngine_subscribable_event*       _ExprResult_12;                                    // 0x60(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                       _InstancingGraph_13;                               // 0x68(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerseEngine_subscribable_event*       _ExprResult_14;                                    // 0x70(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                       _InstancingGraph_15;                               // 0x78(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerseEngine_subscribable_event*       _ExprResult_16;                                    // 0x80(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                       _InstancingGraph_17;                               // 0x88(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerseEngine_subscribable_event*       _ExprResult_18;                                    // 0x90(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                       _InstancingGraph_19;                               // 0x98(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerseEngine_subscribable_event*       _ExprResult_20;                                    // 0xA0(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                       _InstancingGraph_21;                               // 0xA8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerseEngine_subscribable_event*       _ExprResult_22;                                    // 0xB0(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                       _InstancingGraph_23;                               // 0xB8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerseEngine_subscribable_event*       _ExprResult_24;                                    // 0xC0(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                       _InstancingGraph_25;                               // 0xC8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerseEngine_subscribable_event*       _ExprResult_26;                                    // 0xD0(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                       _InstancingGraph_27;                               // 0xD8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerseEngine_subscribable_event*       _ExprResult_28;                                    // 0xE0(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                       _InstancingGraph_29;                               // 0xE8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerseEngine_subscribable_event*       _ExprResult_30;                                    // 0xF0(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                       _InstancingGraph_31;                               // 0xF8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x1A (0x1A - 0x0)
// Function VerseFortnite.FortPlayerUtilities._L_2fFortnite_2ecom_2fFortPlayerUtilities_N_Roperator_U_2eSpectatePlayer_U_L_Nplayer_M_Ntuple_L_R_M_Nplayer_R
struct UFortPlayerUtilities__L_2fFortnite_2ecom_2fFortPlayerUtilities_N_Roperator_U_2eSpectatePlayer_U_L_Nplayer_M_Ntuple_L_R_M_Nplayer_R_Params
{
public:
	struct FTuple_Lplayer_Mtuple_L_R_Mplayer_R   __verse_0xB2CDDD72_Argument;                       // 0x0(0x18)(Parm, HasGetValueTypeHash)
	FOptionalProperty_                           RetVal;                                            // 0x18(0x2)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x12 (0x12 - 0x0)
// Function VerseFortnite.FortPlayerUtilities._L_2fFortnite_2ecom_2fFortPlayerUtilities_N_Roperator_U_2eSpectateEliminator_U_L_Nplayer_M_Ntuple_L_R_M_Ntuple_L_R_R
struct UFortPlayerUtilities__L_2fFortnite_2ecom_2fFortPlayerUtilities_N_Roperator_U_2eSpectateEliminator_U_L_Nplayer_M_Ntuple_L_R_M_Ntuple_L_R_R_Params
{
public:
	struct FTuple_Lplayer_Mtuple_L_R_Mtuple_L_R_R __verse_0xB2CDDD72_Argument;                       // 0x0(0xA)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_3B16[0x6];                                     // Fixing Size After Last Property 
	FOptionalProperty_                           RetVal;                                            // 0x10(0x2)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x12 (0x12 - 0x0)
// Function VerseFortnite.FortPlayerUtilities._L_2fFortnite_2ecom_2fFortPlayerUtilities_N_Roperator_U_2eSetSpectator_U_L_Nplayer_M_Ntuple_L_R_M_Ntuple_L_R_R
struct UFortPlayerUtilities__L_2fFortnite_2ecom_2fFortPlayerUtilities_N_Roperator_U_2eSetSpectator_U_L_Nplayer_M_Ntuple_L_R_M_Ntuple_L_R_R_Params
{
public:
	struct FTuple_Lplayer_Mtuple_L_R_Mtuple_L_R_R __verse_0xB2CDDD72_Argument;                       // 0x0(0xA)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_3B1F[0x6];                                     // Fixing Size After Last Property 
	FOptionalProperty_                           RetVal;                                            // 0x10(0x2)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x10 (0x10 - 0x0)
// Function VerseFortnite.FortPlayerUtilities._L_2fFortnite_2ecom_2fFortPlayerUtilities_N_Roperator_U_2eSendToLobby_U_L_Nplayer_M_Ntuple_L_R_M_Ntuple_L_R_R
struct UFortPlayerUtilities__L_2fFortnite_2ecom_2fFortPlayerUtilities_N_Roperator_U_2eSendToLobby_U_L_Nplayer_M_Ntuple_L_R_M_Ntuple_L_R_R_Params
{
public:
	struct FTuple_Lplayer_Mtuple_L_R_Mtuple_L_R_R __verse_0xB2CDDD72_Argument;                       // 0x0(0xA)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_3B24[0x6];                                     // Fixing Size Of Struct
};

// 0x50 (0x50 - 0x0)
// Function VerseFortnite.FortPlayerUtilities._L_2fFortnite_2ecom_2fFortPlayerUtilities_N_Roperator_U_2eRespawn_U_L_Nagent_M_Ntuple_L_R_M_Ntuple_Lvector3_Mrotation_R_R
struct UFortPlayerUtilities__L_2fFortnite_2ecom_2fFortPlayerUtilities_N_Roperator_U_2eRespawn_U_L_Nagent_M_Ntuple_L_R_M_Ntuple_Lvector3_Mrotation_R_R_Params
{
public:
	struct FTuple_Lagent_Mtuple_L_R_Mtuple_Lvector3_Mrotation_R_R __verse_0xB2CDDD72_Argument;                       // 0x0(0x50)(Parm, HasGetValueTypeHash)
};

// 0x12 (0x12 - 0x0)
// Function VerseFortnite.FortPlayerUtilities._L_2fFortnite_2ecom_2fFortPlayerUtilities_N_Roperator_U_2eIsSpectator_U_L_Nplayer_M_Ntuple_L_R_M_Ntuple_L_R_R
struct UFortPlayerUtilities__L_2fFortnite_2ecom_2fFortPlayerUtilities_N_Roperator_U_2eIsSpectator_U_L_Nplayer_M_Ntuple_L_R_M_Ntuple_L_R_R_Params
{
public:
	struct FTuple_Lplayer_Mtuple_L_R_Mtuple_L_R_R __verse_0xB2CDDD72_Argument;                       // 0x0(0xA)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_3B37[0x6];                                     // Fixing Size After Last Property 
	FOptionalProperty_                           RetVal;                                            // 0x10(0x2)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x20 (0x20 - 0x0)
// Function VerseFortnite.FortPlayerUtilities._L_2fFortnite_2ecom_2fFortPlayerUtilities_N_Roperator_U_2eGetPlayersSpectating_U_L_Nplayer_M_Ntuple_L_R_M_Ntuple_L_R_R
struct UFortPlayerUtilities__L_2fFortnite_2ecom_2fFortPlayerUtilities_N_Roperator_U_2eGetPlayersSpectating_U_L_Nplayer_M_Ntuple_L_R_M_Ntuple_L_R_R_Params
{
public:
	struct FTuple_Lplayer_Mtuple_L_R_Mtuple_L_R_R __verse_0xB2CDDD72_Argument;                       // 0x0(0xA)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_3B41[0x6];                                     // Fixing Size After Last Property 
	TArray<class USimulation_player*>            RetVal;                                            // 0x10(0x10)(Parm, OutParm, ReturnParm, ContainsInstancedReference)
};

// 0x0 (0x0 - 0x0)
// Function VerseFortnite.FortPlayerUtilities.$InitCDO
struct UFortPlayerUtilities__InitCDO_Params
{
public:
};

// 0x10D (0x10D - 0x0)
// Function VerseFortnite.Game.Game_healing_result$OverrideFactory
struct UGame_Game_healing_result_OverrideFactory_Params
{
public:
	struct FGame_healing_result                  RetVal;                                            // 0x0(0x20)(Parm, OutParm, ReturnParm, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           __verse_0xFB48ED96__InitOverrideMap;               // 0x20(0x50)(ConstParm, Parm, ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResultStack_0;                                // 0x70(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_1;                                     // 0x80(0x2)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_3B64[0x6];                                     // Fixing Size After Last Property 
	FOptionalProperty_                           _ExprResult_2;                                     // 0x88(0x8)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FOptionalProperty_                           __verse_0x00000000__1;                             // 0x90(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        _ExprResult_3 : 1;                                 // Mask: 0x1, PropSize: 0x10x92(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_214 : 7;                                    // Fixing Bit-Field Size 
	FOptionalProperty_                           _ExprResultStack_4;                                // 0x93(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_3B67[0x3];                                     // Fixing Size After Last Property 
	FVerseStringProperty_                        _ExprResultStack_5;                                // 0x98(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_6;                                     // 0xA8(0x2)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_3B68[0x6];                                     // Fixing Size After Last Property 
	FOptionalProperty_                           _ExprResult_7;                                     // 0xB0(0x8)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FOptionalProperty_                           __verse_0x00000000__3;                             // 0xB8(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        _ExprResult_8 : 1;                                 // Mask: 0x1, PropSize: 0x10xBA(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_215 : 7;                                    // Fixing Bit-Field Size 
	FOptionalProperty_                           _ExprResultStack_9;                                // 0xBB(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_3B6A[0x3];                                     // Fixing Size After Last Property 
	FVerseStringProperty_                        _ExprResultStack_10;                               // 0xC0(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_11;                                    // 0xD0(0x2)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_3B6B[0x6];                                     // Fixing Size After Last Property 
	FOptionalProperty_                           _ExprResult_12;                                    // 0xD8(0x8)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FOptionalProperty_                           __verse_0x00000000__5;                             // 0xE0(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        _ExprResult_13 : 1;                                // Mask: 0x1, PropSize: 0x10xE2(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_216 : 7;                                    // Fixing Bit-Field Size 
	FOptionalProperty_                           _ExprResultStack_14;                               // 0xE3(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_3B6C[0x3];                                     // Fixing Size After Last Property 
	FVerseStringProperty_                        _ExprResultStack_15;                               // 0xE8(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_16;                                    // 0xF8(0x2)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_3B6E[0x6];                                     // Fixing Size After Last Property 
	FOptionalProperty_                           _ExprResult_17;                                    // 0x100(0x8)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FOptionalProperty_                           __verse_0x00000000__7;                             // 0x108(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        _ExprResult_18 : 1;                                // Mask: 0x1, PropSize: 0x10x10A(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_217 : 7;                                    // Fixing Bit-Field Size 
	FOptionalProperty_                           _ExprResultStack_19;                               // 0x10B(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x5D (0x5D - 0x0)
// Function VerseFortnite.Game.Game_healing_result$Factory
struct UGame_Game_healing_result_Factory_Params
{
public:
	struct FGame_healing_result                  RetVal;                                            // 0x0(0x20)(Parm, OutParm, ReturnParm, NoDestructor)
	FOptionalProperty_                           _ExprResult_0;                                     // 0x20(0x8)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FOptionalProperty_                           __verse_0x00000000__1;                             // 0x28(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        _ExprResult_1 : 1;                                 // Mask: 0x1, PropSize: 0x10x2A(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_218 : 7;                                    // Fixing Bit-Field Size 
	FOptionalProperty_                           _ExprResultStack_2;                                // 0x2B(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_3B8B[0x3];                                     // Fixing Size After Last Property 
	FOptionalProperty_                           _ExprResult_3;                                     // 0x30(0x8)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FOptionalProperty_                           __verse_0x00000000__3;                             // 0x38(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        _ExprResult_4 : 1;                                 // Mask: 0x1, PropSize: 0x10x3A(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_219 : 7;                                    // Fixing Bit-Field Size 
	FOptionalProperty_                           _ExprResultStack_5;                                // 0x3B(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_3B8C[0x3];                                     // Fixing Size After Last Property 
	FOptionalProperty_                           _ExprResult_6;                                     // 0x40(0x8)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FOptionalProperty_                           __verse_0x00000000__5;                             // 0x48(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        _ExprResult_7 : 1;                                 // Mask: 0x1, PropSize: 0x10x4A(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_21A : 7;                                    // Fixing Bit-Field Size 
	FOptionalProperty_                           _ExprResultStack_8;                                // 0x4B(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_3B8E[0x3];                                     // Fixing Size After Last Property 
	FOptionalProperty_                           _ExprResult_9;                                     // 0x50(0x8)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FOptionalProperty_                           __verse_0x00000000__7;                             // 0x58(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        _ExprResult_10 : 1;                                // Mask: 0x1, PropSize: 0x10x5A(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_21B : 7;                                    // Fixing Bit-Field Size 
	FOptionalProperty_                           _ExprResultStack_11;                               // 0x5B(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x105 (0x105 - 0x0)
// Function VerseFortnite.Game.Game_healing_args$OverrideFactory
struct UGame_Game_healing_args_OverrideFactory_Params
{
public:
	struct FGame_healing_args                    RetVal;                                            // 0x0(0x18)(Parm, OutParm, ReturnParm, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           __verse_0xFB48ED96__InitOverrideMap;               // 0x18(0x50)(ConstParm, Parm, ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResultStack_0;                                // 0x68(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_1;                                     // 0x78(0x2)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_3BA6[0x6];                                     // Fixing Size After Last Property 
	FOptionalProperty_                           _ExprResult_2;                                     // 0x80(0x8)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FOptionalProperty_                           __verse_0x00000000__1;                             // 0x88(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        _ExprResult_3 : 1;                                 // Mask: 0x1, PropSize: 0x10x8A(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_21D : 7;                                    // Fixing Bit-Field Size 
	FOptionalProperty_                           _ExprResultStack_4;                                // 0x8B(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_3BA7[0x3];                                     // Fixing Size After Last Property 
	FVerseStringProperty_                        _ExprResultStack_5;                                // 0x90(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_6;                                     // 0xA0(0x2)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_3BA8[0x6];                                     // Fixing Size After Last Property 
	FOptionalProperty_                           _ExprResult_7;                                     // 0xA8(0x8)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FOptionalProperty_                           __verse_0x00000000__3;                             // 0xB0(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        _ExprResult_8 : 1;                                 // Mask: 0x1, PropSize: 0x10xB2(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_21E : 7;                                    // Fixing Bit-Field Size 
	FOptionalProperty_                           _ExprResultStack_9;                                // 0xB3(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_3BAA[0x3];                                     // Fixing Size After Last Property 
	FVerseStringProperty_                        _ExprResultStack_10;                               // 0xB8(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_11;                                    // 0xC8(0x2)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_3BAD[0x6];                                     // Fixing Size After Last Property 
	FOptionalProperty_                           _ExprResult_12;                                    // 0xD0(0x8)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FOptionalProperty_                           __verse_0x00000000__5;                             // 0xD8(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        _ExprResult_13 : 1;                                // Mask: 0x1, PropSize: 0x10xDA(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_21F : 7;                                    // Fixing Bit-Field Size 
	FOptionalProperty_                           _ExprResultStack_14;                               // 0xDB(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_3BAE[0x3];                                     // Fixing Size After Last Property 
	FVerseStringProperty_                        _ExprResultStack_15;                               // 0xE0(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_16;                                    // 0xF0(0x2)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_3BB0[0x6];                                     // Fixing Size After Last Property 
	FOptionalProperty_                           _ExprResult_17;                                    // 0xF8(0x8)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FOptionalProperty_                           __verse_0x00000000__7;                             // 0x100(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        _ExprResult_18 : 1;                                // Mask: 0x1, PropSize: 0x10x102(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_220 : 7;                                    // Fixing Bit-Field Size 
	FOptionalProperty_                           _ExprResultStack_19;                               // 0x103(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x55 (0x55 - 0x0)
// Function VerseFortnite.Game.Game_healing_args$Factory
struct UGame_Game_healing_args_Factory_Params
{
public:
	struct FGame_healing_args                    RetVal;                                            // 0x0(0x18)(Parm, OutParm, ReturnParm, NoDestructor)
	FOptionalProperty_                           _ExprResult_0;                                     // 0x18(0x8)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FOptionalProperty_                           __verse_0x00000000__1;                             // 0x20(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        _ExprResult_1 : 1;                                 // Mask: 0x1, PropSize: 0x10x22(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_221 : 7;                                    // Fixing Bit-Field Size 
	FOptionalProperty_                           _ExprResultStack_2;                                // 0x23(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_3BB9[0x3];                                     // Fixing Size After Last Property 
	FOptionalProperty_                           _ExprResult_3;                                     // 0x28(0x8)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FOptionalProperty_                           __verse_0x00000000__3;                             // 0x30(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        _ExprResult_4 : 1;                                 // Mask: 0x1, PropSize: 0x10x32(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_222 : 7;                                    // Fixing Bit-Field Size 
	FOptionalProperty_                           _ExprResultStack_5;                                // 0x33(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_3BBB[0x3];                                     // Fixing Size After Last Property 
	FOptionalProperty_                           _ExprResult_6;                                     // 0x38(0x8)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FOptionalProperty_                           __verse_0x00000000__5;                             // 0x40(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        _ExprResult_7 : 1;                                 // Mask: 0x1, PropSize: 0x10x42(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_223 : 7;                                    // Fixing Bit-Field Size 
	FOptionalProperty_                           _ExprResultStack_8;                                // 0x43(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_3BBD[0x3];                                     // Fixing Size After Last Property 
	FOptionalProperty_                           _ExprResult_9;                                     // 0x48(0x8)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FOptionalProperty_                           __verse_0x00000000__7;                             // 0x50(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        _ExprResult_10 : 1;                                // Mask: 0x1, PropSize: 0x10x52(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_224 : 7;                                    // Fixing Bit-Field Size 
	FOptionalProperty_                           _ExprResultStack_11;                               // 0x53(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x10D (0x10D - 0x0)
// Function VerseFortnite.Game.Game_damage_result$OverrideFactory
struct UGame_Game_damage_result_OverrideFactory_Params
{
public:
	struct FGame_damage_result                   RetVal;                                            // 0x0(0x20)(Parm, OutParm, ReturnParm, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           __verse_0xFB48ED96__InitOverrideMap;               // 0x20(0x50)(ConstParm, Parm, ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResultStack_0;                                // 0x70(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_1;                                     // 0x80(0x2)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_3BCE[0x6];                                     // Fixing Size After Last Property 
	FOptionalProperty_                           _ExprResult_2;                                     // 0x88(0x8)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FOptionalProperty_                           __verse_0x00000000__1;                             // 0x90(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        _ExprResult_3 : 1;                                 // Mask: 0x1, PropSize: 0x10x92(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_225 : 7;                                    // Fixing Bit-Field Size 
	FOptionalProperty_                           _ExprResultStack_4;                                // 0x93(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_3BD0[0x3];                                     // Fixing Size After Last Property 
	FVerseStringProperty_                        _ExprResultStack_5;                                // 0x98(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_6;                                     // 0xA8(0x2)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_3BD2[0x6];                                     // Fixing Size After Last Property 
	FOptionalProperty_                           _ExprResult_7;                                     // 0xB0(0x8)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FOptionalProperty_                           __verse_0x00000000__3;                             // 0xB8(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        _ExprResult_8 : 1;                                 // Mask: 0x1, PropSize: 0x10xBA(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_226 : 7;                                    // Fixing Bit-Field Size 
	FOptionalProperty_                           _ExprResultStack_9;                                // 0xBB(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_3BD4[0x3];                                     // Fixing Size After Last Property 
	FVerseStringProperty_                        _ExprResultStack_10;                               // 0xC0(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_11;                                    // 0xD0(0x2)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_3BD5[0x6];                                     // Fixing Size After Last Property 
	FOptionalProperty_                           _ExprResult_12;                                    // 0xD8(0x8)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FOptionalProperty_                           __verse_0x00000000__5;                             // 0xE0(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        _ExprResult_13 : 1;                                // Mask: 0x1, PropSize: 0x10xE2(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_227 : 7;                                    // Fixing Bit-Field Size 
	FOptionalProperty_                           _ExprResultStack_14;                               // 0xE3(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_3BD6[0x3];                                     // Fixing Size After Last Property 
	FVerseStringProperty_                        _ExprResultStack_15;                               // 0xE8(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_16;                                    // 0xF8(0x2)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_3BD7[0x6];                                     // Fixing Size After Last Property 
	FOptionalProperty_                           _ExprResult_17;                                    // 0x100(0x8)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FOptionalProperty_                           __verse_0x00000000__7;                             // 0x108(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        _ExprResult_18 : 1;                                // Mask: 0x1, PropSize: 0x10x10A(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_228 : 7;                                    // Fixing Bit-Field Size 
	FOptionalProperty_                           _ExprResultStack_19;                               // 0x10B(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x5D (0x5D - 0x0)
// Function VerseFortnite.Game.Game_damage_result$Factory
struct UGame_Game_damage_result_Factory_Params
{
public:
	struct FGame_damage_result                   RetVal;                                            // 0x0(0x20)(Parm, OutParm, ReturnParm, NoDestructor)
	FOptionalProperty_                           _ExprResult_0;                                     // 0x20(0x8)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FOptionalProperty_                           __verse_0x00000000__1;                             // 0x28(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        _ExprResult_1 : 1;                                 // Mask: 0x1, PropSize: 0x10x2A(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_229 : 7;                                    // Fixing Bit-Field Size 
	FOptionalProperty_                           _ExprResultStack_2;                                // 0x2B(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_3BE3[0x3];                                     // Fixing Size After Last Property 
	FOptionalProperty_                           _ExprResult_3;                                     // 0x30(0x8)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FOptionalProperty_                           __verse_0x00000000__3;                             // 0x38(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        _ExprResult_4 : 1;                                 // Mask: 0x1, PropSize: 0x10x3A(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_22A : 7;                                    // Fixing Bit-Field Size 
	FOptionalProperty_                           _ExprResultStack_5;                                // 0x3B(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_3BE4[0x3];                                     // Fixing Size After Last Property 
	FOptionalProperty_                           _ExprResult_6;                                     // 0x40(0x8)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FOptionalProperty_                           __verse_0x00000000__5;                             // 0x48(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        _ExprResult_7 : 1;                                 // Mask: 0x1, PropSize: 0x10x4A(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_22B : 7;                                    // Fixing Bit-Field Size 
	FOptionalProperty_                           _ExprResultStack_8;                                // 0x4B(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_3BE5[0x3];                                     // Fixing Size After Last Property 
	FOptionalProperty_                           _ExprResult_9;                                     // 0x50(0x8)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FOptionalProperty_                           __verse_0x00000000__7;                             // 0x58(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        _ExprResult_10 : 1;                                // Mask: 0x1, PropSize: 0x10x5A(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_22C : 7;                                    // Fixing Bit-Field Size 
	FOptionalProperty_                           _ExprResultStack_11;                               // 0x5B(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x105 (0x105 - 0x0)
// Function VerseFortnite.Game.Game_damage_args$OverrideFactory
struct UGame_Game_damage_args_OverrideFactory_Params
{
public:
	struct FGame_damage_args                     RetVal;                                            // 0x0(0x18)(Parm, OutParm, ReturnParm, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           __verse_0xFB48ED96__InitOverrideMap;               // 0x18(0x50)(ConstParm, Parm, ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResultStack_0;                                // 0x68(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_1;                                     // 0x78(0x2)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_3BF1[0x6];                                     // Fixing Size After Last Property 
	FOptionalProperty_                           _ExprResult_2;                                     // 0x80(0x8)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FOptionalProperty_                           __verse_0x00000000__1;                             // 0x88(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        _ExprResult_3 : 1;                                 // Mask: 0x1, PropSize: 0x10x8A(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_22D : 7;                                    // Fixing Bit-Field Size 
	FOptionalProperty_                           _ExprResultStack_4;                                // 0x8B(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_3BF2[0x3];                                     // Fixing Size After Last Property 
	FVerseStringProperty_                        _ExprResultStack_5;                                // 0x90(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_6;                                     // 0xA0(0x2)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_3BF3[0x6];                                     // Fixing Size After Last Property 
	FOptionalProperty_                           _ExprResult_7;                                     // 0xA8(0x8)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FOptionalProperty_                           __verse_0x00000000__3;                             // 0xB0(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        _ExprResult_8 : 1;                                 // Mask: 0x1, PropSize: 0x10xB2(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_22E : 7;                                    // Fixing Bit-Field Size 
	FOptionalProperty_                           _ExprResultStack_9;                                // 0xB3(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_3BF4[0x3];                                     // Fixing Size After Last Property 
	FVerseStringProperty_                        _ExprResultStack_10;                               // 0xB8(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_11;                                    // 0xC8(0x2)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_3BF5[0x6];                                     // Fixing Size After Last Property 
	FOptionalProperty_                           _ExprResult_12;                                    // 0xD0(0x8)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FOptionalProperty_                           __verse_0x00000000__5;                             // 0xD8(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        _ExprResult_13 : 1;                                // Mask: 0x1, PropSize: 0x10xDA(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_22F : 7;                                    // Fixing Bit-Field Size 
	FOptionalProperty_                           _ExprResultStack_14;                               // 0xDB(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_3BF6[0x3];                                     // Fixing Size After Last Property 
	FVerseStringProperty_                        _ExprResultStack_15;                               // 0xE0(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_16;                                    // 0xF0(0x2)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_3BF7[0x6];                                     // Fixing Size After Last Property 
	FOptionalProperty_                           _ExprResult_17;                                    // 0xF8(0x8)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FOptionalProperty_                           __verse_0x00000000__7;                             // 0x100(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        _ExprResult_18 : 1;                                // Mask: 0x1, PropSize: 0x10x102(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_230 : 7;                                    // Fixing Bit-Field Size 
	FOptionalProperty_                           _ExprResultStack_19;                               // 0x103(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x55 (0x55 - 0x0)
// Function VerseFortnite.Game.Game_damage_args$Factory
struct UGame_Game_damage_args_Factory_Params
{
public:
	struct FGame_damage_args                     RetVal;                                            // 0x0(0x18)(Parm, OutParm, ReturnParm, NoDestructor)
	FOptionalProperty_                           _ExprResult_0;                                     // 0x18(0x8)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FOptionalProperty_                           __verse_0x00000000__1;                             // 0x20(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        _ExprResult_1 : 1;                                 // Mask: 0x1, PropSize: 0x10x22(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_231 : 7;                                    // Fixing Bit-Field Size 
	FOptionalProperty_                           _ExprResultStack_2;                                // 0x23(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_3C00[0x3];                                     // Fixing Size After Last Property 
	FOptionalProperty_                           _ExprResult_3;                                     // 0x28(0x8)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FOptionalProperty_                           __verse_0x00000000__3;                             // 0x30(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        _ExprResult_4 : 1;                                 // Mask: 0x1, PropSize: 0x10x32(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_232 : 7;                                    // Fixing Bit-Field Size 
	FOptionalProperty_                           _ExprResultStack_5;                                // 0x33(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_3C02[0x3];                                     // Fixing Size After Last Property 
	FOptionalProperty_                           _ExprResult_6;                                     // 0x38(0x8)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FOptionalProperty_                           __verse_0x00000000__5;                             // 0x40(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        _ExprResult_7 : 1;                                 // Mask: 0x1, PropSize: 0x10x42(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_233 : 7;                                    // Fixing Bit-Field Size 
	FOptionalProperty_                           _ExprResultStack_8;                                // 0x43(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_3C03[0x3];                                     // Fixing Size After Last Property 
	FOptionalProperty_                           _ExprResult_9;                                     // 0x48(0x8)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FOptionalProperty_                           __verse_0x00000000__7;                             // 0x50(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        _ExprResult_10 : 1;                                // Mask: 0x1, PropSize: 0x10x52(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_234 : 7;                                    // Fixing Bit-Field Size 
	FOptionalProperty_                           _ExprResultStack_11;                               // 0x53(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x60 (0x60 - 0x0)
// Function VerseFortnite.Game.Game_elimination_result$OverrideFactory
struct UGame_Game_elimination_result_OverrideFactory_Params
{
public:
	struct FGame_elimination_result              RetVal;                                            // 0x0(0x10)(Parm, OutParm, ReturnParm, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           __verse_0xFB48ED96__InitOverrideMap;               // 0x10(0x50)(ConstParm, Parm, ContainsInstancedReference)
};

// 0x10 (0x10 - 0x0)
// Function VerseFortnite.Game.Game_elimination_result$Factory
struct UGame_Game_elimination_result_Factory_Params
{
public:
	struct FGame_elimination_result              RetVal;                                            // 0x0(0x10)(Parm, OutParm, ReturnParm, NoDestructor)
};

// 0x0 (0x0 - 0x0)
// Function VerseFortnite.Game.$InitCDO
struct UGame__InitCDO_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseFortnite.Game_agent_instigator_impl.$InitInstance
struct UGame_agent_instigator_impl__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseFortnite.Game_agent_instigator_impl.$Block
struct UGame_agent_instigator_impl__Block_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseFortnite.Game_agent_instigator_impl.$InitCDO
struct UGame_agent_instigator_impl__InitCDO_Params
{
public:
};

// 0x10 (0x10 - 0x0)
// Function VerseFortnite.Game_damageable._L_2fFortnite_2ecom_2fGame_2fdamageable_N_RDamagedEvent
struct UGame_damageable__L_2fFortnite_2ecom_2fGame_2fdamageable_N_RDamagedEvent_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_3C13[0x7];                                     // Fixing Size After Last Property 
	class UObject*                               RetVal;                                            // 0x8(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function VerseFortnite.Game_damageable._L_2fFortnite_2ecom_2fGame_2fdamageable_N_RDamage_L_Nfloat_R
struct UGame_damageable__L_2fFortnite_2ecom_2fGame_2fdamageable_N_RDamage_L_Nfloat_R_Params
{
public:
	double                                       __verse_0xB2CDDD72_Argument;                       // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x18 (0x18 - 0x0)
// Function VerseFortnite.Game_damageable._L_2fFortnite_2ecom_2fGame_2fdamageable_N_RDamage_L_Ndamage__args_R
struct UGame_damageable__L_2fFortnite_2ecom_2fGame_2fdamageable_N_RDamage_L_Ndamage__args_R_Params
{
public:
	struct FGame_damage_args                     __verse_0xB2CDDD72_Argument;                       // 0x0(0x18)(Parm, NoDestructor)
};

// 0x10 (0x10 - 0x0)
// Function VerseFortnite.Game_healable._L_2fFortnite_2ecom_2fGame_2fhealable_N_RHealedEvent
struct UGame_healable__L_2fFortnite_2ecom_2fGame_2fhealable_N_RHealedEvent_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_3C18[0x7];                                     // Fixing Size After Last Property 
	class UObject*                               RetVal;                                            // 0x8(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function VerseFortnite.Game_healable._L_2fFortnite_2ecom_2fGame_2fhealable_N_RHeal_L_Nfloat_R
struct UGame_healable__L_2fFortnite_2ecom_2fGame_2fhealable_N_RHeal_L_Nfloat_R_Params
{
public:
	double                                       __verse_0xB2CDDD72_Argument;                       // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x18 (0x18 - 0x0)
// Function VerseFortnite.Game_healable._L_2fFortnite_2ecom_2fGame_2fhealable_N_RHeal_L_Nhealing__args_R
struct UGame_healable__L_2fFortnite_2ecom_2fGame_2fhealable_N_RHeal_L_Nhealing__args_R_Params
{
public:
	struct FGame_healing_args                    __verse_0xB2CDDD72_Argument;                       // 0x0(0x18)(Parm, NoDestructor)
};

// 0x8 (0x8 - 0x0)
// Function VerseFortnite.Game_healthful._L_2fFortnite_2ecom_2fGame_2fhealthful_N_RSetMaxHealth_L_Nfloat_R
struct UGame_healthful__L_2fFortnite_2ecom_2fGame_2fhealthful_N_RSetMaxHealth_L_Nfloat_R_Params
{
public:
	double                                       __verse_0xB2CDDD72_Argument;                       // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function VerseFortnite.Game_healthful._L_2fFortnite_2ecom_2fGame_2fhealthful_N_RSetHealth_L_Nfloat_R
struct UGame_healthful__L_2fFortnite_2ecom_2fGame_2fhealthful_N_RSetHealth_L_Nfloat_R_Params
{
public:
	double                                       __verse_0xB2CDDD72_Argument;                       // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x10 (0x10 - 0x0)
// Function VerseFortnite.Game_healthful._L_2fFortnite_2ecom_2fGame_2fhealthful_N_RGetMaxHealth
struct UGame_healthful__L_2fFortnite_2ecom_2fGame_2fhealthful_N_RGetMaxHealth_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_3C24[0x7];                                     // Fixing Size After Last Property 
	double                                       RetVal;                                            // 0x8(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x10 (0x10 - 0x0)
// Function VerseFortnite.Game_healthful._L_2fFortnite_2ecom_2fGame_2fhealthful_N_RGetHealth
struct UGame_healthful__L_2fFortnite_2ecom_2fGame_2fhealthful_N_RGetHealth_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_3C26[0x7];                                     // Fixing Size After Last Property 
	double                                       RetVal;                                            // 0x8(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x70 (0x70 - 0x0)
// Function VerseFortnite.Game_positional._L_2fFortnite_2ecom_2fGame_2fpositional_N_RGetTransform
struct UGame_positional__L_2fFortnite_2ecom_2fGame_2fpositional_N_RGetTransform_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_3C29[0xF];                                     // Fixing Size After Last Property 
	struct FSpatialMath_transform                RetVal;                                            // 0x10(0x60)(Parm, OutParm, ReturnParm, NoDestructor)
};

// 0x8 (0x8 - 0x0)
// Function VerseFortnite.Game_shieldable._L_2fFortnite_2ecom_2fGame_2fshieldable_N_RSetShield_L_Nfloat_R
struct UGame_shieldable__L_2fFortnite_2ecom_2fGame_2fshieldable_N_RSetShield_L_Nfloat_R_Params
{
public:
	double                                       __verse_0xB2CDDD72_Argument;                       // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function VerseFortnite.Game_shieldable._L_2fFortnite_2ecom_2fGame_2fshieldable_N_RSetMaxShield_L_Nfloat_R
struct UGame_shieldable__L_2fFortnite_2ecom_2fGame_2fshieldable_N_RSetMaxShield_L_Nfloat_R_Params
{
public:
	double                                       __verse_0xB2CDDD72_Argument;                       // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x10 (0x10 - 0x0)
// Function VerseFortnite.Game_shieldable._L_2fFortnite_2ecom_2fGame_2fshieldable_N_RHealedShieldEvent
struct UGame_shieldable__L_2fFortnite_2ecom_2fGame_2fshieldable_N_RHealedShieldEvent_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_3C34[0x7];                                     // Fixing Size After Last Property 
	class UObject*                               RetVal;                                            // 0x8(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// 0x10 (0x10 - 0x0)
// Function VerseFortnite.Game_shieldable._L_2fFortnite_2ecom_2fGame_2fshieldable_N_RGetShield
struct UGame_shieldable__L_2fFortnite_2ecom_2fGame_2fshieldable_N_RGetShield_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_3C39[0x7];                                     // Fixing Size After Last Property 
	double                                       RetVal;                                            // 0x8(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x10 (0x10 - 0x0)
// Function VerseFortnite.Game_shieldable._L_2fFortnite_2ecom_2fGame_2fshieldable_N_RGetMaxShield
struct UGame_shieldable__L_2fFortnite_2ecom_2fGame_2fshieldable_N_RGetMaxShield_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_3C3B[0x7];                                     // Fixing Size After Last Property 
	double                                       RetVal;                                            // 0x8(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x10 (0x10 - 0x0)
// Function VerseFortnite.Game_shieldable._L_2fFortnite_2ecom_2fGame_2fshieldable_N_RDamagedShieldEvent
struct UGame_shieldable__L_2fFortnite_2ecom_2fGame_2fshieldable_N_RDamagedShieldEvent_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_3C45[0x7];                                     // Fixing Size After Last Property 
	class UObject*                               RetVal;                                            // 0x8(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// 0x10 (0x10 - 0x0)
// Function VerseFortnite.Playspaces_fort_playspace._L_2fFortnite_2ecom_2fPlayspaces_2ffort__playspace_N_RPlayerRemovedEvent
struct UPlayspaces_fort_playspace__L_2fFortnite_2ecom_2fPlayspaces_2ffort__playspace_N_RPlayerRemovedEvent_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_3C4C[0x7];                                     // Fixing Size After Last Property 
	class UObject*                               RetVal;                                            // 0x8(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// 0x10 (0x10 - 0x0)
// Function VerseFortnite.Playspaces_fort_playspace._L_2fFortnite_2ecom_2fPlayspaces_2ffort__playspace_N_RPlayerAddedEvent
struct UPlayspaces_fort_playspace__L_2fFortnite_2ecom_2fPlayspaces_2ffort__playspace_N_RPlayerAddedEvent_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_3C4F[0x7];                                     // Fixing Size After Last Property 
	class UObject*                               RetVal;                                            // 0x8(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// 0x10 (0x10 - 0x0)
// Function VerseFortnite.Playspaces_fort_playspace._L_2fFortnite_2ecom_2fPlayspaces_2ffort__playspace_N_RGetTeamCollection
struct UPlayspaces_fort_playspace__L_2fFortnite_2ecom_2fPlayspaces_2ffort__playspace_N_RGetTeamCollection_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_3C54[0x7];                                     // Fixing Size After Last Property 
	class UObject*                               RetVal;                                            // 0x8(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// 0x18 (0x18 - 0x0)
// Function VerseFortnite.Playspaces_fort_playspace._L_2fFortnite_2ecom_2fPlayspaces_2ffort__playspace_N_RGetPlayers
struct UPlayspaces_fort_playspace__L_2fFortnite_2ecom_2fPlayspaces_2ffort__playspace_N_RGetPlayers_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_3C57[0x7];                                     // Fixing Size After Last Property 
	TArray<class USimulation_player*>            RetVal;                                            // 0x8(0x10)(Parm, OutParm, ReturnParm, ContainsInstancedReference)
};

// 0x10 (0x10 - 0x0)
// Function VerseFortnite.Playspaces_fort_playspace_impl._L_2fFortnite_2ecom_2fPlayspaces_2ffort__playspace_N_RPlayerRemovedEvent
struct UPlayspaces_fort_playspace_impl__L_2fFortnite_2ecom_2fPlayspaces_2ffort__playspace_N_RPlayerRemovedEvent_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_3C59[0x7];                                     // Fixing Size After Last Property 
	class UObject*                               RetVal;                                            // 0x8(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// 0x10 (0x10 - 0x0)
// Function VerseFortnite.Playspaces_fort_playspace_impl._L_2fFortnite_2ecom_2fPlayspaces_2ffort__playspace_N_RPlayerAddedEvent
struct UPlayspaces_fort_playspace_impl__L_2fFortnite_2ecom_2fPlayspaces_2ffort__playspace_N_RPlayerAddedEvent_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_3C5C[0x7];                                     // Fixing Size After Last Property 
	class UObject*                               RetVal;                                            // 0x8(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// 0x10 (0x10 - 0x0)
// Function VerseFortnite.Playspaces_fort_playspace_impl._L_2fFortnite_2ecom_2fPlayspaces_2ffort__playspace_N_RGetTeamCollection
struct UPlayspaces_fort_playspace_impl__L_2fFortnite_2ecom_2fPlayspaces_2ffort__playspace_N_RGetTeamCollection_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_3C60[0x7];                                     // Fixing Size After Last Property 
	class UObject*                               RetVal;                                            // 0x8(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// 0x18 (0x18 - 0x0)
// Function VerseFortnite.Playspaces_fort_playspace_impl._L_2fFortnite_2ecom_2fPlayspaces_2ffort__playspace_N_RGetPlayers
struct UPlayspaces_fort_playspace_impl__L_2fFortnite_2ecom_2fPlayspaces_2ffort__playspace_N_RGetPlayers_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_3C65[0x7];                                     // Fixing Size After Last Property 
	TArray<class USimulation_player*>            RetVal;                                            // 0x8(0x10)(Parm, OutParm, ReturnParm, ContainsInstancedReference)
};

// 0x0 (0x0 - 0x0)
// Function VerseFortnite.Playspaces_fort_playspace_impl.$InitInstance
struct UPlayspaces_fort_playspace_impl__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseFortnite.Playspaces_fort_playspace_impl.$Block
struct UPlayspaces_fort_playspace_impl__Block_Params
{
public:
};

// 0x40 (0x40 - 0x0)
// Function VerseFortnite.Playspaces_fort_playspace_impl.$InitCDO
struct UPlayspaces_fort_playspace_impl__InitCDO_Params
{
public:
	class UVerseEngine_subscribable_event*       _ExprResult_0;                                     // 0x0(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                       _InstancingGraph_1;                                // 0x8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerseEngine_subscribable_event*       _ExprResult_2;                                     // 0x10(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                       _InstancingGraph_3;                                // 0x18(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerseEngine_subscribable_event*       _ExprResult_4;                                     // 0x20(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                       _InstancingGraph_5;                                // 0x28(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerseEngine_subscribable_event*       _ExprResult_6;                                     // 0x30(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                       _InstancingGraph_7;                                // 0x38(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function VerseFortnite.task_AI_ai_behavior$OnBegin.Update
struct UTask_AI_ai_behavior_OnBegin_Update_Params
{
public:
	int64                                        RetVal;                                            // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function VerseFortnite.task_AI_focus_interface$MaintainFocus_L_Nagent_R.Update
struct UTask_AI_focus_interface_MaintainFocus_L_Nagent_R_Update_Params
{
public:
	int64                                        RetVal;                                            // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function VerseFortnite.task_AI_focus_interface$MaintainFocus_L_Nvector3_R.Update
struct UTask_AI_focus_interface_MaintainFocus_L_Nvector3_R_Update_Params
{
public:
	int64                                        RetVal;                                            // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function VerseFortnite.task_AI_navigatable$NavigateTo_L_Nnavigation__target_M_N_QReachRadius_Nfloat_20_3d_20_2e_2e_2e_M_N_QAllowPartialPath_Nlogic_20_3d_20_2e_2e_2e_R.Update
struct UTask_AI_navigatable_NavigateTo_L_Nnavigation__target_M_N_QReachRadius_Nfloat_20_3d_20_2e_2e_2e_M_N_QAllowPartialPath_Nlogic_20_3d_20_2e_2e_2e_R_Update_Params
{
public:
	int64                                        RetVal;                                            // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function VerseFortnite.task_AI_navigatable$Wait_L_N_QDuration_Nfloat_20_3d_20_2e_2e_2e_R.Update
struct UTask_AI_navigatable_Wait_L_N_QDuration_Nfloat_20_3d_20_2e_2e_2e_R_Update_Params
{
public:
	int64                                        RetVal;                                            // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x12 (0x12 - 0x0)
// Function VerseFortnite.Teams_fort_br_team_collection._L_2fFortnite_2ecom_2fTeams_2ffort__team__collection_N_RIsOnTeam_L_Nagent_M_Nteam_R
struct UTeams_fort_br_team_collection__L_2fFortnite_2ecom_2fTeams_2ffort__team__collection_N_RIsOnTeam_L_Nagent_M_Nteam_R_Params
{
public:
	struct FTuple_Lagent_Mteam_R                 __verse_0xB2CDDD72_Argument;                       // 0x0(0x10)(Parm, HasGetValueTypeHash)
	FOptionalProperty_                           RetVal;                                            // 0x10(0x2)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x18 (0x18 - 0x0)
// Function VerseFortnite.Teams_fort_br_team_collection._L_2fFortnite_2ecom_2fTeams_2ffort__team__collection_N_RGetTeams
struct UTeams_fort_br_team_collection__L_2fFortnite_2ecom_2fTeams_2ffort__team__collection_N_RGetTeams_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_3C8C[0x7];                                     // Fixing Size After Last Property 
	TArray<class USimulation_team*>              RetVal;                                            // 0x8(0x10)(Parm, OutParm, ReturnParm, ContainsInstancedReference)
};

// 0x12 (0x12 - 0x0)
// Function VerseFortnite.Teams_fort_br_team_collection._L_2fFortnite_2ecom_2fTeams_2ffort__team__collection_N_RGetTeamAttitude_L_Nteam_M_Nteam_R
struct UTeams_fort_br_team_collection__L_2fFortnite_2ecom_2fTeams_2ffort__team__collection_N_RGetTeamAttitude_L_Nteam_M_Nteam_R_Params
{
public:
	struct FTuple_Lteam_Mteam_R                  __verse_0xB2CDDD72_Argument;                       // 0x0(0x10)(Parm, HasGetValueTypeHash)
	FOptionalProperty_                           RetVal;                                            // 0x10(0x2)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x12 (0x12 - 0x0)
// Function VerseFortnite.Teams_fort_br_team_collection._L_2fFortnite_2ecom_2fTeams_2ffort__team__collection_N_RGetTeamAttitude_L_Nagent_M_Nagent_R
struct UTeams_fort_br_team_collection__L_2fFortnite_2ecom_2fTeams_2ffort__team__collection_N_RGetTeamAttitude_L_Nagent_M_Nagent_R_Params
{
public:
	struct FTuple_Lagent_Magent_R                __verse_0xB2CDDD72_Argument;                       // 0x0(0x10)(Parm, HasGetValueTypeHash)
	FOptionalProperty_                           RetVal;                                            // 0x10(0x2)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x10 (0x10 - 0x0)
// Function VerseFortnite.Teams_fort_br_team_collection._L_2fFortnite_2ecom_2fTeams_2ffort__team__collection_N_RGetTeam_L_Nagent_R
struct UTeams_fort_br_team_collection__L_2fFortnite_2ecom_2fTeams_2ffort__team__collection_N_RGetTeam_L_Nagent_R_Params
{
public:
	class USimulation_agent*                     __verse_0xB2CDDD72_Argument;                       // 0x0(0x8)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FOptionalProperty_                           RetVal;                                            // 0x8(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};

// 0x20 (0x20 - 0x0)
// Function VerseFortnite.Teams_fort_br_team_collection._L_2fFortnite_2ecom_2fTeams_2ffort__team__collection_N_RGetAgents_L_Nteam_R
struct UTeams_fort_br_team_collection__L_2fFortnite_2ecom_2fTeams_2ffort__team__collection_N_RGetAgents_L_Nteam_R_Params
{
public:
	class USimulation_team*                      __verse_0xB2CDDD72_Argument;                       // 0x0(0x8)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FOptionalProperty_                           RetVal;                                            // 0x8(0x18)(Parm, OutParm, ZeroConstructor, ReturnParm, ContainsInstancedReference)
};

// 0x12 (0x12 - 0x0)
// Function VerseFortnite.Teams_fort_br_team_collection._L_2fFortnite_2ecom_2fTeams_2ffort__team__collection_N_RAddToTeam_L_Nagent_M_Nteam_R
struct UTeams_fort_br_team_collection__L_2fFortnite_2ecom_2fTeams_2ffort__team__collection_N_RAddToTeam_L_Nagent_M_Nteam_R_Params
{
public:
	struct FTuple_Lagent_Mteam_R                 __verse_0xB2CDDD72_Argument;                       // 0x0(0x10)(Parm, HasGetValueTypeHash)
	FOptionalProperty_                           RetVal;                                            // 0x10(0x2)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x0 (0x0 - 0x0)
// Function VerseFortnite.Teams_fort_br_team_collection.$InitInstance
struct UTeams_fort_br_team_collection__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseFortnite.Teams_fort_br_team_collection.$Block
struct UTeams_fort_br_team_collection__Block_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseFortnite.Teams_fort_br_team_collection.$InitCDO
struct UTeams_fort_br_team_collection__InitCDO_Params
{
public:
};

// 0x12 (0x12 - 0x0)
// Function VerseFortnite.Teams_fort_minigame_team_collection._L_2fFortnite_2ecom_2fTeams_2ffort__team__collection_N_RIsOnTeam_L_Nagent_M_Nteam_R
struct UTeams_fort_minigame_team_collection__L_2fFortnite_2ecom_2fTeams_2ffort__team__collection_N_RIsOnTeam_L_Nagent_M_Nteam_R_Params
{
public:
	struct FTuple_Lagent_Mteam_R                 __verse_0xB2CDDD72_Argument;                       // 0x0(0x10)(Parm, HasGetValueTypeHash)
	FOptionalProperty_                           RetVal;                                            // 0x10(0x2)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x18 (0x18 - 0x0)
// Function VerseFortnite.Teams_fort_minigame_team_collection._L_2fFortnite_2ecom_2fTeams_2ffort__team__collection_N_RGetTeams
struct UTeams_fort_minigame_team_collection__L_2fFortnite_2ecom_2fTeams_2ffort__team__collection_N_RGetTeams_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_3CAC[0x7];                                     // Fixing Size After Last Property 
	TArray<class USimulation_team*>              RetVal;                                            // 0x8(0x10)(Parm, OutParm, ReturnParm, ContainsInstancedReference)
};

// 0x12 (0x12 - 0x0)
// Function VerseFortnite.Teams_fort_minigame_team_collection._L_2fFortnite_2ecom_2fTeams_2ffort__team__collection_N_RGetTeamAttitude_L_Nteam_M_Nteam_R
struct UTeams_fort_minigame_team_collection__L_2fFortnite_2ecom_2fTeams_2ffort__team__collection_N_RGetTeamAttitude_L_Nteam_M_Nteam_R_Params
{
public:
	struct FTuple_Lteam_Mteam_R                  __verse_0xB2CDDD72_Argument;                       // 0x0(0x10)(Parm, HasGetValueTypeHash)
	FOptionalProperty_                           RetVal;                                            // 0x10(0x2)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x12 (0x12 - 0x0)
// Function VerseFortnite.Teams_fort_minigame_team_collection._L_2fFortnite_2ecom_2fTeams_2ffort__team__collection_N_RGetTeamAttitude_L_Nagent_M_Nagent_R
struct UTeams_fort_minigame_team_collection__L_2fFortnite_2ecom_2fTeams_2ffort__team__collection_N_RGetTeamAttitude_L_Nagent_M_Nagent_R_Params
{
public:
	struct FTuple_Lagent_Magent_R                __verse_0xB2CDDD72_Argument;                       // 0x0(0x10)(Parm, HasGetValueTypeHash)
	FOptionalProperty_                           RetVal;                                            // 0x10(0x2)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x10 (0x10 - 0x0)
// Function VerseFortnite.Teams_fort_minigame_team_collection._L_2fFortnite_2ecom_2fTeams_2ffort__team__collection_N_RGetTeam_L_Nagent_R
struct UTeams_fort_minigame_team_collection__L_2fFortnite_2ecom_2fTeams_2ffort__team__collection_N_RGetTeam_L_Nagent_R_Params
{
public:
	class USimulation_agent*                     __verse_0xB2CDDD72_Argument;                       // 0x0(0x8)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FOptionalProperty_                           RetVal;                                            // 0x8(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};

// 0x20 (0x20 - 0x0)
// Function VerseFortnite.Teams_fort_minigame_team_collection._L_2fFortnite_2ecom_2fTeams_2ffort__team__collection_N_RGetAgents_L_Nteam_R
struct UTeams_fort_minigame_team_collection__L_2fFortnite_2ecom_2fTeams_2ffort__team__collection_N_RGetAgents_L_Nteam_R_Params
{
public:
	class USimulation_team*                      __verse_0xB2CDDD72_Argument;                       // 0x0(0x8)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FOptionalProperty_                           RetVal;                                            // 0x8(0x18)(Parm, OutParm, ZeroConstructor, ReturnParm, ContainsInstancedReference)
};

// 0x12 (0x12 - 0x0)
// Function VerseFortnite.Teams_fort_minigame_team_collection._L_2fFortnite_2ecom_2fTeams_2ffort__team__collection_N_RAddToTeam_L_Nagent_M_Nteam_R
struct UTeams_fort_minigame_team_collection__L_2fFortnite_2ecom_2fTeams_2ffort__team__collection_N_RAddToTeam_L_Nagent_M_Nteam_R_Params
{
public:
	struct FTuple_Lagent_Mteam_R                 __verse_0xB2CDDD72_Argument;                       // 0x0(0x10)(Parm, HasGetValueTypeHash)
	FOptionalProperty_                           RetVal;                                            // 0x10(0x2)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x0 (0x0 - 0x0)
// Function VerseFortnite.Teams_fort_minigame_team_collection.$InitInstance
struct UTeams_fort_minigame_team_collection__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseFortnite.Teams_fort_minigame_team_collection.$Block
struct UTeams_fort_minigame_team_collection__Block_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseFortnite.Teams_fort_minigame_team_collection.$InitCDO
struct UTeams_fort_minigame_team_collection__InitCDO_Params
{
public:
};

// 0x12 (0x12 - 0x0)
// Function VerseFortnite.Teams_fort_team_collection._L_2fFortnite_2ecom_2fTeams_2ffort__team__collection_N_RIsOnTeam_L_Nagent_M_Nteam_R
struct UTeams_fort_team_collection__L_2fFortnite_2ecom_2fTeams_2ffort__team__collection_N_RIsOnTeam_L_Nagent_M_Nteam_R_Params
{
public:
	struct FTuple_Lagent_Mteam_R                 __verse_0xB2CDDD72_Argument;                       // 0x0(0x10)(Parm, HasGetValueTypeHash)
	FOptionalProperty_                           RetVal;                                            // 0x10(0x2)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x18 (0x18 - 0x0)
// Function VerseFortnite.Teams_fort_team_collection._L_2fFortnite_2ecom_2fTeams_2ffort__team__collection_N_RGetTeams
struct UTeams_fort_team_collection__L_2fFortnite_2ecom_2fTeams_2ffort__team__collection_N_RGetTeams_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_3CC8[0x7];                                     // Fixing Size After Last Property 
	TArray<class USimulation_team*>              RetVal;                                            // 0x8(0x10)(Parm, OutParm, ReturnParm, ContainsInstancedReference)
};

// 0x12 (0x12 - 0x0)
// Function VerseFortnite.Teams_fort_team_collection._L_2fFortnite_2ecom_2fTeams_2ffort__team__collection_N_RGetTeamAttitude_L_Nteam_M_Nteam_R
struct UTeams_fort_team_collection__L_2fFortnite_2ecom_2fTeams_2ffort__team__collection_N_RGetTeamAttitude_L_Nteam_M_Nteam_R_Params
{
public:
	struct FTuple_Lteam_Mteam_R                  __verse_0xB2CDDD72_Argument;                       // 0x0(0x10)(Parm, HasGetValueTypeHash)
	FOptionalProperty_                           RetVal;                                            // 0x10(0x2)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x12 (0x12 - 0x0)
// Function VerseFortnite.Teams_fort_team_collection._L_2fFortnite_2ecom_2fTeams_2ffort__team__collection_N_RGetTeamAttitude_L_Nagent_M_Nagent_R
struct UTeams_fort_team_collection__L_2fFortnite_2ecom_2fTeams_2ffort__team__collection_N_RGetTeamAttitude_L_Nagent_M_Nagent_R_Params
{
public:
	struct FTuple_Lagent_Magent_R                __verse_0xB2CDDD72_Argument;                       // 0x0(0x10)(Parm, HasGetValueTypeHash)
	FOptionalProperty_                           RetVal;                                            // 0x10(0x2)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x10 (0x10 - 0x0)
// Function VerseFortnite.Teams_fort_team_collection._L_2fFortnite_2ecom_2fTeams_2ffort__team__collection_N_RGetTeam_L_Nagent_R
struct UTeams_fort_team_collection__L_2fFortnite_2ecom_2fTeams_2ffort__team__collection_N_RGetTeam_L_Nagent_R_Params
{
public:
	class USimulation_agent*                     __verse_0xB2CDDD72_Argument;                       // 0x0(0x8)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FOptionalProperty_                           RetVal;                                            // 0x8(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};

// 0x20 (0x20 - 0x0)
// Function VerseFortnite.Teams_fort_team_collection._L_2fFortnite_2ecom_2fTeams_2ffort__team__collection_N_RGetAgents_L_Nteam_R
struct UTeams_fort_team_collection__L_2fFortnite_2ecom_2fTeams_2ffort__team__collection_N_RGetAgents_L_Nteam_R_Params
{
public:
	class USimulation_team*                      __verse_0xB2CDDD72_Argument;                       // 0x0(0x8)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FOptionalProperty_                           RetVal;                                            // 0x8(0x18)(Parm, OutParm, ZeroConstructor, ReturnParm, ContainsInstancedReference)
};

// 0x12 (0x12 - 0x0)
// Function VerseFortnite.Teams_fort_team_collection._L_2fFortnite_2ecom_2fTeams_2ffort__team__collection_N_RAddToTeam_L_Nagent_M_Nteam_R
struct UTeams_fort_team_collection__L_2fFortnite_2ecom_2fTeams_2ffort__team__collection_N_RAddToTeam_L_Nagent_M_Nteam_R_Params
{
public:
	struct FTuple_Lagent_Mteam_R                 __verse_0xB2CDDD72_Argument;                       // 0x0(0x10)(Parm, HasGetValueTypeHash)
	FOptionalProperty_                           RetVal;                                            // 0x10(0x2)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x18 (0x18 - 0x0)
// Function VerseFortnite.Vehicles._L_2fFortnite_2ecom_2fVehicles_N_Roperator_U_2eGetVehicle_U_L_Nfort__character_M_Ntuple_L_R_M_Ntuple_L_R_R
struct UVehicles__L_2fFortnite_2ecom_2fVehicles_N_Roperator_U_2eGetVehicle_U_L_Nfort__character_M_Ntuple_L_R_M_Ntuple_L_R_R_Params
{
public:
	struct FTuple_Lfort__character_Mtuple_L_R_Mtuple_L_R_R __verse_0xB2CDDD72_Argument;                       // 0x0(0xA)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_3CE9[0x6];                                     // Fixing Size After Last Property 
	FOptionalProperty_                           RetVal;                                            // 0x10(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};

// 0x0 (0x0 - 0x0)
// Function VerseFortnite.Vehicles.$InitCDO
struct UVehicles__InitCDO_Params
{
public:
};

// 0x3 (0x3 - 0x0)
// Function VerseFortnite.Vehicles_fort_vehicle._L_2fFortnite_2ecom_2fVehicles_2ffort__vehicle_N_RIsOnGround
struct UVehicles_fort_vehicle__L_2fFortnite_2ecom_2fVehicles_2ffort__vehicle_N_RIsOnGround_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	FOptionalProperty_                           RetVal;                                            // 0x1(0x2)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x3 (0x3 - 0x0)
// Function VerseFortnite.Vehicles_fort_vehicle._L_2fFortnite_2ecom_2fVehicles_2ffort__vehicle_N_RIsInWater
struct UVehicles_fort_vehicle__L_2fFortnite_2ecom_2fVehicles_2ffort__vehicle_N_RIsInWater_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	FOptionalProperty_                           RetVal;                                            // 0x1(0x2)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x3 (0x3 - 0x0)
// Function VerseFortnite.Vehicles_fort_vehicle._L_2fFortnite_2ecom_2fVehicles_2ffort__vehicle_N_RIsInAir
struct UVehicles_fort_vehicle__L_2fFortnite_2ecom_2fVehicles_2ffort__vehicle_N_RIsInAir_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	FOptionalProperty_                           RetVal;                                            // 0x1(0x2)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x18 (0x18 - 0x0)
// Function VerseFortnite.Vehicles_fort_vehicle._L_2fFortnite_2ecom_2fVehicles_2ffort__vehicle_N_RGetPassengers
struct UVehicles_fort_vehicle__L_2fFortnite_2ecom_2fVehicles_2ffort__vehicle_N_RGetPassengers_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_3CF7[0x7];                                     // Fixing Size After Last Property 
	TArray<class UObject*>                       RetVal;                                            // 0x8(0x10)(Parm, OutParm, ReturnParm, ContainsInstancedReference)
};

// 0x8 (0x8 - 0x0)
// Function VerseFortnite.Vehicles_fort_vehicle_impl._L_2fFortnite_2ecom_2fGame_2fhealthful_N_RSetMaxHealth_L_Nfloat_R
struct UVehicles_fort_vehicle_impl__L_2fFortnite_2ecom_2fGame_2fhealthful_N_RSetMaxHealth_L_Nfloat_R_Params
{
public:
	double                                       __verse_0xB2CDDD72_Argument;                       // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function VerseFortnite.Vehicles_fort_vehicle_impl._L_2fFortnite_2ecom_2fGame_2fhealthful_N_RSetHealth_L_Nfloat_R
struct UVehicles_fort_vehicle_impl__L_2fFortnite_2ecom_2fGame_2fhealthful_N_RSetHealth_L_Nfloat_R_Params
{
public:
	double                                       __verse_0xB2CDDD72_Argument;                       // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x3 (0x3 - 0x0)
// Function VerseFortnite.Vehicles_fort_vehicle_impl._L_2fFortnite_2ecom_2fVehicles_2ffort__vehicle_N_RIsOnGround
struct UVehicles_fort_vehicle_impl__L_2fFortnite_2ecom_2fVehicles_2ffort__vehicle_N_RIsOnGround_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	FOptionalProperty_                           RetVal;                                            // 0x1(0x2)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x3 (0x3 - 0x0)
// Function VerseFortnite.Vehicles_fort_vehicle_impl._L_2fFortnite_2ecom_2fVehicles_2ffort__vehicle_N_RIsInWater
struct UVehicles_fort_vehicle_impl__L_2fFortnite_2ecom_2fVehicles_2ffort__vehicle_N_RIsInWater_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	FOptionalProperty_                           RetVal;                                            // 0x1(0x2)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x3 (0x3 - 0x0)
// Function VerseFortnite.Vehicles_fort_vehicle_impl._L_2fFortnite_2ecom_2fVehicles_2ffort__vehicle_N_RIsInAir
struct UVehicles_fort_vehicle_impl__L_2fFortnite_2ecom_2fVehicles_2ffort__vehicle_N_RIsInAir_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	FOptionalProperty_                           RetVal;                                            // 0x1(0x2)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x70 (0x70 - 0x0)
// Function VerseFortnite.Vehicles_fort_vehicle_impl._L_2fFortnite_2ecom_2fGame_2fpositional_N_RGetTransform
struct UVehicles_fort_vehicle_impl__L_2fFortnite_2ecom_2fGame_2fpositional_N_RGetTransform_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_3D07[0xF];                                     // Fixing Size After Last Property 
	struct FSpatialMath_transform                RetVal;                                            // 0x10(0x60)(Parm, OutParm, ReturnParm, NoDestructor)
};

// 0x18 (0x18 - 0x0)
// Function VerseFortnite.Vehicles_fort_vehicle_impl._L_2fFortnite_2ecom_2fVehicles_2ffort__vehicle_N_RGetPassengers
struct UVehicles_fort_vehicle_impl__L_2fFortnite_2ecom_2fVehicles_2ffort__vehicle_N_RGetPassengers_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_3D0A[0x7];                                     // Fixing Size After Last Property 
	TArray<class UObject*>                       RetVal;                                            // 0x8(0x10)(Parm, OutParm, ReturnParm, ContainsInstancedReference)
};

// 0x10 (0x10 - 0x0)
// Function VerseFortnite.Vehicles_fort_vehicle_impl._L_2fFortnite_2ecom_2fGame_2fhealthful_N_RGetMaxHealth
struct UVehicles_fort_vehicle_impl__L_2fFortnite_2ecom_2fGame_2fhealthful_N_RGetMaxHealth_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_3D0B[0x7];                                     // Fixing Size After Last Property 
	double                                       RetVal;                                            // 0x8(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x10 (0x10 - 0x0)
// Function VerseFortnite.Vehicles_fort_vehicle_impl._L_2fFortnite_2ecom_2fGame_2fhealthful_N_RGetHealth
struct UVehicles_fort_vehicle_impl__L_2fFortnite_2ecom_2fGame_2fhealthful_N_RGetHealth_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_3D11[0x7];                                     // Fixing Size After Last Property 
	double                                       RetVal;                                            // 0x8(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x10 (0x10 - 0x0)
// Function VerseFortnite.Vehicles_fort_vehicle_impl._L_2fFortnite_2ecom_2fGame_2fdamageable_N_RDamagedEvent
struct UVehicles_fort_vehicle_impl__L_2fFortnite_2ecom_2fGame_2fdamageable_N_RDamagedEvent_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_3D13[0x7];                                     // Fixing Size After Last Property 
	class UObject*                               RetVal;                                            // 0x8(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function VerseFortnite.Vehicles_fort_vehicle_impl._L_2fFortnite_2ecom_2fGame_2fdamageable_N_RDamage_L_Nfloat_R
struct UVehicles_fort_vehicle_impl__L_2fFortnite_2ecom_2fGame_2fdamageable_N_RDamage_L_Nfloat_R_Params
{
public:
	double                                       __verse_0xB2CDDD72_Argument;                       // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x18 (0x18 - 0x0)
// Function VerseFortnite.Vehicles_fort_vehicle_impl._L_2fFortnite_2ecom_2fGame_2fdamageable_N_RDamage_L_Ndamage__args_R
struct UVehicles_fort_vehicle_impl__L_2fFortnite_2ecom_2fGame_2fdamageable_N_RDamage_L_Ndamage__args_R_Params
{
public:
	struct FGame_damage_args                     __verse_0xB2CDDD72_Argument;                       // 0x0(0x18)(Parm, NoDestructor)
};

// 0x0 (0x0 - 0x0)
// Function VerseFortnite.Vehicles_fort_vehicle_impl.$InitInstance
struct UVehicles_fort_vehicle_impl__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseFortnite.Vehicles_fort_vehicle_impl.$Block
struct UVehicles_fort_vehicle_impl__Block_Params
{
public:
};

// 0x20 (0x20 - 0x0)
// Function VerseFortnite.Vehicles_fort_vehicle_impl.$InitCDO
struct UVehicles_fort_vehicle_impl__InitCDO_Params
{
public:
	class UVerseEngine_subscribable_event*       _ExprResult_0;                                     // 0x0(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                       _InstancingGraph_1;                                // 0x8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerseEngine_subscribable_event*       _ExprResult_2;                                     // 0x10(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                       _InstancingGraph_3;                                // 0x18(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}
}


