#pragma once

// Dumped with Dumper-7!


#include "../SDK.hpp"

namespace SDK
{
namespace Params
{
//---------------------------------------------------------------------------------------------------------------------
// PARAMETERS
//---------------------------------------------------------------------------------------------------------------------

// 0x40 (0x40 - 0x0)
// Function Verse.Colors._L_2fVerse_2eorg_2fColors_N_Roperator_U_2f_U_L_Ncolor_M_Nint_R
struct UColors__L_2fVerse_2eorg_2fColors_N_Roperator_U_2f_U_L_Ncolor_M_Nint_R_Params
{
public:
	struct FTuple_Lcolor_Mint_R                  __verse_0xB2CDDD72_Argument;                       // 0x0(0x20)(Parm, HasGetValueTypeHash)
	FOptionalProperty_                           RetVal;                                            // 0x20(0x20)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// 0x40 (0x40 - 0x0)
// Function Verse.Colors._L_2fVerse_2eorg_2fColors_N_Roperator_U_2f_U_L_Ncolor_M_Nfloat_R
struct UColors__L_2fVerse_2eorg_2fColors_N_Roperator_U_2f_U_L_Ncolor_M_Nfloat_R_Params
{
public:
	struct FTuple_Lcolor_Mfloat_R                __verse_0xB2CDDD72_Argument;                       // 0x0(0x20)(Parm, HasGetValueTypeHash)
	FOptionalProperty_                           RetVal;                                            // 0x20(0x20)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// 0x48 (0x48 - 0x0)
// Function Verse.Colors._L_2fVerse_2eorg_2fColors_N_Roperator_U_2d_U_L_Ncolor_M_Ncolor_R
struct UColors__L_2fVerse_2eorg_2fColors_N_Roperator_U_2d_U_L_Ncolor_M_Ncolor_R_Params
{
public:
	struct FTuple_Lcolor_Mcolor_R                __verse_0xB2CDDD72_Argument;                       // 0x0(0x30)(Parm, HasGetValueTypeHash)
	struct FColors_color                         RetVal;                                            // 0x30(0x18)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// 0x48 (0x48 - 0x0)
// Function Verse.Colors._L_2fVerse_2eorg_2fColors_N_Roperator_U_2b_U_L_Ncolor_M_Ncolor_R
struct UColors__L_2fVerse_2eorg_2fColors_N_Roperator_U_2b_U_L_Ncolor_M_Ncolor_R_Params
{
public:
	struct FTuple_Lcolor_Mcolor_R                __verse_0xB2CDDD72_Argument;                       // 0x0(0x30)(Parm, HasGetValueTypeHash)
	struct FColors_color                         RetVal;                                            // 0x30(0x18)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// 0x48 (0x48 - 0x0)
// Function Verse.Colors._L_2fVerse_2eorg_2fColors_N_Roperator_U_2a_U_L_Ncolor_M_Ncolor_R
struct UColors__L_2fVerse_2eorg_2fColors_N_Roperator_U_2a_U_L_Ncolor_M_Ncolor_R_Params
{
public:
	struct FTuple_Lcolor_Mcolor_R                __verse_0xB2CDDD72_Argument;                       // 0x0(0x30)(Parm, HasGetValueTypeHash)
	struct FColors_color                         RetVal;                                            // 0x30(0x18)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// 0x38 (0x38 - 0x0)
// Function Verse.Colors._L_2fVerse_2eorg_2fColors_N_Roperator_U_2a_U_L_Ncolor_M_Nfloat_R
struct UColors__L_2fVerse_2eorg_2fColors_N_Roperator_U_2a_U_L_Ncolor_M_Nfloat_R_Params
{
public:
	struct FTuple_Lcolor_Mfloat_R                __verse_0xB2CDDD72_Argument;                       // 0x0(0x20)(Parm, HasGetValueTypeHash)
	struct FColors_color                         RetVal;                                            // 0x20(0x18)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// 0x38 (0x38 - 0x0)
// Function Verse.Colors._L_2fVerse_2eorg_2fColors_N_Roperator_U_2a_U_L_Nfloat_M_Ncolor_R
struct UColors__L_2fVerse_2eorg_2fColors_N_Roperator_U_2a_U_L_Nfloat_M_Ncolor_R_Params
{
public:
	struct FTuple_Lfloat_Mcolor_R                __verse_0xB2CDDD72_Argument;                       // 0x0(0x20)(Parm, HasGetValueTypeHash)
	struct FColors_color                         RetVal;                                            // 0x20(0x18)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// 0x38 (0x38 - 0x0)
// Function Verse.Colors._L_2fVerse_2eorg_2fColors_N_Roperator_U_2a_U_L_Ncolor_M_Nint_R
struct UColors__L_2fVerse_2eorg_2fColors_N_Roperator_U_2a_U_L_Ncolor_M_Nint_R_Params
{
public:
	struct FTuple_Lcolor_Mint_R                  __verse_0xB2CDDD72_Argument;                       // 0x0(0x20)(Parm, HasGetValueTypeHash)
	struct FColors_color                         RetVal;                                            // 0x20(0x18)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// 0x38 (0x38 - 0x0)
// Function Verse.Colors._L_2fVerse_2eorg_2fColors_N_Roperator_U_2a_U_L_Nint_M_Ncolor_R
struct UColors__L_2fVerse_2eorg_2fColors_N_Roperator_U_2a_U_L_Nint_M_Ncolor_R_Params
{
public:
	struct FTuple_Lint_Mcolor_R                  __verse_0xB2CDDD72_Argument;                       // 0x0(0x20)(Parm, HasGetValueTypeHash)
	struct FColors_color                         RetVal;                                            // 0x20(0x18)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// 0x30 (0x30 - 0x0)
// Function Verse.Colors._L_2fVerse_2eorg_2fColors_N_RMakeSRGBFromColor_L_Ncolor_R
struct UColors__L_2fVerse_2eorg_2fColors_N_RMakeSRGBFromColor_L_Ncolor_R_Params
{
public:
	struct FColors_color                         __verse_0xB2CDDD72_Argument;                       // 0x0(0x18)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FTuple_Lfloat_Mfloat_Mfloat_R         RetVal;                                            // 0x18(0x18)(Parm, OutParm, ReturnParm, HasGetValueTypeHash)
};

// 0x30 (0x30 - 0x0)
// Function Verse.Colors._L_2fVerse_2eorg_2fColors_N_RMakeHSVFromColor_L_Ncolor_R
struct UColors__L_2fVerse_2eorg_2fColors_N_RMakeHSVFromColor_L_Ncolor_R_Params
{
public:
	struct FColors_color                         __verse_0xB2CDDD72_Argument;                       // 0x0(0x18)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FTuple_Lfloat_Mfloat_Mfloat_R         RetVal;                                            // 0x18(0x18)(Parm, OutParm, ReturnParm, HasGetValueTypeHash)
};

// 0x20 (0x20 - 0x0)
// Function Verse.Colors._L_2fVerse_2eorg_2fColors_N_RMakeColorFromTemperature_L_Nfloat_R
struct UColors__L_2fVerse_2eorg_2fColors_N_RMakeColorFromTemperature_L_Nfloat_R_Params
{
public:
	double                                       __verse_0xB2CDDD72_Argument;                       // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FColors_color                         RetVal;                                            // 0x8(0x18)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// 0x30 (0x30 - 0x0)
// Function Verse.Colors._L_2fVerse_2eorg_2fColors_N_RMakeColorFromSRGBValues_L_Nint_M_Nint_M_Nint_R
struct UColors__L_2fVerse_2eorg_2fColors_N_RMakeColorFromSRGBValues_L_Nint_M_Nint_M_Nint_R_Params
{
public:
	struct FTuple_Lint_Mint_Mint_R               __verse_0xB2CDDD72_Argument;                       // 0x0(0x18)(Parm, HasGetValueTypeHash)
	struct FColors_color                         RetVal;                                            // 0x18(0x18)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// 0x30 (0x30 - 0x0)
// Function Verse.Colors._L_2fVerse_2eorg_2fColors_N_RMakeColorFromSRGB_L_Nfloat_M_Nfloat_M_Nfloat_R
struct UColors__L_2fVerse_2eorg_2fColors_N_RMakeColorFromSRGB_L_Nfloat_M_Nfloat_M_Nfloat_R_Params
{
public:
	struct FTuple_Lfloat_Mfloat_Mfloat_R         __verse_0xB2CDDD72_Argument;                       // 0x0(0x18)(Parm, HasGetValueTypeHash)
	struct FColors_color                         RetVal;                                            // 0x18(0x18)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// 0x28 (0x28 - 0x0)
// Function Verse.Colors._L_2fVerse_2eorg_2fColors_N_RMakeColorFromHex_L_N_Kchar_R
struct UColors__L_2fVerse_2eorg_2fColors_N_RMakeColorFromHex_L_N_Kchar_R_Params
{
public:
	FVerseStringProperty_                        __verse_0xB2CDDD72_Argument;                       // 0x0(0x10)(Parm, HasGetValueTypeHash)
	struct FColors_color                         RetVal;                                            // 0x10(0x18)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// 0x30 (0x30 - 0x0)
// Function Verse.Colors._L_2fVerse_2eorg_2fColors_N_RMakeColorFromHSV_L_Nfloat_M_Nfloat_M_Nfloat_R
struct UColors__L_2fVerse_2eorg_2fColors_N_RMakeColorFromHSV_L_Nfloat_M_Nfloat_M_Nfloat_R_Params
{
public:
	struct FTuple_Lfloat_Mfloat_Mfloat_R         __verse_0xB2CDDD72_Argument;                       // 0x0(0x18)(Parm, HasGetValueTypeHash)
	struct FColors_color                         RetVal;                                            // 0x18(0x18)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// 0xF2 (0xF2 - 0x0)
// Function Verse.Colors.Colors_color$OverrideFactory
struct UColors_Colors_color_OverrideFactory_Params
{
public:
	struct FColors_color                         RetVal;                                            // 0x0(0x18)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           __verse_0xFB48ED96__InitOverrideMap;               // 0x18(0x50)(ConstParm, Parm, ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResultStack_0;                                // 0x68(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_1;                                     // 0x78(0x2)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2598[0x6];                                     // Fixing Size After Last Property 
	FVerseStringProperty_                        _ExprResultStack_2;                                // 0x80(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_3;                                     // 0x90(0x2)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2599[0x6];                                     // Fixing Size After Last Property 
	FVerseStringProperty_                        _ExprResultStack_4;                                // 0x98(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_5;                                     // 0xA8(0x2)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_259A[0x6];                                     // Fixing Size After Last Property 
	FVerseStringProperty_                        _ExprResultStack_6;                                // 0xB0(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_7;                                     // 0xC0(0x2)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_259E[0x6];                                     // Fixing Size After Last Property 
	FVerseStringProperty_                        _ExprResultStack_8;                                // 0xC8(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_9;                                     // 0xD8(0x2)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_259F[0x6];                                     // Fixing Size After Last Property 
	FVerseStringProperty_                        _ExprResultStack_10;                               // 0xE0(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_11;                                    // 0xF0(0x2)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

// 0x18 (0x18 - 0x0)
// Function Verse.Colors.Colors_color$Factory
struct UColors_Colors_color_Factory_Params
{
public:
	struct FColors_color                         RetVal;                                            // 0x0(0x18)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// 0x0 (0x0 - 0x0)
// Function Verse.Colors.$InitCDO
struct UColors__InitCDO_Params
{
public:
};

// 0x4050 (0x4050 - 0x0)
// Function Verse.Colors_NamedColors.$InitCDO
struct UColors_NamedColors__InitCDO_Params
{
public:
	struct FColors_color                         _ExprResultStack_0;                                // 0x0(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_1;                                         // 0x18(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_2;                                     // 0x28(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_3;                                // 0x38(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_4;                                         // 0x50(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_5;                                     // 0x60(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_6;                                // 0x70(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_7;                                         // 0x88(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_8;                                     // 0x98(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_9;                                // 0xA8(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_10;                                        // 0xC0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_11;                                    // 0xD0(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_12;                               // 0xE0(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_13;                                        // 0xF8(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_14;                                    // 0x108(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_15;                               // 0x118(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_16;                                        // 0x130(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_17;                                    // 0x140(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_18;                               // 0x150(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_19;                                        // 0x168(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_20;                                    // 0x178(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_21;                               // 0x188(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_22;                                        // 0x1A0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_23;                                    // 0x1B0(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_24;                               // 0x1C0(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_25;                                        // 0x1D8(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_26;                                    // 0x1E8(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_27;                               // 0x1F8(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_28;                                        // 0x210(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_29;                                    // 0x220(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_30;                               // 0x230(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_31;                                        // 0x248(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_32;                                    // 0x258(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_33;                               // 0x268(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_34;                                        // 0x280(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_35;                                    // 0x290(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_36;                               // 0x2A0(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_37;                                        // 0x2B8(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_38;                                    // 0x2C8(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_39;                               // 0x2D8(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_40;                                        // 0x2F0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_41;                                    // 0x300(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_42;                               // 0x310(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_43;                                        // 0x328(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_44;                                    // 0x338(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_45;                               // 0x348(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_46;                                        // 0x360(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_47;                                    // 0x370(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_48;                               // 0x380(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_49;                                        // 0x398(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_50;                                    // 0x3A8(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_51;                               // 0x3B8(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_52;                                        // 0x3D0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_53;                                    // 0x3E0(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_54;                               // 0x3F0(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_55;                                        // 0x408(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_56;                                    // 0x418(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_57;                               // 0x428(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_58;                                        // 0x440(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_59;                                    // 0x450(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_60;                               // 0x460(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_61;                                        // 0x478(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_62;                                    // 0x488(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_63;                               // 0x498(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_64;                                        // 0x4B0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_65;                                    // 0x4C0(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_66;                               // 0x4D0(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_67;                                        // 0x4E8(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_68;                                    // 0x4F8(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_69;                               // 0x508(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_70;                                        // 0x520(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_71;                                    // 0x530(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_72;                               // 0x540(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_73;                                        // 0x558(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_74;                                    // 0x568(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_75;                               // 0x578(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_76;                                        // 0x590(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_77;                                    // 0x5A0(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_78;                               // 0x5B0(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_79;                                        // 0x5C8(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_80;                                    // 0x5D8(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_81;                               // 0x5E8(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_82;                                        // 0x600(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_83;                                    // 0x610(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_84;                               // 0x620(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_85;                                        // 0x638(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_86;                                    // 0x648(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_87;                               // 0x658(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_88;                                        // 0x670(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_89;                                    // 0x680(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_90;                               // 0x690(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_91;                                        // 0x6A8(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_92;                                    // 0x6B8(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_93;                               // 0x6C8(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_94;                                        // 0x6E0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_95;                                    // 0x6F0(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_96;                               // 0x700(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_97;                                        // 0x718(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_98;                                    // 0x728(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_99;                               // 0x738(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_100;                                       // 0x750(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_101;                                   // 0x760(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_102;                              // 0x770(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_103;                                       // 0x788(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_104;                                   // 0x798(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_105;                              // 0x7A8(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_106;                                       // 0x7C0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_107;                                   // 0x7D0(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_108;                              // 0x7E0(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_109;                                       // 0x7F8(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_110;                                   // 0x808(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_111;                              // 0x818(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_112;                                       // 0x830(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_113;                                   // 0x840(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_114;                              // 0x850(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_115;                                       // 0x868(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_116;                                   // 0x878(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_117;                              // 0x888(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_118;                                       // 0x8A0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_119;                                   // 0x8B0(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_120;                              // 0x8C0(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_121;                                       // 0x8D8(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_122;                                   // 0x8E8(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_123;                              // 0x8F8(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_124;                                       // 0x910(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_125;                                   // 0x920(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_126;                              // 0x930(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_127;                                       // 0x948(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_128;                                   // 0x958(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_129;                              // 0x968(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_130;                                       // 0x980(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_131;                                   // 0x990(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_132;                              // 0x9A0(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_133;                                       // 0x9B8(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_134;                                   // 0x9C8(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_135;                              // 0x9D8(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_136;                                       // 0x9F0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_137;                                   // 0xA00(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_138;                              // 0xA10(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_139;                                       // 0xA28(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_140;                                   // 0xA38(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_141;                              // 0xA48(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_142;                                       // 0xA60(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_143;                                   // 0xA70(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_144;                              // 0xA80(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_145;                                       // 0xA98(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_146;                                   // 0xAA8(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_147;                              // 0xAB8(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_148;                                       // 0xAD0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_149;                                   // 0xAE0(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_150;                              // 0xAF0(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_151;                                       // 0xB08(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_152;                                   // 0xB18(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_153;                              // 0xB28(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_154;                                       // 0xB40(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_155;                                   // 0xB50(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_156;                              // 0xB60(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_157;                                       // 0xB78(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_158;                                   // 0xB88(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_159;                              // 0xB98(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_160;                                       // 0xBB0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_161;                                   // 0xBC0(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_162;                              // 0xBD0(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_163;                                       // 0xBE8(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_164;                                   // 0xBF8(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_165;                              // 0xC08(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_166;                                       // 0xC20(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_167;                                   // 0xC30(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_168;                              // 0xC40(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_169;                                       // 0xC58(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_170;                                   // 0xC68(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_171;                              // 0xC78(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_172;                                       // 0xC90(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_173;                                   // 0xCA0(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_174;                              // 0xCB0(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_175;                                       // 0xCC8(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_176;                                   // 0xCD8(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_177;                              // 0xCE8(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_178;                                       // 0xD00(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_179;                                   // 0xD10(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_180;                              // 0xD20(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_181;                                       // 0xD38(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_182;                                   // 0xD48(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_183;                              // 0xD58(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_184;                                       // 0xD70(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_185;                                   // 0xD80(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_186;                              // 0xD90(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_187;                                       // 0xDA8(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_188;                                   // 0xDB8(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_189;                              // 0xDC8(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_190;                                       // 0xDE0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_191;                                   // 0xDF0(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_192;                              // 0xE00(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_193;                                       // 0xE18(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_194;                                   // 0xE28(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_195;                              // 0xE38(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_196;                                       // 0xE50(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_197;                                   // 0xE60(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_198;                              // 0xE70(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_199;                                       // 0xE88(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_200;                                   // 0xE98(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_201;                              // 0xEA8(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_202;                                       // 0xEC0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_203;                                   // 0xED0(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_204;                              // 0xEE0(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_205;                                       // 0xEF8(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_206;                                   // 0xF08(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_207;                              // 0xF18(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_208;                                       // 0xF30(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_209;                                   // 0xF40(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_210;                              // 0xF50(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_211;                                       // 0xF68(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_212;                                   // 0xF78(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_213;                              // 0xF88(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_214;                                       // 0xFA0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_215;                                   // 0xFB0(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_216;                              // 0xFC0(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_217;                                       // 0xFD8(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_218;                                   // 0xFE8(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_219;                              // 0xFF8(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_220;                                       // 0x1010(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_221;                                   // 0x1020(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_222;                              // 0x1030(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_223;                                       // 0x1048(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_224;                                   // 0x1058(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_225;                              // 0x1068(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_226;                                       // 0x1080(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_227;                                   // 0x1090(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_228;                              // 0x10A0(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_229;                                       // 0x10B8(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_230;                                   // 0x10C8(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_231;                              // 0x10D8(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_232;                                       // 0x10F0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_233;                                   // 0x1100(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_234;                              // 0x1110(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_235;                                       // 0x1128(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_236;                                   // 0x1138(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_237;                              // 0x1148(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_238;                                       // 0x1160(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_239;                                   // 0x1170(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_240;                              // 0x1180(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_241;                                       // 0x1198(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_242;                                   // 0x11A8(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_243;                              // 0x11B8(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_244;                                       // 0x11D0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_245;                                   // 0x11E0(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_246;                              // 0x11F0(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_247;                                       // 0x1208(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_248;                                   // 0x1218(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_249;                              // 0x1228(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_250;                                       // 0x1240(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_251;                                   // 0x1250(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_252;                              // 0x1260(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_253;                                       // 0x1278(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_254;                                   // 0x1288(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_255;                              // 0x1298(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_256;                                       // 0x12B0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_257;                                   // 0x12C0(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_258;                              // 0x12D0(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_259;                                       // 0x12E8(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_260;                                   // 0x12F8(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_261;                              // 0x1308(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_262;                                       // 0x1320(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_263;                                   // 0x1330(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_264;                              // 0x1340(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_265;                                       // 0x1358(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_266;                                   // 0x1368(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_267;                              // 0x1378(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_268;                                       // 0x1390(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_269;                                   // 0x13A0(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_270;                              // 0x13B0(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_271;                                       // 0x13C8(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_272;                                   // 0x13D8(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_273;                              // 0x13E8(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_274;                                       // 0x1400(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_275;                                   // 0x1410(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_276;                              // 0x1420(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_277;                                       // 0x1438(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_278;                                   // 0x1448(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_279;                              // 0x1458(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_280;                                       // 0x1470(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_281;                                   // 0x1480(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_282;                              // 0x1490(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_283;                                       // 0x14A8(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_284;                                   // 0x14B8(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_285;                              // 0x14C8(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_286;                                       // 0x14E0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_287;                                   // 0x14F0(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_288;                              // 0x1500(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_289;                                       // 0x1518(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_290;                                   // 0x1528(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_291;                              // 0x1538(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_292;                                       // 0x1550(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_293;                                   // 0x1560(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_294;                              // 0x1570(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_295;                                       // 0x1588(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_296;                                   // 0x1598(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_297;                              // 0x15A8(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_298;                                       // 0x15C0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_299;                                   // 0x15D0(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_300;                              // 0x15E0(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_301;                                       // 0x15F8(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_302;                                   // 0x1608(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_303;                              // 0x1618(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_304;                                       // 0x1630(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_305;                                   // 0x1640(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_306;                              // 0x1650(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_307;                                       // 0x1668(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_308;                                   // 0x1678(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_309;                              // 0x1688(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_310;                                       // 0x16A0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_311;                                   // 0x16B0(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_312;                              // 0x16C0(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_313;                                       // 0x16D8(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_314;                                   // 0x16E8(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_315;                              // 0x16F8(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_316;                                       // 0x1710(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_317;                                   // 0x1720(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_318;                              // 0x1730(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_319;                                       // 0x1748(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_320;                                   // 0x1758(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_321;                              // 0x1768(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_322;                                       // 0x1780(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_323;                                   // 0x1790(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_324;                              // 0x17A0(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_325;                                       // 0x17B8(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_326;                                   // 0x17C8(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_327;                              // 0x17D8(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_328;                                       // 0x17F0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_329;                                   // 0x1800(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_330;                              // 0x1810(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_331;                                       // 0x1828(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_332;                                   // 0x1838(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_333;                              // 0x1848(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_334;                                       // 0x1860(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_335;                                   // 0x1870(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_336;                              // 0x1880(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_337;                                       // 0x1898(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_338;                                   // 0x18A8(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_339;                              // 0x18B8(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_340;                                       // 0x18D0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_341;                                   // 0x18E0(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_342;                              // 0x18F0(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_343;                                       // 0x1908(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_344;                                   // 0x1918(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_345;                              // 0x1928(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_346;                                       // 0x1940(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_347;                                   // 0x1950(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_348;                              // 0x1960(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_349;                                       // 0x1978(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_350;                                   // 0x1988(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_351;                              // 0x1998(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_352;                                       // 0x19B0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_353;                                   // 0x19C0(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_354;                              // 0x19D0(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_355;                                       // 0x19E8(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_356;                                   // 0x19F8(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_357;                              // 0x1A08(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_358;                                       // 0x1A20(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_359;                                   // 0x1A30(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_360;                              // 0x1A40(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_361;                                       // 0x1A58(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_362;                                   // 0x1A68(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_363;                              // 0x1A78(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_364;                                       // 0x1A90(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_365;                                   // 0x1AA0(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_366;                              // 0x1AB0(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_367;                                       // 0x1AC8(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_368;                                   // 0x1AD8(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_369;                              // 0x1AE8(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_370;                                       // 0x1B00(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_371;                                   // 0x1B10(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_372;                              // 0x1B20(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_373;                                       // 0x1B38(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_374;                                   // 0x1B48(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_375;                              // 0x1B58(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_376;                                       // 0x1B70(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_377;                                   // 0x1B80(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_378;                              // 0x1B90(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_379;                                       // 0x1BA8(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_380;                                   // 0x1BB8(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_381;                              // 0x1BC8(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_382;                                       // 0x1BE0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_383;                                   // 0x1BF0(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_384;                              // 0x1C00(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_385;                                       // 0x1C18(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_386;                                   // 0x1C28(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_387;                              // 0x1C38(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_388;                                       // 0x1C50(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_389;                                   // 0x1C60(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_390;                              // 0x1C70(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_391;                                       // 0x1C88(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_392;                                   // 0x1C98(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_393;                              // 0x1CA8(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_394;                                       // 0x1CC0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_395;                                   // 0x1CD0(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_396;                              // 0x1CE0(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_397;                                       // 0x1CF8(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_398;                                   // 0x1D08(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_399;                              // 0x1D18(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_400;                                       // 0x1D30(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_401;                                   // 0x1D40(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_402;                              // 0x1D50(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_403;                                       // 0x1D68(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_404;                                   // 0x1D78(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_405;                              // 0x1D88(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_406;                                       // 0x1DA0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_407;                                   // 0x1DB0(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_408;                              // 0x1DC0(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_409;                                       // 0x1DD8(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_410;                                   // 0x1DE8(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_411;                              // 0x1DF8(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_412;                                       // 0x1E10(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_413;                                   // 0x1E20(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_414;                              // 0x1E30(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_415;                                       // 0x1E48(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_416;                                   // 0x1E58(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_417;                              // 0x1E68(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_418;                                       // 0x1E80(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_419;                                   // 0x1E90(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_420;                              // 0x1EA0(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_421;                                       // 0x1EB8(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_422;                                   // 0x1EC8(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_423;                              // 0x1ED8(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_424;                                       // 0x1EF0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_425;                                   // 0x1F00(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_426;                              // 0x1F10(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_427;                                       // 0x1F28(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_428;                                   // 0x1F38(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_429;                              // 0x1F48(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_430;                                       // 0x1F60(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_431;                                   // 0x1F70(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_432;                              // 0x1F80(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_433;                                       // 0x1F98(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_434;                                   // 0x1FA8(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_435;                              // 0x1FB8(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_436;                                       // 0x1FD0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_437;                                   // 0x1FE0(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_438;                              // 0x1FF0(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_439;                                       // 0x2008(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_440;                                   // 0x2018(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_441;                              // 0x2028(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_442;                                       // 0x2040(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_443;                                   // 0x2050(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_444;                              // 0x2060(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_445;                                       // 0x2078(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_446;                                   // 0x2088(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_447;                              // 0x2098(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_448;                                       // 0x20B0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_449;                                   // 0x20C0(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_450;                              // 0x20D0(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_451;                                       // 0x20E8(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_452;                                   // 0x20F8(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_453;                              // 0x2108(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_454;                                       // 0x2120(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_455;                                   // 0x2130(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_456;                              // 0x2140(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_457;                                       // 0x2158(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_458;                                   // 0x2168(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_459;                              // 0x2178(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_460;                                       // 0x2190(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_461;                                   // 0x21A0(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_462;                              // 0x21B0(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_463;                                       // 0x21C8(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_464;                                   // 0x21D8(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_465;                              // 0x21E8(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_466;                                       // 0x2200(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_467;                                   // 0x2210(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_468;                              // 0x2220(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_469;                                       // 0x2238(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_470;                                   // 0x2248(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_471;                              // 0x2258(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_472;                                       // 0x2270(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_473;                                   // 0x2280(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_474;                              // 0x2290(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_475;                                       // 0x22A8(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_476;                                   // 0x22B8(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_477;                              // 0x22C8(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_478;                                       // 0x22E0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_479;                                   // 0x22F0(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_480;                              // 0x2300(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_481;                                       // 0x2318(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_482;                                   // 0x2328(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_483;                              // 0x2338(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_484;                                       // 0x2350(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_485;                                   // 0x2360(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_486;                              // 0x2370(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_487;                                       // 0x2388(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_488;                                   // 0x2398(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_489;                              // 0x23A8(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_490;                                       // 0x23C0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_491;                                   // 0x23D0(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_492;                              // 0x23E0(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_493;                                       // 0x23F8(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_494;                                   // 0x2408(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_495;                              // 0x2418(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_496;                                       // 0x2430(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_497;                                   // 0x2440(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_498;                              // 0x2450(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_499;                                       // 0x2468(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_500;                                   // 0x2478(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_501;                              // 0x2488(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_502;                                       // 0x24A0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_503;                                   // 0x24B0(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_504;                              // 0x24C0(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_505;                                       // 0x24D8(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_506;                                   // 0x24E8(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_507;                              // 0x24F8(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_508;                                       // 0x2510(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_509;                                   // 0x2520(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_510;                              // 0x2530(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_511;                                       // 0x2548(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_512;                                   // 0x2558(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_513;                              // 0x2568(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_514;                                       // 0x2580(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_515;                                   // 0x2590(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_516;                              // 0x25A0(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_517;                                       // 0x25B8(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_518;                                   // 0x25C8(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_519;                              // 0x25D8(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_520;                                       // 0x25F0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_521;                                   // 0x2600(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_522;                              // 0x2610(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_523;                                       // 0x2628(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_524;                                   // 0x2638(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_525;                              // 0x2648(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_526;                                       // 0x2660(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_527;                                   // 0x2670(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_528;                              // 0x2680(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_529;                                       // 0x2698(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_530;                                   // 0x26A8(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_531;                              // 0x26B8(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_532;                                       // 0x26D0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_533;                                   // 0x26E0(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_534;                              // 0x26F0(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_535;                                       // 0x2708(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_536;                                   // 0x2718(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_537;                              // 0x2728(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_538;                                       // 0x2740(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_539;                                   // 0x2750(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_540;                              // 0x2760(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_541;                                       // 0x2778(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_542;                                   // 0x2788(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_543;                              // 0x2798(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_544;                                       // 0x27B0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_545;                                   // 0x27C0(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_546;                              // 0x27D0(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_547;                                       // 0x27E8(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_548;                                   // 0x27F8(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_549;                              // 0x2808(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_550;                                       // 0x2820(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_551;                                   // 0x2830(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_552;                              // 0x2840(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_553;                                       // 0x2858(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_554;                                   // 0x2868(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_555;                              // 0x2878(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_556;                                       // 0x2890(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_557;                                   // 0x28A0(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_558;                              // 0x28B0(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_559;                                       // 0x28C8(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_560;                                   // 0x28D8(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_561;                              // 0x28E8(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_562;                                       // 0x2900(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_563;                                   // 0x2910(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_564;                              // 0x2920(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_565;                                       // 0x2938(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_566;                                   // 0x2948(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_567;                              // 0x2958(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_568;                                       // 0x2970(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_569;                                   // 0x2980(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_570;                              // 0x2990(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_571;                                       // 0x29A8(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_572;                                   // 0x29B8(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_573;                              // 0x29C8(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_574;                                       // 0x29E0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_575;                                   // 0x29F0(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_576;                              // 0x2A00(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_577;                                       // 0x2A18(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_578;                                   // 0x2A28(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_579;                              // 0x2A38(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_580;                                       // 0x2A50(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_581;                                   // 0x2A60(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_582;                              // 0x2A70(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_583;                                       // 0x2A88(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_584;                                   // 0x2A98(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_585;                              // 0x2AA8(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_586;                                       // 0x2AC0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_587;                                   // 0x2AD0(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_588;                              // 0x2AE0(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_589;                                       // 0x2AF8(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_590;                                   // 0x2B08(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_591;                              // 0x2B18(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_592;                                       // 0x2B30(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_593;                                   // 0x2B40(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_594;                              // 0x2B50(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_595;                                       // 0x2B68(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_596;                                   // 0x2B78(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_597;                              // 0x2B88(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_598;                                       // 0x2BA0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_599;                                   // 0x2BB0(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_600;                              // 0x2BC0(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_601;                                       // 0x2BD8(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_602;                                   // 0x2BE8(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_603;                              // 0x2BF8(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_604;                                       // 0x2C10(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_605;                                   // 0x2C20(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_606;                              // 0x2C30(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_607;                                       // 0x2C48(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_608;                                   // 0x2C58(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_609;                              // 0x2C68(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_610;                                       // 0x2C80(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_611;                                   // 0x2C90(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_612;                              // 0x2CA0(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_613;                                       // 0x2CB8(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_614;                                   // 0x2CC8(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_615;                              // 0x2CD8(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_616;                                       // 0x2CF0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_617;                                   // 0x2D00(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_618;                              // 0x2D10(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_619;                                       // 0x2D28(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_620;                                   // 0x2D38(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_621;                              // 0x2D48(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_622;                                       // 0x2D60(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_623;                                   // 0x2D70(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_624;                              // 0x2D80(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_625;                                       // 0x2D98(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_626;                                   // 0x2DA8(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_627;                              // 0x2DB8(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_628;                                       // 0x2DD0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_629;                                   // 0x2DE0(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_630;                              // 0x2DF0(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_631;                                       // 0x2E08(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_632;                                   // 0x2E18(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_633;                              // 0x2E28(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_634;                                       // 0x2E40(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_635;                                   // 0x2E50(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_636;                              // 0x2E60(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_637;                                       // 0x2E78(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_638;                                   // 0x2E88(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_639;                              // 0x2E98(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_640;                                       // 0x2EB0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_641;                                   // 0x2EC0(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_642;                              // 0x2ED0(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_643;                                       // 0x2EE8(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_644;                                   // 0x2EF8(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_645;                              // 0x2F08(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_646;                                       // 0x2F20(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_647;                                   // 0x2F30(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_648;                              // 0x2F40(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_649;                                       // 0x2F58(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_650;                                   // 0x2F68(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_651;                              // 0x2F78(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_652;                                       // 0x2F90(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_653;                                   // 0x2FA0(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_654;                              // 0x2FB0(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_655;                                       // 0x2FC8(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_656;                                   // 0x2FD8(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_657;                              // 0x2FE8(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_658;                                       // 0x3000(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_659;                                   // 0x3010(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_660;                              // 0x3020(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_661;                                       // 0x3038(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_662;                                   // 0x3048(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_663;                              // 0x3058(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_664;                                       // 0x3070(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_665;                                   // 0x3080(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_666;                              // 0x3090(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_667;                                       // 0x30A8(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_668;                                   // 0x30B8(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_669;                              // 0x30C8(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_670;                                       // 0x30E0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_671;                                   // 0x30F0(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_672;                              // 0x3100(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_673;                                       // 0x3118(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_674;                                   // 0x3128(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_675;                              // 0x3138(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_676;                                       // 0x3150(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_677;                                   // 0x3160(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_678;                              // 0x3170(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_679;                                       // 0x3188(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_680;                                   // 0x3198(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_681;                              // 0x31A8(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_682;                                       // 0x31C0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_683;                                   // 0x31D0(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_684;                              // 0x31E0(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_685;                                       // 0x31F8(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_686;                                   // 0x3208(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_687;                              // 0x3218(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_688;                                       // 0x3230(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_689;                                   // 0x3240(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_690;                              // 0x3250(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_691;                                       // 0x3268(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_692;                                   // 0x3278(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_693;                              // 0x3288(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_694;                                       // 0x32A0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_695;                                   // 0x32B0(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_696;                              // 0x32C0(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_697;                                       // 0x32D8(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_698;                                   // 0x32E8(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_699;                              // 0x32F8(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_700;                                       // 0x3310(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_701;                                   // 0x3320(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_702;                              // 0x3330(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_703;                                       // 0x3348(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_704;                                   // 0x3358(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_705;                              // 0x3368(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_706;                                       // 0x3380(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_707;                                   // 0x3390(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_708;                              // 0x33A0(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_709;                                       // 0x33B8(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_710;                                   // 0x33C8(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_711;                              // 0x33D8(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_712;                                       // 0x33F0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_713;                                   // 0x3400(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_714;                              // 0x3410(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_715;                                       // 0x3428(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_716;                                   // 0x3438(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_717;                              // 0x3448(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_718;                                       // 0x3460(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_719;                                   // 0x3470(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_720;                              // 0x3480(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_721;                                       // 0x3498(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_722;                                   // 0x34A8(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_723;                              // 0x34B8(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_724;                                       // 0x34D0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_725;                                   // 0x34E0(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_726;                              // 0x34F0(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_727;                                       // 0x3508(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_728;                                   // 0x3518(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_729;                              // 0x3528(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_730;                                       // 0x3540(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_731;                                   // 0x3550(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_732;                              // 0x3560(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_733;                                       // 0x3578(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_734;                                   // 0x3588(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_735;                              // 0x3598(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_736;                                       // 0x35B0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_737;                                   // 0x35C0(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_738;                              // 0x35D0(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_739;                                       // 0x35E8(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_740;                                   // 0x35F8(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_741;                              // 0x3608(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_742;                                       // 0x3620(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_743;                                   // 0x3630(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_744;                              // 0x3640(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_745;                                       // 0x3658(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_746;                                   // 0x3668(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_747;                              // 0x3678(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_748;                                       // 0x3690(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_749;                                   // 0x36A0(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_750;                              // 0x36B0(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_751;                                       // 0x36C8(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_752;                                   // 0x36D8(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_753;                              // 0x36E8(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_754;                                       // 0x3700(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_755;                                   // 0x3710(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_756;                              // 0x3720(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_757;                                       // 0x3738(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_758;                                   // 0x3748(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_759;                              // 0x3758(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_760;                                       // 0x3770(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_761;                                   // 0x3780(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_762;                              // 0x3790(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_763;                                       // 0x37A8(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_764;                                   // 0x37B8(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_765;                              // 0x37C8(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_766;                                       // 0x37E0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_767;                                   // 0x37F0(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_768;                              // 0x3800(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_769;                                       // 0x3818(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_770;                                   // 0x3828(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_771;                              // 0x3838(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_772;                                       // 0x3850(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_773;                                   // 0x3860(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_774;                              // 0x3870(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_775;                                       // 0x3888(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_776;                                   // 0x3898(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_777;                              // 0x38A8(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_778;                                       // 0x38C0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_779;                                   // 0x38D0(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_780;                              // 0x38E0(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_781;                                       // 0x38F8(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_782;                                   // 0x3908(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_783;                              // 0x3918(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_784;                                       // 0x3930(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_785;                                   // 0x3940(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_786;                              // 0x3950(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_787;                                       // 0x3968(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_788;                                   // 0x3978(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_789;                              // 0x3988(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_790;                                       // 0x39A0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_791;                                   // 0x39B0(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_792;                              // 0x39C0(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_793;                                       // 0x39D8(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_794;                                   // 0x39E8(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_795;                              // 0x39F8(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_796;                                       // 0x3A10(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_797;                                   // 0x3A20(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_798;                              // 0x3A30(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_799;                                       // 0x3A48(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_800;                                   // 0x3A58(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_801;                              // 0x3A68(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_802;                                       // 0x3A80(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_803;                                   // 0x3A90(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_804;                              // 0x3AA0(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_805;                                       // 0x3AB8(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_806;                                   // 0x3AC8(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_807;                              // 0x3AD8(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_808;                                       // 0x3AF0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_809;                                   // 0x3B00(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_810;                              // 0x3B10(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_811;                                       // 0x3B28(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_812;                                   // 0x3B38(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_813;                              // 0x3B48(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_814;                                       // 0x3B60(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_815;                                   // 0x3B70(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_816;                              // 0x3B80(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_817;                                       // 0x3B98(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_818;                                   // 0x3BA8(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_819;                              // 0x3BB8(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_820;                                       // 0x3BD0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_821;                                   // 0x3BE0(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_822;                              // 0x3BF0(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_823;                                       // 0x3C08(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_824;                                   // 0x3C18(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_825;                              // 0x3C28(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_826;                                       // 0x3C40(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_827;                                   // 0x3C50(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_828;                              // 0x3C60(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_829;                                       // 0x3C78(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_830;                                   // 0x3C88(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_831;                              // 0x3C98(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_832;                                       // 0x3CB0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_833;                                   // 0x3CC0(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_834;                              // 0x3CD0(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_835;                                       // 0x3CE8(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_836;                                   // 0x3CF8(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_837;                              // 0x3D08(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_838;                                       // 0x3D20(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_839;                                   // 0x3D30(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_840;                              // 0x3D40(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_841;                                       // 0x3D58(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_842;                                   // 0x3D68(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_843;                              // 0x3D78(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_844;                                       // 0x3D90(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_845;                                   // 0x3DA0(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_846;                              // 0x3DB0(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_847;                                       // 0x3DC8(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_848;                                   // 0x3DD8(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_849;                              // 0x3DE8(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_850;                                       // 0x3E00(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_851;                                   // 0x3E10(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_852;                              // 0x3E20(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_853;                                       // 0x3E38(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_854;                                   // 0x3E48(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_855;                              // 0x3E58(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_856;                                       // 0x3E70(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_857;                                   // 0x3E80(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_858;                              // 0x3E90(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_859;                                       // 0x3EA8(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_860;                                   // 0x3EB8(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_861;                              // 0x3EC8(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_862;                                       // 0x3EE0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_863;                                   // 0x3EF0(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_864;                              // 0x3F00(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_865;                                       // 0x3F18(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_866;                                   // 0x3F28(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_867;                              // 0x3F38(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_868;                                       // 0x3F50(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_869;                                   // 0x3F60(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_870;                              // 0x3F70(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_871;                                       // 0x3F88(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_872;                                   // 0x3F98(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_873;                              // 0x3FA8(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_874;                                       // 0x3FC0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_875;                                   // 0x3FD0(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_876;                              // 0x3FE0(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_877;                                       // 0x3FF8(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_878;                                   // 0x4008(0x10)(HasGetValueTypeHash)
	struct FColors_color                         _ExprResultStack_879;                              // 0x4018(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                      _Callee_880;                                       // 0x4030(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_881;                                   // 0x4040(0x10)(HasGetValueTypeHash)
};

// 0x1D0 (0x1D0 - 0x0)
// Function Verse.Random._L_2fVerse_2eorg_2fRandom_N_RShuffle_L_N_Kt_20where_20t_R
struct URandom__L_2fVerse_2eorg_2fRandom_N_RShuffle_L_N_Kt_20where_20t_R_Params
{
public:
	TArray<FVerseDynamicProperty_>               __verse_0xB2CDDD72_Argument;                       // 0x0(0x10)(Parm, ContainsInstancedReference)
	TArray<FVerseDynamicProperty_>               RetVal;                                            // 0x10(0x10)(Parm, OutParm, ReturnParm, ContainsInstancedReference)
	int64                                        __verse_0x5B0C19A9_Length_1;                       // 0x20(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<FVerseDynamicProperty_>               __verse_0x00000000__2;                             // 0x28(0x10)(ContainsInstancedReference)
	TArray<FVerseDynamicProperty_>               __verse_0x95D09D0E_Result_1;                       // 0x38(0x10)(ContainsInstancedReference)
	struct FVerseIntRange                        _ForIterable_0;                                    // 0x48(0x10)(NoDestructor)
	int64                                        __verse_0x95676A67_i_5;                            // 0x58(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        __verse_0x7BC8DF75_j_7;                            // 0x60(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_1;                                         // 0x68(0x10)(HasGetValueTypeHash)
	struct FTuple_Lint_Mint_R                    _ExprResult_2;                                     // 0x78(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       __verse_0x58C1F360_Temp_8;                         // 0x88(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_3;                                // 0x98(0x18)(ZeroConstructor, HasGetValueTypeHash)
	FReferenceProperty_                          _ExprResultStack_4;                                // 0xB0(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResultStack_5;                                // 0xC0(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_6;                                // 0xD0(0x18)(ZeroConstructor, HasGetValueTypeHash)
	FReferenceProperty_                          _ExprResultStack_7;                                // 0xE8(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        __verse_0x5B0C19A9_Length_9;                       // 0xF8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<FVerseDynamicProperty_>               __verse_0x00000000__10;                            // 0x100(0x10)(ContainsInstancedReference)
	TArray<FVerseDynamicProperty_>               __verse_0x95D09D0E_Result_9;                       // 0x110(0x10)(ContainsInstancedReference)
	struct FVerseIntRange                        _ForIterable_8;                                    // 0x120(0x10)(NoDestructor)
	int64                                        __verse_0x95676A67_i_13;                           // 0x130(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        __verse_0x7BC8DF75_j_15;                           // 0x138(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_9;                                         // 0x140(0x10)(HasGetValueTypeHash)
	struct FTuple_Lint_Mint_R                    _ExprResult_10;                                    // 0x150(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       __verse_0x58C1F360_Temp_16;                        // 0x160(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_11;                               // 0x170(0x18)(ZeroConstructor, HasGetValueTypeHash)
	FReferenceProperty_                          _ExprResultStack_12;                               // 0x188(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResultStack_13;                               // 0x198(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_14;                               // 0x1A8(0x18)(ZeroConstructor, HasGetValueTypeHash)
	FReferenceProperty_                          _ExprResultStack_15;                               // 0x1C0(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x18 (0x18 - 0x0)
// Function Verse.Random._L_2fVerse_2eorg_2fRandom_N_RGetRandomInt_L_Nint_M_Nint_R
struct URandom__L_2fVerse_2eorg_2fRandom_N_RGetRandomInt_L_Nint_M_Nint_R_Params
{
public:
	struct FTuple_Lint_Mint_R                    __verse_0xB2CDDD72_Argument;                       // 0x0(0x10)(Parm, HasGetValueTypeHash)
	int64                                        RetVal;                                            // 0x10(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x18 (0x18 - 0x0)
// Function Verse.Random._L_2fVerse_2eorg_2fRandom_N_RGetRandomFloat_L_Nfloat_M_Nfloat_R
struct URandom__L_2fVerse_2eorg_2fRandom_N_RGetRandomFloat_L_Nfloat_M_Nfloat_R_Params
{
public:
	struct FTuple_Lfloat_Mfloat_R                __verse_0xB2CDDD72_Argument;                       // 0x0(0x10)(Parm, HasGetValueTypeHash)
	double                                       RetVal;                                            // 0x10(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x0 (0x0 - 0x0)
// Function Verse.Random.$InitCDO
struct URandom__InitCDO_Params
{
public:
};

// 0x8 (0x8 - 0x0)
// Function Verse.task_Verse_event$Await.Update
struct UTask_Verse_event_Await_Update_Params
{
public:
	int64                                        RetVal;                                            // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x30 (0x30 - 0x0)
// Function Verse.Verse._L_2fVerse_2eorg_2fVerse_N_Rsubscribable
struct UVerse__L_2fVerse_2eorg_2fVerse_N_Rsubscribable_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_2AC2[0x7];                                     // Fixing Size After Last Property 
	class UClass*                                RetVal;                                            // 0x8(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_0;                                         // 0x10(0x10)(HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_1;                                         // 0x20(0x10)(HasGetValueTypeHash)
};

// 0x10 (0x10 - 0x0)
// Function Verse.Verse._L_2fVerse_2eorg_2fVerse_N_Rsubscribable_L_Nt_20where_20t_R
struct UVerse__L_2fVerse_2eorg_2fVerse_N_Rsubscribable_L_Nt_20where_20t_R_Params
{
public:
	class UClass*                                __verse_0xB2CDDD72_Argument;                       // 0x0(0x8)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UClass*                                RetVal;                                            // 0x8(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// 0x10 (0x10 - 0x0)
// Function Verse.Verse._L_2fVerse_2eorg_2fVerse_N_Rsignalable_L_Npayload_20where_20payload_R
struct UVerse__L_2fVerse_2eorg_2fVerse_N_Rsignalable_L_Npayload_20where_20payload_R_Params
{
public:
	class UClass*                                __verse_0xB2CDDD72_Argument;                       // 0x0(0x8)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UClass*                                RetVal;                                            // 0x8(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// 0x198 (0x198 - 0x0)
// Function Verse.Verse._L_2fVerse_2eorg_2fVerse_N_Roperator_U_2eSlice_U_L_N_Kt_M_Ntuple_L_R_M_Nint_20where_20t_R
struct UVerse__L_2fVerse_2eorg_2fVerse_N_Roperator_U_2eSlice_U_L_N_Kt_M_Ntuple_L_R_M_Nint_20where_20t_R_Params
{
public:
	struct FTuple_L_Kany_Mtuple_L_R_Mint_R       __verse_0xB2CDDD72_Argument;                       // 0x0(0x20)(Parm, HasGetValueTypeHash)
	FOptionalProperty_                           RetVal;                                            // 0x20(0x18)(Parm, OutParm, ZeroConstructor, ReturnParm, ContainsInstancedReference)
	TArray<FVerseDynamicProperty_>               _ExprResult_0;                                     // 0x38(0x10)(ContainsInstancedReference)
	FOptionalProperty_                           _ExprResultStack_1;                                // 0x48(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_2;                                // 0x58(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        _ExprResult_3;                                     // 0x68(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<FVerseDynamicProperty_>               __verse_0x00000000__2;                             // 0x70(0x10)(ContainsInstancedReference)
	TArray<FVerseDynamicProperty_>               _ForResult_4;                                      // 0x80(0x10)(ContainsInstancedReference)
	struct FVerseIntRange                        _ForIterable_5;                                    // 0x90(0x10)(NoDestructor)
	int64                                        _ExprResult_6;                                     // 0xA0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<FVerseDynamicProperty_>               __verse_0x00000000__5;                             // 0xA8(0x10)(ContainsInstancedReference)
	int64                                        __verse_0x98DC86C6_Index_6;                        // 0xB8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_7;                                     // 0xC0(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_8;                                // 0xD0(0x18)(ZeroConstructor, HasGetValueTypeHash)
	TArray<FVerseDynamicProperty_>               _ExprResult_9;                                     // 0xE8(0x10)(ContainsInstancedReference)
	FOptionalProperty_                           _ExprResultStack_10;                               // 0xF8(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_11;                               // 0x108(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        _ExprResult_12;                                    // 0x118(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<FVerseDynamicProperty_>               __verse_0x00000000__10;                            // 0x120(0x10)(ContainsInstancedReference)
	TArray<FVerseDynamicProperty_>               _ForResult_13;                                     // 0x130(0x10)(ContainsInstancedReference)
	struct FVerseIntRange                        _ForIterable_14;                                   // 0x140(0x10)(NoDestructor)
	int64                                        _ExprResult_15;                                    // 0x150(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<FVerseDynamicProperty_>               __verse_0x00000000__13;                            // 0x158(0x10)(ContainsInstancedReference)
	int64                                        __verse_0x98DC86C6_Index_14;                       // 0x168(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_16;                                    // 0x170(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_17;                               // 0x180(0x18)(ZeroConstructor, HasGetValueTypeHash)
};

// 0x190 (0x190 - 0x0)
// Function Verse.Verse._L_2fVerse_2eorg_2fVerse_N_Roperator_U_2eSlice_U_L_N_Kt_M_Ntuple_L_R_M_Ntuple_Lint_Mint_R_20where_20t_R
struct UVerse__L_2fVerse_2eorg_2fVerse_N_Roperator_U_2eSlice_U_L_N_Kt_M_Ntuple_L_R_M_Ntuple_Lint_Mint_R_20where_20t_R_Params
{
public:
	struct FTuple_L_Kany_Mtuple_L_R_Mtuple_Lint_Mint_R_R __verse_0xB2CDDD72_Argument;                       // 0x0(0x28)(Parm, HasGetValueTypeHash)
	FOptionalProperty_                           RetVal;                                            // 0x28(0x18)(Parm, OutParm, ZeroConstructor, ReturnParm, ContainsInstancedReference)
	TArray<FVerseDynamicProperty_>               _ExprResult_0;                                     // 0x40(0x10)(ContainsInstancedReference)
	FOptionalProperty_                           _ExprResultStack_1;                                // 0x50(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_2;                                // 0x60(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_3;                                // 0x70(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        _ExprResult_4;                                     // 0x80(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<FVerseDynamicProperty_>               __verse_0x00000000__2;                             // 0x88(0x10)(ContainsInstancedReference)
	TArray<FVerseDynamicProperty_>               _ForResult_5;                                      // 0x98(0x10)(ContainsInstancedReference)
	struct FVerseIntRange                        _ForIterable_6;                                    // 0xA8(0x10)(NoDestructor)
	int64                                        __verse_0x98DC86C6_Index_5;                        // 0xB8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_7;                                     // 0xC0(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_8;                                // 0xD0(0x18)(ZeroConstructor, HasGetValueTypeHash)
	TArray<FVerseDynamicProperty_>               _ExprResult_9;                                     // 0xE8(0x10)(ContainsInstancedReference)
	FOptionalProperty_                           _ExprResultStack_10;                               // 0xF8(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_11;                               // 0x108(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_12;                               // 0x118(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        _ExprResult_13;                                    // 0x128(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<FVerseDynamicProperty_>               __verse_0x00000000__9;                             // 0x130(0x10)(ContainsInstancedReference)
	TArray<FVerseDynamicProperty_>               _ForResult_14;                                     // 0x140(0x10)(ContainsInstancedReference)
	struct FVerseIntRange                        _ForIterable_15;                                   // 0x150(0x10)(NoDestructor)
	int64                                        __verse_0x98DC86C6_Index_12;                       // 0x160(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_16;                                    // 0x168(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_17;                               // 0x178(0x18)(ZeroConstructor, HasGetValueTypeHash)
};

// 0x280 (0x280 - 0x0)
// Function Verse.Verse._L_2fVerse_2eorg_2fVerse_N_Roperator_U_2eReplaceFirstElement_U_L_N_Kt_M_Ntuple_L_R_M_Ntuple_Lt_Mt_R_20where_20t_R
struct UVerse__L_2fVerse_2eorg_2fVerse_N_Roperator_U_2eReplaceFirstElement_U_L_N_Kt_M_Ntuple_L_R_M_Ntuple_Lt_Mt_R_20where_20t_R_Params
{
public:
	struct FTuple_L_Kany_Mtuple_L_R_Mtuple_Lany_Many_R_R __verse_0xB2CDDD72_Argument;                       // 0x0(0x38)(Parm, HasGetValueTypeHash)
	FOptionalProperty_                           RetVal;                                            // 0x38(0x18)(Parm, OutParm, ZeroConstructor, ReturnParm, ContainsInstancedReference)
	TArray<FVerseDynamicProperty_>               _ExprResult_0;                                     // 0x50(0x10)(ContainsInstancedReference)
	TArray<int64>                                __verse_0x35C8B160_Indices_1;                      // 0x60(0x10)(ContainsInstancedReference)
	TArray<int64>                                _ForResult_1;                                      // 0x70(0x10)(ContainsInstancedReference)
	TArray<FVerseDynamicProperty_>               _ForIterable_2;                                    // 0x80(0x10)(ContainsInstancedReference)
	int64                                        __verse_0x98DC86C6_Index_4;                        // 0x90(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        _ForLength_3;                                      // 0x98(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       __verse_0x68EE242C_Element_4;                      // 0xA0(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       InvokeResultDummy_4;                               // 0xB0(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_5;                                // 0xC0(0x18)(ZeroConstructor, HasGetValueTypeHash)
	int64                                        _ExprResult_6;                                     // 0xD8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_7;                                // 0xE0(0x18)(ZeroConstructor, ContainsInstancedReference)
	FVerseFunctionProperty_                      _Callee_8;                                         // 0xF8(0x10)(HasGetValueTypeHash)
	struct FTuple_L_Kany_Mtuple_L_R_Mtuple_Lint_Many_R_R _ExprResult_9;                                     // 0x108(0x30)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_10;                                    // 0x138(0x1)(HasGetValueTypeHash)
	uint8                                        Pad_2ACD[0x7];                                     // Fixing Size After Last Property 
	struct FTuple_Lint_Many_R                    _ExprResult_11;                                    // 0x140(0x18)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_12;                               // 0x158(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<FVerseDynamicProperty_>               _ExprResult_13;                                    // 0x168(0x10)(ContainsInstancedReference)
	TArray<int64>                                __verse_0x35C8B160_Indices_7;                      // 0x178(0x10)(ContainsInstancedReference)
	TArray<int64>                                _ForResult_14;                                     // 0x188(0x10)(ContainsInstancedReference)
	TArray<FVerseDynamicProperty_>               _ForIterable_15;                                   // 0x198(0x10)(ContainsInstancedReference)
	int64                                        __verse_0x98DC86C6_Index_10;                       // 0x1A8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        _ForLength_16;                                     // 0x1B0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       __verse_0x68EE242C_Element_10;                     // 0x1B8(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       InvokeResultDummy_17;                              // 0x1C8(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_18;                               // 0x1D8(0x18)(ZeroConstructor, HasGetValueTypeHash)
	int64                                        _ExprResult_19;                                    // 0x1F0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_20;                               // 0x1F8(0x18)(ZeroConstructor, ContainsInstancedReference)
	FVerseFunctionProperty_                      _Callee_21;                                        // 0x210(0x10)(HasGetValueTypeHash)
	struct FTuple_L_Kany_Mtuple_L_R_Mtuple_Lint_Many_R_R _ExprResult_22;                                    // 0x220(0x30)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_23;                                    // 0x250(0x1)(HasGetValueTypeHash)
	uint8                                        Pad_2ACE[0x7];                                     // Fixing Size After Last Property 
	struct FTuple_Lint_Many_R                    _ExprResult_24;                                    // 0x258(0x18)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_25;                               // 0x270(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x208 (0x208 - 0x0)
// Function Verse.Verse._L_2fVerse_2eorg_2fVerse_N_Roperator_U_2eReplaceElement_U_L_N_Kt_M_Ntuple_L_R_M_Ntuple_Lint_Mt_R_20where_20t_R
struct UVerse__L_2fVerse_2eorg_2fVerse_N_Roperator_U_2eReplaceElement_U_L_N_Kt_M_Ntuple_L_R_M_Ntuple_Lint_Mt_R_20where_20t_R_Params
{
public:
	struct FTuple_L_Kany_Mtuple_L_R_Mtuple_Lint_Many_R_R __verse_0xB2CDDD72_Argument;                       // 0x0(0x30)(Parm, HasGetValueTypeHash)
	FOptionalProperty_                           RetVal;                                            // 0x30(0x18)(Parm, OutParm, ZeroConstructor, ReturnParm, ContainsInstancedReference)
	TArray<FVerseDynamicProperty_>               _ExprResult_0;                                     // 0x48(0x10)(ContainsInstancedReference)
	FOptionalProperty_                           _ExprResultStack_1;                                // 0x58(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_2;                                // 0x68(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        _ExprResult_3;                                     // 0x78(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<FVerseDynamicProperty_>               __verse_0x00000000__2;                             // 0x80(0x10)(ContainsInstancedReference)
	TArray<FVerseDynamicProperty_>               _ForResult_4;                                      // 0x90(0x10)(ContainsInstancedReference)
	TArray<FVerseDynamicProperty_>               _ForIterable_5;                                    // 0xA0(0x10)(ContainsInstancedReference)
	int64                                        __verse_0x98DC86C6_Index_5;                        // 0xB0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        _ForLength_6;                                      // 0xB8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       __verse_0x6D6B7666_InputElement_5;                 // 0xC0(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_7;                                     // 0xD0(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       InvokeResultDummy_8;                               // 0xE0(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_9;                                // 0xF0(0x18)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_10;                                    // 0x108(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_11;                                    // 0x118(0x10)(HasGetValueTypeHash)
	TArray<FVerseDynamicProperty_>               _ExprResult_12;                                    // 0x128(0x10)(ContainsInstancedReference)
	FOptionalProperty_                           _ExprResultStack_13;                               // 0x138(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_14;                               // 0x148(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        _ExprResult_15;                                    // 0x158(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<FVerseDynamicProperty_>               __verse_0x00000000__11;                            // 0x160(0x10)(ContainsInstancedReference)
	TArray<FVerseDynamicProperty_>               _ForResult_16;                                     // 0x170(0x10)(ContainsInstancedReference)
	TArray<FVerseDynamicProperty_>               _ForIterable_17;                                   // 0x180(0x10)(ContainsInstancedReference)
	int64                                        __verse_0x98DC86C6_Index_14;                       // 0x190(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        _ForLength_18;                                     // 0x198(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       __verse_0x6D6B7666_InputElement_14;                // 0x1A0(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_19;                                    // 0x1B0(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       InvokeResultDummy_20;                              // 0x1C0(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_21;                               // 0x1D0(0x18)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_22;                                    // 0x1E8(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_23;                                    // 0x1F8(0x10)(HasGetValueTypeHash)
};

// 0x138 (0x138 - 0x0)
// Function Verse.Verse._L_2fVerse_2eorg_2fVerse_N_Roperator_U_2eReplaceAllElements_U_L_N_Kt_M_Ntuple_L_R_M_Ntuple_Lt_Mt_R_20where_20t_R
struct UVerse__L_2fVerse_2eorg_2fVerse_N_Roperator_U_2eReplaceAllElements_U_L_N_Kt_M_Ntuple_L_R_M_Ntuple_Lt_Mt_R_20where_20t_R_Params
{
public:
	struct FTuple_L_Kany_Mtuple_L_R_Mtuple_Lany_Many_R_R __verse_0xB2CDDD72_Argument;                       // 0x0(0x38)(Parm, HasGetValueTypeHash)
	TArray<FVerseDynamicProperty_>               RetVal;                                            // 0x38(0x10)(Parm, OutParm, ReturnParm, ContainsInstancedReference)
	TArray<FVerseDynamicProperty_>               _ForResult_0;                                      // 0x48(0x10)(ContainsInstancedReference)
	TArray<FVerseDynamicProperty_>               _ForIterable_1;                                    // 0x58(0x10)(ContainsInstancedReference)
	int64                                        _ForIndex_2;                                       // 0x68(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        _ForLength_3;                                      // 0x70(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       __verse_0x6D6B7666_InputElement_3;                 // 0x78(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_4;                                     // 0x88(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       InvokeResultDummy_5;                               // 0x98(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_6;                                // 0xA8(0x18)(ZeroConstructor, HasGetValueTypeHash)
	TArray<FVerseDynamicProperty_>               _ForResult_7;                                      // 0xC0(0x10)(ContainsInstancedReference)
	TArray<FVerseDynamicProperty_>               _ForIterable_8;                                    // 0xD0(0x10)(ContainsInstancedReference)
	int64                                        _ForIndex_9;                                       // 0xE0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        _ForLength_10;                                     // 0xE8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       __verse_0x6D6B7666_InputElement_10;                // 0xF0(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_11;                                    // 0x100(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       InvokeResultDummy_12;                              // 0x110(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_13;                               // 0x120(0x18)(ZeroConstructor, HasGetValueTypeHash)
};

// 0x588 (0x588 - 0x0)
// Function Verse.Verse._L_2fVerse_2eorg_2fVerse_N_Roperator_U_2eReplaceAll_U_L_N_Kt_M_Ntuple_L_R_M_Ntuple_L_Kt_M_Kt_R_20where_20t_R
struct UVerse__L_2fVerse_2eorg_2fVerse_N_Roperator_U_2eReplaceAll_U_L_N_Kt_M_Ntuple_L_R_M_Ntuple_L_Kt_M_Kt_R_20where_20t_R_Params
{
public:
	struct FTuple_L_Kany_Mtuple_L_R_Mtuple_L_Kany_M_Kany_R_R __verse_0xB2CDDD72_Argument;                       // 0x0(0x38)(Parm, HasGetValueTypeHash)
	TArray<FVerseDynamicProperty_>               RetVal;                                            // 0x38(0x10)(Parm, OutParm, ReturnParm, ContainsInstancedReference)
	int64                                        __verse_0x5B0C19A9_Length_1;                       // 0x48(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<FVerseDynamicProperty_>               __verse_0x00000000__2;                             // 0x50(0x10)(ContainsInstancedReference)
	int64                                        __verse_0xC86D91E0_ToReplaceLength_1;              // 0x60(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<FVerseDynamicProperty_>               __verse_0x00000000__3;                             // 0x68(0x10)(ContainsInstancedReference)
	FVerseDynamicProperty_                       InvokeResultDummy_0;                               // 0x78(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_1;                                // 0x88(0x18)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_2;                                     // 0xA0(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_3;                                     // 0xB0(0x10)(HasGetValueTypeHash)
	TArray<FVerseDynamicProperty_>               __verse_0x95D09D0E_Result_1;                       // 0xC0(0x10)(ContainsInstancedReference)
	TArray<enum class EVerseFalse>               __verse_0xFFC68BC5_Array_6;                        // 0xD0(0x10)(ContainsInstancedReference)
	TArray<FVerseDynamicProperty_>               _ForResult_4;                                      // 0xE0(0x10)(ContainsInstancedReference)
	int64                                        _ForIndex_5;                                       // 0xF0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        _ForLength_6;                                      // 0xF8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class EVerseFalse                       __verse_0xFB88B569_Item_8;                         // 0x100(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        _ExprResult_7 : 1;                                 // Mask: 0x1, PropSize: 0x10x101(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_197 : 7;                                    // Fixing Bit-Field Size 
	uint8                                        Pad_2AED[0x6];                                     // Fixing Size After Last Property 
	int64                                        __verse_0xABC858C7_I_1;                            // 0x108(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        __verse_0x60194205_SliceBeginIndex_1;              // 0x110(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_8;                                // 0x118(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<FVerseDynamicProperty_>               InvokeResultDummy_9;                               // 0x128(0x10)(ContainsInstancedReference)
	TArray<FVerseDynamicProperty_>               _ExprResultStack_10;                               // 0x138(0x10)(ContainsInstancedReference)
	FOptionalProperty_                           _ExprResultStack_11;                               // 0x148(0x18)(ZeroConstructor, ContainsInstancedReference)
	FVerseFunctionProperty_                      _Callee_12;                                        // 0x160(0x10)(HasGetValueTypeHash)
	struct FTuple_L_Kany_Mtuple_L_R_Mtuple_Lint_Mint_R_R _ExprResult_13;                                    // 0x170(0x28)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_14;                                    // 0x198(0x1)(HasGetValueTypeHash)
	uint8                                        Pad_2AEE[0x7];                                     // Fixing Size After Last Property 
	struct FTuple_Lint_Mint_R                    _ExprResult_15;                                    // 0x1A0(0x10)(HasGetValueTypeHash)
	uint8                                        __verse_0x8F8294E0_Matches_10 : 1;                 // Mask: 0x1, PropSize: 0x10x1B0(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_198 : 7;                                    // Fixing Bit-Field Size 
	uint8                                        Pad_2AEF[0x7];                                     // Fixing Size After Last Property 
	int64                                        __verse_0x4567EDD5_J_10;                           // 0x1B8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_16;                               // 0x1C0(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       InvokeResultDummy_17;                              // 0x1D0(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_18;                               // 0x1E0(0x18)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResultStack_19;                               // 0x1F8(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_20;                               // 0x208(0x18)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResultStack_21;                               // 0x220(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_22;                               // 0x230(0x18)(ZeroConstructor, HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_23;                               // 0x248(0x2)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2AF1[0x6];                                     // Fixing Size After Last Property 
	TArray<FVerseDynamicProperty_>               InvokeResultDummy_24;                              // 0x250(0x10)(ContainsInstancedReference)
	TArray<FVerseDynamicProperty_>               _ExprResultStack_25;                               // 0x260(0x10)(ContainsInstancedReference)
	TArray<FVerseDynamicProperty_>               _ExprResultStack_26;                               // 0x270(0x10)(ContainsInstancedReference)
	FOptionalProperty_                           _ExprResultStack_27;                               // 0x280(0x18)(ZeroConstructor, ContainsInstancedReference)
	FVerseFunctionProperty_                      _Callee_28;                                        // 0x298(0x10)(HasGetValueTypeHash)
	struct FTuple_L_Kany_Mtuple_L_R_Mtuple_Lint_Mint_R_R _ExprResult_29;                                    // 0x2A8(0x28)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_30;                                    // 0x2D0(0x1)(HasGetValueTypeHash)
	uint8                                        Pad_2AF2[0x7];                                     // Fixing Size After Last Property 
	struct FTuple_Lint_Mint_R                    _ExprResult_31;                                    // 0x2D8(0x10)(HasGetValueTypeHash)
	int64                                        __verse_0x5B0C19A9_Length_22;                      // 0x2E8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<FVerseDynamicProperty_>               __verse_0x00000000__23;                            // 0x2F0(0x10)(ContainsInstancedReference)
	int64                                        __verse_0xC86D91E0_ToReplaceLength_22;             // 0x300(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<FVerseDynamicProperty_>               __verse_0x00000000__24;                            // 0x308(0x10)(ContainsInstancedReference)
	FVerseDynamicProperty_                       InvokeResultDummy_32;                              // 0x318(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_33;                               // 0x328(0x18)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_34;                                    // 0x340(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_35;                                    // 0x350(0x10)(HasGetValueTypeHash)
	TArray<FVerseDynamicProperty_>               __verse_0x95D09D0E_Result_22;                      // 0x360(0x10)(ContainsInstancedReference)
	TArray<enum class EVerseFalse>               __verse_0xFFC68BC5_Array_27;                       // 0x370(0x10)(ContainsInstancedReference)
	TArray<FVerseDynamicProperty_>               _ForResult_36;                                     // 0x380(0x10)(ContainsInstancedReference)
	int64                                        _ForIndex_37;                                      // 0x390(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        _ForLength_38;                                     // 0x398(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class EVerseFalse                       __verse_0xFB88B569_Item_29;                        // 0x3A0(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        _ExprResult_39 : 1;                                // Mask: 0x1, PropSize: 0x10x3A1(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_199 : 7;                                    // Fixing Bit-Field Size 
	uint8                                        Pad_2AF4[0x6];                                     // Fixing Size After Last Property 
	int64                                        __verse_0xABC858C7_I_22;                           // 0x3A8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        __verse_0x60194205_SliceBeginIndex_22;             // 0x3B0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_40;                               // 0x3B8(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<FVerseDynamicProperty_>               InvokeResultDummy_41;                              // 0x3C8(0x10)(ContainsInstancedReference)
	TArray<FVerseDynamicProperty_>               _ExprResultStack_42;                               // 0x3D8(0x10)(ContainsInstancedReference)
	FOptionalProperty_                           _ExprResultStack_43;                               // 0x3E8(0x18)(ZeroConstructor, ContainsInstancedReference)
	FVerseFunctionProperty_                      _Callee_44;                                        // 0x400(0x10)(HasGetValueTypeHash)
	struct FTuple_L_Kany_Mtuple_L_R_Mtuple_Lint_Mint_R_R _ExprResult_45;                                    // 0x410(0x28)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_46;                                    // 0x438(0x1)(HasGetValueTypeHash)
	uint8                                        Pad_2AF6[0x7];                                     // Fixing Size After Last Property 
	struct FTuple_Lint_Mint_R                    _ExprResult_47;                                    // 0x440(0x10)(HasGetValueTypeHash)
	uint8                                        __verse_0x8F8294E0_Matches_31 : 1;                 // Mask: 0x1, PropSize: 0x10x450(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_19C : 7;                                    // Fixing Bit-Field Size 
	uint8                                        Pad_2AF8[0x7];                                     // Fixing Size After Last Property 
	int64                                        __verse_0x4567EDD5_J_31;                           // 0x458(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_48;                               // 0x460(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       InvokeResultDummy_49;                              // 0x470(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_50;                               // 0x480(0x18)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResultStack_51;                               // 0x498(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_52;                               // 0x4A8(0x18)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResultStack_53;                               // 0x4C0(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_54;                               // 0x4D0(0x18)(ZeroConstructor, HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_55;                               // 0x4E8(0x2)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2AF9[0x6];                                     // Fixing Size After Last Property 
	TArray<FVerseDynamicProperty_>               InvokeResultDummy_56;                              // 0x4F0(0x10)(ContainsInstancedReference)
	TArray<FVerseDynamicProperty_>               _ExprResultStack_57;                               // 0x500(0x10)(ContainsInstancedReference)
	TArray<FVerseDynamicProperty_>               _ExprResultStack_58;                               // 0x510(0x10)(ContainsInstancedReference)
	FOptionalProperty_                           _ExprResultStack_59;                               // 0x520(0x18)(ZeroConstructor, ContainsInstancedReference)
	FVerseFunctionProperty_                      _Callee_60;                                        // 0x538(0x10)(HasGetValueTypeHash)
	struct FTuple_L_Kany_Mtuple_L_R_Mtuple_Lint_Mint_R_R _ExprResult_61;                                    // 0x548(0x28)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_62;                                    // 0x570(0x1)(HasGetValueTypeHash)
	uint8                                        Pad_2AFB[0x7];                                     // Fixing Size After Last Property 
	struct FTuple_Lint_Mint_R                    _ExprResult_63;                                    // 0x578(0x10)(HasGetValueTypeHash)
};

// 0x220 (0x220 - 0x0)
// Function Verse.Verse._L_2fVerse_2eorg_2fVerse_N_Roperator_U_2eRemoveFirstElement_U_L_N_Kt_M_Ntuple_L_R_M_Nt_20where_20t_R
struct UVerse__L_2fVerse_2eorg_2fVerse_N_Roperator_U_2eRemoveFirstElement_U_L_N_Kt_M_Ntuple_L_R_M_Nt_20where_20t_R_Params
{
public:
	struct FTuple_L_Kany_Mtuple_L_R_Many_R       __verse_0xB2CDDD72_Argument;                       // 0x0(0x28)(Parm, HasGetValueTypeHash)
	FOptionalProperty_                           RetVal;                                            // 0x28(0x18)(Parm, OutParm, ZeroConstructor, ReturnParm, ContainsInstancedReference)
	TArray<FVerseDynamicProperty_>               _ExprResult_0;                                     // 0x40(0x10)(ContainsInstancedReference)
	TArray<int64>                                __verse_0x35C8B160_Indices_1;                      // 0x50(0x10)(ContainsInstancedReference)
	TArray<int64>                                _ForResult_1;                                      // 0x60(0x10)(ContainsInstancedReference)
	TArray<FVerseDynamicProperty_>               _ForIterable_2;                                    // 0x70(0x10)(ContainsInstancedReference)
	int64                                        __verse_0x98DC86C6_Index_4;                        // 0x80(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        _ForLength_3;                                      // 0x88(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       __verse_0x68EE242C_Element_4;                      // 0x90(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       InvokeResultDummy_4;                               // 0xA0(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_5;                                // 0xB0(0x18)(ZeroConstructor, HasGetValueTypeHash)
	int64                                        _ExprResult_6;                                     // 0xC8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_7;                                // 0xD0(0x18)(ZeroConstructor, ContainsInstancedReference)
	FVerseFunctionProperty_                      _Callee_8;                                         // 0xE8(0x10)(HasGetValueTypeHash)
	struct FTuple_L_Kany_Mtuple_L_R_Mint_R       _ExprResult_9;                                     // 0xF8(0x20)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_10;                                    // 0x118(0x1)(HasGetValueTypeHash)
	uint8                                        Pad_2AFF[0x7];                                     // Fixing Size After Last Property 
	FOptionalProperty_                           _ExprResultStack_11;                               // 0x120(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<FVerseDynamicProperty_>               _ExprResult_12;                                    // 0x130(0x10)(ContainsInstancedReference)
	TArray<int64>                                __verse_0x35C8B160_Indices_7;                      // 0x140(0x10)(ContainsInstancedReference)
	TArray<int64>                                _ForResult_13;                                     // 0x150(0x10)(ContainsInstancedReference)
	TArray<FVerseDynamicProperty_>               _ForIterable_14;                                   // 0x160(0x10)(ContainsInstancedReference)
	int64                                        __verse_0x98DC86C6_Index_10;                       // 0x170(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        _ForLength_15;                                     // 0x178(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       __verse_0x68EE242C_Element_10;                     // 0x180(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       InvokeResultDummy_16;                              // 0x190(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_17;                               // 0x1A0(0x18)(ZeroConstructor, HasGetValueTypeHash)
	int64                                        _ExprResult_18;                                    // 0x1B8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_19;                               // 0x1C0(0x18)(ZeroConstructor, ContainsInstancedReference)
	FVerseFunctionProperty_                      _Callee_20;                                        // 0x1D8(0x10)(HasGetValueTypeHash)
	struct FTuple_L_Kany_Mtuple_L_R_Mint_R       _ExprResult_21;                                    // 0x1E8(0x20)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_22;                                    // 0x208(0x1)(HasGetValueTypeHash)
	uint8                                        Pad_2B00[0x7];                                     // Fixing Size After Last Property 
	FOptionalProperty_                           _ExprResultStack_23;                               // 0x210(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x1C8 (0x1C8 - 0x0)
// Function Verse.Verse._L_2fVerse_2eorg_2fVerse_N_Roperator_U_2eRemoveElement_U_L_N_Kt_M_Ntuple_L_R_M_Nint_20where_20t_R
struct UVerse__L_2fVerse_2eorg_2fVerse_N_Roperator_U_2eRemoveElement_U_L_N_Kt_M_Ntuple_L_R_M_Nint_20where_20t_R_Params
{
public:
	struct FTuple_L_Kany_Mtuple_L_R_Mint_R       __verse_0xB2CDDD72_Argument;                       // 0x0(0x20)(Parm, HasGetValueTypeHash)
	FOptionalProperty_                           RetVal;                                            // 0x20(0x18)(Parm, OutParm, ZeroConstructor, ReturnParm, ContainsInstancedReference)
	TArray<FVerseDynamicProperty_>               _ExprResult_0;                                     // 0x38(0x10)(ContainsInstancedReference)
	FOptionalProperty_                           _ExprResultStack_1;                                // 0x48(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_2;                                // 0x58(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        _ExprResult_3;                                     // 0x68(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<FVerseDynamicProperty_>               __verse_0x00000000__2;                             // 0x70(0x10)(ContainsInstancedReference)
	TArray<FVerseDynamicProperty_>               _ForResult_4;                                      // 0x80(0x10)(ContainsInstancedReference)
	struct FVerseIntRange                        _ForIterable_5;                                    // 0x90(0x10)(NoDestructor)
	int64                                        _ExprResult_6;                                     // 0xA0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<FVerseDynamicProperty_>               __verse_0x00000000__5;                             // 0xA8(0x10)(ContainsInstancedReference)
	int64                                        __verse_0x720ECD68_OutputIndex_6;                  // 0xB8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_7;                                     // 0xC0(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_8;                                // 0xD0(0x18)(ZeroConstructor, HasGetValueTypeHash)
	int64                                        _ExprResult_9;                                     // 0xE8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_10;                               // 0xF0(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<FVerseDynamicProperty_>               _ExprResult_11;                                    // 0x100(0x10)(ContainsInstancedReference)
	FOptionalProperty_                           _ExprResultStack_12;                               // 0x110(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_13;                               // 0x120(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        _ExprResult_14;                                    // 0x130(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<FVerseDynamicProperty_>               __verse_0x00000000__10;                            // 0x138(0x10)(ContainsInstancedReference)
	TArray<FVerseDynamicProperty_>               _ForResult_15;                                     // 0x148(0x10)(ContainsInstancedReference)
	struct FVerseIntRange                        _ForIterable_16;                                   // 0x158(0x10)(NoDestructor)
	int64                                        _ExprResult_17;                                    // 0x168(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<FVerseDynamicProperty_>               __verse_0x00000000__13;                            // 0x170(0x10)(ContainsInstancedReference)
	int64                                        __verse_0x720ECD68_OutputIndex_14;                 // 0x180(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_18;                                    // 0x188(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_19;                               // 0x198(0x18)(ZeroConstructor, HasGetValueTypeHash)
	int64                                        _ExprResult_20;                                    // 0x1B0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_21;                               // 0x1B8(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x128 (0x128 - 0x0)
// Function Verse.Verse._L_2fVerse_2eorg_2fVerse_N_Roperator_U_2eRemoveAllElements_U_L_N_Kt_M_Ntuple_L_R_M_Nt_20where_20t_R
struct UVerse__L_2fVerse_2eorg_2fVerse_N_Roperator_U_2eRemoveAllElements_U_L_N_Kt_M_Ntuple_L_R_M_Nt_20where_20t_R_Params
{
public:
	struct FTuple_L_Kany_Mtuple_L_R_Many_R       __verse_0xB2CDDD72_Argument;                       // 0x0(0x28)(Parm, HasGetValueTypeHash)
	TArray<FVerseDynamicProperty_>               RetVal;                                            // 0x28(0x10)(Parm, OutParm, ReturnParm, ContainsInstancedReference)
	TArray<FVerseDynamicProperty_>               _ForResult_0;                                      // 0x38(0x10)(ContainsInstancedReference)
	TArray<FVerseDynamicProperty_>               _ForIterable_1;                                    // 0x48(0x10)(ContainsInstancedReference)
	int64                                        _ForIndex_2;                                       // 0x58(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        _ForLength_3;                                      // 0x60(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       __verse_0x6D6B7666_InputElement_3;                 // 0x68(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       InvokeResultDummy_4;                               // 0x78(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_5;                                // 0x88(0x18)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_6;                                     // 0xA0(0x10)(HasGetValueTypeHash)
	TArray<FVerseDynamicProperty_>               _ForResult_7;                                      // 0xB0(0x10)(ContainsInstancedReference)
	TArray<FVerseDynamicProperty_>               _ForIterable_8;                                    // 0xC0(0x10)(ContainsInstancedReference)
	int64                                        _ForIndex_9;                                       // 0xD0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        _ForLength_10;                                     // 0xD8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       __verse_0x6D6B7666_InputElement_8;                 // 0xE0(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       InvokeResultDummy_11;                              // 0xF0(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_12;                               // 0x100(0x18)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_13;                                    // 0x118(0x10)(HasGetValueTypeHash)
};

// 0x1D0 (0x1D0 - 0x0)
// Function Verse.Verse._L_2fVerse_2eorg_2fVerse_N_Roperator_U_2eRemove_U_L_N_Kt_M_Ntuple_L_R_M_Ntuple_Lint_Mint_R_20where_20t_R
struct UVerse__L_2fVerse_2eorg_2fVerse_N_Roperator_U_2eRemove_U_L_N_Kt_M_Ntuple_L_R_M_Ntuple_Lint_Mint_R_20where_20t_R_Params
{
public:
	struct FTuple_L_Kany_Mtuple_L_R_Mtuple_Lint_Mint_R_R __verse_0xB2CDDD72_Argument;                       // 0x0(0x28)(Parm, HasGetValueTypeHash)
	FOptionalProperty_                           RetVal;                                            // 0x28(0x18)(Parm, OutParm, ZeroConstructor, ReturnParm, ContainsInstancedReference)
	TArray<FVerseDynamicProperty_>               _ExprResult_0;                                     // 0x40(0x10)(ContainsInstancedReference)
	FOptionalProperty_                           _ExprResultStack_1;                                // 0x50(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_2;                                // 0x60(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_3;                                // 0x70(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        _ExprResult_4;                                     // 0x80(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<FVerseDynamicProperty_>               __verse_0x00000000__2;                             // 0x88(0x10)(ContainsInstancedReference)
	TArray<FVerseDynamicProperty_>               _ForResult_5;                                      // 0x98(0x10)(ContainsInstancedReference)
	TArray<FVerseDynamicProperty_>               _ForIterable_6;                                    // 0xA8(0x10)(ContainsInstancedReference)
	int64                                        __verse_0x98DC86C6_Index_5;                        // 0xB8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        _ForLength_7;                                      // 0xC0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       __verse_0x68EE242C_Element_5;                      // 0xC8(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_8;                                // 0xD8(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_9;                                // 0xE8(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_10;                                    // 0xF8(0x10)(HasGetValueTypeHash)
	TArray<FVerseDynamicProperty_>               _ExprResult_11;                                    // 0x108(0x10)(ContainsInstancedReference)
	FOptionalProperty_                           _ExprResultStack_12;                               // 0x118(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_13;                               // 0x128(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_14;                               // 0x138(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        _ExprResult_15;                                    // 0x148(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<FVerseDynamicProperty_>               __verse_0x00000000__9;                             // 0x150(0x10)(ContainsInstancedReference)
	TArray<FVerseDynamicProperty_>               _ForResult_16;                                     // 0x160(0x10)(ContainsInstancedReference)
	TArray<FVerseDynamicProperty_>               _ForIterable_17;                                   // 0x170(0x10)(ContainsInstancedReference)
	int64                                        __verse_0x98DC86C6_Index_12;                       // 0x180(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        _ForLength_18;                                     // 0x188(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       __verse_0x68EE242C_Element_12;                     // 0x190(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_19;                               // 0x1A0(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_20;                               // 0x1B0(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_21;                                    // 0x1C0(0x10)(HasGetValueTypeHash)
};

// 0x80 (0x80 - 0x0)
// Function Verse.Verse._L_2fVerse_2eorg_2fVerse_N_Roperator_U_2eIsFinite_U_L_Nfloat_M_Ntuple_L_R_M_Ntuple_L_R_R
struct UVerse__L_2fVerse_2eorg_2fVerse_N_Roperator_U_2eIsFinite_U_L_Nfloat_M_Ntuple_L_R_M_Ntuple_L_R_R_Params
{
public:
	struct FTuple_Lfloat_Mtuple_L_R_Mtuple_L_R_R __verse_0xB2CDDD72_Argument;                       // 0x0(0xA)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_2B11[0x6];                                     // Fixing Size After Last Property 
	FOptionalProperty_                           RetVal;                                            // 0x10(0x10)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class EVerseFalse                       _ExprResult_0;                                     // 0x20(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2B12[0x7];                                     // Fixing Size After Last Property 
	double                                       _ExprResult_1;                                     // 0x28(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_2;                                // 0x30(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_3;                                // 0x40(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class EVerseFalse                       _ExprResult_4;                                     // 0x50(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2B13[0x7];                                     // Fixing Size After Last Property 
	double                                       _ExprResult_5;                                     // 0x58(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_6;                                // 0x60(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_7;                                // 0x70(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x48 (0x48 - 0x0)
// Function Verse.Verse._L_2fVerse_2eorg_2fVerse_N_Roperator_U_2eIsAlmostZero_U_L_Nfloat_M_Ntuple_L_R_M_Nfloat_R
struct UVerse__L_2fVerse_2eorg_2fVerse_N_Roperator_U_2eIsAlmostZero_U_L_Nfloat_M_Ntuple_L_R_M_Nfloat_R_Params
{
public:
	struct FTuple_Lfloat_Mtuple_L_R_Mfloat_R     __verse_0xB2CDDD72_Argument;                       // 0x0(0x18)(Parm, HasGetValueTypeHash)
	FOptionalProperty_                           RetVal;                                            // 0x18(0x2)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        _ExprResult_0 : 1;                                 // Mask: 0x1, PropSize: 0x10x1A(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_19F : 7;                                    // Fixing Bit-Field Size 
	uint8                                        Pad_2B16[0x5];                                     // Fixing Size After Last Property 
	FOptionalProperty_                           _ExprResultStack_1;                                // 0x20(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        _ExprResult_2 : 1;                                 // Mask: 0x1, PropSize: 0x10x30(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_1A0 : 7;                                    // Fixing Bit-Field Size 
	uint8                                        Pad_2B17[0x7];                                     // Fixing Size After Last Property 
	FOptionalProperty_                           _ExprResultStack_3;                                // 0x38(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x2A1 (0x2A1 - 0x0)
// Function Verse.Verse._L_2fVerse_2eorg_2fVerse_N_Roperator_U_2eInsert_U_L_N_Kt_M_Ntuple_L_R_M_Ntuple_Lint_M_Kt_R_20where_20t_R
struct UVerse__L_2fVerse_2eorg_2fVerse_N_Roperator_U_2eInsert_U_L_N_Kt_M_Ntuple_L_R_M_Ntuple_Lint_M_Kt_R_20where_20t_R_Params
{
public:
	struct FTuple_L_Kany_Mtuple_L_R_Mtuple_Lint_M_Kany_R_R __verse_0xB2CDDD72_Argument;                       // 0x0(0x30)(Parm, HasGetValueTypeHash)
	FOptionalProperty_                           RetVal;                                            // 0x30(0x18)(Parm, OutParm, ZeroConstructor, ReturnParm, ContainsInstancedReference)
	TArray<FVerseDynamicProperty_>               _ExprResult_0;                                     // 0x48(0x10)(ContainsInstancedReference)
	FOptionalProperty_                           _ExprResultStack_1;                                // 0x58(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_2;                                // 0x68(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        _ExprResult_3;                                     // 0x78(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<FVerseDynamicProperty_>               __verse_0x00000000__2;                             // 0x80(0x10)(ContainsInstancedReference)
	TArray<FVerseDynamicProperty_>               _ExprResultStack_4;                                // 0x90(0x10)(ContainsInstancedReference)
	TArray<FVerseDynamicProperty_>               _ExprResultStack_5;                                // 0xA0(0x10)(ContainsInstancedReference)
	FOptionalProperty_                           _ExprResultStack_6;                                // 0xB0(0x18)(ZeroConstructor, ContainsInstancedReference)
	FVerseFunctionProperty_                      _Callee_7;                                         // 0xC8(0x10)(HasGetValueTypeHash)
	struct FTuple_L_Kany_Mtuple_L_R_Mtuple_Ltype_7b0_7d_Mint_R_R _ExprResult_8;                                     // 0xD8(0x28)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_9;                                     // 0x100(0x1)(HasGetValueTypeHash)
	uint8                                        Pad_2B21[0x7];                                     // Fixing Size After Last Property 
	struct FTuple_Ltype_7b0_7d_Mint_R            _ExprResult_10;                                    // 0x108(0x10)(HasGetValueTypeHash)
	TArray<FVerseDynamicProperty_>               _ExprResultStack_11;                               // 0x118(0x10)(ContainsInstancedReference)
	FOptionalProperty_                           _ExprResultStack_12;                               // 0x128(0x18)(ZeroConstructor, ContainsInstancedReference)
	FVerseFunctionProperty_                      _Callee_13;                                        // 0x140(0x10)(HasGetValueTypeHash)
	struct FTuple_L_Kany_Mtuple_L_R_Mint_R       _ExprResult_14;                                    // 0x150(0x20)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_15;                                    // 0x170(0x1)(HasGetValueTypeHash)
	uint8                                        Pad_2B22[0x7];                                     // Fixing Size After Last Property 
	TArray<FVerseDynamicProperty_>               _ExprResult_16;                                    // 0x178(0x10)(ContainsInstancedReference)
	FOptionalProperty_                           _ExprResultStack_17;                               // 0x188(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_18;                               // 0x198(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        _ExprResult_19;                                    // 0x1A8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<FVerseDynamicProperty_>               __verse_0x00000000__4;                             // 0x1B0(0x10)(ContainsInstancedReference)
	TArray<FVerseDynamicProperty_>               _ExprResultStack_20;                               // 0x1C0(0x10)(ContainsInstancedReference)
	TArray<FVerseDynamicProperty_>               _ExprResultStack_21;                               // 0x1D0(0x10)(ContainsInstancedReference)
	FOptionalProperty_                           _ExprResultStack_22;                               // 0x1E0(0x18)(ZeroConstructor, ContainsInstancedReference)
	FVerseFunctionProperty_                      _Callee_23;                                        // 0x1F8(0x10)(HasGetValueTypeHash)
	struct FTuple_L_Kany_Mtuple_L_R_Mtuple_Ltype_7b0_7d_Mint_R_R _ExprResult_24;                                    // 0x208(0x28)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_25;                                    // 0x230(0x1)(HasGetValueTypeHash)
	uint8                                        Pad_2B23[0x7];                                     // Fixing Size After Last Property 
	struct FTuple_Ltype_7b0_7d_Mint_R            _ExprResult_26;                                    // 0x238(0x10)(HasGetValueTypeHash)
	TArray<FVerseDynamicProperty_>               _ExprResultStack_27;                               // 0x248(0x10)(ContainsInstancedReference)
	FOptionalProperty_                           _ExprResultStack_28;                               // 0x258(0x18)(ZeroConstructor, ContainsInstancedReference)
	FVerseFunctionProperty_                      _Callee_29;                                        // 0x270(0x10)(HasGetValueTypeHash)
	struct FTuple_L_Kany_Mtuple_L_R_Mint_R       _ExprResult_30;                                    // 0x280(0x20)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_31;                                    // 0x2A0(0x1)(HasGetValueTypeHash)
};

// 0x168 (0x168 - 0x0)
// Function Verse.Verse._L_2fVerse_2eorg_2fVerse_N_Roperator_U_2eFind_U_L_N_Kt_M_Ntuple_L_R_M_Nt_20where_20t_R
struct UVerse__L_2fVerse_2eorg_2fVerse_N_Roperator_U_2eFind_U_L_N_Kt_M_Ntuple_L_R_M_Nt_20where_20t_R_Params
{
public:
	struct FTuple_L_Kany_Mtuple_L_R_Many_R       __verse_0xB2CDDD72_Argument;                       // 0x0(0x28)(Parm, HasGetValueTypeHash)
	FOptionalProperty_                           RetVal;                                            // 0x28(0x10)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        _ExprResult_0;                                     // 0x38(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<int64>                                __verse_0x982D8E7C_Results_1;                      // 0x40(0x10)(ContainsInstancedReference)
	TArray<int64>                                _ForResult_1;                                      // 0x50(0x10)(ContainsInstancedReference)
	TArray<FVerseDynamicProperty_>               _ForIterable_2;                                    // 0x60(0x10)(ContainsInstancedReference)
	int64                                        __verse_0x98DC86C6_Index_4;                        // 0x70(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        _ForLength_3;                                      // 0x78(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       __verse_0x68EE242C_Element_4;                      // 0x80(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       InvokeResultDummy_4;                               // 0x90(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_5;                                // 0xA0(0x18)(ZeroConstructor, HasGetValueTypeHash)
	int64                                        _ExprResult_6;                                     // 0xB8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_7;                                // 0xC0(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        _ExprResult_8;                                     // 0xD0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<int64>                                __verse_0x982D8E7C_Results_7;                      // 0xD8(0x10)(ContainsInstancedReference)
	TArray<int64>                                _ForResult_9;                                      // 0xE8(0x10)(ContainsInstancedReference)
	TArray<FVerseDynamicProperty_>               _ForIterable_10;                                   // 0xF8(0x10)(ContainsInstancedReference)
	int64                                        __verse_0x98DC86C6_Index_10;                       // 0x108(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        _ForLength_11;                                     // 0x110(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       __verse_0x68EE242C_Element_10;                     // 0x118(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       InvokeResultDummy_12;                              // 0x128(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_13;                               // 0x138(0x18)(ZeroConstructor, HasGetValueTypeHash)
	int64                                        _ExprResult_14;                                    // 0x150(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_15;                               // 0x158(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x30 (0x30 - 0x0)
// Function Verse.Verse._L_2fVerse_2eorg_2fVerse_N_Rlistenable
struct UVerse__L_2fVerse_2eorg_2fVerse_N_Rlistenable_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_2B27[0x7];                                     // Fixing Size After Last Property 
	class UClass*                                RetVal;                                            // 0x8(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_0;                                         // 0x10(0x10)(HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_1;                                         // 0x20(0x10)(HasGetValueTypeHash)
};

// 0x10 (0x10 - 0x0)
// Function Verse.Verse._L_2fVerse_2eorg_2fVerse_N_Rlistenable_L_Npayload_20where_20payload_R
struct UVerse__L_2fVerse_2eorg_2fVerse_N_Rlistenable_L_Npayload_20where_20payload_R_Params
{
public:
	class UClass*                                __verse_0xB2CDDD72_Argument;                       // 0x0(0x8)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UClass*                                RetVal;                                            // 0x8(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// 0x10 (0x10 - 0x0)
// Function Verse.Verse._L_2fVerse_2eorg_2fVerse_N_Revent_L_Nt_20where_20t_R
struct UVerse__L_2fVerse_2eorg_2fVerse_N_Revent_L_Nt_20where_20t_R_Params
{
public:
	class UClass*                                __verse_0xB2CDDD72_Argument;                       // 0x0(0x8)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UClass*                                RetVal;                                            // 0x8(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// 0x30 (0x30 - 0x0)
// Function Verse.Verse._L_2fVerse_2eorg_2fVerse_N_Revent
struct UVerse__L_2fVerse_2eorg_2fVerse_N_Revent_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_2B2A[0x7];                                     // Fixing Size After Last Property 
	class UClass*                                RetVal;                                            // 0x8(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_0;                                         // 0x10(0x10)(HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_1;                                         // 0x20(0x10)(HasGetValueTypeHash)
};

// 0x18 (0x18 - 0x0)
// Function Verse.Verse._L_2fVerse_2eorg_2fVerse_N_RToString_L_Nchar32_R
struct UVerse__L_2fVerse_2eorg_2fVerse_N_RToString_L_Nchar32_R_Params
{
public:
	int32                                        __verse_0xB2CDDD72_Argument;                       // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2B2B[0x4];                                     // Fixing Size After Last Property 
	FVerseStringProperty_                        RetVal;                                            // 0x8(0x10)(Parm, OutParm, ReturnParm, HasGetValueTypeHash)
};

// 0x18 (0x18 - 0x0)
// Function Verse.Verse._L_2fVerse_2eorg_2fVerse_N_RToString_L_Nchar_R
struct UVerse__L_2fVerse_2eorg_2fVerse_N_RToString_L_Nchar_R_Params
{
public:
	uint8                                        __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2B2C[0x7];                                     // Fixing Size After Last Property 
	FVerseStringProperty_                        RetVal;                                            // 0x8(0x10)(Parm, OutParm, ReturnParm, HasGetValueTypeHash)
};

// 0x18 (0x18 - 0x0)
// Function Verse.Verse._L_2fVerse_2eorg_2fVerse_N_RToString_L_Nfloat_R
struct UVerse__L_2fVerse_2eorg_2fVerse_N_RToString_L_Nfloat_R_Params
{
public:
	double                                       __verse_0xB2CDDD72_Argument;                       // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                        RetVal;                                            // 0x8(0x10)(Parm, OutParm, ReturnParm, HasGetValueTypeHash)
};

// 0x18 (0x18 - 0x0)
// Function Verse.Verse._L_2fVerse_2eorg_2fVerse_N_RToString_L_Nint_R
struct UVerse__L_2fVerse_2eorg_2fVerse_N_RToString_L_Nint_R_Params
{
public:
	int64                                        __verse_0xB2CDDD72_Argument;                       // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                        RetVal;                                            // 0x8(0x10)(Parm, OutParm, ReturnParm, HasGetValueTypeHash)
};

// 0x20 (0x20 - 0x0)
// Function Verse.Verse._L_2fVerse_2eorg_2fVerse_N_RToString_L_N_Kchar_R
struct UVerse__L_2fVerse_2eorg_2fVerse_N_RToString_L_N_Kchar_R_Params
{
public:
	FVerseStringProperty_                        __verse_0xB2CDDD72_Argument;                       // 0x0(0x10)(Parm, HasGetValueTypeHash)
	FVerseStringProperty_                        RetVal;                                            // 0x10(0x10)(Parm, OutParm, ReturnParm, HasGetValueTypeHash)
};

// 0x10 (0x10 - 0x0)
// Function Verse.Verse._L_2fVerse_2eorg_2fVerse_N_RTanh_L_Nfloat_R
struct UVerse__L_2fVerse_2eorg_2fVerse_N_RTanh_L_Nfloat_R_Params
{
public:
	double                                       __verse_0xB2CDDD72_Argument;                       // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       RetVal;                                            // 0x8(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x10 (0x10 - 0x0)
// Function Verse.Verse._L_2fVerse_2eorg_2fVerse_N_RTan_L_Nfloat_R
struct UVerse__L_2fVerse_2eorg_2fVerse_N_RTan_L_Nfloat_R_Params
{
public:
	double                                       __verse_0xB2CDDD72_Argument;                       // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       RetVal;                                            // 0x8(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x10 (0x10 - 0x0)
// Function Verse.Verse._L_2fVerse_2eorg_2fVerse_N_RSqrt_L_Nfloat_R
struct UVerse__L_2fVerse_2eorg_2fVerse_N_RSqrt_L_Nfloat_R_Params
{
public:
	double                                       __verse_0xB2CDDD72_Argument;                       // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       RetVal;                                            // 0x8(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x10 (0x10 - 0x0)
// Function Verse.Verse._L_2fVerse_2eorg_2fVerse_N_RSinh_L_Nfloat_R
struct UVerse__L_2fVerse_2eorg_2fVerse_N_RSinh_L_Nfloat_R_Params
{
public:
	double                                       __verse_0xB2CDDD72_Argument;                       // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       RetVal;                                            // 0x8(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x10 (0x10 - 0x0)
// Function Verse.Verse._L_2fVerse_2eorg_2fVerse_N_RSin_L_Nfloat_R
struct UVerse__L_2fVerse_2eorg_2fVerse_N_RSin_L_Nfloat_R_Params
{
public:
	double                                       __verse_0xB2CDDD72_Argument;                       // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       RetVal;                                            // 0x8(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x50 (0x50 - 0x0)
// Function Verse.Verse._L_2fVerse_2eorg_2fVerse_N_RSgn_L_Nint_R
struct UVerse__L_2fVerse_2eorg_2fVerse_N_RSgn_L_Nint_R_Params
{
public:
	int64                                        __verse_0xB2CDDD72_Argument;                       // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        RetVal;                                            // 0x8(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_0;                                // 0x10(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_1;                                // 0x20(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_2;                                // 0x30(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_3;                                // 0x40(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0xE0 (0xE0 - 0x0)
// Function Verse.Verse._L_2fVerse_2eorg_2fVerse_N_RSgn_L_Nfloat_R
struct UVerse__L_2fVerse_2eorg_2fVerse_N_RSgn_L_Nfloat_R_Params
{
public:
	double                                       __verse_0xB2CDDD72_Argument;                       // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       RetVal;                                            // 0x8(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       InvokeResultDummy_0;                               // 0x10(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_1;                                // 0x20(0x18)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_2;                                     // 0x38(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_3;                                     // 0x48(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_4;                                // 0x58(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_5;                                // 0x68(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       InvokeResultDummy_6;                               // 0x78(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_7;                                // 0x88(0x18)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_8;                                     // 0xA0(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_9;                                     // 0xB0(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_10;                               // 0xC0(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_11;                               // 0xD0(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x18 (0x18 - 0x0)
// Function Verse.Verse._L_2fVerse_2eorg_2fVerse_N_RRound_L_Nfloat_R
struct UVerse__L_2fVerse_2eorg_2fVerse_N_RRound_L_Nfloat_R_Params
{
public:
	double                                       __verse_0xB2CDDD72_Argument;                       // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FOptionalProperty_                           RetVal;                                            // 0x8(0x10)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x20 (0x20 - 0x0)
// Function Verse.Verse._L_2fVerse_2eorg_2fVerse_N_RQuotient_L_Nint_M_Nint_R
struct UVerse__L_2fVerse_2eorg_2fVerse_N_RQuotient_L_Nint_M_Nint_R_Params
{
public:
	struct FTuple_Lint_Mint_R                    __verse_0xB2CDDD72_Argument;                       // 0x0(0x10)(Parm, HasGetValueTypeHash)
	FOptionalProperty_                           RetVal;                                            // 0x10(0x10)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x40 (0x40 - 0x0)
// Function Verse.Verse._L_2fVerse_2eorg_2fVerse_N_RPrint_L_N_Kchar_M_N_QDuration_Nfloat_20_3d_20_2e_2e_2e_M_N_QColor_Ncolor_20_3d_20_2e_2e_2e_R
struct UVerse__L_2fVerse_2eorg_2fVerse_N_RPrint_L_N_Kchar_M_N_QDuration_Nfloat_20_3d_20_2e_2e_2e_M_N_QColor_Ncolor_20_3d_20_2e_2e_2e_R_Params
{
public:
	struct FTuple_L_Kchar_M_QDuration_Nfloat_20_3d_20_2e_2e_2e_M_QColor_Ncolor_20_3d_20_2e_2e_2e_R __verse_0xB2CDDD72_Argument;                       // 0x0(0x40)(Parm, HasGetValueTypeHash)
};

// 0x18 (0x18 - 0x0)
// Function Verse.Verse._L_2fVerse_2eorg_2fVerse_N_RPow_L_Nfloat_M_Nfloat_R
struct UVerse__L_2fVerse_2eorg_2fVerse_N_RPow_L_Nfloat_M_Nfloat_R_Params
{
public:
	struct FTuple_Lfloat_Mfloat_R                __verse_0xB2CDDD72_Argument;                       // 0x0(0x10)(Parm, HasGetValueTypeHash)
	double                                       RetVal;                                            // 0x10(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x20 (0x20 - 0x0)
// Function Verse.Verse._L_2fVerse_2eorg_2fVerse_N_RMod_L_Nint_M_Nint_R
struct UVerse__L_2fVerse_2eorg_2fVerse_N_RMod_L_Nint_M_Nint_R_Params
{
public:
	struct FTuple_Lint_Mint_R                    __verse_0xB2CDDD72_Argument;                       // 0x0(0x10)(Parm, HasGetValueTypeHash)
	FOptionalProperty_                           RetVal;                                            // 0x10(0x10)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x38 (0x38 - 0x0)
// Function Verse.Verse._L_2fVerse_2eorg_2fVerse_N_RMin_L_Nint_M_Nint_R
struct UVerse__L_2fVerse_2eorg_2fVerse_N_RMin_L_Nint_M_Nint_R_Params
{
public:
	struct FTuple_Lint_Mint_R                    __verse_0xB2CDDD72_Argument;                       // 0x0(0x10)(Parm, HasGetValueTypeHash)
	int64                                        RetVal;                                            // 0x10(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_0;                                // 0x18(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_1;                                // 0x28(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0xC8 (0xC8 - 0x0)
// Function Verse.Verse._L_2fVerse_2eorg_2fVerse_N_RMin_L_Nfloat_M_Nfloat_R
struct UVerse__L_2fVerse_2eorg_2fVerse_N_RMin_L_Nfloat_M_Nfloat_R_Params
{
public:
	struct FTuple_Lfloat_Mfloat_R                __verse_0xB2CDDD72_Argument;                       // 0x0(0x10)(Parm, HasGetValueTypeHash)
	double                                       RetVal;                                            // 0x10(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_0;                                // 0x18(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResultStack_1;                                // 0x28(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_2;                                // 0x38(0x18)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_3;                                     // 0x50(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_4;                                     // 0x60(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_5;                                // 0x70(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResultStack_6;                                // 0x80(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_7;                                // 0x90(0x18)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_8;                                     // 0xA8(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_9;                                     // 0xB8(0x10)(HasGetValueTypeHash)
};

// 0x38 (0x38 - 0x0)
// Function Verse.Verse._L_2fVerse_2eorg_2fVerse_N_RMax_L_Nint_M_Nint_R
struct UVerse__L_2fVerse_2eorg_2fVerse_N_RMax_L_Nint_M_Nint_R_Params
{
public:
	struct FTuple_Lint_Mint_R                    __verse_0xB2CDDD72_Argument;                       // 0x0(0x10)(Parm, HasGetValueTypeHash)
	int64                                        RetVal;                                            // 0x10(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_0;                                // 0x18(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_1;                                // 0x28(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0xC8 (0xC8 - 0x0)
// Function Verse.Verse._L_2fVerse_2eorg_2fVerse_N_RMax_L_Nfloat_M_Nfloat_R
struct UVerse__L_2fVerse_2eorg_2fVerse_N_RMax_L_Nfloat_M_Nfloat_R_Params
{
public:
	struct FTuple_Lfloat_Mfloat_R                __verse_0xB2CDDD72_Argument;                       // 0x0(0x10)(Parm, HasGetValueTypeHash)
	double                                       RetVal;                                            // 0x10(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_0;                                // 0x18(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResultStack_1;                                // 0x28(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_2;                                // 0x38(0x18)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_3;                                     // 0x50(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_4;                                     // 0x60(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_5;                                // 0x70(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResultStack_6;                                // 0x80(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_7;                                // 0x90(0x18)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_8;                                     // 0xA8(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_9;                                     // 0xB8(0x10)(HasGetValueTypeHash)
};

// 0x78 (0x78 - 0x0)
// Function Verse.Verse._L_2fVerse_2eorg_2fVerse_N_RMakeMessageInternal_L_N_Kchar_M_N_Kchar_M_N_5b_Kchar_5dlocalizable__value_R
struct UVerse__L_2fVerse_2eorg_2fVerse_N_RMakeMessageInternal_L_N_Kchar_M_N_Kchar_M_N_5b_Kchar_5dlocalizable__value_R_Params
{
public:
	struct FTuple_L_Kchar_M_Kchar_M_5b_Kchar_5dlocalizable__value_R __verse_0xB2CDDD72_Argument;                       // 0x0(0x70)(Parm, HasGetValueTypeHash)
	class UVerse_message*                        RetVal;                                            // 0x70(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// 0x20 (0x20 - 0x0)
// Function Verse.Verse._L_2fVerse_2eorg_2fVerse_N_RMakeLocalizableValue_L_Nmessage_R
struct UVerse__L_2fVerse_2eorg_2fVerse_N_RMakeLocalizableValue_L_Nmessage_R_Params
{
public:
	class UVerse_message*                        __verse_0xB2CDDD72_Argument;                       // 0x0(0x8)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerse_localizable_message*            RetVal;                                            // 0x8(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                       _InstancingGraph_0;                                // 0x10(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint64                                       _InstancingGraph_1;                                // 0x18(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x28 (0x28 - 0x0)
// Function Verse.Verse._L_2fVerse_2eorg_2fVerse_N_RMakeLocalizableValue_L_N_Kchar_R
struct UVerse__L_2fVerse_2eorg_2fVerse_N_RMakeLocalizableValue_L_N_Kchar_R_Params
{
public:
	FVerseStringProperty_                        __verse_0xB2CDDD72_Argument;                       // 0x0(0x10)(Parm, HasGetValueTypeHash)
	class UVerse_localizable_string*             RetVal;                                            // 0x10(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                       _InstancingGraph_0;                                // 0x18(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint64                                       _InstancingGraph_1;                                // 0x20(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x20 (0x20 - 0x0)
// Function Verse.Verse._L_2fVerse_2eorg_2fVerse_N_RMakeLocalizableValue_L_Nint_R
struct UVerse__L_2fVerse_2eorg_2fVerse_N_RMakeLocalizableValue_L_Nint_R_Params
{
public:
	int64                                        __verse_0xB2CDDD72_Argument;                       // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerse_localizable_int*                RetVal;                                            // 0x8(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                       _InstancingGraph_0;                                // 0x10(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint64                                       _InstancingGraph_1;                                // 0x18(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x20 (0x20 - 0x0)
// Function Verse.Verse._L_2fVerse_2eorg_2fVerse_N_RMakeLocalizableValue_L_Nfloat_R
struct UVerse__L_2fVerse_2eorg_2fVerse_N_RMakeLocalizableValue_L_Nfloat_R_Params
{
public:
	double                                       __verse_0xB2CDDD72_Argument;                       // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerse_localizable_float*              RetVal;                                            // 0x8(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                       _InstancingGraph_0;                                // 0x10(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint64                                       _InstancingGraph_1;                                // 0x18(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x78 (0x78 - 0x0)
// Function Verse.Verse._L_2fVerse_2eorg_2fVerse_N_RLog_L_Nfloat_M_Nfloat_R
struct UVerse__L_2fVerse_2eorg_2fVerse_N_RLog_L_Nfloat_M_Nfloat_R_Params
{
public:
	struct FTuple_Lfloat_Mfloat_R                __verse_0xB2CDDD72_Argument;                       // 0x0(0x10)(Parm, HasGetValueTypeHash)
	double                                       RetVal;                                            // 0x10(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       _ExprResultStack_0;                                // 0x18(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_1;                                         // 0x20(0x10)(HasGetValueTypeHash)
	double                                       _ExprResultStack_2;                                // 0x30(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_3;                                         // 0x38(0x10)(HasGetValueTypeHash)
	double                                       _ExprResultStack_4;                                // 0x48(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_5;                                         // 0x50(0x10)(HasGetValueTypeHash)
	double                                       _ExprResultStack_6;                                // 0x60(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_7;                                         // 0x68(0x10)(HasGetValueTypeHash)
};

// 0x18 (0x18 - 0x0)
// Function Verse.Verse._L_2fVerse_2eorg_2fVerse_N_RLocalize_L_Nmessage_R
struct UVerse__L_2fVerse_2eorg_2fVerse_N_RLocalize_L_Nmessage_R_Params
{
public:
	class UVerse_message*                        __verse_0xB2CDDD72_Argument;                       // 0x0(0x8)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseStringProperty_                        RetVal;                                            // 0x8(0x10)(Parm, OutParm, ReturnParm, HasGetValueTypeHash)
};

// 0x28 (0x28 - 0x0)
// Function Verse.Verse._L_2fVerse_2eorg_2fVerse_N_RLocalize_L_N_Kchar_M_N_QWhere_Nlocale_R
struct UVerse__L_2fVerse_2eorg_2fVerse_N_RLocalize_L_N_Kchar_M_N_QWhere_Nlocale_R_Params
{
public:
	struct FTuple_L_Kchar_M_QWhere_Nlocale_R     __verse_0xB2CDDD72_Argument;                       // 0x0(0x12)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_2B46[0x6];                                     // Fixing Size After Last Property 
	FVerseStringProperty_                        RetVal;                                            // 0x18(0x10)(Parm, OutParm, ReturnParm, HasGetValueTypeHash)
};

// 0x40 (0x40 - 0x0)
// Function Verse.Verse._L_2fVerse_2eorg_2fVerse_N_RLocalize_L_Nint_M_N_QWhere_Nlocale_R
struct UVerse__L_2fVerse_2eorg_2fVerse_N_RLocalize_L_Nint_M_N_QWhere_Nlocale_R_Params
{
public:
	struct FTuple_Lint_M_QWhere_Nlocale_R        __verse_0xB2CDDD72_Argument;                       // 0x0(0xA)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_2B47[0x6];                                     // Fixing Size After Last Property 
	FVerseStringProperty_                        RetVal;                                            // 0x10(0x10)(Parm, OutParm, ReturnParm, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_0;                                         // 0x20(0x10)(HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_1;                                         // 0x30(0x10)(HasGetValueTypeHash)
};

// 0x40 (0x40 - 0x0)
// Function Verse.Verse._L_2fVerse_2eorg_2fVerse_N_RLocalize_L_Nfloat_M_N_QWhere_Nlocale_R
struct UVerse__L_2fVerse_2eorg_2fVerse_N_RLocalize_L_Nfloat_M_N_QWhere_Nlocale_R_Params
{
public:
	struct FTuple_Lfloat_M_QWhere_Nlocale_R      __verse_0xB2CDDD72_Argument;                       // 0x0(0xA)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_2B49[0x6];                                     // Fixing Size After Last Property 
	FVerseStringProperty_                        RetVal;                                            // 0x10(0x10)(Parm, OutParm, ReturnParm, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_0;                                         // 0x20(0x10)(HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_1;                                         // 0x30(0x10)(HasGetValueTypeHash)
};

// 0x10 (0x10 - 0x0)
// Function Verse.Verse._L_2fVerse_2eorg_2fVerse_N_RLn_L_Nfloat_R
struct UVerse__L_2fVerse_2eorg_2fVerse_N_RLn_L_Nfloat_R_Params
{
public:
	double                                       __verse_0xB2CDDD72_Argument;                       // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       RetVal;                                            // 0x8(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x20 (0x20 - 0x0)
// Function Verse.Verse._L_2fVerse_2eorg_2fVerse_N_RLerp_L_Nfloat_M_Nfloat_M_Nfloat_R
struct UVerse__L_2fVerse_2eorg_2fVerse_N_RLerp_L_Nfloat_M_Nfloat_M_Nfloat_R_Params
{
public:
	struct FTuple_Lfloat_Mfloat_Mfloat_R         __verse_0xB2CDDD72_Argument;                       // 0x0(0x18)(Parm, HasGetValueTypeHash)
	double                                       RetVal;                                            // 0x18(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x30 (0x30 - 0x0)
// Function Verse.Verse._L_2fVerse_2eorg_2fVerse_N_RJoin_L_N_K_Kchar_M_N_Kchar_R
struct UVerse__L_2fVerse_2eorg_2fVerse_N_RJoin_L_N_K_Kchar_M_N_Kchar_R_Params
{
public:
	struct FTuple_L_K_Kchar_M_Kchar_R            __verse_0xB2CDDD72_Argument;                       // 0x0(0x20)(Parm, HasGetValueTypeHash)
	FVerseStringProperty_                        RetVal;                                            // 0x20(0x10)(Parm, OutParm, ReturnParm, HasGetValueTypeHash)
};

// 0x48 (0x48 - 0x0)
// Function Verse.Verse._L_2fVerse_2eorg_2fVerse_N_RIsAlmostEqual_L_Nfloat_M_Nfloat_M_Nfloat_R
struct UVerse__L_2fVerse_2eorg_2fVerse_N_RIsAlmostEqual_L_Nfloat_M_Nfloat_M_Nfloat_R_Params
{
public:
	struct FTuple_Lfloat_Mfloat_Mfloat_R         __verse_0xB2CDDD72_Argument;                       // 0x0(0x18)(Parm, HasGetValueTypeHash)
	FOptionalProperty_                           RetVal;                                            // 0x18(0x2)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        _ExprResult_0 : 1;                                 // Mask: 0x1, PropSize: 0x10x1A(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_1A3 : 7;                                    // Fixing Bit-Field Size 
	uint8                                        Pad_2B4F[0x5];                                     // Fixing Size After Last Property 
	FOptionalProperty_                           _ExprResultStack_1;                                // 0x20(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        _ExprResult_2 : 1;                                 // Mask: 0x1, PropSize: 0x10x30(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_1A4 : 7;                                    // Fixing Bit-Field Size 
	uint8                                        Pad_2B50[0x7];                                     // Fixing Size After Last Property 
	FOptionalProperty_                           _ExprResultStack_3;                                // 0x38(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x18 (0x18 - 0x0)
// Function Verse.Verse._L_2fVerse_2eorg_2fVerse_N_RInt_L_Nfloat_R
struct UVerse__L_2fVerse_2eorg_2fVerse_N_RInt_L_Nfloat_R_Params
{
public:
	double                                       __verse_0xB2CDDD72_Argument;                       // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FOptionalProperty_                           RetVal;                                            // 0x8(0x10)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x18 (0x18 - 0x0)
// Function Verse.Verse._L_2fVerse_2eorg_2fVerse_N_RFloor_L_Nfloat_R
struct UVerse__L_2fVerse_2eorg_2fVerse_N_RFloor_L_Nfloat_R_Params
{
public:
	double                                       __verse_0xB2CDDD72_Argument;                       // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FOptionalProperty_                           RetVal;                                            // 0x8(0x10)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x10 (0x10 - 0x0)
// Function Verse.Verse._L_2fVerse_2eorg_2fVerse_N_RExp_L_Nfloat_R
struct UVerse__L_2fVerse_2eorg_2fVerse_N_RExp_L_Nfloat_R_Params
{
public:
	double                                       __verse_0xB2CDDD72_Argument;                       // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       RetVal;                                            // 0x8(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x11 (0x11 - 0x0)
// Function Verse.Verse._L_2fVerse_2eorg_2fVerse_N_RErr_L_N_Kchar_R
struct UVerse__L_2fVerse_2eorg_2fVerse_N_RErr_L_N_Kchar_R_Params
{
public:
	FVerseStringProperty_                        __verse_0xB2CDDD72_Argument;                       // 0x0(0x10)(Parm, HasGetValueTypeHash)
	enum class EVerseFalse                       RetVal;                                            // 0x10(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x10 (0x10 - 0x0)
// Function Verse.Verse._L_2fVerse_2eorg_2fVerse_N_RCosh_L_Nfloat_R
struct UVerse__L_2fVerse_2eorg_2fVerse_N_RCosh_L_Nfloat_R_Params
{
public:
	double                                       __verse_0xB2CDDD72_Argument;                       // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       RetVal;                                            // 0x8(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x10 (0x10 - 0x0)
// Function Verse.Verse._L_2fVerse_2eorg_2fVerse_N_RCos_L_Nfloat_R
struct UVerse__L_2fVerse_2eorg_2fVerse_N_RCos_L_Nfloat_R_Params
{
public:
	double                                       __verse_0xB2CDDD72_Argument;                       // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       RetVal;                                            // 0x8(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0xADA (0xADA - 0x0)
// Function Verse.Verse._L_2fVerse_2eorg_2fVerse_N_RConcatenate_L_N_K_Kt_20where_20t_R
struct UVerse__L_2fVerse_2eorg_2fVerse_N_RConcatenate_L_N_K_Kt_20where_20t_R_Params
{
public:
	TArray<TArray<FVerseDynamicProperty_>>       __verse_0xB2CDDD72_Argument;                       // 0x0(0x10)(Parm, ContainsInstancedReference)
	TArray<FVerseDynamicProperty_>               RetVal;                                            // 0x10(0x10)(Parm, OutParm, ReturnParm, ContainsInstancedReference)
	FVerseDynamicProperty_                       InvokeResultDummy_0;                               // 0x20(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_1;                                // 0x30(0x18)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_2;                                     // 0x48(0x10)(HasGetValueTypeHash)
	int64                                        _ExprResult_3;                                     // 0x58(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<TArray<FVerseDynamicProperty_>>       __verse_0x00000000__2;                             // 0x60(0x10)(ContainsInstancedReference)
	FVerseDynamicProperty_                       _ExprResult_4;                                     // 0x70(0x10)(HasGetValueTypeHash)
	TArray<FVerseDynamicProperty_>               __verse_0x95D09D0E_Result_1;                       // 0x80(0x10)(ContainsInstancedReference)
	FOptionalProperty_                           _ExprResultStack_5;                                // 0x90(0x18)(ZeroConstructor, ContainsInstancedReference)
	FVerseDynamicProperty_                       InvokeResultDummy_6;                               // 0xA8(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_7;                                // 0xB8(0x18)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_8;                                     // 0xD0(0x10)(HasGetValueTypeHash)
	int64                                        _ExprResult_9;                                     // 0xE0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<TArray<FVerseDynamicProperty_>>       __verse_0x00000000__4;                             // 0xE8(0x10)(ContainsInstancedReference)
	FVerseDynamicProperty_                       _ExprResult_10;                                    // 0xF8(0x10)(HasGetValueTypeHash)
	TArray<FVerseDynamicProperty_>               __verse_0xBBE53E70_A0_3;                           // 0x108(0x10)(ContainsInstancedReference)
	FOptionalProperty_                           _ExprResultStack_11;                               // 0x118(0x18)(ZeroConstructor, ContainsInstancedReference)
	TArray<FVerseDynamicProperty_>               __verse_0xDE8282C8_A1_3;                           // 0x130(0x10)(ContainsInstancedReference)
	FOptionalProperty_                           _ExprResultStack_12;                               // 0x140(0x18)(ZeroConstructor, ContainsInstancedReference)
	FVerseDynamicProperty_                       InvokeResultDummy_13;                              // 0x158(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_14;                               // 0x168(0x18)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_15;                                    // 0x180(0x10)(HasGetValueTypeHash)
	int64                                        _ExprResult_16;                                    // 0x190(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<TArray<FVerseDynamicProperty_>>       __verse_0x00000000__6;                             // 0x198(0x10)(ContainsInstancedReference)
	FVerseDynamicProperty_                       _ExprResult_17;                                    // 0x1A8(0x10)(HasGetValueTypeHash)
	TArray<FVerseDynamicProperty_>               __verse_0xBBE53E70_A0_5;                           // 0x1B8(0x10)(ContainsInstancedReference)
	FOptionalProperty_                           _ExprResultStack_18;                               // 0x1C8(0x18)(ZeroConstructor, ContainsInstancedReference)
	TArray<FVerseDynamicProperty_>               __verse_0xDE8282C8_A1_5;                           // 0x1E0(0x10)(ContainsInstancedReference)
	FOptionalProperty_                           _ExprResultStack_19;                               // 0x1F0(0x18)(ZeroConstructor, ContainsInstancedReference)
	TArray<FVerseDynamicProperty_>               __verse_0x302D37DA_A2_5;                           // 0x208(0x10)(ContainsInstancedReference)
	FOptionalProperty_                           _ExprResultStack_20;                               // 0x218(0x18)(ZeroConstructor, ContainsInstancedReference)
	TArray<FVerseDynamicProperty_>               _ExprResultStack_21;                               // 0x230(0x10)(ContainsInstancedReference)
	FOptionalProperty_                           _ExprResultStack_22;                               // 0x240(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        _ExprResult_23;                                    // 0x250(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<TArray<FVerseDynamicProperty_>>       __verse_0x00000000__8;                             // 0x258(0x10)(ContainsInstancedReference)
	int64                                        __verse_0x06CC5305_Midpoint_7;                     // 0x268(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_24;                               // 0x270(0x18)(ZeroConstructor, NoDestructor)
	int64                                        _ExprResult_25;                                    // 0x288(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<TArray<FVerseDynamicProperty_>>       __verse_0x00000000__9;                             // 0x290(0x10)(ContainsInstancedReference)
	TArray<TArray<FVerseDynamicProperty_>>       __verse_0xBBE53E70_A0_7;                           // 0x2A0(0x10)(ContainsInstancedReference)
	TArray<FVerseDynamicProperty_>               __verse_0xFFC68BC5_Array_10;                       // 0x2B0(0x10)(ContainsInstancedReference)
	FOptionalProperty_                           _ExprResultStack_26;                               // 0x2C0(0x18)(ZeroConstructor, ContainsInstancedReference)
	FVerseFunctionProperty_                      _Callee_27;                                        // 0x2D8(0x10)(HasGetValueTypeHash)
	struct FTuple_L_Kany_Mtuple_L_R_Mtuple_Lint_Mint_R_R _ExprResult_28;                                    // 0x2E8(0x28)(HasGetValueTypeHash)
	TArray<FVerseDynamicProperty_>               _ExprResult_29;                                    // 0x310(0x10)(ContainsInstancedReference)
	TArray<TArray<FVerseDynamicProperty_>>       __verse_0xFFC68BC5_Array_11;                       // 0x320(0x10)(ContainsInstancedReference)
	TArray<FVerseDynamicProperty_>               _ForResult_30;                                     // 0x330(0x10)(ContainsInstancedReference)
	int64                                        _ForIndex_31;                                      // 0x340(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        _ForLength_32;                                     // 0x348(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<FVerseDynamicProperty_>               __verse_0xFB88B569_Item_13;                        // 0x350(0x10)(ContainsInstancedReference)
	FVerseDynamicProperty_                       _ExprResult_33;                                    // 0x360(0x10)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_34;                                    // 0x370(0x1)(HasGetValueTypeHash)
	uint8                                        Pad_2B6E[0x7];                                     // Fixing Size After Last Property 
	struct FTuple_Ltype_7b0_7d_Mint_R            _ExprResult_35;                                    // 0x378(0x10)(HasGetValueTypeHash)
	TArray<TArray<FVerseDynamicProperty_>>       _ForResult_36;                                     // 0x388(0x10)(ContainsInstancedReference)
	int64                                        _ForIndex_37;                                      // 0x398(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        _ForLength_38;                                     // 0x3A0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       __verse_0xFB88B569_Item_15;                        // 0x3A8(0x10)(HasGetValueTypeHash)
	TArray<FVerseDynamicProperty_>               _ExprResult_39;                                    // 0x3B8(0x10)(ContainsInstancedReference)
	TArray<TArray<FVerseDynamicProperty_>>       __verse_0xDE8282C8_A1_7;                           // 0x3C8(0x10)(ContainsInstancedReference)
	TArray<FVerseDynamicProperty_>               __verse_0xFFC68BC5_Array_16;                       // 0x3D8(0x10)(ContainsInstancedReference)
	FOptionalProperty_                           _ExprResultStack_40;                               // 0x3E8(0x18)(ZeroConstructor, ContainsInstancedReference)
	FVerseFunctionProperty_                      _Callee_41;                                        // 0x400(0x10)(HasGetValueTypeHash)
	struct FTuple_L_Kany_Mtuple_L_R_Mtuple_Lint_Mint_R_R _ExprResult_42;                                    // 0x410(0x28)(HasGetValueTypeHash)
	TArray<FVerseDynamicProperty_>               _ExprResult_43;                                    // 0x438(0x10)(ContainsInstancedReference)
	TArray<TArray<FVerseDynamicProperty_>>       __verse_0xFFC68BC5_Array_17;                       // 0x448(0x10)(ContainsInstancedReference)
	TArray<FVerseDynamicProperty_>               _ForResult_44;                                     // 0x458(0x10)(ContainsInstancedReference)
	int64                                        _ForIndex_45;                                      // 0x468(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        _ForLength_46;                                     // 0x470(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<FVerseDynamicProperty_>               __verse_0xFB88B569_Item_19;                        // 0x478(0x10)(ContainsInstancedReference)
	FVerseDynamicProperty_                       _ExprResult_47;                                    // 0x488(0x10)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_48;                                    // 0x498(0x1)(HasGetValueTypeHash)
	uint8                                        Pad_2B6F[0x7];                                     // Fixing Size After Last Property 
	struct FTuple_Lint_Mint_R                    _ExprResult_49;                                    // 0x4A0(0x10)(HasGetValueTypeHash)
	int64                                        _ExprResult_50;                                    // 0x4B0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<TArray<FVerseDynamicProperty_>>       __verse_0x00000000__20;                            // 0x4B8(0x10)(ContainsInstancedReference)
	TArray<TArray<FVerseDynamicProperty_>>       _ForResult_51;                                     // 0x4C8(0x10)(ContainsInstancedReference)
	int64                                        _ForIndex_52;                                      // 0x4D8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        _ForLength_53;                                     // 0x4E0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       __verse_0xFB88B569_Item_22;                        // 0x4E8(0x10)(HasGetValueTypeHash)
	TArray<FVerseDynamicProperty_>               _ExprResult_54;                                    // 0x4F8(0x10)(ContainsInstancedReference)
	TArray<FVerseDynamicProperty_>               _ExprResultStack_55;                               // 0x508(0x10)(ContainsInstancedReference)
	FVerseFunctionProperty_                      _Callee_56;                                        // 0x518(0x10)(HasGetValueTypeHash)
	TArray<FVerseDynamicProperty_>               _ExprResultStack_57;                               // 0x528(0x10)(ContainsInstancedReference)
	FVerseFunctionProperty_                      _Callee_58;                                        // 0x538(0x10)(HasGetValueTypeHash)
	TArray<enum class EVerseFalse>               __verse_0xFFC68BC5_Array_23;                       // 0x548(0x10)(ContainsInstancedReference)
	TArray<FVerseDynamicProperty_>               _ForResult_59;                                     // 0x558(0x10)(ContainsInstancedReference)
	int64                                        _ForIndex_60;                                      // 0x568(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        _ForLength_61;                                     // 0x570(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class EVerseFalse                       __verse_0xFB88B569_Item_26;                        // 0x578(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        _ExprResult_62 : 1;                                // Mask: 0x1, PropSize: 0x10x579(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_1A5 : 7;                                    // Fixing Bit-Field Size 
	uint8                                        Pad_2B71[0x6];                                     // Fixing Size After Last Property 
	FVerseDynamicProperty_                       InvokeResultDummy_63;                              // 0x580(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_64;                               // 0x590(0x18)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_65;                                    // 0x5A8(0x10)(HasGetValueTypeHash)
	int64                                        _ExprResult_66;                                    // 0x5B8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<TArray<FVerseDynamicProperty_>>       __verse_0x00000000__29;                            // 0x5C0(0x10)(ContainsInstancedReference)
	FVerseDynamicProperty_                       _ExprResult_67;                                    // 0x5D0(0x10)(HasGetValueTypeHash)
	TArray<FVerseDynamicProperty_>               __verse_0x95D09D0E_Result_28;                      // 0x5E0(0x10)(ContainsInstancedReference)
	FOptionalProperty_                           _ExprResultStack_68;                               // 0x5F0(0x18)(ZeroConstructor, ContainsInstancedReference)
	FVerseDynamicProperty_                       InvokeResultDummy_69;                              // 0x608(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_70;                               // 0x618(0x18)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_71;                                    // 0x630(0x10)(HasGetValueTypeHash)
	int64                                        _ExprResult_72;                                    // 0x640(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<TArray<FVerseDynamicProperty_>>       __verse_0x00000000__31;                            // 0x648(0x10)(ContainsInstancedReference)
	FVerseDynamicProperty_                       _ExprResult_73;                                    // 0x658(0x10)(HasGetValueTypeHash)
	TArray<FVerseDynamicProperty_>               __verse_0xBBE53E70_A0_30;                          // 0x668(0x10)(ContainsInstancedReference)
	FOptionalProperty_                           _ExprResultStack_74;                               // 0x678(0x18)(ZeroConstructor, ContainsInstancedReference)
	TArray<FVerseDynamicProperty_>               __verse_0xDE8282C8_A1_30;                          // 0x690(0x10)(ContainsInstancedReference)
	FOptionalProperty_                           _ExprResultStack_75;                               // 0x6A0(0x18)(ZeroConstructor, ContainsInstancedReference)
	FVerseDynamicProperty_                       InvokeResultDummy_76;                              // 0x6B8(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_77;                               // 0x6C8(0x18)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_78;                                    // 0x6E0(0x10)(HasGetValueTypeHash)
	int64                                        _ExprResult_79;                                    // 0x6F0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<TArray<FVerseDynamicProperty_>>       __verse_0x00000000__33;                            // 0x6F8(0x10)(ContainsInstancedReference)
	FVerseDynamicProperty_                       _ExprResult_80;                                    // 0x708(0x10)(HasGetValueTypeHash)
	TArray<FVerseDynamicProperty_>               __verse_0xBBE53E70_A0_32;                          // 0x718(0x10)(ContainsInstancedReference)
	FOptionalProperty_                           _ExprResultStack_81;                               // 0x728(0x18)(ZeroConstructor, ContainsInstancedReference)
	TArray<FVerseDynamicProperty_>               __verse_0xDE8282C8_A1_32;                          // 0x740(0x10)(ContainsInstancedReference)
	FOptionalProperty_                           _ExprResultStack_82;                               // 0x750(0x18)(ZeroConstructor, ContainsInstancedReference)
	TArray<FVerseDynamicProperty_>               __verse_0x302D37DA_A2_32;                          // 0x768(0x10)(ContainsInstancedReference)
	FOptionalProperty_                           _ExprResultStack_83;                               // 0x778(0x18)(ZeroConstructor, ContainsInstancedReference)
	TArray<FVerseDynamicProperty_>               _ExprResultStack_84;                               // 0x790(0x10)(ContainsInstancedReference)
	FOptionalProperty_                           _ExprResultStack_85;                               // 0x7A0(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        _ExprResult_86;                                    // 0x7B0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<TArray<FVerseDynamicProperty_>>       __verse_0x00000000__35;                            // 0x7B8(0x10)(ContainsInstancedReference)
	int64                                        __verse_0x06CC5305_Midpoint_34;                    // 0x7C8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_87;                               // 0x7D0(0x18)(ZeroConstructor, NoDestructor)
	int64                                        _ExprResult_88;                                    // 0x7E8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<TArray<FVerseDynamicProperty_>>       __verse_0x00000000__36;                            // 0x7F0(0x10)(ContainsInstancedReference)
	TArray<TArray<FVerseDynamicProperty_>>       __verse_0xBBE53E70_A0_34;                          // 0x800(0x10)(ContainsInstancedReference)
	TArray<FVerseDynamicProperty_>               __verse_0xFFC68BC5_Array_37;                       // 0x810(0x10)(ContainsInstancedReference)
	FOptionalProperty_                           _ExprResultStack_89;                               // 0x820(0x18)(ZeroConstructor, ContainsInstancedReference)
	FVerseFunctionProperty_                      _Callee_90;                                        // 0x838(0x10)(HasGetValueTypeHash)
	struct FTuple_L_Kany_Mtuple_L_R_Mtuple_Lint_Mint_R_R _ExprResult_91;                                    // 0x848(0x28)(HasGetValueTypeHash)
	TArray<FVerseDynamicProperty_>               _ExprResult_92;                                    // 0x870(0x10)(ContainsInstancedReference)
	TArray<TArray<FVerseDynamicProperty_>>       __verse_0xFFC68BC5_Array_38;                       // 0x880(0x10)(ContainsInstancedReference)
	TArray<FVerseDynamicProperty_>               _ForResult_93;                                     // 0x890(0x10)(ContainsInstancedReference)
	int64                                        _ForIndex_94;                                      // 0x8A0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        _ForLength_95;                                     // 0x8A8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<FVerseDynamicProperty_>               __verse_0xFB88B569_Item_40;                        // 0x8B0(0x10)(ContainsInstancedReference)
	FVerseDynamicProperty_                       _ExprResult_96;                                    // 0x8C0(0x10)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_97;                                    // 0x8D0(0x1)(HasGetValueTypeHash)
	uint8                                        Pad_2B75[0x7];                                     // Fixing Size After Last Property 
	struct FTuple_Ltype_7b0_7d_Mint_R            _ExprResult_98;                                    // 0x8D8(0x10)(HasGetValueTypeHash)
	TArray<TArray<FVerseDynamicProperty_>>       _ForResult_99;                                     // 0x8E8(0x10)(ContainsInstancedReference)
	int64                                        _ForIndex_100;                                     // 0x8F8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        _ForLength_101;                                    // 0x900(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       __verse_0xFB88B569_Item_42;                        // 0x908(0x10)(HasGetValueTypeHash)
	TArray<FVerseDynamicProperty_>               _ExprResult_102;                                   // 0x918(0x10)(ContainsInstancedReference)
	TArray<TArray<FVerseDynamicProperty_>>       __verse_0xDE8282C8_A1_34;                          // 0x928(0x10)(ContainsInstancedReference)
	TArray<FVerseDynamicProperty_>               __verse_0xFFC68BC5_Array_43;                       // 0x938(0x10)(ContainsInstancedReference)
	FOptionalProperty_                           _ExprResultStack_103;                              // 0x948(0x18)(ZeroConstructor, ContainsInstancedReference)
	FVerseFunctionProperty_                      _Callee_104;                                       // 0x960(0x10)(HasGetValueTypeHash)
	struct FTuple_L_Kany_Mtuple_L_R_Mtuple_Lint_Mint_R_R _ExprResult_105;                                   // 0x970(0x28)(HasGetValueTypeHash)
	TArray<FVerseDynamicProperty_>               _ExprResult_106;                                   // 0x998(0x10)(ContainsInstancedReference)
	TArray<TArray<FVerseDynamicProperty_>>       __verse_0xFFC68BC5_Array_44;                       // 0x9A8(0x10)(ContainsInstancedReference)
	TArray<FVerseDynamicProperty_>               _ForResult_107;                                    // 0x9B8(0x10)(ContainsInstancedReference)
	int64                                        _ForIndex_108;                                     // 0x9C8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        _ForLength_109;                                    // 0x9D0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<FVerseDynamicProperty_>               __verse_0xFB88B569_Item_46;                        // 0x9D8(0x10)(ContainsInstancedReference)
	FVerseDynamicProperty_                       _ExprResult_110;                                   // 0x9E8(0x10)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_111;                                   // 0x9F8(0x1)(HasGetValueTypeHash)
	uint8                                        Pad_2B76[0x7];                                     // Fixing Size After Last Property 
	struct FTuple_Lint_Mint_R                    _ExprResult_112;                                   // 0xA00(0x10)(HasGetValueTypeHash)
	int64                                        _ExprResult_113;                                   // 0xA10(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<TArray<FVerseDynamicProperty_>>       __verse_0x00000000__47;                            // 0xA18(0x10)(ContainsInstancedReference)
	TArray<TArray<FVerseDynamicProperty_>>       _ForResult_114;                                    // 0xA28(0x10)(ContainsInstancedReference)
	int64                                        _ForIndex_115;                                     // 0xA38(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        _ForLength_116;                                    // 0xA40(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       __verse_0xFB88B569_Item_49;                        // 0xA48(0x10)(HasGetValueTypeHash)
	TArray<FVerseDynamicProperty_>               _ExprResult_117;                                   // 0xA58(0x10)(ContainsInstancedReference)
	TArray<FVerseDynamicProperty_>               _ExprResultStack_118;                              // 0xA68(0x10)(ContainsInstancedReference)
	FVerseFunctionProperty_                      _Callee_119;                                       // 0xA78(0x10)(HasGetValueTypeHash)
	TArray<FVerseDynamicProperty_>               _ExprResultStack_120;                              // 0xA88(0x10)(ContainsInstancedReference)
	FVerseFunctionProperty_                      _Callee_121;                                       // 0xA98(0x10)(HasGetValueTypeHash)
	TArray<enum class EVerseFalse>               __verse_0xFFC68BC5_Array_50;                       // 0xAA8(0x10)(ContainsInstancedReference)
	TArray<FVerseDynamicProperty_>               _ForResult_122;                                    // 0xAB8(0x10)(ContainsInstancedReference)
	int64                                        _ForIndex_123;                                     // 0xAC8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        _ForLength_124;                                    // 0xAD0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class EVerseFalse                       __verse_0xFB88B569_Item_53;                        // 0xAD8(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        _ExprResult_125 : 1;                               // Mask: 0x1, PropSize: 0x10xAD9(0x1)(NoDestructor, HasGetValueTypeHash)
};

// 0x150 (0x150 - 0x0)
// Function Verse.Verse._L_2fVerse_2eorg_2fVerse_N_RClamp_L_Nfloat_M_Nfloat_M_Nfloat_R
struct UVerse__L_2fVerse_2eorg_2fVerse_N_RClamp_L_Nfloat_M_Nfloat_M_Nfloat_R_Params
{
public:
	struct FTuple_Lfloat_Mfloat_Mfloat_R         __verse_0xB2CDDD72_Argument;                       // 0x0(0x18)(Parm, HasGetValueTypeHash)
	double                                       RetVal;                                            // 0x18(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       __verse_0x9EEF5578_Lo_1;                           // 0x20(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_0;                                         // 0x28(0x10)(HasGetValueTypeHash)
	struct FTuple_Lfloat_Mfloat_R                _ExprResult_1;                                     // 0x38(0x10)(HasGetValueTypeHash)
	double                                       __verse_0xB8BE74D9_Hi_1;                           // 0x48(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_2;                                         // 0x50(0x10)(HasGetValueTypeHash)
	struct FTuple_Lfloat_Mfloat_R                _ExprResult_3;                                     // 0x60(0x10)(HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_4;                                         // 0x70(0x10)(HasGetValueTypeHash)
	struct FTuple_Lfloat_Mfloat_R                _ExprResult_5;                                     // 0x80(0x10)(HasGetValueTypeHash)
	double                                       _ExprResultStack_6;                                // 0x90(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_7;                                         // 0x98(0x10)(HasGetValueTypeHash)
	struct FTuple_Lfloat_Mfloat_R                _ExprResult_8;                                     // 0xA8(0x10)(HasGetValueTypeHash)
	double                                       __verse_0x9EEF5578_Lo_2;                           // 0xB8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_9;                                         // 0xC0(0x10)(HasGetValueTypeHash)
	struct FTuple_Lfloat_Mfloat_R                _ExprResult_10;                                    // 0xD0(0x10)(HasGetValueTypeHash)
	double                                       __verse_0xB8BE74D9_Hi_2;                           // 0xE0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_11;                                        // 0xE8(0x10)(HasGetValueTypeHash)
	struct FTuple_Lfloat_Mfloat_R                _ExprResult_12;                                    // 0xF8(0x10)(HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_13;                                        // 0x108(0x10)(HasGetValueTypeHash)
	struct FTuple_Lfloat_Mfloat_R                _ExprResult_14;                                    // 0x118(0x10)(HasGetValueTypeHash)
	double                                       _ExprResultStack_15;                               // 0x128(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_16;                                        // 0x130(0x10)(HasGetValueTypeHash)
	struct FTuple_Lfloat_Mfloat_R                _ExprResult_17;                                    // 0x140(0x10)(HasGetValueTypeHash)
};

// 0x20 (0x20 - 0x0)
// Function Verse.Verse._L_2fVerse_2eorg_2fVerse_N_RClamp_L_Nint_M_Nint_M_Nint_R
struct UVerse__L_2fVerse_2eorg_2fVerse_N_RClamp_L_Nint_M_Nint_M_Nint_R_Params
{
public:
	struct FTuple_Lint_Mint_Mint_R               __verse_0xB2CDDD72_Argument;                       // 0x0(0x18)(Parm, HasGetValueTypeHash)
	int64                                        RetVal;                                            // 0x18(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x18 (0x18 - 0x0)
// Function Verse.Verse._L_2fVerse_2eorg_2fVerse_N_RCeil_L_Nfloat_R
struct UVerse__L_2fVerse_2eorg_2fVerse_N_RCeil_L_Nfloat_R_Params
{
public:
	double                                       __verse_0xB2CDDD72_Argument;                       // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FOptionalProperty_                           RetVal;                                            // 0x8(0x10)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x10 (0x10 - 0x0)
// Function Verse.Verse._L_2fVerse_2eorg_2fVerse_N_RArcTan_L_Nfloat_R
struct UVerse__L_2fVerse_2eorg_2fVerse_N_RArcTan_L_Nfloat_R_Params
{
public:
	double                                       __verse_0xB2CDDD72_Argument;                       // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       RetVal;                                            // 0x8(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x18 (0x18 - 0x0)
// Function Verse.Verse._L_2fVerse_2eorg_2fVerse_N_RArcTan_L_Nfloat_M_Nfloat_R
struct UVerse__L_2fVerse_2eorg_2fVerse_N_RArcTan_L_Nfloat_M_Nfloat_R_Params
{
public:
	struct FTuple_Lfloat_Mfloat_R                __verse_0xB2CDDD72_Argument;                       // 0x0(0x10)(Parm, HasGetValueTypeHash)
	double                                       RetVal;                                            // 0x10(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x10 (0x10 - 0x0)
// Function Verse.Verse._L_2fVerse_2eorg_2fVerse_N_RArcSin_L_Nfloat_R
struct UVerse__L_2fVerse_2eorg_2fVerse_N_RArcSin_L_Nfloat_R_Params
{
public:
	double                                       __verse_0xB2CDDD72_Argument;                       // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       RetVal;                                            // 0x8(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x10 (0x10 - 0x0)
// Function Verse.Verse._L_2fVerse_2eorg_2fVerse_N_RArcCos_L_Nfloat_R
struct UVerse__L_2fVerse_2eorg_2fVerse_N_RArcCos_L_Nfloat_R_Params
{
public:
	double                                       __verse_0xB2CDDD72_Argument;                       // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       RetVal;                                            // 0x8(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x10 (0x10 - 0x0)
// Function Verse.Verse._L_2fVerse_2eorg_2fVerse_N_RArTanh_L_Nfloat_R
struct UVerse__L_2fVerse_2eorg_2fVerse_N_RArTanh_L_Nfloat_R_Params
{
public:
	double                                       __verse_0xB2CDDD72_Argument;                       // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       RetVal;                                            // 0x8(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x10 (0x10 - 0x0)
// Function Verse.Verse._L_2fVerse_2eorg_2fVerse_N_RArSinh_L_Nfloat_R
struct UVerse__L_2fVerse_2eorg_2fVerse_N_RArSinh_L_Nfloat_R_Params
{
public:
	double                                       __verse_0xB2CDDD72_Argument;                       // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       RetVal;                                            // 0x8(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x10 (0x10 - 0x0)
// Function Verse.Verse._L_2fVerse_2eorg_2fVerse_N_RArCosh_L_Nfloat_R
struct UVerse__L_2fVerse_2eorg_2fVerse_N_RArCosh_L_Nfloat_R_Params
{
public:
	double                                       __verse_0xB2CDDD72_Argument;                       // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       RetVal;                                            // 0x8(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x58 (0x58 - 0x0)
// Function Verse.Verse.Verse_locale$OverrideFactory
struct UVerse_Verse_locale_OverrideFactory_Params
{
public:
	struct FVerse_locale                         RetVal;                                            // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                        Pad_2B82[0x7];                                     // Fixing Size After Last Property 
	TMap<FVerseStringProperty_, uint8>           __verse_0xFB48ED96__InitOverrideMap;               // 0x8(0x50)(ConstParm, Parm, ContainsInstancedReference)
};

// 0x1 (0x1 - 0x0)
// Function Verse.Verse.Verse_locale$Factory
struct UVerse_Verse_locale_Factory_Params
{
public:
	struct FVerse_locale                         RetVal;                                            // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// 0x0 (0x0 - 0x0)
// Function Verse.Verse.$InitCDO
struct UVerse__InitCDO_Params
{
public:
};

// 0x1 (0x1 - 0x0)
// Function Verse.Verse_cancelable._L_2fVerse_2eorg_2fVerse_2fcancelable_N_RCancel
struct UVerse_cancelable__L_2fVerse_2eorg_2fVerse_2fcancelable_N_RCancel_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
};

// 0x1 (0x1 - 0x0)
// Function Verse.Verse_disposable._L_2fVerse_2eorg_2fVerse_2fdisposable_N_RDispose
struct UVerse_disposable__L_2fVerse_2eorg_2fVerse_2fdisposable_N_RDispose_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
};

// 0x10 (0x10 - 0x0)
// Function Verse.Verse_event._L_2fVerse_2eorg_2fVerse_2fsignalable_2fsignalable_Lpayload_R_N_RSignal_L_Npayload_R
struct UVerse_event__L_2fVerse_2eorg_2fVerse_2fsignalable_2fsignalable_Lpayload_R_N_RSignal_L_Npayload_R_Params
{
public:
	FVerseDynamicProperty_                       __verse_0xB2CDDD72_Argument;                       // 0x0(0x10)(Parm, HasGetValueTypeHash)
};

// 0x10 (0x10 - 0x0)
// Function Verse.Verse_event._L_2fVerse_2eorg_2fVerse_2fevent_2fevent_Lt_R_N_RGetAwaitCount
struct UVerse_event__L_2fVerse_2eorg_2fVerse_2fevent_2fevent_Lt_R_N_RGetAwaitCount_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_2B96[0x7];                                     // Fixing Size After Last Property 
	int64                                        RetVal;                                            // 0x8(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x28 (0x28 - 0x0)
// Function Verse.Verse_event.Await
struct UVerse_event_Await_Params
{
public:
	class UConcurrency_task*                     __verse_0xC1E81372_CallingTask;                    // 0x0(0x8)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                        __verse_0xA3A00DDB_CallerResumeState;              // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        __verse_0x2AC0E4D8_CallerCancelState;              // 0x10(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x18(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_2B9A[0x7];                                     // Fixing Size After Last Property 
	class UConcurrency_task*                     RetVal;                                            // 0x20(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// 0x0 (0x0 - 0x0)
// Function Verse.Verse_event.$InitInstance
struct UVerse_event__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function Verse.Verse_event.$Block
struct UVerse_event__Block_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function Verse.Verse_event.$InitCDO
struct UVerse_event__InitCDO_Params
{
public:
};

// 0x3 (0x3 - 0x0)
// Function Verse.Verse_invalidatable._L_2fVerse_2eorg_2fVerse_2finvalidatable_N_RIsValid
struct UVerse_invalidatable__L_2fVerse_2eorg_2fVerse_2finvalidatable_N_RIsValid_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	FOptionalProperty_                           RetVal;                                            // 0x1(0x2)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x0 (0x0 - 0x0)
// Function Verse.Verse_localizable_value.$InitInstance
struct UVerse_localizable_value__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function Verse.Verse_localizable_value.$Block
struct UVerse_localizable_value__Block_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function Verse.Verse_localizable_value.$InitCDO
struct UVerse_localizable_value__InitCDO_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function Verse.Verse_localizable_float.$InitInstance
struct UVerse_localizable_float__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function Verse.Verse_localizable_float.$Block
struct UVerse_localizable_float__Block_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function Verse.Verse_localizable_float.$InitCDO
struct UVerse_localizable_float__InitCDO_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function Verse.Verse_localizable_int.$InitInstance
struct UVerse_localizable_int__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function Verse.Verse_localizable_int.$Block
struct UVerse_localizable_int__Block_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function Verse.Verse_localizable_int.$InitCDO
struct UVerse_localizable_int__InitCDO_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function Verse.Verse_localizable_message.$InitInstance
struct UVerse_localizable_message__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function Verse.Verse_localizable_message.$Block
struct UVerse_localizable_message__Block_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function Verse.Verse_localizable_message.$InitCDO
struct UVerse_localizable_message__InitCDO_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function Verse.Verse_localizable_string.$InitInstance
struct UVerse_localizable_string__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function Verse.Verse_localizable_string.$Block
struct UVerse_localizable_string__Block_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function Verse.Verse_localizable_string.$InitCDO
struct UVerse_localizable_string__InitCDO_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function Verse.Verse_message.$InitInstance
struct UVerse_message__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function Verse.Verse_message.$Block
struct UVerse_message__Block_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function Verse.Verse_message.$InitCDO
struct UVerse_message__InitCDO_Params
{
public:
};

// 0x10 (0x10 - 0x0)
// Function Verse.Verse_signalable._L_2fVerse_2eorg_2fVerse_2fsignalable_2fsignalable_Lpayload_R_N_RSignal_L_Npayload_R
struct UVerse_signalable__L_2fVerse_2eorg_2fVerse_2fsignalable_2fsignalable_Lpayload_R_N_RSignal_L_Npayload_R_Params
{
public:
	FVerseDynamicProperty_                       __verse_0xB2CDDD72_Argument;                       // 0x0(0x10)(Parm, HasGetValueTypeHash)
};

// 0x18 (0x18 - 0x0)
// Function Verse.Verse_subscribable._L_2fVerse_2eorg_2fVerse_2fsubscribable_2fsubscribable_Lt_R_N_RSubscribe_L_Nt_Tvoid_R
struct UVerse_subscribable__L_2fVerse_2eorg_2fVerse_2fsubscribable_2fsubscribable_Lt_R_N_RSubscribe_L_Nt_Tvoid_R_Params
{
public:
	FVerseFunctionProperty_                      __verse_0xB2CDDD72_Argument;                       // 0x0(0x10)(Parm, HasGetValueTypeHash)
	class UObject*                               RetVal;                                            // 0x10(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

}
}


