#pragma once

// Dumped with Dumper-7!


#include "../SDK.hpp"

namespace SDK
{
namespace Params
{
//---------------------------------------------------------------------------------------------------------------------
// PARAMETERS
//---------------------------------------------------------------------------------------------------------------------

// 0x71 (0x71 - 0x0)
// Function VerseDevices.Devices._L_2fFortnite_2ecom_2fDevices_N_Roperator_U_2eTeleportToInternalImpl_U_L_Ncreative__movable__object__base_M_Ntuple_L_R_M_Ntransform_R
struct UDevices__L_2fFortnite_2ecom_2fDevices_N_Roperator_U_2eTeleportToInternalImpl_U_L_Ncreative__movable__object__base_M_Ntuple_L_R_M_Ntransform_R_Params
{
public:
	struct FTuple_Lcreative__movable__object__base_Mtuple_L_R_Mtransform_R __verse_0xB2CDDD72_Argument;                       // 0x0(0x70)(Parm, HasGetValueTypeHash)
	enum class EDevices_teleport_to_result       RetVal;                                            // 0x70(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x1B8 (0x1B8 - 0x0)
// Function VerseDevices.Devices._L_2fFortnite_2ecom_2fDevices_N_Roperator_U_2eTeleportToInternal_U_L_Ncreative__movable__object__base_M_Ntuple_L_R_M_Ntransform_R
struct UDevices__L_2fFortnite_2ecom_2fDevices_N_Roperator_U_2eTeleportToInternal_U_L_Ncreative__movable__object__base_M_Ntuple_L_R_M_Ntransform_R_Params
{
public:
	struct FTuple_Lcreative__movable__object__base_Mtuple_L_R_Mtransform_R __verse_0xB2CDDD72_Argument;                       // 0x0(0x70)(Parm, HasGetValueTypeHash)
	FOptionalProperty_                           RetVal;                                            // 0x70(0x2)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class EVerseTrue                        _ExprResult_0;                                     // 0x72(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class EDevices_teleport_to_result       __verse_0x95D09D0E_Result_1;                       // 0x73(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_6007[0x4];                                     // Fixing Size After Last Property 
	FVerseFunctionProperty_                      _Callee_1;                                         // 0x78(0x10)(HasGetValueTypeHash)
	uint8                                        Pad_6008[0x8];                                     // Fixing Size After Last Property 
	struct FTuple_Lcreative__movable__object__base_Mtuple_L_R_Mtransform_R _ExprResult_2;                                     // 0x90(0x70)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_3;                                     // 0x100(0x1)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_4;                                // 0x101(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_600D[0x5];                                     // Fixing Size After Last Property 
	FVerseFunctionProperty_                      _Callee_5;                                         // 0x108(0x10)(HasGetValueTypeHash)
	enum class EVerseTrue                        _ExprResult_6;                                     // 0x118(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class EDevices_teleport_to_result       __verse_0x95D09D0E_Result_2;                       // 0x119(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_600E[0x6];                                     // Fixing Size After Last Property 
	FVerseFunctionProperty_                      _Callee_7;                                         // 0x120(0x10)(HasGetValueTypeHash)
	struct FTuple_Lcreative__movable__object__base_Mtuple_L_R_Mtransform_R _ExprResult_8;                                     // 0x130(0x70)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_9;                                     // 0x1A0(0x1)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_10;                               // 0x1A1(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_600F[0x5];                                     // Fixing Size After Last Property 
	FVerseFunctionProperty_                      _Callee_11;                                        // 0x1A8(0x10)(HasGetValueTypeHash)
};

// 0x2B8 (0x2B8 - 0x0)
// Function VerseDevices.Devices._L_2fFortnite_2ecom_2fDevices_N_Roperator_U_2eTeleportToInternal_U_L_Ncreative__movable__object__base_M_Ntuple_L_R_M_Ntuple_Lvector3_Mrotation_R_R
struct UDevices__L_2fFortnite_2ecom_2fDevices_N_Roperator_U_2eTeleportToInternal_U_L_Ncreative__movable__object__base_M_Ntuple_L_R_M_Ntuple_Lvector3_Mrotation_R_R_Params
{
public:
	struct FTuple_Lcreative__movable__object__base_Mtuple_L_R_Mtuple_Lvector3_Mrotation_R_R __verse_0xB2CDDD72_Argument;                       // 0x0(0x50)(Parm, HasGetValueTypeHash)
	FOptionalProperty_                           RetVal;                                            // 0x50(0x2)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class EVerseTrue                        _ExprResult_0;                                     // 0x52(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_601C[0xD];                                     // Fixing Size After Last Property 
	struct FSpatialMath_transform                __verse_0x61C3007D_Transform_1;                    // 0x60(0x60)(NoDestructor)
	FVerseFunctionProperty_                      _Callee_1;                                         // 0xC0(0x10)(HasGetValueTypeHash)
	struct FTuple_Lcreative__movable__object__base_Mtuple_L_R_Mtuple_L_R_R _ExprResult_2;                                     // 0xD0(0xA)(HasGetValueTypeHash)
	uint8                                        Pad_601D[0x6];                                     // Fixing Size After Last Property 
	struct FTuple_L_R                            _ExprResult_3;                                     // 0xE0(0x1)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_4;                                     // 0xE1(0x1)(HasGetValueTypeHash)
	enum class EDevices_teleport_to_result       __verse_0x95D09D0E_Result_1;                       // 0xE2(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_601E[0x5];                                     // Fixing Size After Last Property 
	FVerseFunctionProperty_                      _Callee_5;                                         // 0xE8(0x10)(HasGetValueTypeHash)
	uint8                                        Pad_601F[0x8];                                     // Fixing Size After Last Property 
	struct FTuple_Lcreative__movable__object__base_Mtuple_L_R_Mtransform_R _ExprResult_6;                                     // 0x100(0x70)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_7;                                     // 0x170(0x1)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_8;                                // 0x171(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_6020[0x5];                                     // Fixing Size After Last Property 
	FVerseFunctionProperty_                      _Callee_9;                                         // 0x178(0x10)(HasGetValueTypeHash)
	enum class EVerseTrue                        _ExprResult_10;                                    // 0x188(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_6021[0x7];                                     // Fixing Size After Last Property 
	struct FSpatialMath_transform                __verse_0x61C3007D_Transform_2;                    // 0x190(0x60)(NoDestructor)
	FVerseFunctionProperty_                      _Callee_11;                                        // 0x1F0(0x10)(HasGetValueTypeHash)
	struct FTuple_Lcreative__movable__object__base_Mtuple_L_R_Mtuple_L_R_R _ExprResult_12;                                    // 0x200(0xA)(HasGetValueTypeHash)
	uint8                                        Pad_6022[0x6];                                     // Fixing Size After Last Property 
	struct FTuple_L_R                            _ExprResult_13;                                    // 0x210(0x1)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_14;                                    // 0x211(0x1)(HasGetValueTypeHash)
	enum class EDevices_teleport_to_result       __verse_0x95D09D0E_Result_2;                       // 0x212(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_6023[0x5];                                     // Fixing Size After Last Property 
	FVerseFunctionProperty_                      _Callee_15;                                        // 0x218(0x10)(HasGetValueTypeHash)
	uint8                                        Pad_6024[0x8];                                     // Fixing Size After Last Property 
	struct FTuple_Lcreative__movable__object__base_Mtuple_L_R_Mtransform_R _ExprResult_16;                                    // 0x230(0x70)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_17;                                    // 0x2A0(0x1)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_18;                               // 0x2A1(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_6025[0x5];                                     // Fixing Size After Last Property 
	FVerseFunctionProperty_                      _Callee_19;                                        // 0x2A8(0x10)(HasGetValueTypeHash)
};

// 0xA8 (0xA8 - 0x0)
// Function VerseDevices.Devices.operator_U_2eMoveToInternalImpl_U_L_Ncreative__movable__object__base_M_Ntuple_L_R_M_Ntuple_Ltransform_Mfloat_R_R
struct UDevices_Operator_U_2eMoveToInternalImpl_U_L_Ncreative__movable__object__base_M_Ntuple_L_R_M_Ntuple_Ltransform_Mfloat_R_R_Params
{
public:
	class UConcurrency_task*                     __verse_0xC1E81372_CallingTask;                    // 0x0(0x8)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                        __verse_0xA3A00DDB_CallerResumeState;              // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        __verse_0x2AC0E4D8_CallerCancelState;              // 0x10(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_6028[0x8];                                     // Fixing Size After Last Property 
	struct FTuple_Lcreative__movable__object__base_Mtuple_L_R_Mtuple_Ltransform_Mfloat_R_R __verse_0xB2CDDD72_Argument;                       // 0x20(0x80)(Parm, HasGetValueTypeHash)
	class UConcurrency_task*                     RetVal;                                            // 0xA0(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// 0xA8 (0xA8 - 0x0)
// Function VerseDevices.Devices.operator_U_2eMoveToInternal_U_L_Ncreative__movable__object__base_M_Ntuple_L_R_M_Ntuple_Ltransform_Mfloat_R_R
struct UDevices_Operator_U_2eMoveToInternal_U_L_Ncreative__movable__object__base_M_Ntuple_L_R_M_Ntuple_Ltransform_Mfloat_R_R_Params
{
public:
	class UConcurrency_task*                     __verse_0xC1E81372_CallingTask;                    // 0x0(0x8)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                        __verse_0xA3A00DDB_CallerResumeState;              // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        __verse_0x2AC0E4D8_CallerCancelState;              // 0x10(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_602D[0x8];                                     // Fixing Size After Last Property 
	struct FTuple_Lcreative__movable__object__base_Mtuple_L_R_Mtuple_Ltransform_Mfloat_R_R __verse_0xB2CDDD72_Argument;                       // 0x20(0x80)(Parm, HasGetValueTypeHash)
	class UConcurrency_task*                     RetVal;                                            // 0xA0(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// 0x88 (0x88 - 0x0)
// Function VerseDevices.Devices.operator_U_2eMoveToInternal_U_L_Ncreative__movable__object__base_M_Ntuple_L_R_M_Ntuple_Lvector3_Mrotation_Mfloat_R_R
struct UDevices_Operator_U_2eMoveToInternal_U_L_Ncreative__movable__object__base_M_Ntuple_L_R_M_Ntuple_Lvector3_Mrotation_Mfloat_R_R_Params
{
public:
	class UConcurrency_task*                     __verse_0xC1E81372_CallingTask;                    // 0x0(0x8)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                        __verse_0xA3A00DDB_CallerResumeState;              // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        __verse_0x2AC0E4D8_CallerCancelState;              // 0x10(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_602F[0x8];                                     // Fixing Size After Last Property 
	struct FTuple_Lcreative__movable__object__base_Mtuple_L_R_Mtuple_Lvector3_Mrotation_Mfloat_R_R __verse_0xB2CDDD72_Argument;                       // 0x20(0x60)(Parm, HasGetValueTypeHash)
	class UConcurrency_task*                     RetVal;                                            // 0x80(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// 0x70 (0x70 - 0x0)
// Function VerseDevices.Devices._L_2fFortnite_2ecom_2fDevices_N_Roperator_U_2eGetTransformInternalImpl_U_L_Ncreative__movable__object__base_M_Ntuple_L_R_M_Ntuple_L_R_R
struct UDevices__L_2fFortnite_2ecom_2fDevices_N_Roperator_U_2eGetTransformInternalImpl_U_L_Ncreative__movable__object__base_M_Ntuple_L_R_M_Ntuple_L_R_R_Params
{
public:
	struct FTuple_Lcreative__movable__object__base_Mtuple_L_R_Mtuple_L_R_R __verse_0xB2CDDD72_Argument;                       // 0x0(0xA)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_6030[0x6];                                     // Fixing Size After Last Property 
	struct FSpatialMath_transform                RetVal;                                            // 0x10(0x60)(Parm, OutParm, ReturnParm, NoDestructor)
};

// 0x18 (0x18 - 0x0)
// Function VerseDevices.Devices._L_2fFortnite_2ecom_2fDevices_N_Roperator_U_2eGetTags_U_L_Ncreative__object__interface_M_Ntuple_L_R_M_Ntuple_L_R_R
struct UDevices__L_2fFortnite_2ecom_2fDevices_N_Roperator_U_2eGetTags_U_L_Ncreative__object__interface_M_Ntuple_L_R_M_Ntuple_L_R_R_Params
{
public:
	struct FTuple_Lcreative__object__interface_Mtuple_L_R_Mtuple_L_R_R __verse_0xB2CDDD72_Argument;                       // 0x0(0xA)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_6034[0x6];                                     // Fixing Size After Last Property 
	class UObject*                               RetVal;                                            // 0x10(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// 0x18 (0x18 - 0x0)
// Function VerseDevices.Devices._L_2fFortnite_2ecom_2fDevices_N_Roperator_U_2eGetPlayspace_U_L_Ncreative__object__interface_M_Ntuple_L_R_M_Ntuple_L_R_R
struct UDevices__L_2fFortnite_2ecom_2fDevices_N_Roperator_U_2eGetPlayspace_U_L_Ncreative__object__interface_M_Ntuple_L_R_M_Ntuple_L_R_R_Params
{
public:
	struct FTuple_Lcreative__object__interface_Mtuple_L_R_Mtuple_L_R_R __verse_0xB2CDDD72_Argument;                       // 0x0(0xA)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_6038[0x6];                                     // Fixing Size After Last Property 
	class UObject*                               RetVal;                                            // 0x10(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// 0x10 (0x10 - 0x0)
// Function VerseDevices.Devices._L_2fFortnite_2ecom_2fDevices_N_Rdevice__event_L_Nt_20where_20t_R
struct UDevices__L_2fFortnite_2ecom_2fDevices_N_Rdevice__event_L_Nt_20where_20t_R_Params
{
public:
	class UClass*                                __verse_0xB2CDDD72_Argument;                       // 0x0(0x8)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UClass*                                RetVal;                                            // 0x8(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// 0x30 (0x30 - 0x0)
// Function VerseDevices.Devices._L_2fFortnite_2ecom_2fDevices_N_Rdevice__event
struct UDevices__L_2fFortnite_2ecom_2fDevices_N_Rdevice__event_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_603E[0x7];                                     // Fixing Size After Last Property 
	class UClass*                                RetVal;                                            // 0x8(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_0;                                         // 0x10(0x10)(HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_1;                                         // 0x20(0x10)(HasGetValueTypeHash)
};

// 0x388 (0x388 - 0x0)
// Function VerseDevices.Devices._L_2fFortnite_2ecom_2fDevices_N_RToString_L_Nmove__to__internal__result_R
struct UDevices__L_2fFortnite_2ecom_2fDevices_N_RToString_L_Nmove__to__internal__result_R_Params
{
public:
	enum class EDevices_move_to_internal_result  __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_6043[0x7];                                     // Fixing Size After Last Property 
	FVerseStringProperty_                        RetVal;                                            // 0x8(0x10)(Parm, OutParm, ReturnParm, HasGetValueTypeHash)
	enum class EDevices_move_to_internal_result  __verse_0x00000000__1;                             // 0x18(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_6044[0x7];                                     // Fixing Size After Last Property 
	FVerseDynamicProperty_                       InvokeResultDummy_0;                               // 0x20(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_1;                                // 0x30(0x18)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_2;                                     // 0x48(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_3;                                     // 0x58(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       InvokeResultDummy_4;                               // 0x68(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_5;                                // 0x78(0x18)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_6;                                     // 0x90(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_7;                                     // 0xA0(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       InvokeResultDummy_8;                               // 0xB0(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_9;                                // 0xC0(0x18)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_10;                                    // 0xD8(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_11;                                    // 0xE8(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       InvokeResultDummy_12;                              // 0xF8(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_13;                               // 0x108(0x18)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_14;                                    // 0x120(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_15;                                    // 0x130(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       InvokeResultDummy_16;                              // 0x140(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_17;                               // 0x150(0x18)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_18;                                    // 0x168(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_19;                                    // 0x178(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       InvokeResultDummy_20;                              // 0x188(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_21;                               // 0x198(0x18)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_22;                                    // 0x1B0(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_23;                                    // 0x1C0(0x10)(HasGetValueTypeHash)
	enum class EDevices_move_to_internal_result  __verse_0x00000000__9;                             // 0x1D0(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_6047[0x7];                                     // Fixing Size After Last Property 
	FVerseDynamicProperty_                       InvokeResultDummy_24;                              // 0x1D8(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_25;                               // 0x1E8(0x18)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_26;                                    // 0x200(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_27;                                    // 0x210(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       InvokeResultDummy_28;                              // 0x220(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_29;                               // 0x230(0x18)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_30;                                    // 0x248(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_31;                                    // 0x258(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       InvokeResultDummy_32;                              // 0x268(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_33;                               // 0x278(0x18)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_34;                                    // 0x290(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_35;                                    // 0x2A0(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       InvokeResultDummy_36;                              // 0x2B0(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_37;                               // 0x2C0(0x18)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_38;                                    // 0x2D8(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_39;                                    // 0x2E8(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       InvokeResultDummy_40;                              // 0x2F8(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_41;                               // 0x308(0x18)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_42;                                    // 0x320(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_43;                                    // 0x330(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       InvokeResultDummy_44;                              // 0x340(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_45;                               // 0x350(0x18)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_46;                                    // 0x368(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_47;                                    // 0x378(0x10)(HasGetValueTypeHash)
};

// 0x80 (0x80 - 0x0)
// Function VerseDevices.Devices._L_2fFortnite_2ecom_2fDevices_N_RSpawnProp_L_Ncreative__prop__asset_M_Ntransform_R
struct UDevices__L_2fFortnite_2ecom_2fDevices_N_RSpawnProp_L_Ncreative__prop__asset_M_Ntransform_R_Params
{
public:
	struct FTuple_Lcreative__prop__asset_Mtransform_R __verse_0xB2CDDD72_Argument;                       // 0x0(0x70)(Parm, HasGetValueTypeHash)
	struct FTuple_L_Qcreative__prop_Mspawn__prop__result_R RetVal;                                            // 0x70(0x9)(Parm, OutParm, ReturnParm, HasGetValueTypeHash)
	uint8                                        Pad_604B[0x7];                                     // Fixing Size Of Struct
};

// 0x50 (0x50 - 0x0)
// Function VerseDevices.Devices._L_2fFortnite_2ecom_2fDevices_N_RSpawnProp_L_Ncreative__prop__asset_M_Nvector3_M_Nrotation_R
struct UDevices__L_2fFortnite_2ecom_2fDevices_N_RSpawnProp_L_Ncreative__prop__asset_M_Nvector3_M_Nrotation_R_Params
{
public:
	struct FTuple_Lcreative__prop__asset_Mvector3_Mrotation_R __verse_0xB2CDDD72_Argument;                       // 0x0(0x40)(Parm, HasGetValueTypeHash)
	struct FTuple_L_Qcreative__prop_Mspawn__prop__result_R RetVal;                                            // 0x40(0x9)(Parm, OutParm, ReturnParm, HasGetValueTypeHash)
	uint8                                        Pad_604E[0x7];                                     // Fixing Size Of Struct
};

// 0x730 (0x730 - 0x0)
// Function VerseDevices.Devices._L_2fFortnite_2ecom_2fDevices_N_RHandleTeleportToResult_L_Nteleport__to__result_R
struct UDevices__L_2fFortnite_2ecom_2fDevices_N_RHandleTeleportToResult_L_Nteleport__to__result_R_Params
{
public:
	enum class EDevices_teleport_to_result       __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FOptionalProperty_                           RetVal;                                            // 0x1(0x2)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        _ExprResult_0 : 1;                                 // Mask: 0x1, PropSize: 0x10x3(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_3BD : 7;                                    // Fixing Bit-Field Size 
	uint8                                        Pad_6067[0x4];                                     // Fixing Size After Last Property 
	FVerseDynamicProperty_                       InvokeResultDummy_1;                               // 0x8(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_2;                                // 0x18(0x18)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_3;                                     // 0x30(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_4;                                     // 0x40(0x10)(HasGetValueTypeHash)
	class UDiagnostics_log*                      __verse_0x63A8D5FA_DebugLog_3;                     // 0x50(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                       _InstancingGraph_5;                                // 0x58(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                        __verse_0x8BA81554_LogString_3;                    // 0x60(0x10)(HasGetValueTypeHash)
	enum class EDevices_teleport_to_result       __verse_0x00000000__4;                             // 0x70(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_6068[0x7];                                     // Fixing Size After Last Property 
	FVerseDynamicProperty_                       InvokeResultDummy_6;                               // 0x78(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_7;                                // 0x88(0x18)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_8;                                     // 0xA0(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_9;                                     // 0xB0(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       InvokeResultDummy_10;                              // 0xC0(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_11;                               // 0xD0(0x18)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_12;                                    // 0xE8(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_13;                                    // 0xF8(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       InvokeResultDummy_14;                              // 0x108(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_15;                               // 0x118(0x18)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_16;                                    // 0x130(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_17;                                    // 0x140(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       InvokeResultDummy_18;                              // 0x150(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_19;                               // 0x160(0x18)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_20;                                    // 0x178(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_21;                                    // 0x188(0x10)(HasGetValueTypeHash)
	class UDiagnostics_log*                      __verse_0x00000000__10;                            // 0x198(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	enum class EVerseTrue                        _InvokeSureResultDummy_22;                         // 0x1A0(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_606C[0x7];                                     // Fixing Size After Last Property 
	FVerseFunctionProperty_                      _Callee_23;                                        // 0x1A8(0x10)(HasGetValueTypeHash)
	struct FTuple_L_Kchar_M_QLevel_Nlog__level_R _ExprResult_24;                                    // 0x1B8(0x12)(HasGetValueTypeHash)
	uint8                                        Pad_606D[0x6];                                     // Fixing Size After Last Property 
	FVerseStringProperty_                        _ExprResult_25;                                    // 0x1D0(0x10)(HasGetValueTypeHash)
	TArray<FVerseDynamicProperty_>               __verse_0xFFC68BC5_Array_11;                       // 0x1E0(0x10)(ContainsInstancedReference)
	FVerseFunctionProperty_                      _Callee_26;                                        // 0x1F0(0x10)(HasGetValueTypeHash)
	TArray<TArray<FVerseDynamicProperty_>>       _ExprResult_27;                                    // 0x200(0x10)(ContainsInstancedReference)
	TArray<FVerseStringProperty_>                __verse_0xFFC68BC5_Array_12;                       // 0x210(0x10)(ContainsInstancedReference)
	struct FTuple_L_Kchar_M_Kchar_R              __verse_0x00000000__13;                            // 0x220(0x20)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_28;                                    // 0x240(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResultStack_29;                               // 0x250(0x10)(HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_30;                                        // 0x260(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResultDummy_31;                               // 0x270(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResultDummy_32;                               // 0x280(0x10)(HasGetValueTypeHash)
	TArray<TArray<FVerseDynamicProperty_>>       _ForResult_33;                                     // 0x290(0x10)(ContainsInstancedReference)
	int64                                        _ForIndex_34;                                      // 0x2A0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        _ForLength_35;                                     // 0x2A8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                        __verse_0xFB88B569_Item_15;                        // 0x2B0(0x10)(HasGetValueTypeHash)
	TArray<FVerseDynamicProperty_>               _ExprResult_36;                                    // 0x2C0(0x10)(ContainsInstancedReference)
	FVerseStringProperty_                        __verse_0xFFC68BC5_Array_16;                       // 0x2D0(0x10)(HasGetValueTypeHash)
	TArray<FVerseDynamicProperty_>               _ForResult_37;                                     // 0x2E0(0x10)(ContainsInstancedReference)
	int64                                        _ForIndex_38;                                      // 0x2F0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        _ForLength_39;                                     // 0x2F8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        __verse_0xFB88B569_Item_18;                        // 0x300(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_606F[0x7];                                     // Fixing Size After Last Property 
	FVerseDynamicProperty_                       _ExprResult_40;                                    // 0x308(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ForResult_41;                                     // 0x318(0x10)(HasGetValueTypeHash)
	int64                                        _ForIndex_42;                                      // 0x328(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        _ForLength_43;                                     // 0x330(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       __verse_0xFB88B569_Item_20;                        // 0x338(0x10)(HasGetValueTypeHash)
	uint8                                        _ExprResult_44;                                    // 0x348(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_45;                                    // 0x349(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_6070[0x5];                                     // Fixing Size After Last Property 
	FVerseDynamicProperty_                       InvokeResultDummy_46;                              // 0x350(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_47;                               // 0x360(0x18)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_48;                                    // 0x378(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_49;                                    // 0x388(0x10)(HasGetValueTypeHash)
	uint8                                        _ExprResult_50 : 1;                                // Mask: 0x1, PropSize: 0x10x398(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_3BE : 7;                                    // Fixing Bit-Field Size 
	uint8                                        Pad_6072[0x7];                                     // Fixing Size After Last Property 
	FVerseDynamicProperty_                       InvokeResultDummy_51;                              // 0x3A0(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_52;                               // 0x3B0(0x18)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_53;                                    // 0x3C8(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_54;                                    // 0x3D8(0x10)(HasGetValueTypeHash)
	class UDiagnostics_log*                      __verse_0x63A8D5FA_DebugLog_23;                    // 0x3E8(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                       _InstancingGraph_55;                               // 0x3F0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                        __verse_0x8BA81554_LogString_23;                   // 0x3F8(0x10)(HasGetValueTypeHash)
	enum class EDevices_teleport_to_result       __verse_0x00000000__24;                            // 0x408(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_607A[0x7];                                     // Fixing Size After Last Property 
	FVerseDynamicProperty_                       InvokeResultDummy_56;                              // 0x410(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_57;                               // 0x420(0x18)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_58;                                    // 0x438(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_59;                                    // 0x448(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       InvokeResultDummy_60;                              // 0x458(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_61;                               // 0x468(0x18)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_62;                                    // 0x480(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_63;                                    // 0x490(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       InvokeResultDummy_64;                              // 0x4A0(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_65;                               // 0x4B0(0x18)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_66;                                    // 0x4C8(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_67;                                    // 0x4D8(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       InvokeResultDummy_68;                              // 0x4E8(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_69;                               // 0x4F8(0x18)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_70;                                    // 0x510(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_71;                                    // 0x520(0x10)(HasGetValueTypeHash)
	class UDiagnostics_log*                      __verse_0x00000000__30;                            // 0x530(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	enum class EVerseTrue                        _InvokeSureResultDummy_72;                         // 0x538(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_607D[0x7];                                     // Fixing Size After Last Property 
	FVerseFunctionProperty_                      _Callee_73;                                        // 0x540(0x10)(HasGetValueTypeHash)
	struct FTuple_L_Kchar_M_QLevel_Nlog__level_R _ExprResult_74;                                    // 0x550(0x12)(HasGetValueTypeHash)
	uint8                                        Pad_607E[0x6];                                     // Fixing Size After Last Property 
	FVerseStringProperty_                        _ExprResult_75;                                    // 0x568(0x10)(HasGetValueTypeHash)
	TArray<FVerseDynamicProperty_>               __verse_0xFFC68BC5_Array_31;                       // 0x578(0x10)(ContainsInstancedReference)
	FVerseFunctionProperty_                      _Callee_76;                                        // 0x588(0x10)(HasGetValueTypeHash)
	TArray<TArray<FVerseDynamicProperty_>>       _ExprResult_77;                                    // 0x598(0x10)(ContainsInstancedReference)
	TArray<FVerseStringProperty_>                __verse_0xFFC68BC5_Array_32;                       // 0x5A8(0x10)(ContainsInstancedReference)
	struct FTuple_L_Kchar_M_Kchar_R              __verse_0x00000000__33;                            // 0x5B8(0x20)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_78;                                    // 0x5D8(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResultStack_79;                               // 0x5E8(0x10)(HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_80;                                        // 0x5F8(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResultDummy_81;                               // 0x608(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResultDummy_82;                               // 0x618(0x10)(HasGetValueTypeHash)
	TArray<TArray<FVerseDynamicProperty_>>       _ForResult_83;                                     // 0x628(0x10)(ContainsInstancedReference)
	int64                                        _ForIndex_84;                                      // 0x638(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        _ForLength_85;                                     // 0x640(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                        __verse_0xFB88B569_Item_35;                        // 0x648(0x10)(HasGetValueTypeHash)
	TArray<FVerseDynamicProperty_>               _ExprResult_86;                                    // 0x658(0x10)(ContainsInstancedReference)
	FVerseStringProperty_                        __verse_0xFFC68BC5_Array_36;                       // 0x668(0x10)(HasGetValueTypeHash)
	TArray<FVerseDynamicProperty_>               _ForResult_87;                                     // 0x678(0x10)(ContainsInstancedReference)
	int64                                        _ForIndex_88;                                      // 0x688(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        _ForLength_89;                                     // 0x690(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        __verse_0xFB88B569_Item_38;                        // 0x698(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_6081[0x7];                                     // Fixing Size After Last Property 
	FVerseDynamicProperty_                       _ExprResult_90;                                    // 0x6A0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ForResult_91;                                     // 0x6B0(0x10)(HasGetValueTypeHash)
	int64                                        _ForIndex_92;                                      // 0x6C0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        _ForLength_93;                                     // 0x6C8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       __verse_0xFB88B569_Item_40;                        // 0x6D0(0x10)(HasGetValueTypeHash)
	uint8                                        _ExprResult_94;                                    // 0x6E0(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_95;                                    // 0x6E1(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_6082[0x5];                                     // Fixing Size After Last Property 
	FVerseDynamicProperty_                       InvokeResultDummy_96;                              // 0x6E8(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_97;                               // 0x6F8(0x18)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_98;                                    // 0x710(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_99;                                    // 0x720(0x10)(HasGetValueTypeHash)
};

// 0x4B3 (0x4B3 - 0x0)
// Function VerseDevices.Devices._L_2fFortnite_2ecom_2fDevices_N_RHandleMoveToInternalResult_L_Nmove__to__internal__result_R
struct UDevices__L_2fFortnite_2ecom_2fDevices_N_RHandleMoveToInternalResult_L_Nmove__to__internal__result_R_Params
{
public:
	enum class EDevices_move_to_internal_result  __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class EDevices_move_to_result           RetVal;                                            // 0x1(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_60B7[0x6];                                     // Fixing Size After Last Property 
	FVerseDynamicProperty_                       InvokeResultDummy_0;                               // 0x8(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_1;                                // 0x18(0x18)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_2;                                     // 0x30(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_3;                                     // 0x40(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       InvokeResultDummy_4;                               // 0x50(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_5;                                // 0x60(0x18)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_6;                                     // 0x78(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_7;                                     // 0x88(0x10)(HasGetValueTypeHash)
	class UDiagnostics_log*                      __verse_0x63A8D5FA_DebugLog_3;                     // 0x98(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                       _InstancingGraph_8;                                // 0xA0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDiagnostics_log*                      __verse_0x00000000__4;                             // 0xA8(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	enum class EVerseTrue                        _InvokeSureResultDummy_9;                          // 0xB0(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_60BC[0x7];                                     // Fixing Size After Last Property 
	FVerseFunctionProperty_                      _Callee_10;                                        // 0xB8(0x10)(HasGetValueTypeHash)
	struct FTuple_L_Kchar_M_QLevel_Nlog__level_R _ExprResult_11;                                    // 0xC8(0x12)(HasGetValueTypeHash)
	uint8                                        Pad_60BD[0x6];                                     // Fixing Size After Last Property 
	FVerseStringProperty_                        _ExprResult_12;                                    // 0xE0(0x10)(HasGetValueTypeHash)
	TArray<FVerseDynamicProperty_>               __verse_0xFFC68BC5_Array_5;                        // 0xF0(0x10)(ContainsInstancedReference)
	FVerseFunctionProperty_                      _Callee_13;                                        // 0x100(0x10)(HasGetValueTypeHash)
	TArray<TArray<FVerseDynamicProperty_>>       _ExprResult_14;                                    // 0x110(0x10)(ContainsInstancedReference)
	TArray<FVerseStringProperty_>                __verse_0xFFC68BC5_Array_6;                        // 0x120(0x10)(ContainsInstancedReference)
	struct FTuple_L_Kchar_M_Kchar_R              __verse_0x00000000__7;                             // 0x130(0x20)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_15;                                    // 0x150(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResultStack_16;                               // 0x160(0x10)(HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_17;                                        // 0x170(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResultDummy_18;                               // 0x180(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResultDummy_19;                               // 0x190(0x10)(HasGetValueTypeHash)
	TArray<TArray<FVerseDynamicProperty_>>       _ForResult_20;                                     // 0x1A0(0x10)(ContainsInstancedReference)
	int64                                        _ForIndex_21;                                      // 0x1B0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        _ForLength_22;                                     // 0x1B8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                        __verse_0xFB88B569_Item_9;                         // 0x1C0(0x10)(HasGetValueTypeHash)
	TArray<FVerseDynamicProperty_>               _ExprResult_23;                                    // 0x1D0(0x10)(ContainsInstancedReference)
	FVerseStringProperty_                        __verse_0xFFC68BC5_Array_10;                       // 0x1E0(0x10)(HasGetValueTypeHash)
	TArray<FVerseDynamicProperty_>               _ForResult_24;                                     // 0x1F0(0x10)(ContainsInstancedReference)
	int64                                        _ForIndex_25;                                      // 0x200(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        _ForLength_26;                                     // 0x208(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        __verse_0xFB88B569_Item_12;                        // 0x210(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_60C0[0x7];                                     // Fixing Size After Last Property 
	FVerseDynamicProperty_                       _ExprResult_27;                                    // 0x218(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ForResult_28;                                     // 0x228(0x10)(HasGetValueTypeHash)
	int64                                        _ForIndex_29;                                      // 0x238(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        _ForLength_30;                                     // 0x240(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       __verse_0xFB88B569_Item_14;                        // 0x248(0x10)(HasGetValueTypeHash)
	uint8                                        _ExprResult_31;                                    // 0x258(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_32;                                    // 0x259(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_60C1[0x5];                                     // Fixing Size After Last Property 
	FVerseDynamicProperty_                       InvokeResultDummy_33;                              // 0x260(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_34;                               // 0x270(0x18)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_35;                                    // 0x288(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_36;                                    // 0x298(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       InvokeResultDummy_37;                              // 0x2A8(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_38;                               // 0x2B8(0x18)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_39;                                    // 0x2D0(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_40;                                    // 0x2E0(0x10)(HasGetValueTypeHash)
	class UDiagnostics_log*                      __verse_0x63A8D5FA_DebugLog_17;                    // 0x2F0(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                       _InstancingGraph_41;                               // 0x2F8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDiagnostics_log*                      __verse_0x00000000__18;                            // 0x300(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	enum class EVerseTrue                        _InvokeSureResultDummy_42;                         // 0x308(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_60C6[0x7];                                     // Fixing Size After Last Property 
	FVerseFunctionProperty_                      _Callee_43;                                        // 0x310(0x10)(HasGetValueTypeHash)
	struct FTuple_L_Kchar_M_QLevel_Nlog__level_R _ExprResult_44;                                    // 0x320(0x12)(HasGetValueTypeHash)
	uint8                                        Pad_60C8[0x6];                                     // Fixing Size After Last Property 
	FVerseStringProperty_                        _ExprResult_45;                                    // 0x338(0x10)(HasGetValueTypeHash)
	TArray<FVerseDynamicProperty_>               __verse_0xFFC68BC5_Array_19;                       // 0x348(0x10)(ContainsInstancedReference)
	FVerseFunctionProperty_                      _Callee_46;                                        // 0x358(0x10)(HasGetValueTypeHash)
	TArray<TArray<FVerseDynamicProperty_>>       _ExprResult_47;                                    // 0x368(0x10)(ContainsInstancedReference)
	TArray<FVerseStringProperty_>                __verse_0xFFC68BC5_Array_20;                       // 0x378(0x10)(ContainsInstancedReference)
	struct FTuple_L_Kchar_M_Kchar_R              __verse_0x00000000__21;                            // 0x388(0x20)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_48;                                    // 0x3A8(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResultStack_49;                               // 0x3B8(0x10)(HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_50;                                        // 0x3C8(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResultDummy_51;                               // 0x3D8(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResultDummy_52;                               // 0x3E8(0x10)(HasGetValueTypeHash)
	TArray<TArray<FVerseDynamicProperty_>>       _ForResult_53;                                     // 0x3F8(0x10)(ContainsInstancedReference)
	int64                                        _ForIndex_54;                                      // 0x408(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        _ForLength_55;                                     // 0x410(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                        __verse_0xFB88B569_Item_23;                        // 0x418(0x10)(HasGetValueTypeHash)
	TArray<FVerseDynamicProperty_>               _ExprResult_56;                                    // 0x428(0x10)(ContainsInstancedReference)
	FVerseStringProperty_                        __verse_0xFFC68BC5_Array_24;                       // 0x438(0x10)(HasGetValueTypeHash)
	TArray<FVerseDynamicProperty_>               _ForResult_57;                                     // 0x448(0x10)(ContainsInstancedReference)
	int64                                        _ForIndex_58;                                      // 0x458(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        _ForLength_59;                                     // 0x460(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        __verse_0xFB88B569_Item_26;                        // 0x468(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_60CF[0x7];                                     // Fixing Size After Last Property 
	FVerseDynamicProperty_                       _ExprResult_60;                                    // 0x470(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ForResult_61;                                     // 0x480(0x10)(HasGetValueTypeHash)
	int64                                        _ForIndex_62;                                      // 0x490(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        _ForLength_63;                                     // 0x498(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       __verse_0xFB88B569_Item_28;                        // 0x4A0(0x10)(HasGetValueTypeHash)
	uint8                                        _ExprResult_64;                                    // 0x4B0(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_65;                                    // 0x4B1(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x18 (0x18 - 0x0)
// Function VerseDevices.Devices._L_2fFortnite_2ecom_2fDevices_N_RGetCreativeObjectsWithTags_L_Ntag__search__criteria_R
struct UDevices__L_2fFortnite_2ecom_2fDevices_N_RGetCreativeObjectsWithTags_L_Ntag__search__criteria_R_Params
{
public:
	class UTags_tag_search_criteria*             __verse_0xB2CDDD72_Argument;                       // 0x0(0x8)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UObject*>                       RetVal;                                            // 0x8(0x10)(Parm, OutParm, ReturnParm, ContainsInstancedReference)
};

// 0x18 (0x18 - 0x0)
// Function VerseDevices.Devices._L_2fFortnite_2ecom_2fDevices_N_RGetCreativeObjectsWithTag_L_Ntag_R
struct UDevices__L_2fFortnite_2ecom_2fDevices_N_RGetCreativeObjectsWithTag_L_Ntag_R_Params
{
public:
	class UTags_tag*                             __verse_0xB2CDDD72_Argument;                       // 0x0(0x8)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UObject*>                       RetVal;                                            // 0x8(0x10)(Parm, OutParm, ReturnParm, ContainsInstancedReference)
};

// 0x60 (0x60 - 0x0)
// Function VerseDevices.Devices.Devices_device_ai_interaction_result$OverrideFactory
struct UDevices_Devices_device_ai_interaction_result_OverrideFactory_Params
{
public:
	struct FDevices_device_ai_interaction_result RetVal;                                            // 0x0(0x10)(Parm, OutParm, ReturnParm, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           __verse_0xFB48ED96__InitOverrideMap;               // 0x10(0x50)(ConstParm, Parm, ContainsInstancedReference)
};

// 0x10 (0x10 - 0x0)
// Function VerseDevices.Devices.Devices_device_ai_interaction_result$Factory
struct UDevices_Devices_device_ai_interaction_result_Factory_Params
{
public:
	struct FDevices_device_ai_interaction_result RetVal;                                            // 0x0(0x10)(Parm, OutParm, ReturnParm, NoDestructor)
};

// 0x20 (0x20 - 0x0)
// Function VerseDevices.Devices.$InitCDO
struct UDevices__InitCDO_Params
{
public:
	class UDevices_creative_prop_asset*          _ExprResult_0;                                     // 0x0(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                       _InstancingGraph_1;                                // 0x8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDevices_creative_prop_asset*          _ExprResult_2;                                     // 0x10(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                       _InstancingGraph_3;                                // 0x18(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x181 (0x181 - 0x0)
// Function VerseDevices.Devices_creative_device._L_2fFortnite_2ecom_2fDevices_2fcreative__device_N_RTeleportTo_L_Ntransform_R
struct UDevices_creative_device__L_2fFortnite_2ecom_2fDevices_2fcreative__device_N_RTeleportTo_L_Ntransform_R_Params
{
public:
	struct FSpatialMath_transform                __verse_0xB2CDDD72_Argument;                       // 0x0(0x60)(Parm, NoDestructor)
	FOptionalProperty_                           RetVal;                                            // 0x60(0x2)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_0;                                // 0x62(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_60E5[0x4];                                     // Fixing Size After Last Property 
	FVerseFunctionProperty_                      _Callee_1;                                         // 0x68(0x10)(HasGetValueTypeHash)
	uint8                                        Pad_60E6[0x8];                                     // Fixing Size After Last Property 
	struct FTuple_Lcreative__device_Mtuple_L_R_Mtransform_R _ExprResult_2;                                     // 0x80(0x70)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_3;                                     // 0xF0(0x1)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_4;                                // 0xF1(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_60E7[0x5];                                     // Fixing Size After Last Property 
	FVerseFunctionProperty_                      _Callee_5;                                         // 0xF8(0x10)(HasGetValueTypeHash)
	uint8                                        Pad_60E8[0x8];                                     // Fixing Size After Last Property 
	struct FTuple_Lcreative__device_Mtuple_L_R_Mtransform_R _ExprResult_6;                                     // 0x110(0x70)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_7;                                     // 0x180(0x1)(HasGetValueTypeHash)
};

// 0x1C0 (0x1C0 - 0x0)
// Function VerseDevices.Devices_creative_device._L_2fFortnite_2ecom_2fDevices_2fcreative__device_N_RTeleportTo_L_Nvector3_M_Nrotation_R
struct UDevices_creative_device__L_2fFortnite_2ecom_2fDevices_2fcreative__device_N_RTeleportTo_L_Nvector3_M_Nrotation_R_Params
{
public:
	struct FTuple_Lvector3_Mrotation_R           __verse_0xB2CDDD72_Argument;                       // 0x0(0x40)(Parm, HasGetValueTypeHash)
	FOptionalProperty_                           RetVal;                                            // 0x40(0x2)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_0;                                // 0x42(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_60EC[0x4];                                     // Fixing Size After Last Property 
	FVerseFunctionProperty_                      _Callee_1;                                         // 0x48(0x10)(HasGetValueTypeHash)
	uint8                                        Pad_60ED[0x8];                                     // Fixing Size After Last Property 
	struct FTuple_Lcreative__device_Mtuple_L_R_Mtuple_Lvector3_Mrotation_R_R _ExprResult_2;                                     // 0x60(0x50)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_3;                                     // 0xB0(0x1)(HasGetValueTypeHash)
	uint8                                        Pad_60EE[0xF];                                     // Fixing Size After Last Property 
	struct FTuple_Lvector3_Mrotation_R           _ExprResult_4;                                     // 0xC0(0x40)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_5;                                // 0x100(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_60EF[0x6];                                     // Fixing Size After Last Property 
	FVerseFunctionProperty_                      _Callee_6;                                         // 0x108(0x10)(HasGetValueTypeHash)
	uint8                                        Pad_60F0[0x8];                                     // Fixing Size After Last Property 
	struct FTuple_Lcreative__device_Mtuple_L_R_Mtuple_Lvector3_Mrotation_R_R _ExprResult_7;                                     // 0x120(0x50)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_8;                                     // 0x170(0x1)(HasGetValueTypeHash)
	uint8                                        Pad_60F1[0xF];                                     // Fixing Size After Last Property 
	struct FTuple_Lvector3_Mrotation_R           _ExprResult_9;                                     // 0x180(0x40)(HasGetValueTypeHash)
};

// 0x1 (0x1 - 0x0)
// Function VerseDevices.Devices_creative_device._L_2fFortnite_2ecom_2fDevices_2fcreative__device_N_RShow
struct UDevices_creative_device__L_2fFortnite_2ecom_2fDevices_2fcreative__device_N_RShow_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
};

// 0x1 (0x1 - 0x0)
// Function VerseDevices.Devices_creative_device._L_2fFortnite_2ecom_2fDevices_2fcreative__device_N_ROnEnd
struct UDevices_creative_device__L_2fFortnite_2ecom_2fDevices_2fcreative__device_N_ROnEnd_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
};

// 0x58 (0x58 - 0x0)
// Function VerseDevices.Devices_creative_device._L_2fFortnite_2ecom_2fDevices_2fcreative__device_N_ROnBegin__Internal
struct UDevices_creative_device__L_2fFortnite_2ecom_2fDevices_2fcreative__device_N_ROnBegin__Internal_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_60F6[0x7];                                     // Fixing Size After Last Property 
	class UConcurrency_task*                     _AsyncTask_0;                                      // 0x8(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _AsyncTaskClass_1;                                 // 0x10(0x10)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_2;                                     // 0x20(0x1)(HasGetValueTypeHash)
	uint8                                        Pad_60F7[0x7];                                     // Fixing Size After Last Property 
	int64                                        _AsyncResult_3;                                    // 0x28(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UConcurrency_task*                     _AsyncTask_4;                                      // 0x30(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                      _AsyncTaskClass_5;                                 // 0x38(0x10)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_6;                                     // 0x48(0x1)(HasGetValueTypeHash)
	uint8                                        Pad_60F8[0x7];                                     // Fixing Size After Last Property 
	int64                                        _AsyncResult_7;                                    // 0x50(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x28 (0x28 - 0x0)
// Function VerseDevices.Devices_creative_device.OnBegin
struct UDevices_creative_device_OnBegin_Params
{
public:
	class UConcurrency_task*                     __verse_0xC1E81372_CallingTask;                    // 0x0(0x8)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                        __verse_0xA3A00DDB_CallerResumeState;              // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        __verse_0x2AC0E4D8_CallerCancelState;              // 0x10(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x18(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_60FB[0x7];                                     // Fixing Size After Last Property 
	class UConcurrency_task*                     RetVal;                                            // 0x20(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// 0x98 (0x98 - 0x0)
// Function VerseDevices.Devices_creative_device.MoveTo_L_Ntransform_M_Nfloat_R
struct UDevices_creative_device_MoveTo_L_Ntransform_M_Nfloat_R_Params
{
public:
	class UConcurrency_task*                     __verse_0xC1E81372_CallingTask;                    // 0x0(0x8)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                        __verse_0xA3A00DDB_CallerResumeState;              // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        __verse_0x2AC0E4D8_CallerCancelState;              // 0x10(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_60FD[0x8];                                     // Fixing Size After Last Property 
	struct FTuple_Ltransform_Mfloat_R            __verse_0xB2CDDD72_Argument;                       // 0x20(0x68)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_60FE[0x8];                                     // Fixing Size After Last Property 
	class UConcurrency_task*                     RetVal;                                            // 0x90(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// 0x78 (0x78 - 0x0)
// Function VerseDevices.Devices_creative_device.MoveTo_L_Nvector3_M_Nrotation_M_Nfloat_R
struct UDevices_creative_device_MoveTo_L_Nvector3_M_Nrotation_M_Nfloat_R_Params
{
public:
	class UConcurrency_task*                     __verse_0xC1E81372_CallingTask;                    // 0x0(0x8)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                        __verse_0xA3A00DDB_CallerResumeState;              // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        __verse_0x2AC0E4D8_CallerCancelState;              // 0x10(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_6103[0x8];                                     // Fixing Size After Last Property 
	struct FTuple_Lvector3_Mrotation_Mfloat_R    __verse_0xB2CDDD72_Argument;                       // 0x20(0x48)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_6104[0x8];                                     // Fixing Size After Last Property 
	class UConcurrency_task*                     RetVal;                                            // 0x70(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// 0x1 (0x1 - 0x0)
// Function VerseDevices.Devices_creative_device._L_2fFortnite_2ecom_2fDevices_2fcreative__device_N_RHide
struct UDevices_creative_device__L_2fFortnite_2ecom_2fDevices_2fcreative__device_N_RHide_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
};

// 0xBA (0xBA - 0x0)
// Function VerseDevices.Devices_creative_device._L_2fFortnite_2ecom_2fGame_2fpositional_N_RGetTransform
struct UDevices_creative_device__L_2fFortnite_2ecom_2fGame_2fpositional_N_RGetTransform_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_610A[0xF];                                     // Fixing Size After Last Property 
	struct FSpatialMath_transform                RetVal;                                            // 0x10(0x60)(Parm, OutParm, ReturnParm, NoDestructor)
	FVerseFunctionProperty_                      _Callee_0;                                         // 0x70(0x10)(HasGetValueTypeHash)
	struct FTuple_Lcreative__device_Mtuple_L_R_Mtuple_L_R_R _ExprResult_1;                                     // 0x80(0xA)(HasGetValueTypeHash)
	uint8                                        Pad_610B[0x6];                                     // Fixing Size After Last Property 
	struct FTuple_L_R                            _ExprResult_2;                                     // 0x90(0x1)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_3;                                     // 0x91(0x1)(HasGetValueTypeHash)
	uint8                                        Pad_610C[0x6];                                     // Fixing Size After Last Property 
	FVerseFunctionProperty_                      _Callee_4;                                         // 0x98(0x10)(HasGetValueTypeHash)
	struct FTuple_Lcreative__device_Mtuple_L_R_Mtuple_L_R_R _ExprResult_5;                                     // 0xA8(0xA)(HasGetValueTypeHash)
	uint8                                        Pad_610D[0x6];                                     // Fixing Size After Last Property 
	struct FTuple_L_R                            _ExprResult_6;                                     // 0xB8(0x1)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_7;                                     // 0xB9(0x1)(HasGetValueTypeHash)
};

// 0x0 (0x0 - 0x0)
// Function VerseDevices.Devices_creative_device.$InitInstance
struct UDevices_creative_device__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseDevices.Devices_creative_device.$Block
struct UDevices_creative_device__Block_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseDevices.Devices_creative_device.$InitCDO
struct UDevices_creative_device__InitCDO_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseDevices.Devices_creative_device_asset.$InitInstance
struct UDevices_creative_device_asset__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseDevices.Devices_creative_device_asset.$Block
struct UDevices_creative_device_asset__Block_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseDevices.Devices_creative_device_asset.$InitCDO
struct UDevices_creative_device_asset__InitCDO_Params
{
public:
};

// 0xBA (0xBA - 0x0)
// Function VerseDevices.Devices_creative_object._L_2fFortnite_2ecom_2fGame_2fpositional_N_RGetTransform
struct UDevices_creative_object__L_2fFortnite_2ecom_2fGame_2fpositional_N_RGetTransform_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_610F[0xF];                                     // Fixing Size After Last Property 
	struct FSpatialMath_transform                RetVal;                                            // 0x10(0x60)(Parm, OutParm, ReturnParm, NoDestructor)
	FVerseFunctionProperty_                      _Callee_0;                                         // 0x70(0x10)(HasGetValueTypeHash)
	struct FTuple_Lcreative__object_Mtuple_L_R_Mtuple_L_R_R _ExprResult_1;                                     // 0x80(0xA)(HasGetValueTypeHash)
	uint8                                        Pad_6111[0x6];                                     // Fixing Size After Last Property 
	struct FTuple_L_R                            _ExprResult_2;                                     // 0x90(0x1)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_3;                                     // 0x91(0x1)(HasGetValueTypeHash)
	uint8                                        Pad_6112[0x6];                                     // Fixing Size After Last Property 
	FVerseFunctionProperty_                      _Callee_4;                                         // 0x98(0x10)(HasGetValueTypeHash)
	struct FTuple_Lcreative__object_Mtuple_L_R_Mtuple_L_R_R _ExprResult_5;                                     // 0xA8(0xA)(HasGetValueTypeHash)
	uint8                                        Pad_6113[0x6];                                     // Fixing Size After Last Property 
	struct FTuple_L_R                            _ExprResult_6;                                     // 0xB8(0x1)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_7;                                     // 0xB9(0x1)(HasGetValueTypeHash)
};

// 0x0 (0x0 - 0x0)
// Function VerseDevices.Devices_creative_object.$InitInstance
struct UDevices_creative_object__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseDevices.Devices_creative_object.$Block
struct UDevices_creative_object__Block_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseDevices.Devices_creative_object.$InitCDO
struct UDevices_creative_object__InitCDO_Params
{
public:
};

// 0x1 (0x1 - 0x0)
// Function VerseDevices.Devices_creative_device_base._L_2fFortnite_2ecom_2fDevices_2fcreative__device__base_N_RShow__Internal
struct UDevices_creative_device_base__L_2fFortnite_2ecom_2fDevices_2fcreative__device__base_N_RShow__Internal_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
};

// 0x1 (0x1 - 0x0)
// Function VerseDevices.Devices_creative_device_base._L_2fFortnite_2ecom_2fDevices_2fcreative__device__base_N_RHide__Internal
struct UDevices_creative_device_base__L_2fFortnite_2ecom_2fDevices_2fcreative__device__base_N_RHide__Internal_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
};

// 0x0 (0x0 - 0x0)
// Function VerseDevices.Devices_creative_device_base.$InitInstance
struct UDevices_creative_device_base__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseDevices.Devices_creative_device_base.$Block
struct UDevices_creative_device_base__Block_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseDevices.Devices_creative_device_base.$InitCDO
struct UDevices_creative_device_base__InitCDO_Params
{
public:
};

// 0x181 (0x181 - 0x0)
// Function VerseDevices.Devices_creative_prop._L_2fFortnite_2ecom_2fDevices_2fcreative__prop_N_RTeleportTo_L_Ntransform_R
struct UDevices_creative_prop__L_2fFortnite_2ecom_2fDevices_2fcreative__prop_N_RTeleportTo_L_Ntransform_R_Params
{
public:
	struct FSpatialMath_transform                __verse_0xB2CDDD72_Argument;                       // 0x0(0x60)(Parm, NoDestructor)
	FOptionalProperty_                           RetVal;                                            // 0x60(0x2)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_0;                                // 0x62(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_6121[0x4];                                     // Fixing Size After Last Property 
	FVerseFunctionProperty_                      _Callee_1;                                         // 0x68(0x10)(HasGetValueTypeHash)
	uint8                                        Pad_6122[0x8];                                     // Fixing Size After Last Property 
	struct FTuple_Lcreative__prop_Mtuple_L_R_Mtransform_R _ExprResult_2;                                     // 0x80(0x70)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_3;                                     // 0xF0(0x1)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_4;                                // 0xF1(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_6123[0x5];                                     // Fixing Size After Last Property 
	FVerseFunctionProperty_                      _Callee_5;                                         // 0xF8(0x10)(HasGetValueTypeHash)
	uint8                                        Pad_6124[0x8];                                     // Fixing Size After Last Property 
	struct FTuple_Lcreative__prop_Mtuple_L_R_Mtransform_R _ExprResult_6;                                     // 0x110(0x70)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_7;                                     // 0x180(0x1)(HasGetValueTypeHash)
};

// 0x1C0 (0x1C0 - 0x0)
// Function VerseDevices.Devices_creative_prop._L_2fFortnite_2ecom_2fDevices_2fcreative__prop_N_RTeleportTo_L_Nvector3_M_Nrotation_R
struct UDevices_creative_prop__L_2fFortnite_2ecom_2fDevices_2fcreative__prop_N_RTeleportTo_L_Nvector3_M_Nrotation_R_Params
{
public:
	struct FTuple_Lvector3_Mrotation_R           __verse_0xB2CDDD72_Argument;                       // 0x0(0x40)(Parm, HasGetValueTypeHash)
	FOptionalProperty_                           RetVal;                                            // 0x40(0x2)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_0;                                // 0x42(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_612F[0x4];                                     // Fixing Size After Last Property 
	FVerseFunctionProperty_                      _Callee_1;                                         // 0x48(0x10)(HasGetValueTypeHash)
	uint8                                        Pad_6131[0x8];                                     // Fixing Size After Last Property 
	struct FTuple_Lcreative__prop_Mtuple_L_R_Mtuple_Lvector3_Mrotation_R_R _ExprResult_2;                                     // 0x60(0x50)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_3;                                     // 0xB0(0x1)(HasGetValueTypeHash)
	uint8                                        Pad_6132[0xF];                                     // Fixing Size After Last Property 
	struct FTuple_Lvector3_Mrotation_R           _ExprResult_4;                                     // 0xC0(0x40)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_5;                                // 0x100(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_6134[0x6];                                     // Fixing Size After Last Property 
	FVerseFunctionProperty_                      _Callee_6;                                         // 0x108(0x10)(HasGetValueTypeHash)
	uint8                                        Pad_6135[0x8];                                     // Fixing Size After Last Property 
	struct FTuple_Lcreative__prop_Mtuple_L_R_Mtuple_Lvector3_Mrotation_R_R _ExprResult_7;                                     // 0x120(0x50)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_8;                                     // 0x170(0x1)(HasGetValueTypeHash)
	uint8                                        Pad_6136[0xF];                                     // Fixing Size After Last Property 
	struct FTuple_Lvector3_Mrotation_R           _ExprResult_9;                                     // 0x180(0x40)(HasGetValueTypeHash)
};

// 0x1 (0x1 - 0x0)
// Function VerseDevices.Devices_creative_prop._L_2fFortnite_2ecom_2fDevices_2fcreative__prop_N_RShow
struct UDevices_creative_prop__L_2fFortnite_2ecom_2fDevices_2fcreative__prop_N_RShow_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function VerseDevices.Devices_creative_prop._L_2fFortnite_2ecom_2fDevices_2fcreative__prop_N_RSetMesh_L_Nmesh_R
struct UDevices_creative_prop__L_2fFortnite_2ecom_2fDevices_2fcreative__prop_N_RSetMesh_L_Nmesh_R_Params
{
public:
	class UAssets_mesh*                          __verse_0xB2CDDD72_Argument;                       // 0x0(0x8)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// 0x10 (0x10 - 0x0)
// Function VerseDevices.Devices_creative_prop._L_2fFortnite_2ecom_2fDevices_2fcreative__prop_N_RSetMaterialAtIndex_L_Nmaterial_M_Nint_R
struct UDevices_creative_prop__L_2fFortnite_2ecom_2fDevices_2fcreative__prop_N_RSetMaterialAtIndex_L_Nmaterial_M_Nint_R_Params
{
public:
	struct FTuple_Lmaterial_Mint_R               __verse_0xB2CDDD72_Argument;                       // 0x0(0x10)(Parm, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function VerseDevices.Devices_creative_prop._L_2fFortnite_2ecom_2fDevices_2fcreative__prop_N_RSetMaterial_L_Nmaterial_R
struct UDevices_creative_prop__L_2fFortnite_2ecom_2fDevices_2fcreative__prop_N_RSetMaterial_L_Nmaterial_R_Params
{
public:
	class UAssets_material*                      __verse_0xB2CDDD72_Argument;                       // 0x0(0x8)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// 0x78 (0x78 - 0x0)
// Function VerseDevices.Devices_creative_prop.MoveTo_L_Nvector3_M_Nrotation_M_Nfloat_R
struct UDevices_creative_prop_MoveTo_L_Nvector3_M_Nrotation_M_Nfloat_R_Params
{
public:
	class UConcurrency_task*                     __verse_0xC1E81372_CallingTask;                    // 0x0(0x8)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                        __verse_0xA3A00DDB_CallerResumeState;              // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        __verse_0x2AC0E4D8_CallerCancelState;              // 0x10(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_6145[0x8];                                     // Fixing Size After Last Property 
	struct FTuple_Lvector3_Mrotation_Mfloat_R    __verse_0xB2CDDD72_Argument;                       // 0x20(0x48)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_6146[0x8];                                     // Fixing Size After Last Property 
	class UConcurrency_task*                     RetVal;                                            // 0x70(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// 0x98 (0x98 - 0x0)
// Function VerseDevices.Devices_creative_prop.MoveTo_L_Ntransform_M_Nfloat_R
struct UDevices_creative_prop_MoveTo_L_Ntransform_M_Nfloat_R_Params
{
public:
	class UConcurrency_task*                     __verse_0xC1E81372_CallingTask;                    // 0x0(0x8)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                        __verse_0xA3A00DDB_CallerResumeState;              // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        __verse_0x2AC0E4D8_CallerCancelState;              // 0x10(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_6147[0x8];                                     // Fixing Size After Last Property 
	struct FTuple_Ltransform_Mfloat_R            __verse_0xB2CDDD72_Argument;                       // 0x20(0x68)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_6149[0x8];                                     // Fixing Size After Last Property 
	class UConcurrency_task*                     RetVal;                                            // 0x90(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// 0x3 (0x3 - 0x0)
// Function VerseDevices.Devices_creative_prop._L_2fVerse_2eorg_2fVerse_2finvalidatable_N_RIsValid
struct UDevices_creative_prop__L_2fVerse_2eorg_2fVerse_2finvalidatable_N_RIsValid_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	FOptionalProperty_                           RetVal;                                            // 0x1(0x2)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x2 (0x2 - 0x0)
// Function VerseDevices.Devices_creative_prop._L_2fFortnite_2ecom_2fDevices_2fcreative__prop_N_RIsHidden
struct UDevices_creative_prop__L_2fFortnite_2ecom_2fDevices_2fcreative__prop_N_RIsHidden_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        RetVal : 1;                                        // Mask: 0x1, PropSize: 0x10x1(0x1)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash)
};

// 0x1 (0x1 - 0x0)
// Function VerseDevices.Devices_creative_prop._L_2fFortnite_2ecom_2fDevices_2fcreative__prop_N_RHide
struct UDevices_creative_prop__L_2fFortnite_2ecom_2fDevices_2fcreative__prop_N_RHide_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
};

// 0x1 (0x1 - 0x0)
// Function VerseDevices.Devices_creative_prop._L_2fVerse_2eorg_2fVerse_2fdisposable_N_RDispose
struct UDevices_creative_prop__L_2fVerse_2eorg_2fVerse_2fdisposable_N_RDispose_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
};

// 0x0 (0x0 - 0x0)
// Function VerseDevices.Devices_creative_prop.$InitInstance
struct UDevices_creative_prop__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseDevices.Devices_creative_prop.$Block
struct UDevices_creative_prop__Block_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseDevices.Devices_creative_prop.$InitCDO
struct UDevices_creative_prop__InitCDO_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseDevices.Devices_creative_prop_asset.$InitInstance
struct UDevices_creative_prop_asset__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseDevices.Devices_creative_prop_asset.$Block
struct UDevices_creative_prop_asset__Block_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseDevices.Devices_creative_prop_asset.$InitCDO
struct UDevices_creative_prop_asset__InitCDO_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseDevices.Devices_creative_prop_debug_log.$InitInstance
struct UDevices_creative_prop_debug_log__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseDevices.Devices_creative_prop_debug_log.$Block
struct UDevices_creative_prop_debug_log__Block_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseDevices.Devices_creative_prop_debug_log.$InitCDO
struct UDevices_creative_prop_debug_log__InitCDO_Params
{
public:
};

// 0x2F8 (0x2F8 - 0x0)
// Function VerseDevices.Devices_CreativeAnimation._L_2fFortnite_2ecom_2fDevices_2fCreativeAnimation_N_Roperator_U_2eGetAnimationController_U_L_Ncreative__prop_M_Ntuple_L_R_M_Ntuple_L_R_R
struct UDevices_CreativeAnimation__L_2fFortnite_2ecom_2fDevices_2fCreativeAnimation_N_Roperator_U_2eGetAnimationController_U_L_Ncreative__prop_M_Ntuple_L_R_M_Ntuple_L_R_R_Params
{
public:
	struct FTuple_Lcreative__prop_Mtuple_L_R_Mtuple_L_R_R __verse_0xB2CDDD72_Argument;                       // 0x0(0xA)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_6172[0x6];                                     // Fixing Size After Last Property 
	FOptionalProperty_                           RetVal;                                            // 0x10(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	enum class EVerseFalse                       _ExprResult_0;                                     // 0x18(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_6173[0x7];                                     // Fixing Size After Last Property 
	struct FTuple_L_Qanimation__controller_Mget__animation__controller__result_R __verse_0x95D09D0E_Result_1;                       // 0x20(0x9)(HasGetValueTypeHash)
	uint8                                        Pad_6174[0x7];                                     // Fixing Size After Last Property 
	FVerseFunctionProperty_                      _Callee_1;                                         // 0x30(0x10)(HasGetValueTypeHash)
	class UDiagnostics_log*                      __verse_0x63A8D5FA_DebugLog_1;                     // 0x40(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                       _InstancingGraph_2;                                // 0x48(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       InvokeResultDummy_3;                               // 0x50(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_4;                                // 0x60(0x18)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_5;                                     // 0x78(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_6;                                     // 0x88(0x10)(HasGetValueTypeHash)
	class UDiagnostics_log*                      __verse_0x00000000__3;                             // 0x98(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	enum class EVerseTrue                        _InvokeSureResultDummy_7;                          // 0xA0(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_6175[0x7];                                     // Fixing Size After Last Property 
	FVerseFunctionProperty_                      _Callee_8;                                         // 0xA8(0x10)(HasGetValueTypeHash)
	struct FTuple_L_Kchar_M_QLevel_Nlog__level_R _ExprResult_9;                                     // 0xB8(0x12)(HasGetValueTypeHash)
	uint8                                        Pad_6176[0x6];                                     // Fixing Size After Last Property 
	FVerseStringProperty_                        _ExprResult_10;                                    // 0xD0(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_11;                                    // 0xE0(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_6177[0x6];                                     // Fixing Size After Last Property 
	FVerseDynamicProperty_                       InvokeResultDummy_12;                              // 0xE8(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_13;                               // 0xF8(0x18)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_14;                                    // 0x110(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_15;                                    // 0x120(0x10)(HasGetValueTypeHash)
	class UDiagnostics_log*                      __verse_0x00000000__5;                             // 0x130(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	enum class EVerseTrue                        _InvokeSureResultDummy_16;                         // 0x138(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_6179[0x7];                                     // Fixing Size After Last Property 
	FVerseFunctionProperty_                      _Callee_17;                                        // 0x140(0x10)(HasGetValueTypeHash)
	struct FTuple_L_Kchar_M_QLevel_Nlog__level_R _ExprResult_18;                                    // 0x150(0x12)(HasGetValueTypeHash)
	uint8                                        Pad_617A[0x6];                                     // Fixing Size After Last Property 
	FVerseStringProperty_                        _ExprResult_19;                                    // 0x168(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_20;                                    // 0x178(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_617B[0x6];                                     // Fixing Size After Last Property 
	FOptionalProperty_                           _ExprResultStack_21;                               // 0x180(0x8)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	enum class EVerseFalse                       _ExprResult_22;                                    // 0x188(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_617C[0x7];                                     // Fixing Size After Last Property 
	struct FTuple_L_Qanimation__controller_Mget__animation__controller__result_R __verse_0x95D09D0E_Result_6;                       // 0x190(0x9)(HasGetValueTypeHash)
	uint8                                        Pad_617D[0x7];                                     // Fixing Size After Last Property 
	FVerseFunctionProperty_                      _Callee_23;                                        // 0x1A0(0x10)(HasGetValueTypeHash)
	class UDiagnostics_log*                      __verse_0x63A8D5FA_DebugLog_6;                     // 0x1B0(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                       _InstancingGraph_24;                               // 0x1B8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       InvokeResultDummy_25;                              // 0x1C0(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_26;                               // 0x1D0(0x18)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_27;                                    // 0x1E8(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_28;                                    // 0x1F8(0x10)(HasGetValueTypeHash)
	class UDiagnostics_log*                      __verse_0x00000000__8;                             // 0x208(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	enum class EVerseTrue                        _InvokeSureResultDummy_29;                         // 0x210(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_617E[0x7];                                     // Fixing Size After Last Property 
	FVerseFunctionProperty_                      _Callee_30;                                        // 0x218(0x10)(HasGetValueTypeHash)
	struct FTuple_L_Kchar_M_QLevel_Nlog__level_R _ExprResult_31;                                    // 0x228(0x12)(HasGetValueTypeHash)
	uint8                                        Pad_617F[0x6];                                     // Fixing Size After Last Property 
	FVerseStringProperty_                        _ExprResult_32;                                    // 0x240(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_33;                                    // 0x250(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_6180[0x6];                                     // Fixing Size After Last Property 
	FVerseDynamicProperty_                       InvokeResultDummy_34;                              // 0x258(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_35;                               // 0x268(0x18)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_36;                                    // 0x280(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_37;                                    // 0x290(0x10)(HasGetValueTypeHash)
	class UDiagnostics_log*                      __verse_0x00000000__10;                            // 0x2A0(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	enum class EVerseTrue                        _InvokeSureResultDummy_38;                         // 0x2A8(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_6181[0x7];                                     // Fixing Size After Last Property 
	FVerseFunctionProperty_                      _Callee_39;                                        // 0x2B0(0x10)(HasGetValueTypeHash)
	struct FTuple_L_Kchar_M_QLevel_Nlog__level_R _ExprResult_40;                                    // 0x2C0(0x12)(HasGetValueTypeHash)
	uint8                                        Pad_6182[0x6];                                     // Fixing Size After Last Property 
	FVerseStringProperty_                        _ExprResult_41;                                    // 0x2D8(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_42;                                    // 0x2E8(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_6184[0x6];                                     // Fixing Size After Last Property 
	FOptionalProperty_                           _ExprResultStack_43;                               // 0x2F0(0x8)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};

// 0x18 (0x18 - 0x0)
// Function VerseDevices.Devices_CreativeAnimation._L_2fFortnite_2ecom_2fDevices_2fCreativeAnimation_N_RGetAnimationController_L_Ncreative__movable__object__base_R
struct UDevices_CreativeAnimation__L_2fFortnite_2ecom_2fDevices_2fCreativeAnimation_N_RGetAnimationController_L_Ncreative__movable__object__base_R_Params
{
public:
	class UVerseMovableObjectBase*               __verse_0xB2CDDD72_Argument;                       // 0x0(0x8)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FTuple_L_Qanimation__controller_Mget__animation__controller__result_R RetVal;                                            // 0x8(0x9)(Parm, OutParm, ReturnParm, HasGetValueTypeHash)
	uint8                                        Pad_6189[0x7];                                     // Fixing Size Of Struct
};

// 0x25A (0x25A - 0x0)
// Function VerseDevices.Devices_CreativeAnimation.Devices_CreativeAnimation_keyframe_delta$OverrideFactory
struct UDevices_CreativeAnimation_Devices_CreativeAnimation_keyframe_delta_OverrideFactory_Params
{
public:
	struct FDevices_CreativeAnimation_keyframe_delta RetVal;                                            // 0x0(0x80)(Parm, OutParm, ReturnParm, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           __verse_0xFB48ED96__InitOverrideMap;               // 0x80(0x50)(ConstParm, Parm, ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResultStack_0;                                // 0xD0(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_1;                                     // 0xE0(0x2)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_618D[0x6];                                     // Fixing Size After Last Property 
	struct FSpatialMath_vector3                  _ExprResult_2;                                     // 0xE8(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_3;                                // 0x100(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_4;                                     // 0x150(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_5;                                     // 0x160(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_6;                                     // 0x170(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResultStack_7;                                // 0x180(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_8;                                     // 0x190(0x2)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_618E[0x6];                                     // Fixing Size After Last Property 
	FVerseStringProperty_                        _ExprResultStack_9;                                // 0x198(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_10;                                    // 0x1A8(0x2)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_618F[0x6];                                     // Fixing Size After Last Property 
	struct FSpatialMath_vector3                  _ExprResult_11;                                    // 0x1B0(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_12;                               // 0x1C8(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_13;                                    // 0x218(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_14;                                    // 0x228(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_15;                                    // 0x238(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResultStack_16;                               // 0x248(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_17;                                    // 0x258(0x2)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

// 0x1B0 (0x1B0 - 0x0)
// Function VerseDevices.Devices_CreativeAnimation.Devices_CreativeAnimation_keyframe_delta$Factory
struct UDevices_CreativeAnimation_Devices_CreativeAnimation_keyframe_delta_Factory_Params
{
public:
	struct FDevices_CreativeAnimation_keyframe_delta RetVal;                                            // 0x0(0x80)(Parm, OutParm, ReturnParm, NoDestructor)
	struct FSpatialMath_vector3                  _ExprResult_0;                                     // 0x80(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_1;                                // 0x98(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_2;                                     // 0xE8(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_3;                                     // 0xF8(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_4;                                     // 0x108(0x10)(HasGetValueTypeHash)
	struct FSpatialMath_vector3                  _ExprResult_5;                                     // 0x118(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_6;                                // 0x130(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_7;                                     // 0x180(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_8;                                     // 0x190(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_9;                                     // 0x1A0(0x10)(HasGetValueTypeHash)
};

// 0x12A (0x12A - 0x0)
// Function VerseDevices.Devices_CreativeAnimation.Devices_CreativeAnimation_cubic_bezier_parameters$OverrideFactory
struct UDevices_CreativeAnimation_Devices_CreativeAnimation_cubic_bezier_parameters_OverrideFactory_Params
{
public:
	struct FDevices_CreativeAnimation_cubic_bezier_parameters RetVal;                                            // 0x0(0x20)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           __verse_0xFB48ED96__InitOverrideMap;               // 0x20(0x50)(ConstParm, Parm, ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResultStack_0;                                // 0x70(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_1;                                     // 0x80(0x2)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_6199[0x6];                                     // Fixing Size After Last Property 
	FVerseStringProperty_                        _ExprResultStack_2;                                // 0x88(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_3;                                     // 0x98(0x2)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_619A[0x6];                                     // Fixing Size After Last Property 
	FVerseStringProperty_                        _ExprResultStack_4;                                // 0xA0(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_5;                                     // 0xB0(0x2)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_619B[0x6];                                     // Fixing Size After Last Property 
	FVerseStringProperty_                        _ExprResultStack_6;                                // 0xB8(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_7;                                     // 0xC8(0x2)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_619C[0x6];                                     // Fixing Size After Last Property 
	FVerseStringProperty_                        _ExprResultStack_8;                                // 0xD0(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_9;                                     // 0xE0(0x2)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_619E[0x6];                                     // Fixing Size After Last Property 
	FVerseStringProperty_                        _ExprResultStack_10;                               // 0xE8(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_11;                                    // 0xF8(0x2)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_619F[0x6];                                     // Fixing Size After Last Property 
	FVerseStringProperty_                        _ExprResultStack_12;                               // 0x100(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_13;                                    // 0x110(0x2)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_61A0[0x6];                                     // Fixing Size After Last Property 
	FVerseStringProperty_                        _ExprResultStack_14;                               // 0x118(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_15;                                    // 0x128(0x2)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

// 0x20 (0x20 - 0x0)
// Function VerseDevices.Devices_CreativeAnimation.Devices_CreativeAnimation_cubic_bezier_parameters$Factory
struct UDevices_CreativeAnimation_Devices_CreativeAnimation_cubic_bezier_parameters_Factory_Params
{
public:
	struct FDevices_CreativeAnimation_cubic_bezier_parameters RetVal;                                            // 0x0(0x20)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// 0x0 (0x0 - 0x0)
// Function VerseDevices.Devices_CreativeAnimation.$InitCDO
struct UDevices_CreativeAnimation__InitCDO_Params
{
public:
};

// 0x4A8 (0x4A8 - 0x0)
// Function VerseDevices.Devices_CreativeAnimation_animation_controller._L_2fFortnite_2ecom_2fDevices_2fCreativeAnimation_2fanimation__controller_N_RToString_L_Nset__animation__result_R
struct UDevices_CreativeAnimation_animation_controller__L_2fFortnite_2ecom_2fDevices_2fCreativeAnimation_2fanimation__controller_N_RToString_L_Nset__animation__result_R_Params
{
public:
	enum class EDevices_CreativeAnimation_set_animation_result __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_61B8[0x7];                                     // Fixing Size After Last Property 
	FVerseStringProperty_                        RetVal;                                            // 0x8(0x10)(Parm, OutParm, ReturnParm, HasGetValueTypeHash)
	enum class EDevices_CreativeAnimation_set_animation_result __verse_0x00000000__1;                             // 0x18(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_61B9[0x7];                                     // Fixing Size After Last Property 
	FVerseDynamicProperty_                       InvokeResultDummy_0;                               // 0x20(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_1;                                // 0x30(0x18)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_2;                                     // 0x48(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_3;                                     // 0x58(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       InvokeResultDummy_4;                               // 0x68(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_5;                                // 0x78(0x18)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_6;                                     // 0x90(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_7;                                     // 0xA0(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       InvokeResultDummy_8;                               // 0xB0(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_9;                                // 0xC0(0x18)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_10;                                    // 0xD8(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_11;                                    // 0xE8(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       InvokeResultDummy_12;                              // 0xF8(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_13;                               // 0x108(0x18)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_14;                                    // 0x120(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_15;                                    // 0x130(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       InvokeResultDummy_16;                              // 0x140(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_17;                               // 0x150(0x18)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_18;                                    // 0x168(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_19;                                    // 0x178(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       InvokeResultDummy_20;                              // 0x188(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_21;                               // 0x198(0x18)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_22;                                    // 0x1B0(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_23;                                    // 0x1C0(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       InvokeResultDummy_24;                              // 0x1D0(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_25;                               // 0x1E0(0x18)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_26;                                    // 0x1F8(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_27;                                    // 0x208(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       InvokeResultDummy_28;                              // 0x218(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_29;                               // 0x228(0x18)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_30;                                    // 0x240(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_31;                                    // 0x250(0x10)(HasGetValueTypeHash)
	enum class EDevices_CreativeAnimation_set_animation_result __verse_0x00000000__11;                            // 0x260(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_61C0[0x7];                                     // Fixing Size After Last Property 
	FVerseDynamicProperty_                       InvokeResultDummy_32;                              // 0x268(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_33;                               // 0x278(0x18)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_34;                                    // 0x290(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_35;                                    // 0x2A0(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       InvokeResultDummy_36;                              // 0x2B0(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_37;                               // 0x2C0(0x18)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_38;                                    // 0x2D8(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_39;                                    // 0x2E8(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       InvokeResultDummy_40;                              // 0x2F8(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_41;                               // 0x308(0x18)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_42;                                    // 0x320(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_43;                                    // 0x330(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       InvokeResultDummy_44;                              // 0x340(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_45;                               // 0x350(0x18)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_46;                                    // 0x368(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_47;                                    // 0x378(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       InvokeResultDummy_48;                              // 0x388(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_49;                               // 0x398(0x18)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_50;                                    // 0x3B0(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_51;                                    // 0x3C0(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       InvokeResultDummy_52;                              // 0x3D0(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_53;                               // 0x3E0(0x18)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_54;                                    // 0x3F8(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_55;                                    // 0x408(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       InvokeResultDummy_56;                              // 0x418(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_57;                               // 0x428(0x18)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_58;                                    // 0x440(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_59;                                    // 0x450(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       InvokeResultDummy_60;                              // 0x460(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_61;                               // 0x470(0x18)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_62;                                    // 0x488(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_63;                                    // 0x498(0x10)(HasGetValueTypeHash)
};

// 0x2 (0x2 - 0x0)
// Function VerseDevices.Devices_CreativeAnimation_animation_controller._L_2fFortnite_2ecom_2fDevices_2fCreativeAnimation_2fanimation__controller_N_RStopInternal
struct UDevices_CreativeAnimation_animation_controller__L_2fFortnite_2ecom_2fDevices_2fCreativeAnimation_2fanimation__controller_N_RStopInternal_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	enum class EDevices_CreativeAnimation_playstoppause_result RetVal;                                            // 0x1(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0xB0 (0xB0 - 0x0)
// Function VerseDevices.Devices_CreativeAnimation_animation_controller._L_2fFortnite_2ecom_2fDevices_2fCreativeAnimation_2fanimation__controller_N_RStop
struct UDevices_CreativeAnimation_animation_controller__L_2fFortnite_2ecom_2fDevices_2fCreativeAnimation_2fanimation__controller_N_RStop_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	enum class EDevices_CreativeAnimation_playstoppause_result __verse_0x95D09D0E_Result_1;                       // 0x1(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_61D7[0x6];                                     // Fixing Size After Last Property 
	FVerseFunctionProperty_                      _Callee_0;                                         // 0x8(0x10)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_1;                                     // 0x18(0x1)(HasGetValueTypeHash)
	enum class EVerseTrue                        _InvokeSureResultDummy_2;                          // 0x19(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_61D9[0x6];                                     // Fixing Size After Last Property 
	FVerseFunctionProperty_                      _Callee_3;                                         // 0x20(0x10)(HasGetValueTypeHash)
	struct FTuple_L_Kchar_Mplaystoppause__result_R _ExprResult_4;                                     // 0x30(0x11)(HasGetValueTypeHash)
	uint8                                        Pad_61DA[0x7];                                     // Fixing Size After Last Property 
	FVerseStringProperty_                        _ExprResult_5;                                     // 0x48(0x10)(HasGetValueTypeHash)
	enum class EDevices_CreativeAnimation_playstoppause_result __verse_0x95D09D0E_Result_2;                       // 0x58(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_61DB[0x7];                                     // Fixing Size After Last Property 
	FVerseFunctionProperty_                      _Callee_6;                                         // 0x60(0x10)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_7;                                     // 0x70(0x1)(HasGetValueTypeHash)
	enum class EVerseTrue                        _InvokeSureResultDummy_8;                          // 0x71(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_61DC[0x6];                                     // Fixing Size After Last Property 
	FVerseFunctionProperty_                      _Callee_9;                                         // 0x78(0x10)(HasGetValueTypeHash)
	struct FTuple_L_Kchar_Mplaystoppause__result_R _ExprResult_10;                                    // 0x88(0x11)(HasGetValueTypeHash)
	uint8                                        Pad_61DD[0x7];                                     // Fixing Size After Last Property 
	FVerseStringProperty_                        _ExprResult_11;                                    // 0xA0(0x10)(HasGetValueTypeHash)
};

// 0x19 (0x19 - 0x0)
// Function VerseDevices.Devices_CreativeAnimation_animation_controller._L_2fFortnite_2ecom_2fDevices_2fCreativeAnimation_2fanimation__controller_N_RSetAnimationInternal_L_N_Kkeyframe__delta_M_N_QAnimationMode_Nanimation__mode_20_3d_20_2e_2e_2e_R
struct UDevices_CreativeAnimation_animation_controller__L_2fFortnite_2ecom_2fDevices_2fCreativeAnimation_2fanimation__controller_N_RSetAnimationInternal_L_N_Kkeyframe__delta_M_N_QAnimationMode_Nanimation__mode_20_3d_20_2e_2e_2e_R_Params
{
public:
	struct FTuple_L_Kkeyframe__delta_M_QAnimationMode_Nanimation__mode_20_3d_20_2e_2e_2e_R __verse_0xB2CDDD72_Argument;                       // 0x0(0x12)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_61DF[0x6];                                     // Fixing Size After Last Property 
	enum class EDevices_CreativeAnimation_set_animation_result RetVal;                                            // 0x18(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x20A (0x20A - 0x0)
// Function VerseDevices.Devices_CreativeAnimation_animation_controller._L_2fFortnite_2ecom_2fDevices_2fCreativeAnimation_2fanimation__controller_N_RSetAnimation_L_N_Kkeyframe__delta_M_N_QMode_Nanimation__mode_R
struct UDevices_CreativeAnimation_animation_controller__L_2fFortnite_2ecom_2fDevices_2fCreativeAnimation_2fanimation__controller_N_RSetAnimation_L_N_Kkeyframe__delta_M_N_QMode_Nanimation__mode_R_Params
{
public:
	struct FTuple_L_Kkeyframe__delta_M_QMode_Nanimation__mode_R __verse_0xB2CDDD72_Argument;                       // 0x0(0x12)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_61ED[0x6];                                     // Fixing Size After Last Property 
	enum class EDevices_CreativeAnimation_set_animation_result __verse_0x95D09D0E_Result_1;                       // 0x18(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_61EE[0x7];                                     // Fixing Size After Last Property 
	FVerseFunctionProperty_                      _Callee_0;                                         // 0x20(0x10)(HasGetValueTypeHash)
	struct FTuple_L_Kkeyframe__delta_M_QAnimationMode_Nanimation__mode_R _ExprResult_1;                                     // 0x30(0x12)(HasGetValueTypeHash)
	uint8                                        Pad_61EF[0x6];                                     // Fixing Size After Last Property 
	FOptionalProperty_                           _ExprResult_2;                                     // 0x48(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_61F0[0x6];                                     // Fixing Size After Last Property 
	FVerseDynamicProperty_                       InvokeResultDummy_3;                               // 0x50(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_4;                                // 0x60(0x18)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_5;                                     // 0x78(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_6;                                     // 0x88(0x10)(HasGetValueTypeHash)
	class UDiagnostics_log*                      __verse_0x00000000__3;                             // 0x98(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	enum class EVerseTrue                        _InvokeSureResultDummy_7;                          // 0xA0(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_61F2[0x7];                                     // Fixing Size After Last Property 
	FVerseFunctionProperty_                      _Callee_8;                                         // 0xA8(0x10)(HasGetValueTypeHash)
	struct FTuple_L_Kchar_M_QLevel_Nlog__level_R _ExprResult_9;                                     // 0xB8(0x12)(HasGetValueTypeHash)
	uint8                                        Pad_61F3[0x6];                                     // Fixing Size After Last Property 
	FVerseStringProperty_                        _ExprResultStack_10;                               // 0xD0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_11;                                    // 0xE0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResultStack_12;                               // 0xF0(0x10)(HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_13;                                        // 0x100(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_14;                                    // 0x110(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class EDevices_CreativeAnimation_set_animation_result __verse_0x95D09D0E_Result_4;                       // 0x112(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_61F5[0x5];                                     // Fixing Size After Last Property 
	FVerseFunctionProperty_                      _Callee_15;                                        // 0x118(0x10)(HasGetValueTypeHash)
	struct FTuple_L_Kkeyframe__delta_M_QAnimationMode_Nanimation__mode_R _ExprResult_16;                                    // 0x128(0x12)(HasGetValueTypeHash)
	uint8                                        Pad_61F6[0x6];                                     // Fixing Size After Last Property 
	FOptionalProperty_                           _ExprResult_17;                                    // 0x140(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_61F7[0x6];                                     // Fixing Size After Last Property 
	FVerseDynamicProperty_                       InvokeResultDummy_18;                              // 0x148(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_19;                               // 0x158(0x18)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_20;                                    // 0x170(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_21;                                    // 0x180(0x10)(HasGetValueTypeHash)
	class UDiagnostics_log*                      __verse_0x00000000__6;                             // 0x190(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	enum class EVerseTrue                        _InvokeSureResultDummy_22;                         // 0x198(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_61F9[0x7];                                     // Fixing Size After Last Property 
	FVerseFunctionProperty_                      _Callee_23;                                        // 0x1A0(0x10)(HasGetValueTypeHash)
	struct FTuple_L_Kchar_M_QLevel_Nlog__level_R _ExprResult_24;                                    // 0x1B0(0x12)(HasGetValueTypeHash)
	uint8                                        Pad_61FA[0x6];                                     // Fixing Size After Last Property 
	FVerseStringProperty_                        _ExprResultStack_25;                               // 0x1C8(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_26;                                    // 0x1D8(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResultStack_27;                               // 0x1E8(0x10)(HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_28;                                        // 0x1F8(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_29;                                    // 0x208(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x2 (0x2 - 0x0)
// Function VerseDevices.Devices_CreativeAnimation_animation_controller._L_2fFortnite_2ecom_2fDevices_2fCreativeAnimation_2fanimation__controller_N_RPlayInternal
struct UDevices_CreativeAnimation_animation_controller__L_2fFortnite_2ecom_2fDevices_2fCreativeAnimation_2fanimation__controller_N_RPlayInternal_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	enum class EDevices_CreativeAnimation_playstoppause_result RetVal;                                            // 0x1(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0xB0 (0xB0 - 0x0)
// Function VerseDevices.Devices_CreativeAnimation_animation_controller._L_2fFortnite_2ecom_2fDevices_2fCreativeAnimation_2fanimation__controller_N_RPlay
struct UDevices_CreativeAnimation_animation_controller__L_2fFortnite_2ecom_2fDevices_2fCreativeAnimation_2fanimation__controller_N_RPlay_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	enum class EDevices_CreativeAnimation_playstoppause_result __verse_0x95D09D0E_Result_1;                       // 0x1(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_6207[0x6];                                     // Fixing Size After Last Property 
	FVerseFunctionProperty_                      _Callee_0;                                         // 0x8(0x10)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_1;                                     // 0x18(0x1)(HasGetValueTypeHash)
	enum class EVerseTrue                        _InvokeSureResultDummy_2;                          // 0x19(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_620A[0x6];                                     // Fixing Size After Last Property 
	FVerseFunctionProperty_                      _Callee_3;                                         // 0x20(0x10)(HasGetValueTypeHash)
	struct FTuple_L_Kchar_Mplaystoppause__result_R _ExprResult_4;                                     // 0x30(0x11)(HasGetValueTypeHash)
	uint8                                        Pad_620B[0x7];                                     // Fixing Size After Last Property 
	FVerseStringProperty_                        _ExprResult_5;                                     // 0x48(0x10)(HasGetValueTypeHash)
	enum class EDevices_CreativeAnimation_playstoppause_result __verse_0x95D09D0E_Result_2;                       // 0x58(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_620D[0x7];                                     // Fixing Size After Last Property 
	FVerseFunctionProperty_                      _Callee_6;                                         // 0x60(0x10)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_7;                                     // 0x70(0x1)(HasGetValueTypeHash)
	enum class EVerseTrue                        _InvokeSureResultDummy_8;                          // 0x71(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_620F[0x6];                                     // Fixing Size After Last Property 
	FVerseFunctionProperty_                      _Callee_9;                                         // 0x78(0x10)(HasGetValueTypeHash)
	struct FTuple_L_Kchar_Mplaystoppause__result_R _ExprResult_10;                                    // 0x88(0x11)(HasGetValueTypeHash)
	uint8                                        Pad_6210[0x7];                                     // Fixing Size After Last Property 
	FVerseStringProperty_                        _ExprResult_11;                                    // 0xA0(0x10)(HasGetValueTypeHash)
};

// 0x2 (0x2 - 0x0)
// Function VerseDevices.Devices_CreativeAnimation_animation_controller._L_2fFortnite_2ecom_2fDevices_2fCreativeAnimation_2fanimation__controller_N_RPauseInternal
struct UDevices_CreativeAnimation_animation_controller__L_2fFortnite_2ecom_2fDevices_2fCreativeAnimation_2fanimation__controller_N_RPauseInternal_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	enum class EDevices_CreativeAnimation_playstoppause_result RetVal;                                            // 0x1(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0xB0 (0xB0 - 0x0)
// Function VerseDevices.Devices_CreativeAnimation_animation_controller._L_2fFortnite_2ecom_2fDevices_2fCreativeAnimation_2fanimation__controller_N_RPause
struct UDevices_CreativeAnimation_animation_controller__L_2fFortnite_2ecom_2fDevices_2fCreativeAnimation_2fanimation__controller_N_RPause_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	enum class EDevices_CreativeAnimation_playstoppause_result __verse_0x95D09D0E_Result_1;                       // 0x1(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_6224[0x6];                                     // Fixing Size After Last Property 
	FVerseFunctionProperty_                      _Callee_0;                                         // 0x8(0x10)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_1;                                     // 0x18(0x1)(HasGetValueTypeHash)
	enum class EVerseTrue                        _InvokeSureResultDummy_2;                          // 0x19(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_6226[0x6];                                     // Fixing Size After Last Property 
	FVerseFunctionProperty_                      _Callee_3;                                         // 0x20(0x10)(HasGetValueTypeHash)
	struct FTuple_L_Kchar_Mplaystoppause__result_R _ExprResult_4;                                     // 0x30(0x11)(HasGetValueTypeHash)
	uint8                                        Pad_6228[0x7];                                     // Fixing Size After Last Property 
	FVerseStringProperty_                        _ExprResult_5;                                     // 0x48(0x10)(HasGetValueTypeHash)
	enum class EDevices_CreativeAnimation_playstoppause_result __verse_0x95D09D0E_Result_2;                       // 0x58(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_622A[0x7];                                     // Fixing Size After Last Property 
	FVerseFunctionProperty_                      _Callee_6;                                         // 0x60(0x10)(HasGetValueTypeHash)
	struct FTuple_L_R                            _ExprResult_7;                                     // 0x70(0x1)(HasGetValueTypeHash)
	enum class EVerseTrue                        _InvokeSureResultDummy_8;                          // 0x71(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_622D[0x6];                                     // Fixing Size After Last Property 
	FVerseFunctionProperty_                      _Callee_9;                                         // 0x78(0x10)(HasGetValueTypeHash)
	struct FTuple_L_Kchar_Mplaystoppause__result_R _ExprResult_10;                                    // 0x88(0x11)(HasGetValueTypeHash)
	uint8                                        Pad_622E[0x7];                                     // Fixing Size After Last Property 
	FVerseStringProperty_                        _ExprResult_11;                                    // 0xA0(0x10)(HasGetValueTypeHash)
};

// 0x813 (0x813 - 0x0)
// Function VerseDevices.Devices_CreativeAnimation_animation_controller._L_2fFortnite_2ecom_2fDevices_2fCreativeAnimation_2fanimation__controller_N_RLogPlayStopPauseResultIfError_L_N_Kchar_M_Nplaystoppause__result_R
struct UDevices_CreativeAnimation_animation_controller__L_2fFortnite_2ecom_2fDevices_2fCreativeAnimation_2fanimation__controller_N_RLogPlayStopPauseResultIfError_L_N_Kchar_M_Nplaystoppause__result_R_Params
{
public:
	struct FTuple_L_Kchar_Mplaystoppause__result_R __verse_0xB2CDDD72_Argument;                       // 0x0(0x11)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_6287[0x7];                                     // Fixing Size After Last Property 
	FVerseDynamicProperty_                       InvokeResultDummy_0;                               // 0x18(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_1;                                // 0x28(0x18)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_2;                                     // 0x40(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_3;                                     // 0x50(0x10)(HasGetValueTypeHash)
	class UDiagnostics_log*                      __verse_0x00000000__2;                             // 0x60(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	enum class EVerseTrue                        _InvokeSureResultDummy_4;                          // 0x68(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_628B[0x7];                                     // Fixing Size After Last Property 
	FVerseFunctionProperty_                      _Callee_5;                                         // 0x70(0x10)(HasGetValueTypeHash)
	struct FTuple_L_Kchar_M_QLevel_Nlog__level_R _ExprResult_6;                                     // 0x80(0x12)(HasGetValueTypeHash)
	uint8                                        Pad_628D[0x6];                                     // Fixing Size After Last Property 
	FVerseStringProperty_                        _ExprResult_7;                                     // 0x98(0x10)(HasGetValueTypeHash)
	TArray<FVerseDynamicProperty_>               __verse_0xFFC68BC5_Array_3;                        // 0xA8(0x10)(ContainsInstancedReference)
	FVerseFunctionProperty_                      _Callee_8;                                         // 0xB8(0x10)(HasGetValueTypeHash)
	TArray<TArray<FVerseDynamicProperty_>>       _ExprResult_9;                                     // 0xC8(0x10)(ContainsInstancedReference)
	TArray<FVerseStringProperty_>                __verse_0xFFC68BC5_Array_4;                        // 0xD8(0x10)(ContainsInstancedReference)
	struct FTuple_L_Kchar_M_Kchar_R              __verse_0x00000000__5;                             // 0xE8(0x20)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResultStack_10;                               // 0x108(0x10)(HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_11;                                        // 0x118(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_12;                                    // 0x128(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResultDummy_13;                               // 0x138(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResultDummy_14;                               // 0x148(0x10)(HasGetValueTypeHash)
	TArray<TArray<FVerseDynamicProperty_>>       _ForResult_15;                                     // 0x158(0x10)(ContainsInstancedReference)
	int64                                        _ForIndex_16;                                      // 0x168(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        _ForLength_17;                                     // 0x170(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                        __verse_0xFB88B569_Item_7;                         // 0x178(0x10)(HasGetValueTypeHash)
	TArray<FVerseDynamicProperty_>               _ExprResult_18;                                    // 0x188(0x10)(ContainsInstancedReference)
	FVerseStringProperty_                        __verse_0xFFC68BC5_Array_8;                        // 0x198(0x10)(HasGetValueTypeHash)
	TArray<FVerseDynamicProperty_>               _ForResult_19;                                     // 0x1A8(0x10)(ContainsInstancedReference)
	int64                                        _ForIndex_20;                                      // 0x1B8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        _ForLength_21;                                     // 0x1C0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        __verse_0xFB88B569_Item_10;                        // 0x1C8(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_628F[0x7];                                     // Fixing Size After Last Property 
	FVerseDynamicProperty_                       _ExprResult_22;                                    // 0x1D0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ForResult_23;                                     // 0x1E0(0x10)(HasGetValueTypeHash)
	int64                                        _ForIndex_24;                                      // 0x1F0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        _ForLength_25;                                     // 0x1F8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       __verse_0xFB88B569_Item_12;                        // 0x200(0x10)(HasGetValueTypeHash)
	uint8                                        _ExprResult_26;                                    // 0x210(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_27;                                    // 0x211(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_6290[0x5];                                     // Fixing Size After Last Property 
	FVerseDynamicProperty_                       InvokeResultDummy_28;                              // 0x218(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_29;                               // 0x228(0x18)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_30;                                    // 0x240(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_31;                                    // 0x250(0x10)(HasGetValueTypeHash)
	class UDiagnostics_log*                      __verse_0x00000000__14;                            // 0x260(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	enum class EVerseTrue                        _InvokeSureResultDummy_32;                         // 0x268(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_6294[0x7];                                     // Fixing Size After Last Property 
	FVerseFunctionProperty_                      _Callee_33;                                        // 0x270(0x10)(HasGetValueTypeHash)
	struct FTuple_L_Kchar_M_QLevel_Nlog__level_R _ExprResult_34;                                    // 0x280(0x12)(HasGetValueTypeHash)
	uint8                                        Pad_6296[0x6];                                     // Fixing Size After Last Property 
	FVerseStringProperty_                        _ExprResult_35;                                    // 0x298(0x10)(HasGetValueTypeHash)
	TArray<FVerseDynamicProperty_>               __verse_0xFFC68BC5_Array_15;                       // 0x2A8(0x10)(ContainsInstancedReference)
	FVerseFunctionProperty_                      _Callee_36;                                        // 0x2B8(0x10)(HasGetValueTypeHash)
	TArray<TArray<FVerseDynamicProperty_>>       _ExprResult_37;                                    // 0x2C8(0x10)(ContainsInstancedReference)
	TArray<FVerseStringProperty_>                __verse_0xFFC68BC5_Array_16;                       // 0x2D8(0x10)(ContainsInstancedReference)
	struct FTuple_L_Kchar_M_Kchar_R              __verse_0x00000000__17;                            // 0x2E8(0x20)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResultStack_38;                               // 0x308(0x10)(HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_39;                                        // 0x318(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_40;                                    // 0x328(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResultDummy_41;                               // 0x338(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResultDummy_42;                               // 0x348(0x10)(HasGetValueTypeHash)
	TArray<TArray<FVerseDynamicProperty_>>       _ForResult_43;                                     // 0x358(0x10)(ContainsInstancedReference)
	int64                                        _ForIndex_44;                                      // 0x368(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        _ForLength_45;                                     // 0x370(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                        __verse_0xFB88B569_Item_19;                        // 0x378(0x10)(HasGetValueTypeHash)
	TArray<FVerseDynamicProperty_>               _ExprResult_46;                                    // 0x388(0x10)(ContainsInstancedReference)
	FVerseStringProperty_                        __verse_0xFFC68BC5_Array_20;                       // 0x398(0x10)(HasGetValueTypeHash)
	TArray<FVerseDynamicProperty_>               _ForResult_47;                                     // 0x3A8(0x10)(ContainsInstancedReference)
	int64                                        _ForIndex_48;                                      // 0x3B8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        _ForLength_49;                                     // 0x3C0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        __verse_0xFB88B569_Item_22;                        // 0x3C8(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_629F[0x7];                                     // Fixing Size After Last Property 
	FVerseDynamicProperty_                       _ExprResult_50;                                    // 0x3D0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ForResult_51;                                     // 0x3E0(0x10)(HasGetValueTypeHash)
	int64                                        _ForIndex_52;                                      // 0x3F0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        _ForLength_53;                                     // 0x3F8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       __verse_0xFB88B569_Item_24;                        // 0x400(0x10)(HasGetValueTypeHash)
	uint8                                        _ExprResult_54;                                    // 0x410(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_55;                                    // 0x411(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_62A1[0x5];                                     // Fixing Size After Last Property 
	FVerseDynamicProperty_                       InvokeResultDummy_56;                              // 0x418(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_57;                               // 0x428(0x18)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_58;                                    // 0x440(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_59;                                    // 0x450(0x10)(HasGetValueTypeHash)
	class UDiagnostics_log*                      __verse_0x00000000__26;                            // 0x460(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	enum class EVerseTrue                        _InvokeSureResultDummy_60;                         // 0x468(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_62A5[0x7];                                     // Fixing Size After Last Property 
	FVerseFunctionProperty_                      _Callee_61;                                        // 0x470(0x10)(HasGetValueTypeHash)
	struct FTuple_L_Kchar_M_QLevel_Nlog__level_R _ExprResult_62;                                    // 0x480(0x12)(HasGetValueTypeHash)
	uint8                                        Pad_62A7[0x6];                                     // Fixing Size After Last Property 
	FVerseStringProperty_                        _ExprResult_63;                                    // 0x498(0x10)(HasGetValueTypeHash)
	TArray<FVerseDynamicProperty_>               __verse_0xFFC68BC5_Array_27;                       // 0x4A8(0x10)(ContainsInstancedReference)
	FVerseFunctionProperty_                      _Callee_64;                                        // 0x4B8(0x10)(HasGetValueTypeHash)
	TArray<TArray<FVerseDynamicProperty_>>       _ExprResult_65;                                    // 0x4C8(0x10)(ContainsInstancedReference)
	TArray<FVerseStringProperty_>                __verse_0xFFC68BC5_Array_28;                       // 0x4D8(0x10)(ContainsInstancedReference)
	struct FTuple_L_Kchar_M_Kchar_R              __verse_0x00000000__29;                            // 0x4E8(0x20)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResultStack_66;                               // 0x508(0x10)(HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_67;                                        // 0x518(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_68;                                    // 0x528(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResultDummy_69;                               // 0x538(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResultDummy_70;                               // 0x548(0x10)(HasGetValueTypeHash)
	TArray<TArray<FVerseDynamicProperty_>>       _ForResult_71;                                     // 0x558(0x10)(ContainsInstancedReference)
	int64                                        _ForIndex_72;                                      // 0x568(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        _ForLength_73;                                     // 0x570(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                        __verse_0xFB88B569_Item_31;                        // 0x578(0x10)(HasGetValueTypeHash)
	TArray<FVerseDynamicProperty_>               _ExprResult_74;                                    // 0x588(0x10)(ContainsInstancedReference)
	FVerseStringProperty_                        __verse_0xFFC68BC5_Array_32;                       // 0x598(0x10)(HasGetValueTypeHash)
	TArray<FVerseDynamicProperty_>               _ForResult_75;                                     // 0x5A8(0x10)(ContainsInstancedReference)
	int64                                        _ForIndex_76;                                      // 0x5B8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        _ForLength_77;                                     // 0x5C0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        __verse_0xFB88B569_Item_34;                        // 0x5C8(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_62AE[0x7];                                     // Fixing Size After Last Property 
	FVerseDynamicProperty_                       _ExprResult_78;                                    // 0x5D0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ForResult_79;                                     // 0x5E0(0x10)(HasGetValueTypeHash)
	int64                                        _ForIndex_80;                                      // 0x5F0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        _ForLength_81;                                     // 0x5F8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       __verse_0xFB88B569_Item_36;                        // 0x600(0x10)(HasGetValueTypeHash)
	uint8                                        _ExprResult_82;                                    // 0x610(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_83;                                    // 0x611(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_62B3[0x5];                                     // Fixing Size After Last Property 
	FVerseDynamicProperty_                       InvokeResultDummy_84;                              // 0x618(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResultStack_85;                               // 0x628(0x18)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_86;                                    // 0x640(0x10)(HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResult_87;                                    // 0x650(0x10)(HasGetValueTypeHash)
	class UDiagnostics_log*                      __verse_0x00000000__38;                            // 0x660(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	enum class EVerseTrue                        _InvokeSureResultDummy_88;                         // 0x668(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_62B5[0x7];                                     // Fixing Size After Last Property 
	FVerseFunctionProperty_                      _Callee_89;                                        // 0x670(0x10)(HasGetValueTypeHash)
	struct FTuple_L_Kchar_M_QLevel_Nlog__level_R _ExprResult_90;                                    // 0x680(0x12)(HasGetValueTypeHash)
	uint8                                        Pad_62B9[0x6];                                     // Fixing Size After Last Property 
	FVerseStringProperty_                        _ExprResult_91;                                    // 0x698(0x10)(HasGetValueTypeHash)
	TArray<FVerseDynamicProperty_>               __verse_0xFFC68BC5_Array_39;                       // 0x6A8(0x10)(ContainsInstancedReference)
	FVerseFunctionProperty_                      _Callee_92;                                        // 0x6B8(0x10)(HasGetValueTypeHash)
	TArray<TArray<FVerseDynamicProperty_>>       _ExprResult_93;                                    // 0x6C8(0x10)(ContainsInstancedReference)
	TArray<FVerseStringProperty_>                __verse_0xFFC68BC5_Array_40;                       // 0x6D8(0x10)(ContainsInstancedReference)
	struct FTuple_L_Kchar_M_Kchar_R              __verse_0x00000000__41;                            // 0x6E8(0x20)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResultStack_94;                               // 0x708(0x10)(HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_95;                                        // 0x718(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_96;                                    // 0x728(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResultDummy_97;                               // 0x738(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResultDummy_98;                               // 0x748(0x10)(HasGetValueTypeHash)
	TArray<TArray<FVerseDynamicProperty_>>       _ForResult_99;                                     // 0x758(0x10)(ContainsInstancedReference)
	int64                                        _ForIndex_100;                                     // 0x768(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        _ForLength_101;                                    // 0x770(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                        __verse_0xFB88B569_Item_43;                        // 0x778(0x10)(HasGetValueTypeHash)
	TArray<FVerseDynamicProperty_>               _ExprResult_102;                                   // 0x788(0x10)(ContainsInstancedReference)
	FVerseStringProperty_                        __verse_0xFFC68BC5_Array_44;                       // 0x798(0x10)(HasGetValueTypeHash)
	TArray<FVerseDynamicProperty_>               _ForResult_103;                                    // 0x7A8(0x10)(ContainsInstancedReference)
	int64                                        _ForIndex_104;                                     // 0x7B8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        _ForLength_105;                                    // 0x7C0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        __verse_0xFB88B569_Item_46;                        // 0x7C8(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_62BF[0x7];                                     // Fixing Size After Last Property 
	FVerseDynamicProperty_                       _ExprResult_106;                                   // 0x7D0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ForResult_107;                                    // 0x7E0(0x10)(HasGetValueTypeHash)
	int64                                        _ForIndex_108;                                     // 0x7F0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        _ForLength_109;                                    // 0x7F8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                       __verse_0xFB88B569_Item_48;                        // 0x800(0x10)(HasGetValueTypeHash)
	uint8                                        _ExprResult_110;                                   // 0x810(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_111;                                   // 0x811(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x3 (0x3 - 0x0)
// Function VerseDevices.Devices_CreativeAnimation_animation_controller._L_2fFortnite_2ecom_2fDevices_2fCreativeAnimation_2fanimation__controller_N_RIsValid
struct UDevices_CreativeAnimation_animation_controller__L_2fFortnite_2ecom_2fDevices_2fCreativeAnimation_2fanimation__controller_N_RIsValid_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	FOptionalProperty_                           RetVal;                                            // 0x1(0x2)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x2 (0x2 - 0x0)
// Function VerseDevices.Devices_CreativeAnimation_animation_controller._L_2fFortnite_2ecom_2fDevices_2fCreativeAnimation_2fanimation__controller_N_RGetState
struct UDevices_CreativeAnimation_animation_controller__L_2fFortnite_2ecom_2fDevices_2fCreativeAnimation_2fanimation__controller_N_RGetState_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	enum class EDevices_CreativeAnimation_animation_controller_state RetVal;                                            // 0x1(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x28 (0x28 - 0x0)
// Function VerseDevices.Devices_CreativeAnimation_animation_controller.AwaitNextKeyframe
struct UDevices_CreativeAnimation_animation_controller_AwaitNextKeyframe_Params
{
public:
	class UConcurrency_task*                     __verse_0xC1E81372_CallingTask;                    // 0x0(0x8)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                        __verse_0xA3A00DDB_CallerResumeState;              // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        __verse_0x2AC0E4D8_CallerCancelState;              // 0x10(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x18(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_62E0[0x7];                                     // Fixing Size After Last Property 
	class UConcurrency_task*                     RetVal;                                            // 0x20(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// 0x0 (0x0 - 0x0)
// Function VerseDevices.Devices_CreativeAnimation_animation_controller.$InitInstance
struct UDevices_CreativeAnimation_animation_controller__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseDevices.Devices_CreativeAnimation_animation_controller.$Block
struct UDevices_CreativeAnimation_animation_controller__Block_Params
{
public:
};

// 0x80 (0x80 - 0x0)
// Function VerseDevices.Devices_CreativeAnimation_animation_controller.$InitCDO
struct UDevices_CreativeAnimation_animation_controller__InitCDO_Params
{
public:
	class UDiagnostics_log*                      _ExprResult_0;                                     // 0x0(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                       _InstancingGraph_1;                                // 0x8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerseEngine_subscribable_event*       _ExprResult_2;                                     // 0x10(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                       _InstancingGraph_3;                                // 0x18(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerseEngine_subscribable_event*       _ExprResult_4;                                     // 0x20(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                       _InstancingGraph_5;                                // 0x28(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerseEngine_subscribable_event*       _ExprResult_6;                                     // 0x30(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                       _InstancingGraph_7;                                // 0x38(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDiagnostics_log*                      _ExprResult_8;                                     // 0x40(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                       _InstancingGraph_9;                                // 0x48(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerseEngine_subscribable_event*       _ExprResult_10;                                    // 0x50(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                       _InstancingGraph_11;                               // 0x58(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerseEngine_subscribable_event*       _ExprResult_12;                                    // 0x60(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                       _InstancingGraph_13;                               // 0x68(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerseEngine_subscribable_event*       _ExprResult_14;                                    // 0x70(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                       _InstancingGraph_15;                               // 0x78(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x0 (0x0 - 0x0)
// Function VerseDevices.Devices_CreativeAnimation_animation_controller_debug_log.$InitInstance
struct UDevices_CreativeAnimation_animation_controller_debug_log__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseDevices.Devices_CreativeAnimation_animation_controller_debug_log.$Block
struct UDevices_CreativeAnimation_animation_controller_debug_log__Block_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseDevices.Devices_CreativeAnimation_animation_controller_debug_log.$InitCDO
struct UDevices_CreativeAnimation_animation_controller_debug_log__InitCDO_Params
{
public:
};

// 0x6E0 (0x6E0 - 0x0)
// Function VerseDevices.Devices_CreativeAnimation_InterpolationTypes.$InitCDO
struct UDevices_CreativeAnimation_InterpolationTypes__InitCDO_Params
{
public:
	struct FDevices_CreativeAnimation_cubic_bezier_parameters _ExprResult_0;                                     // 0x0(0x20)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_1;                                // 0x20(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_2;                                     // 0x70(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_3;                                     // 0x80(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_4;                                     // 0x90(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_5;                                     // 0xA0(0x10)(HasGetValueTypeHash)
	struct FDevices_CreativeAnimation_cubic_bezier_parameters _ExprResult_6;                                     // 0xB0(0x20)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_7;                                // 0xD0(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_8;                                     // 0x120(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_9;                                     // 0x130(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_10;                                    // 0x140(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_11;                                    // 0x150(0x10)(HasGetValueTypeHash)
	struct FDevices_CreativeAnimation_cubic_bezier_parameters _ExprResult_12;                                    // 0x160(0x20)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_13;                               // 0x180(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_14;                                    // 0x1D0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_15;                                    // 0x1E0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_16;                                    // 0x1F0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_17;                                    // 0x200(0x10)(HasGetValueTypeHash)
	struct FDevices_CreativeAnimation_cubic_bezier_parameters _ExprResult_18;                                    // 0x210(0x20)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_19;                               // 0x230(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_20;                                    // 0x280(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_21;                                    // 0x290(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_22;                                    // 0x2A0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_23;                                    // 0x2B0(0x10)(HasGetValueTypeHash)
	struct FDevices_CreativeAnimation_cubic_bezier_parameters _ExprResult_24;                                    // 0x2C0(0x20)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_25;                               // 0x2E0(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_26;                                    // 0x330(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_27;                                    // 0x340(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_28;                                    // 0x350(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_29;                                    // 0x360(0x10)(HasGetValueTypeHash)
	struct FDevices_CreativeAnimation_cubic_bezier_parameters _ExprResult_30;                                    // 0x370(0x20)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_31;                               // 0x390(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_32;                                    // 0x3E0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_33;                                    // 0x3F0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_34;                                    // 0x400(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_35;                                    // 0x410(0x10)(HasGetValueTypeHash)
	struct FDevices_CreativeAnimation_cubic_bezier_parameters _ExprResult_36;                                    // 0x420(0x20)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_37;                               // 0x440(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_38;                                    // 0x490(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_39;                                    // 0x4A0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_40;                                    // 0x4B0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_41;                                    // 0x4C0(0x10)(HasGetValueTypeHash)
	struct FDevices_CreativeAnimation_cubic_bezier_parameters _ExprResult_42;                                    // 0x4D0(0x20)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_43;                               // 0x4F0(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_44;                                    // 0x540(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_45;                                    // 0x550(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_46;                                    // 0x560(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_47;                                    // 0x570(0x10)(HasGetValueTypeHash)
	struct FDevices_CreativeAnimation_cubic_bezier_parameters _ExprResult_48;                                    // 0x580(0x20)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_49;                               // 0x5A0(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_50;                                    // 0x5F0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_51;                                    // 0x600(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_52;                                    // 0x610(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_53;                                    // 0x620(0x10)(HasGetValueTypeHash)
	struct FDevices_CreativeAnimation_cubic_bezier_parameters _ExprResult_54;                                    // 0x630(0x20)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_55;                               // 0x650(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_56;                                    // 0x6A0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_57;                                    // 0x6B0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_58;                                    // 0x6C0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_59;                                    // 0x6D0(0x10)(HasGetValueTypeHash)
};

// 0x0 (0x0 - 0x0)
// Function VerseDevices.Devices_device_event.$InitInstance
struct UDevices_device_event__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseDevices.Devices_device_event.$Block
struct UDevices_device_event__Block_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseDevices.Devices_device_event.$InitCDO
struct UDevices_device_event__InitCDO_Params
{
public:
};

// 0x18 (0x18 - 0x0)
// Function VerseDevices.Devices_device_event_agent._L_2fVerse_2eorg_2fVerse_2fsubscribable_2fsubscribable_Lt_R_N_RSubscribe_L_Nt_Tvoid_R
struct UDevices_device_event_agent__L_2fVerse_2eorg_2fVerse_2fsubscribable_2fsubscribable_Lt_R_N_RSubscribe_L_Nt_Tvoid_R_Params
{
public:
	FVerseFunctionProperty_                      __verse_0xB2CDDD72_Argument;                       // 0x0(0x10)(Parm, HasGetValueTypeHash)
	class UObject*                               RetVal;                                            // 0x10(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// 0x28 (0x28 - 0x0)
// Function VerseDevices.Devices_device_event_agent.Await
struct UDevices_device_event_agent_Await_Params
{
public:
	class UConcurrency_task*                     __verse_0xC1E81372_CallingTask;                    // 0x0(0x8)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                        __verse_0xA3A00DDB_CallerResumeState;              // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        __verse_0x2AC0E4D8_CallerCancelState;              // 0x10(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x18(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_6393[0x7];                                     // Fixing Size After Last Property 
	class UConcurrency_task*                     RetVal;                                            // 0x20(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// 0x0 (0x0 - 0x0)
// Function VerseDevices.Devices_device_event_agent.$InitInstance
struct UDevices_device_event_agent__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseDevices.Devices_device_event_agent.$Block
struct UDevices_device_event_agent__Block_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseDevices.Devices_device_event_agent.$InitCDO
struct UDevices_device_event_agent__InitCDO_Params
{
public:
};

// 0x18 (0x18 - 0x0)
// Function VerseDevices.Devices_device_event_agent_int._L_2fVerse_2eorg_2fVerse_2fsubscribable_2fsubscribable_Lt_R_N_RSubscribe_L_Nt_Tvoid_R
struct UDevices_device_event_agent_int__L_2fVerse_2eorg_2fVerse_2fsubscribable_2fsubscribable_Lt_R_N_RSubscribe_L_Nt_Tvoid_R_Params
{
public:
	FVerseFunctionProperty_                      __verse_0xB2CDDD72_Argument;                       // 0x0(0x10)(Parm, HasGetValueTypeHash)
	class UObject*                               RetVal;                                            // 0x10(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// 0x28 (0x28 - 0x0)
// Function VerseDevices.Devices_device_event_agent_int.Await
struct UDevices_device_event_agent_int_Await_Params
{
public:
	class UConcurrency_task*                     __verse_0xC1E81372_CallingTask;                    // 0x0(0x8)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                        __verse_0xA3A00DDB_CallerResumeState;              // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        __verse_0x2AC0E4D8_CallerCancelState;              // 0x10(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x18(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_63A1[0x7];                                     // Fixing Size After Last Property 
	class UConcurrency_task*                     RetVal;                                            // 0x20(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// 0x0 (0x0 - 0x0)
// Function VerseDevices.Devices_device_event_agent_int.$InitInstance
struct UDevices_device_event_agent_int__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseDevices.Devices_device_event_agent_int.$Block
struct UDevices_device_event_agent_int__Block_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseDevices.Devices_device_event_agent_int.$InitCDO
struct UDevices_device_event_agent_int__InitCDO_Params
{
public:
};

// 0x18 (0x18 - 0x0)
// Function VerseDevices.Devices_device_event_ai_interaction._L_2fVerse_2eorg_2fVerse_2fsubscribable_2fsubscribable_Lt_R_N_RSubscribe_L_Nt_Tvoid_R
struct UDevices_device_event_ai_interaction__L_2fVerse_2eorg_2fVerse_2fsubscribable_2fsubscribable_Lt_R_N_RSubscribe_L_Nt_Tvoid_R_Params
{
public:
	FVerseFunctionProperty_                      __verse_0xB2CDDD72_Argument;                       // 0x0(0x10)(Parm, HasGetValueTypeHash)
	class UObject*                               RetVal;                                            // 0x10(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// 0x28 (0x28 - 0x0)
// Function VerseDevices.Devices_device_event_ai_interaction.Await
struct UDevices_device_event_ai_interaction_Await_Params
{
public:
	class UConcurrency_task*                     __verse_0xC1E81372_CallingTask;                    // 0x0(0x8)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                        __verse_0xA3A00DDB_CallerResumeState;              // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        __verse_0x2AC0E4D8_CallerCancelState;              // 0x10(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x18(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_63BB[0x7];                                     // Fixing Size After Last Property 
	class UConcurrency_task*                     RetVal;                                            // 0x20(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// 0x0 (0x0 - 0x0)
// Function VerseDevices.Devices_device_event_ai_interaction.$InitInstance
struct UDevices_device_event_ai_interaction__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseDevices.Devices_device_event_ai_interaction.$Block
struct UDevices_device_event_ai_interaction__Block_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseDevices.Devices_device_event_ai_interaction.$InitCDO
struct UDevices_device_event_ai_interaction__InitCDO_Params
{
public:
};

// 0x18 (0x18 - 0x0)
// Function VerseDevices.Devices_device_event_optional_agent._L_2fVerse_2eorg_2fVerse_2fsubscribable_2fsubscribable_Lt_R_N_RSubscribe_L_Nt_Tvoid_R
struct UDevices_device_event_optional_agent__L_2fVerse_2eorg_2fVerse_2fsubscribable_2fsubscribable_Lt_R_N_RSubscribe_L_Nt_Tvoid_R_Params
{
public:
	FVerseFunctionProperty_                      __verse_0xB2CDDD72_Argument;                       // 0x0(0x10)(Parm, HasGetValueTypeHash)
	class UObject*                               RetVal;                                            // 0x10(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// 0x28 (0x28 - 0x0)
// Function VerseDevices.Devices_device_event_optional_agent.Await
struct UDevices_device_event_optional_agent_Await_Params
{
public:
	class UConcurrency_task*                     __verse_0xC1E81372_CallingTask;                    // 0x0(0x8)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                        __verse_0xA3A00DDB_CallerResumeState;              // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        __verse_0x2AC0E4D8_CallerCancelState;              // 0x10(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x18(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_63CD[0x7];                                     // Fixing Size After Last Property 
	class UConcurrency_task*                     RetVal;                                            // 0x20(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// 0x0 (0x0 - 0x0)
// Function VerseDevices.Devices_device_event_optional_agent.$InitInstance
struct UDevices_device_event_optional_agent__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseDevices.Devices_device_event_optional_agent.$Block
struct UDevices_device_event_optional_agent__Block_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseDevices.Devices_device_event_optional_agent.$InitCDO
struct UDevices_device_event_optional_agent__InitCDO_Params
{
public:
};

// 0x18 (0x18 - 0x0)
// Function VerseDevices.Devices_device_event_optional_agent_int._L_2fVerse_2eorg_2fVerse_2fsubscribable_2fsubscribable_Lt_R_N_RSubscribe_L_Nt_Tvoid_R
struct UDevices_device_event_optional_agent_int__L_2fVerse_2eorg_2fVerse_2fsubscribable_2fsubscribable_Lt_R_N_RSubscribe_L_Nt_Tvoid_R_Params
{
public:
	FVerseFunctionProperty_                      __verse_0xB2CDDD72_Argument;                       // 0x0(0x10)(Parm, HasGetValueTypeHash)
	class UObject*                               RetVal;                                            // 0x10(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// 0x28 (0x28 - 0x0)
// Function VerseDevices.Devices_device_event_optional_agent_int.Await
struct UDevices_device_event_optional_agent_int_Await_Params
{
public:
	class UConcurrency_task*                     __verse_0xC1E81372_CallingTask;                    // 0x0(0x8)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                        __verse_0xA3A00DDB_CallerResumeState;              // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        __verse_0x2AC0E4D8_CallerCancelState;              // 0x10(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x18(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_63E3[0x7];                                     // Fixing Size After Last Property 
	class UConcurrency_task*                     RetVal;                                            // 0x20(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// 0x0 (0x0 - 0x0)
// Function VerseDevices.Devices_device_event_optional_agent_int.$InitInstance
struct UDevices_device_event_optional_agent_int__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseDevices.Devices_device_event_optional_agent_int.$Block
struct UDevices_device_event_optional_agent_int__Block_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseDevices.Devices_device_event_optional_agent_int.$InitCDO
struct UDevices_device_event_optional_agent_int__InitCDO_Params
{
public:
};

// 0x18 (0x18 - 0x0)
// Function VerseDevices.Devices_device_event_vehicle._L_2fVerse_2eorg_2fVerse_2fsubscribable_2fsubscribable_Lt_R_N_RSubscribe_L_Nt_Tvoid_R
struct UDevices_device_event_vehicle__L_2fVerse_2eorg_2fVerse_2fsubscribable_2fsubscribable_Lt_R_N_RSubscribe_L_Nt_Tvoid_R_Params
{
public:
	FVerseFunctionProperty_                      __verse_0xB2CDDD72_Argument;                       // 0x0(0x10)(Parm, HasGetValueTypeHash)
	class UObject*                               RetVal;                                            // 0x10(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// 0x28 (0x28 - 0x0)
// Function VerseDevices.Devices_device_event_vehicle.Await
struct UDevices_device_event_vehicle_Await_Params
{
public:
	class UConcurrency_task*                     __verse_0xC1E81372_CallingTask;                    // 0x0(0x8)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                        __verse_0xA3A00DDB_CallerResumeState;              // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        __verse_0x2AC0E4D8_CallerCancelState;              // 0x10(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x18(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_63F7[0x7];                                     // Fixing Size After Last Property 
	class UConcurrency_task*                     RetVal;                                            // 0x20(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// 0x0 (0x0 - 0x0)
// Function VerseDevices.Devices_device_event_vehicle.$InitInstance
struct UDevices_device_event_vehicle__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseDevices.Devices_device_event_vehicle.$Block
struct UDevices_device_event_vehicle__Block_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseDevices.Devices_device_event_vehicle.$InitCDO
struct UDevices_device_event_vehicle__InitCDO_Params
{
public:
};

// 0x18 (0x18 - 0x0)
// Function VerseDevices.Devices_device_event_void._L_2fVerse_2eorg_2fVerse_2fsubscribable_2fsubscribable_Lt_R_N_RSubscribe_L_Nt_Tvoid_R
struct UDevices_device_event_void__L_2fVerse_2eorg_2fVerse_2fsubscribable_2fsubscribable_Lt_R_N_RSubscribe_L_Nt_Tvoid_R_Params
{
public:
	FVerseFunctionProperty_                      __verse_0xB2CDDD72_Argument;                       // 0x0(0x10)(Parm, HasGetValueTypeHash)
	class UObject*                               RetVal;                                            // 0x10(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// 0x28 (0x28 - 0x0)
// Function VerseDevices.Devices_device_event_void.Await
struct UDevices_device_event_void_Await_Params
{
public:
	class UConcurrency_task*                     __verse_0xC1E81372_CallingTask;                    // 0x0(0x8)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                        __verse_0xA3A00DDB_CallerResumeState;              // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        __verse_0x2AC0E4D8_CallerCancelState;              // 0x10(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x18(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_640A[0x7];                                     // Fixing Size After Last Property 
	class UConcurrency_task*                     RetVal;                                            // 0x20(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// 0x0 (0x0 - 0x0)
// Function VerseDevices.Devices_device_event_void.$InitInstance
struct UDevices_device_event_void__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseDevices.Devices_device_event_void.$Block
struct UDevices_device_event_void__Block_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseDevices.Devices_device_event_void.$InitCDO
struct UDevices_device_event_void__InitCDO_Params
{
public:
};

// 0x1 (0x1 - 0x0)
// Function VerseDevices.Devices_device_function._L_2fFortnite_2ecom_2fDevices_2fdevice__function_N_RInvoke
struct UDevices_device_function__L_2fFortnite_2ecom_2fDevices_2fdevice__function_N_RInvoke_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function VerseDevices.Devices_device_function._L_2fFortnite_2ecom_2fDevices_2fdevice__function_N_RInvoke_L_Nagent_R
struct UDevices_device_function__L_2fFortnite_2ecom_2fDevices_2fdevice__function_N_RInvoke_L_Nagent_R_Params
{
public:
	class USimulation_agent*                     __verse_0xB2CDDD72_Argument;                       // 0x0(0x8)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// 0x0 (0x0 - 0x0)
// Function VerseDevices.Devices_device_function.$InitInstance
struct UDevices_device_function__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseDevices.Devices_device_function.$Block
struct UDevices_device_function__Block_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseDevices.Devices_device_function.$InitCDO
struct UDevices_device_function__InitCDO_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseDevices.Devices_device_function_get_base.$InitInstance
struct UDevices_device_function_get_base__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseDevices.Devices_device_function_get_base.$Block
struct UDevices_device_function_get_base__Block_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseDevices.Devices_device_function_get_base.$InitCDO
struct UDevices_device_function_get_base__InitCDO_Params
{
public:
};

// 0x10 (0x10 - 0x0)
// Function VerseDevices.Devices_device_function_get_agent._L_2fFortnite_2ecom_2fDevices_2fdevice__function__get__agent_N_RInvoke
struct UDevices_device_function_get_agent__L_2fFortnite_2ecom_2fDevices_2fdevice__function__get__agent_N_RInvoke_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_6438[0x7];                                     // Fixing Size After Last Property 
	FOptionalProperty_                           RetVal;                                            // 0x8(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};

// 0x0 (0x0 - 0x0)
// Function VerseDevices.Devices_device_function_get_agent.$InitInstance
struct UDevices_device_function_get_agent__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseDevices.Devices_device_function_get_agent.$Block
struct UDevices_device_function_get_agent__Block_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseDevices.Devices_device_function_get_agent.$InitCDO
struct UDevices_device_function_get_agent__InitCDO_Params
{
public:
};

// 0x20 (0x20 - 0x0)
// Function VerseDevices.Devices_device_function_get_color._L_2fFortnite_2ecom_2fDevices_2fdevice__function__get__color_N_RInvoke
struct UDevices_device_function_get_color__L_2fFortnite_2ecom_2fDevices_2fdevice__function__get__color_N_RInvoke_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_643C[0x7];                                     // Fixing Size After Last Property 
	struct FColors_color                         RetVal;                                            // 0x8(0x18)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// 0x0 (0x0 - 0x0)
// Function VerseDevices.Devices_device_function_get_color.$InitInstance
struct UDevices_device_function_get_color__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseDevices.Devices_device_function_get_color.$Block
struct UDevices_device_function_get_color__Block_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseDevices.Devices_device_function_get_color.$InitCDO
struct UDevices_device_function_get_color__InitCDO_Params
{
public:
};

// 0x10 (0x10 - 0x0)
// Function VerseDevices.Devices_device_function_get_float._L_2fFortnite_2ecom_2fDevices_2fdevice__function__get__float_N_RInvoke
struct UDevices_device_function_get_float__L_2fFortnite_2ecom_2fDevices_2fdevice__function__get__float_N_RInvoke_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_6444[0x7];                                     // Fixing Size After Last Property 
	double                                       RetVal;                                            // 0x8(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x0 (0x0 - 0x0)
// Function VerseDevices.Devices_device_function_get_float.$InitInstance
struct UDevices_device_function_get_float__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseDevices.Devices_device_function_get_float.$Block
struct UDevices_device_function_get_float__Block_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseDevices.Devices_device_function_get_float.$InitCDO
struct UDevices_device_function_get_float__InitCDO_Params
{
public:
};

// 0x10 (0x10 - 0x0)
// Function VerseDevices.Devices_device_function_get_int._L_2fFortnite_2ecom_2fDevices_2fdevice__function__get__int_N_RInvoke
struct UDevices_device_function_get_int__L_2fFortnite_2ecom_2fDevices_2fdevice__function__get__int_N_RInvoke_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_644F[0x7];                                     // Fixing Size After Last Property 
	int64                                        RetVal;                                            // 0x8(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x0 (0x0 - 0x0)
// Function VerseDevices.Devices_device_function_get_int.$InitInstance
struct UDevices_device_function_get_int__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseDevices.Devices_device_function_get_int.$Block
struct UDevices_device_function_get_int__Block_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseDevices.Devices_device_function_get_int.$InitCDO
struct UDevices_device_function_get_int__InitCDO_Params
{
public:
};

// 0x2 (0x2 - 0x0)
// Function VerseDevices.Devices_device_function_get_logic._L_2fFortnite_2ecom_2fDevices_2fdevice__function__get__logic_N_RInvoke
struct UDevices_device_function_get_logic__L_2fFortnite_2ecom_2fDevices_2fdevice__function__get__logic_N_RInvoke_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        RetVal : 1;                                        // Mask: 0x1, PropSize: 0x10x1(0x1)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash)
};

// 0x0 (0x0 - 0x0)
// Function VerseDevices.Devices_device_function_get_logic.$InitInstance
struct UDevices_device_function_get_logic__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseDevices.Devices_device_function_get_logic.$Block
struct UDevices_device_function_get_logic__Block_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseDevices.Devices_device_function_get_logic.$InitCDO
struct UDevices_device_function_get_logic__InitCDO_Params
{
public:
};

// 0x18 (0x18 - 0x0)
// Function VerseDevices.Devices_device_function_get_string._L_2fFortnite_2ecom_2fDevices_2fdevice__function__get__string_N_RInvoke
struct UDevices_device_function_get_string__L_2fFortnite_2ecom_2fDevices_2fdevice__function__get__string_N_RInvoke_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_6469[0x7];                                     // Fixing Size After Last Property 
	FVerseStringProperty_                        RetVal;                                            // 0x8(0x10)(Parm, OutParm, ReturnParm, HasGetValueTypeHash)
};

// 0x0 (0x0 - 0x0)
// Function VerseDevices.Devices_device_function_get_string.$InitInstance
struct UDevices_device_function_get_string__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseDevices.Devices_device_function_get_string.$Block
struct UDevices_device_function_get_string__Block_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseDevices.Devices_device_function_get_string.$InitCDO
struct UDevices_device_function_get_string__InitCDO_Params
{
public:
};

// 0x20 (0x20 - 0x0)
// Function VerseDevices.Devices_device_function_get_vector3._L_2fFortnite_2ecom_2fDevices_2fdevice__function__get__vector3_N_RInvoke
struct UDevices_device_function_get_vector3__L_2fFortnite_2ecom_2fDevices_2fdevice__function__get__vector3_N_RInvoke_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_6478[0x7];                                     // Fixing Size After Last Property 
	struct FSpatialMath_vector3                  RetVal;                                            // 0x8(0x18)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// 0x0 (0x0 - 0x0)
// Function VerseDevices.Devices_device_function_get_vector3.$InitInstance
struct UDevices_device_function_get_vector3__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseDevices.Devices_device_function_get_vector3.$Block
struct UDevices_device_function_get_vector3__Block_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseDevices.Devices_device_function_get_vector3.$InitCDO
struct UDevices_device_function_get_vector3__InitCDO_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseDevices.Devices_device_function_set_base.$InitInstance
struct UDevices_device_function_set_base__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseDevices.Devices_device_function_set_base.$Block
struct UDevices_device_function_set_base__Block_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseDevices.Devices_device_function_set_base.$InitCDO
struct UDevices_device_function_set_base__InitCDO_Params
{
public:
};

// 0x8 (0x8 - 0x0)
// Function VerseDevices.Devices_device_function_set_agent._L_2fFortnite_2ecom_2fDevices_2fdevice__function__set__agent_N_RInvoke_L_N_Qagent_R
struct UDevices_device_function_set_agent__L_2fFortnite_2ecom_2fDevices_2fdevice__function__set__agent_N_RInvoke_L_N_Qagent_R_Params
{
public:
	FOptionalProperty_                           __verse_0xB2CDDD72_Argument;                       // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};

// 0x0 (0x0 - 0x0)
// Function VerseDevices.Devices_device_function_set_agent.$InitInstance
struct UDevices_device_function_set_agent__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseDevices.Devices_device_function_set_agent.$Block
struct UDevices_device_function_set_agent__Block_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseDevices.Devices_device_function_set_agent.$InitCDO
struct UDevices_device_function_set_agent__InitCDO_Params
{
public:
};

// 0x18 (0x18 - 0x0)
// Function VerseDevices.Devices_device_function_set_color._L_2fFortnite_2ecom_2fDevices_2fdevice__function__set__color_N_RInvoke_L_Ncolor_R
struct UDevices_device_function_set_color__L_2fFortnite_2ecom_2fDevices_2fdevice__function__set__color_N_RInvoke_L_Ncolor_R_Params
{
public:
	struct FColors_color                         __verse_0xB2CDDD72_Argument;                       // 0x0(0x18)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// 0x0 (0x0 - 0x0)
// Function VerseDevices.Devices_device_function_set_color.$InitInstance
struct UDevices_device_function_set_color__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseDevices.Devices_device_function_set_color.$Block
struct UDevices_device_function_set_color__Block_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseDevices.Devices_device_function_set_color.$InitCDO
struct UDevices_device_function_set_color__InitCDO_Params
{
public:
};

// 0x8 (0x8 - 0x0)
// Function VerseDevices.Devices_device_function_set_float._L_2fFortnite_2ecom_2fDevices_2fdevice__function__set__float_N_RInvoke_L_Nfloat_R
struct UDevices_device_function_set_float__L_2fFortnite_2ecom_2fDevices_2fdevice__function__set__float_N_RInvoke_L_Nfloat_R_Params
{
public:
	double                                       __verse_0xB2CDDD72_Argument;                       // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x0 (0x0 - 0x0)
// Function VerseDevices.Devices_device_function_set_float.$InitInstance
struct UDevices_device_function_set_float__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseDevices.Devices_device_function_set_float.$Block
struct UDevices_device_function_set_float__Block_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseDevices.Devices_device_function_set_float.$InitCDO
struct UDevices_device_function_set_float__InitCDO_Params
{
public:
};

// 0x8 (0x8 - 0x0)
// Function VerseDevices.Devices_device_function_set_int._L_2fFortnite_2ecom_2fDevices_2fdevice__function__set__int_N_RInvoke_L_Nint_R
struct UDevices_device_function_set_int__L_2fFortnite_2ecom_2fDevices_2fdevice__function__set__int_N_RInvoke_L_Nint_R_Params
{
public:
	int64                                        __verse_0xB2CDDD72_Argument;                       // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x0 (0x0 - 0x0)
// Function VerseDevices.Devices_device_function_set_int.$InitInstance
struct UDevices_device_function_set_int__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseDevices.Devices_device_function_set_int.$Block
struct UDevices_device_function_set_int__Block_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseDevices.Devices_device_function_set_int.$InitCDO
struct UDevices_device_function_set_int__InitCDO_Params
{
public:
};

// 0x1 (0x1 - 0x0)
// Function VerseDevices.Devices_device_function_set_logic._L_2fFortnite_2ecom_2fDevices_2fdevice__function__set__logic_N_RInvoke_L_Nlogic_R
struct UDevices_device_function_set_logic__L_2fFortnite_2ecom_2fDevices_2fdevice__function__set__logic_N_RInvoke_L_Nlogic_R_Params
{
public:
	uint8                                        __verse_0xB2CDDD72_Argument : 1;                   // Mask: 0x1, PropSize: 0x10x0(0x1)(Parm, NoDestructor, HasGetValueTypeHash)
};

// 0x0 (0x0 - 0x0)
// Function VerseDevices.Devices_device_function_set_logic.$InitInstance
struct UDevices_device_function_set_logic__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseDevices.Devices_device_function_set_logic.$Block
struct UDevices_device_function_set_logic__Block_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseDevices.Devices_device_function_set_logic.$InitCDO
struct UDevices_device_function_set_logic__InitCDO_Params
{
public:
};

// 0x8 (0x8 - 0x0)
// Function VerseDevices.Devices_device_function_set_message._L_2fFortnite_2ecom_2fDevices_2fdevice__function__set__message_N_RInvoke_L_Nmessage_R
struct UDevices_device_function_set_message__L_2fFortnite_2ecom_2fDevices_2fdevice__function__set__message_N_RInvoke_L_Nmessage_R_Params
{
public:
	class UVerse_message*                        __verse_0xB2CDDD72_Argument;                       // 0x0(0x8)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// 0x0 (0x0 - 0x0)
// Function VerseDevices.Devices_device_function_set_message.$InitInstance
struct UDevices_device_function_set_message__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseDevices.Devices_device_function_set_message.$Block
struct UDevices_device_function_set_message__Block_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseDevices.Devices_device_function_set_message.$InitCDO
struct UDevices_device_function_set_message__InitCDO_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseDevices.Devices_device_function_set_multi_parameter_base.$InitInstance
struct UDevices_device_function_set_multi_parameter_base__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseDevices.Devices_device_function_set_multi_parameter_base.$Block
struct UDevices_device_function_set_multi_parameter_base__Block_Params
{
public:
};

// 0x2D (0x2D - 0x0)
// Function VerseDevices.Devices_device_function_set_multi_parameter_base.$InitCDO
struct UDevices_device_function_set_multi_parameter_base__InitCDO_Params
{
public:
	FOptionalProperty_                           _ExprResult_0;                                     // 0x0(0x10)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FOptionalProperty_                           __verse_0x00000000__1;                             // 0x10(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        _ExprResult_1 : 1;                                 // Mask: 0x1, PropSize: 0x10x12(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_474 : 7;                                    // Fixing Bit-Field Size 
	FOptionalProperty_                           _ExprResultStack_2;                                // 0x13(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_64CF[0x3];                                     // Fixing Size After Last Property 
	FOptionalProperty_                           _ExprResult_3;                                     // 0x18(0x10)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FOptionalProperty_                           __verse_0x00000000__3;                             // 0x28(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        _ExprResult_4 : 1;                                 // Mask: 0x1, PropSize: 0x10x2A(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_475 : 7;                                    // Fixing Bit-Field Size 
	FOptionalProperty_                           _ExprResultStack_5;                                // 0x2B(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x58 (0x58 - 0x0)
// Function VerseDevices.Devices_device_function_set_params_by_name._L_2fFortnite_2ecom_2fDevices_2fdevice__function__set__params__by__name_N_RInvoke_L_N_5b_Kchar_5dfunction__parameter__base_R
struct UDevices_device_function_set_params_by_name__L_2fFortnite_2ecom_2fDevices_2fdevice__function__set__params__by__name_N_RInvoke_L_N_5b_Kchar_5dfunction__parameter__base_R_Params
{
public:
	TMap<FVerseStringProperty_, class UDevices_function_parameter_base*> __verse_0xB2CDDD72_Argument;                       // 0x0(0x50)(Parm, ContainsInstancedReference)
	FOptionalProperty_                           RetVal;                                            // 0x50(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};

// 0x0 (0x0 - 0x0)
// Function VerseDevices.Devices_device_function_set_params_by_name.$InitInstance
struct UDevices_device_function_set_params_by_name__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseDevices.Devices_device_function_set_params_by_name.$Block
struct UDevices_device_function_set_params_by_name__Block_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseDevices.Devices_device_function_set_params_by_name.$InitCDO
struct UDevices_device_function_set_params_by_name__InitCDO_Params
{
public:
};

// 0x58 (0x58 - 0x0)
// Function VerseDevices.Devices_device_function_set_params_by_name_const._L_2fFortnite_2ecom_2fDevices_2fdevice__function__set__params__by__name__const_N_RInvokeConst_L_N_5b_Kchar_5dfunction__parameter__base_R
struct UDevices_device_function_set_params_by_name_const__L_2fFortnite_2ecom_2fDevices_2fdevice__function__set__params__by__name__const_N_RInvokeConst_L_N_5b_Kchar_5dfunction__parameter__base_R_Params
{
public:
	TMap<FVerseStringProperty_, class UDevices_function_parameter_base*> __verse_0xB2CDDD72_Argument;                       // 0x0(0x50)(Parm, ContainsInstancedReference)
	FOptionalProperty_                           RetVal;                                            // 0x50(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};

// 0x0 (0x0 - 0x0)
// Function VerseDevices.Devices_device_function_set_params_by_name_const.$InitInstance
struct UDevices_device_function_set_params_by_name_const__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseDevices.Devices_device_function_set_params_by_name_const.$Block
struct UDevices_device_function_set_params_by_name_const__Block_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseDevices.Devices_device_function_set_params_by_name_const.$InitCDO
struct UDevices_device_function_set_params_by_name_const__InitCDO_Params
{
public:
};

// 0x18 (0x18 - 0x0)
// Function VerseDevices.Devices_device_function_set_params_by_type._L_2fFortnite_2ecom_2fDevices_2fdevice__function__set__params__by__type_N_RInvoke_L_N_Kfunction__parameter__base_R
struct UDevices_device_function_set_params_by_type__L_2fFortnite_2ecom_2fDevices_2fdevice__function__set__params__by__type_N_RInvoke_L_N_Kfunction__parameter__base_R_Params
{
public:
	TArray<class UDevices_function_parameter_base*> __verse_0xB2CDDD72_Argument;                       // 0x0(0x10)(Parm, ContainsInstancedReference)
	FOptionalProperty_                           RetVal;                                            // 0x10(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};

// 0x0 (0x0 - 0x0)
// Function VerseDevices.Devices_device_function_set_params_by_type.$InitInstance
struct UDevices_device_function_set_params_by_type__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseDevices.Devices_device_function_set_params_by_type.$Block
struct UDevices_device_function_set_params_by_type__Block_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseDevices.Devices_device_function_set_params_by_type.$InitCDO
struct UDevices_device_function_set_params_by_type__InitCDO_Params
{
public:
};

// 0x18 (0x18 - 0x0)
// Function VerseDevices.Devices_device_function_set_params_by_type_const._L_2fFortnite_2ecom_2fDevices_2fdevice__function__set__params__by__type__const_N_RInvokeConst_L_N_Kfunction__parameter__base_R
struct UDevices_device_function_set_params_by_type_const__L_2fFortnite_2ecom_2fDevices_2fdevice__function__set__params__by__type__const_N_RInvokeConst_L_N_Kfunction__parameter__base_R_Params
{
public:
	TArray<class UDevices_function_parameter_base*> __verse_0xB2CDDD72_Argument;                       // 0x0(0x10)(Parm, ContainsInstancedReference)
	FOptionalProperty_                           RetVal;                                            // 0x10(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};

// 0x0 (0x0 - 0x0)
// Function VerseDevices.Devices_device_function_set_params_by_type_const.$InitInstance
struct UDevices_device_function_set_params_by_type_const__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseDevices.Devices_device_function_set_params_by_type_const.$Block
struct UDevices_device_function_set_params_by_type_const__Block_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseDevices.Devices_device_function_set_params_by_type_const.$InitCDO
struct UDevices_device_function_set_params_by_type_const__InitCDO_Params
{
public:
};

// 0x10 (0x10 - 0x0)
// Function VerseDevices.Devices_device_function_set_string._L_2fFortnite_2ecom_2fDevices_2fdevice__function__set__string_N_RInvoke_L_N_Kchar_R
struct UDevices_device_function_set_string__L_2fFortnite_2ecom_2fDevices_2fdevice__function__set__string_N_RInvoke_L_N_Kchar_R_Params
{
public:
	FVerseStringProperty_                        __verse_0xB2CDDD72_Argument;                       // 0x0(0x10)(Parm, HasGetValueTypeHash)
};

// 0x0 (0x0 - 0x0)
// Function VerseDevices.Devices_device_function_set_string.$InitInstance
struct UDevices_device_function_set_string__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseDevices.Devices_device_function_set_string.$Block
struct UDevices_device_function_set_string__Block_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseDevices.Devices_device_function_set_string.$InitCDO
struct UDevices_device_function_set_string__InitCDO_Params
{
public:
};

// 0x18 (0x18 - 0x0)
// Function VerseDevices.Devices_device_function_set_vector3._L_2fFortnite_2ecom_2fDevices_2fdevice__function__set__vector3_N_RInvoke_L_Nvector3_R
struct UDevices_device_function_set_vector3__L_2fFortnite_2ecom_2fDevices_2fdevice__function__set__vector3_N_RInvoke_L_Nvector3_R_Params
{
public:
	struct FSpatialMath_vector3                  __verse_0xB2CDDD72_Argument;                       // 0x0(0x18)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// 0x0 (0x0 - 0x0)
// Function VerseDevices.Devices_device_function_set_vector3.$InitInstance
struct UDevices_device_function_set_vector3__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseDevices.Devices_device_function_set_vector3.$Block
struct UDevices_device_function_set_vector3__Block_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseDevices.Devices_device_function_set_vector3.$InitCDO
struct UDevices_device_function_set_vector3__InitCDO_Params
{
public:
};

// 0x1 (0x1 - 0x0)
// Function VerseDevices.Devices_device_subscription._L_2fVerse_2eorg_2fVerse_2fcancelable_N_RCancel
struct UDevices_device_subscription__L_2fVerse_2eorg_2fVerse_2fcancelable_N_RCancel_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
};

// 0x0 (0x0 - 0x0)
// Function VerseDevices.Devices_device_subscription.$InitInstance
struct UDevices_device_subscription__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseDevices.Devices_device_subscription.$Block
struct UDevices_device_subscription__Block_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseDevices.Devices_device_subscription.$InitCDO
struct UDevices_device_subscription__InitCDO_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseDevices.Devices_function_parameter_base.$InitInstance
struct UDevices_function_parameter_base__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseDevices.Devices_function_parameter_base.$Block
struct UDevices_function_parameter_base__Block_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseDevices.Devices_function_parameter_base.$InitCDO
struct UDevices_function_parameter_base__InitCDO_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseDevices.Devices_function_parameter_agent.$InitInstance
struct UDevices_function_parameter_agent__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseDevices.Devices_function_parameter_agent.$Block
struct UDevices_function_parameter_agent__Block_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseDevices.Devices_function_parameter_agent.$InitCDO
struct UDevices_function_parameter_agent__InitCDO_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseDevices.Devices_function_parameter_color.$InitInstance
struct UDevices_function_parameter_color__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseDevices.Devices_function_parameter_color.$Block
struct UDevices_function_parameter_color__Block_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseDevices.Devices_function_parameter_color.$InitCDO
struct UDevices_function_parameter_color__InitCDO_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseDevices.Devices_function_parameter_float.$InitInstance
struct UDevices_function_parameter_float__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseDevices.Devices_function_parameter_float.$Block
struct UDevices_function_parameter_float__Block_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseDevices.Devices_function_parameter_float.$InitCDO
struct UDevices_function_parameter_float__InitCDO_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseDevices.Devices_function_parameter_int.$InitInstance
struct UDevices_function_parameter_int__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseDevices.Devices_function_parameter_int.$Block
struct UDevices_function_parameter_int__Block_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseDevices.Devices_function_parameter_int.$InitCDO
struct UDevices_function_parameter_int__InitCDO_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseDevices.Devices_function_parameter_logic.$InitInstance
struct UDevices_function_parameter_logic__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseDevices.Devices_function_parameter_logic.$Block
struct UDevices_function_parameter_logic__Block_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseDevices.Devices_function_parameter_logic.$InitCDO
struct UDevices_function_parameter_logic__InitCDO_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseDevices.Devices_function_parameter_message.$InitInstance
struct UDevices_function_parameter_message__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseDevices.Devices_function_parameter_message.$Block
struct UDevices_function_parameter_message__Block_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseDevices.Devices_function_parameter_message.$InitCDO
struct UDevices_function_parameter_message__InitCDO_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseDevices.Devices_function_parameter_string.$InitInstance
struct UDevices_function_parameter_string__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseDevices.Devices_function_parameter_string.$Block
struct UDevices_function_parameter_string__Block_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseDevices.Devices_function_parameter_string.$InitCDO
struct UDevices_function_parameter_string__InitCDO_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseDevices.Devices_function_parameter_vector3.$InitInstance
struct UDevices_function_parameter_vector3__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseDevices.Devices_function_parameter_vector3.$Block
struct UDevices_function_parameter_vector3__Block_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseDevices.Devices_function_parameter_vector3.$InitCDO
struct UDevices_function_parameter_vector3__InitCDO_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseDevices.Devices_move_to_debug_log.$InitInstance
struct UDevices_move_to_debug_log__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseDevices.Devices_move_to_debug_log.$Block
struct UDevices_move_to_debug_log__Block_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseDevices.Devices_move_to_debug_log.$InitCDO
struct UDevices_move_to_debug_log__InitCDO_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseDevices.Devices_teleport_to_debug_log.$InitInstance
struct UDevices_teleport_to_debug_log__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseDevices.Devices_teleport_to_debug_log.$Block
struct UDevices_teleport_to_debug_log__Block_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseDevices.Devices_teleport_to_debug_log.$InitCDO
struct UDevices_teleport_to_debug_log__InitCDO_Params
{
public:
};

// 0x8 (0x8 - 0x0)
// Function VerseDevices.task_Devices$operator_U_2eMoveToInternal_U_L_Ncreative__movable__object__base_M_Ntuple_L_R_M_Ntuple_Ltransform_Mfloat_R_R.Update
struct UTask_Devices_operator_U_2eMoveToInternal_U_L_Ncreative__movable__object__base_M_Ntuple_L_R_M_Ntuple_Ltransform_Mfloat_R_R_Update_Params
{
public:
	int64                                        RetVal;                                            // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function VerseDevices.task_Devices$operator_U_2eMoveToInternal_U_L_Ncreative__movable__object__base_M_Ntuple_L_R_M_Ntuple_Lvector3_Mrotation_Mfloat_R_R.Update
struct UTask_Devices_operator_U_2eMoveToInternal_U_L_Ncreative__movable__object__base_M_Ntuple_L_R_M_Ntuple_Lvector3_Mrotation_Mfloat_R_R_Update_Params
{
public:
	int64                                        RetVal;                                            // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function VerseDevices.task_Devices$operator_U_2eMoveToInternalImpl_U_L_Ncreative__movable__object__base_M_Ntuple_L_R_M_Ntuple_Ltransform_Mfloat_R_R.Update
struct UTask_Devices_operator_U_2eMoveToInternalImpl_U_L_Ncreative__movable__object__base_M_Ntuple_L_R_M_Ntuple_Ltransform_Mfloat_R_R_Update_Params
{
public:
	int64                                        RetVal;                                            // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function VerseDevices.task_Devices_creative_device$MoveTo_L_Ntransform_M_Nfloat_R.Update
struct UTask_Devices_creative_device_MoveTo_L_Ntransform_M_Nfloat_R_Update_Params
{
public:
	int64                                        RetVal;                                            // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function VerseDevices.task_Devices_creative_device$MoveTo_L_Nvector3_M_Nrotation_M_Nfloat_R.Update
struct UTask_Devices_creative_device_MoveTo_L_Nvector3_M_Nrotation_M_Nfloat_R_Update_Params
{
public:
	int64                                        RetVal;                                            // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function VerseDevices.task_Devices_creative_device$OnBegin.Update
struct UTask_Devices_creative_device_OnBegin_Update_Params
{
public:
	int64                                        RetVal;                                            // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function VerseDevices.task_Devices_creative_prop$MoveTo_L_Ntransform_M_Nfloat_R.Update
struct UTask_Devices_creative_prop_MoveTo_L_Ntransform_M_Nfloat_R_Update_Params
{
public:
	int64                                        RetVal;                                            // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function VerseDevices.task_Devices_creative_prop$MoveTo_L_Nvector3_M_Nrotation_M_Nfloat_R.Update
struct UTask_Devices_creative_prop_MoveTo_L_Nvector3_M_Nrotation_M_Nfloat_R_Update_Params
{
public:
	int64                                        RetVal;                                            // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function VerseDevices.task_Devices_CreativeAnimation_animation_controller$AwaitNextKeyframe.Update
struct UTask_Devices_CreativeAnimation_animation_controller_AwaitNextKeyframe_Update_Params
{
public:
	int64                                        RetVal;                                            // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function VerseDevices.task_Devices_device_event_agent$Await.Update
struct UTask_Devices_device_event_agent_Await_Update_Params
{
public:
	int64                                        RetVal;                                            // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function VerseDevices.task_Devices_device_event_agent_int$Await.Update
struct UTask_Devices_device_event_agent_int_Await_Update_Params
{
public:
	int64                                        RetVal;                                            // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function VerseDevices.task_Devices_device_event_ai_interaction$Await.Update
struct UTask_Devices_device_event_ai_interaction_Await_Update_Params
{
public:
	int64                                        RetVal;                                            // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function VerseDevices.task_Devices_device_event_optional_agent$Await.Update
struct UTask_Devices_device_event_optional_agent_Await_Update_Params
{
public:
	int64                                        RetVal;                                            // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function VerseDevices.task_Devices_device_event_optional_agent_int$Await.Update
struct UTask_Devices_device_event_optional_agent_int_Await_Update_Params
{
public:
	int64                                        RetVal;                                            // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function VerseDevices.task_Devices_device_event_vehicle$Await.Update
struct UTask_Devices_device_event_vehicle_Await_Update_Params
{
public:
	int64                                        RetVal;                                            // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function VerseDevices.task_Devices_device_event_void$Await.Update
struct UTask_Devices_device_event_void_Await_Update_Params
{
public:
	int64                                        RetVal;                                            // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}
}


