#pragma once

// Dumped with Dumper-7!


#include "../SDK.hpp"

namespace SDK
{
namespace Params
{
//---------------------------------------------------------------------------------------------------------------------
// PARAMETERS
//---------------------------------------------------------------------------------------------------------------------

// 0x10 (0x10 - 0x0)
// Function VerseMovement.VerseMovement._L_2fUnrealEngine_2ecom_2fEngine_2fVerseMovement_N_RGetPlayerMoveComponent_L_Nplayer__component_R
struct UVerseMovement__L_2fUnrealEngine_2ecom_2fEngine_2fVerseMovement_N_RGetPlayerMoveComponent_L_Nplayer__component_R_Params
{
public:
	class USimulation_player_component*          __verse_0xB2CDDD72_Argument;                       // 0x0(0x8)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FOptionalProperty_                           RetVal;                                            // 0x8(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};

// 0x11A (0x11A - 0x0)
// Function VerseMovement.VerseMovement.VerseMovement_move_config$OverrideFactory
struct UVerseMovement_VerseMovement_move_config_OverrideFactory_Params
{
public:
	struct FVerseMovement_move_config            RetVal;                                            // 0x0(0x10)(Parm, OutParm, ReturnParm)
	TMap<FVerseStringProperty_, uint8>           __verse_0xFB48ED96__InitOverrideMap;               // 0x10(0x50)(ConstParm, Parm, ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResultStack_0;                                // 0x60(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_1;                                     // 0x70(0x2)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_5E74[0x6];                                     // Fixing Size After Last Property 
	TArray<struct FVerseMovement_move_config_entry> _ExprResult_2;                                     // 0x78(0x10)(ContainsInstancedReference)
	TArray<enum class EVerseFalse>               __verse_0xFFC68BC5_Array_1;                        // 0x88(0x10)(ContainsInstancedReference)
	TArray<struct FVerseMovement_move_config_entry> _ForResult_3;                                      // 0x98(0x10)(ContainsInstancedReference)
	int64                                        _ForIndex_4;                                       // 0xA8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        _ForLength_5;                                      // 0xB0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class EVerseFalse                       __verse_0xFB88B569_Item_3;                         // 0xB8(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        _ExprResult_6 : 1;                                 // Mask: 0x1, PropSize: 0x10xB9(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_389 : 7;                                    // Fixing Bit-Field Size 
	uint8                                        Pad_5E77[0x6];                                     // Fixing Size After Last Property 
	FVerseStringProperty_                        _ExprResultStack_7;                                // 0xC0(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_8;                                     // 0xD0(0x2)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_5E78[0x6];                                     // Fixing Size After Last Property 
	TArray<struct FVerseMovement_move_config_entry> _ExprResult_9;                                     // 0xD8(0x10)(ContainsInstancedReference)
	TArray<enum class EVerseFalse>               __verse_0xFFC68BC5_Array_5;                        // 0xE8(0x10)(ContainsInstancedReference)
	TArray<struct FVerseMovement_move_config_entry> _ForResult_10;                                     // 0xF8(0x10)(ContainsInstancedReference)
	int64                                        _ForIndex_11;                                      // 0x108(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        _ForLength_12;                                     // 0x110(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class EVerseFalse                       __verse_0xFB88B569_Item_7;                         // 0x118(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        _ExprResult_13 : 1;                                // Mask: 0x1, PropSize: 0x10x119(0x1)(NoDestructor, HasGetValueTypeHash)
};

// 0x9A (0x9A - 0x0)
// Function VerseMovement.VerseMovement.VerseMovement_move_config$Factory
struct UVerseMovement_VerseMovement_move_config_Factory_Params
{
public:
	struct FVerseMovement_move_config            RetVal;                                            // 0x0(0x10)(Parm, OutParm, ReturnParm)
	TArray<struct FVerseMovement_move_config_entry> _ExprResult_0;                                     // 0x10(0x10)(ContainsInstancedReference)
	TArray<enum class EVerseFalse>               __verse_0xFFC68BC5_Array_1;                        // 0x20(0x10)(ContainsInstancedReference)
	TArray<struct FVerseMovement_move_config_entry> _ForResult_1;                                      // 0x30(0x10)(ContainsInstancedReference)
	int64                                        _ForIndex_2;                                       // 0x40(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        _ForLength_3;                                      // 0x48(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class EVerseFalse                       __verse_0xFB88B569_Item_3;                         // 0x50(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        _ExprResult_4 : 1;                                 // Mask: 0x1, PropSize: 0x10x51(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_38A : 7;                                    // Fixing Bit-Field Size 
	uint8                                        Pad_5E86[0x6];                                     // Fixing Size After Last Property 
	TArray<struct FVerseMovement_move_config_entry> _ExprResult_5;                                     // 0x58(0x10)(ContainsInstancedReference)
	TArray<enum class EVerseFalse>               __verse_0xFFC68BC5_Array_5;                        // 0x68(0x10)(ContainsInstancedReference)
	TArray<struct FVerseMovement_move_config_entry> _ForResult_6;                                      // 0x78(0x10)(ContainsInstancedReference)
	int64                                        _ForIndex_7;                                       // 0x88(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        _ForLength_8;                                      // 0x90(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class EVerseFalse                       __verse_0xFB88B569_Item_7;                         // 0x98(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        _ExprResult_9 : 1;                                 // Mask: 0x1, PropSize: 0x10x99(0x1)(NoDestructor, HasGetValueTypeHash)
};

// 0x24A (0x24A - 0x0)
// Function VerseMovement.VerseMovement.VerseMovement_move_config_entry$OverrideFactory
struct UVerseMovement_VerseMovement_move_config_entry_OverrideFactory_Params
{
public:
	struct FVerseMovement_move_config_entry      RetVal;                                            // 0x0(0x30)(Parm, OutParm, ReturnParm)
	TMap<FVerseStringProperty_, uint8>           __verse_0xFB48ED96__InitOverrideMap;               // 0x30(0x50)(ConstParm, Parm, ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResultStack_0;                                // 0x80(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_1;                                     // 0x90(0x2)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_5EA0[0x6];                                     // Fixing Size After Last Property 
	FVerseStringProperty_                        _ExprResult_2;                                     // 0x98(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResultStack_3;                                // 0xA8(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_4;                                     // 0xB8(0x2)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_5EA2[0x6];                                     // Fixing Size After Last Property 
	TArray<struct FVerseMovement_move_trigger>   _ExprResult_5;                                     // 0xC0(0x10)(ContainsInstancedReference)
	TArray<enum class EVerseFalse>               __verse_0xFFC68BC5_Array_1;                        // 0xD0(0x10)(ContainsInstancedReference)
	TArray<struct FVerseMovement_move_trigger>   _ForResult_6;                                      // 0xE0(0x10)(ContainsInstancedReference)
	int64                                        _ForIndex_7;                                       // 0xF0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        _ForLength_8;                                      // 0xF8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class EVerseFalse                       __verse_0xFB88B569_Item_3;                         // 0x100(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        _ExprResult_9 : 1;                                 // Mask: 0x1, PropSize: 0x10x101(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_38B : 7;                                    // Fixing Bit-Field Size 
	uint8                                        Pad_5EA3[0x6];                                     // Fixing Size After Last Property 
	FVerseStringProperty_                        _ExprResultStack_10;                               // 0x108(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_11;                                    // 0x118(0x2)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_5EA4[0x6];                                     // Fixing Size After Last Property 
	TArray<struct FVerseMovement_move_response>  _ExprResult_12;                                    // 0x120(0x10)(ContainsInstancedReference)
	TArray<enum class EVerseFalse>               __verse_0xFFC68BC5_Array_5;                        // 0x130(0x10)(ContainsInstancedReference)
	TArray<struct FVerseMovement_move_response>  _ForResult_13;                                     // 0x140(0x10)(ContainsInstancedReference)
	int64                                        _ForIndex_14;                                      // 0x150(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        _ForLength_15;                                     // 0x158(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class EVerseFalse                       __verse_0xFB88B569_Item_7;                         // 0x160(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        _ExprResult_16 : 1;                                // Mask: 0x1, PropSize: 0x10x161(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_38C : 7;                                    // Fixing Bit-Field Size 
	uint8                                        Pad_5EA7[0x6];                                     // Fixing Size After Last Property 
	FVerseStringProperty_                        _ExprResultStack_17;                               // 0x168(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_18;                                    // 0x178(0x2)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_5EA8[0x6];                                     // Fixing Size After Last Property 
	FVerseStringProperty_                        _ExprResult_19;                                    // 0x180(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResultStack_20;                               // 0x190(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_21;                                    // 0x1A0(0x2)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_5EA9[0x6];                                     // Fixing Size After Last Property 
	TArray<struct FVerseMovement_move_trigger>   _ExprResult_22;                                    // 0x1A8(0x10)(ContainsInstancedReference)
	TArray<enum class EVerseFalse>               __verse_0xFFC68BC5_Array_9;                        // 0x1B8(0x10)(ContainsInstancedReference)
	TArray<struct FVerseMovement_move_trigger>   _ForResult_23;                                     // 0x1C8(0x10)(ContainsInstancedReference)
	int64                                        _ForIndex_24;                                      // 0x1D8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        _ForLength_25;                                     // 0x1E0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class EVerseFalse                       __verse_0xFB88B569_Item_11;                        // 0x1E8(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        _ExprResult_26 : 1;                                // Mask: 0x1, PropSize: 0x10x1E9(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_38D : 7;                                    // Fixing Bit-Field Size 
	uint8                                        Pad_5EAA[0x6];                                     // Fixing Size After Last Property 
	FVerseStringProperty_                        _ExprResultStack_27;                               // 0x1F0(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_28;                                    // 0x200(0x2)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_5EAC[0x6];                                     // Fixing Size After Last Property 
	TArray<struct FVerseMovement_move_response>  _ExprResult_29;                                    // 0x208(0x10)(ContainsInstancedReference)
	TArray<enum class EVerseFalse>               __verse_0xFFC68BC5_Array_13;                       // 0x218(0x10)(ContainsInstancedReference)
	TArray<struct FVerseMovement_move_response>  _ForResult_30;                                     // 0x228(0x10)(ContainsInstancedReference)
	int64                                        _ForIndex_31;                                      // 0x238(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        _ForLength_32;                                     // 0x240(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class EVerseFalse                       __verse_0xFB88B569_Item_15;                        // 0x248(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        _ExprResult_33 : 1;                                // Mask: 0x1, PropSize: 0x10x249(0x1)(NoDestructor, HasGetValueTypeHash)
};

// 0x16A (0x16A - 0x0)
// Function VerseMovement.VerseMovement.VerseMovement_move_config_entry$Factory
struct UVerseMovement_VerseMovement_move_config_entry_Factory_Params
{
public:
	struct FVerseMovement_move_config_entry      RetVal;                                            // 0x0(0x30)(Parm, OutParm, ReturnParm)
	FVerseStringProperty_                        _ExprResult_0;                                     // 0x30(0x10)(HasGetValueTypeHash)
	TArray<struct FVerseMovement_move_trigger>   _ExprResult_1;                                     // 0x40(0x10)(ContainsInstancedReference)
	TArray<enum class EVerseFalse>               __verse_0xFFC68BC5_Array_1;                        // 0x50(0x10)(ContainsInstancedReference)
	TArray<struct FVerseMovement_move_trigger>   _ForResult_2;                                      // 0x60(0x10)(ContainsInstancedReference)
	int64                                        _ForIndex_3;                                       // 0x70(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        _ForLength_4;                                      // 0x78(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class EVerseFalse                       __verse_0xFB88B569_Item_3;                         // 0x80(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        _ExprResult_5 : 1;                                 // Mask: 0x1, PropSize: 0x10x81(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_393 : 7;                                    // Fixing Bit-Field Size 
	uint8                                        Pad_5EBD[0x6];                                     // Fixing Size After Last Property 
	TArray<struct FVerseMovement_move_response>  _ExprResult_6;                                     // 0x88(0x10)(ContainsInstancedReference)
	TArray<enum class EVerseFalse>               __verse_0xFFC68BC5_Array_5;                        // 0x98(0x10)(ContainsInstancedReference)
	TArray<struct FVerseMovement_move_response>  _ForResult_7;                                      // 0xA8(0x10)(ContainsInstancedReference)
	int64                                        _ForIndex_8;                                       // 0xB8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        _ForLength_9;                                      // 0xC0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class EVerseFalse                       __verse_0xFB88B569_Item_7;                         // 0xC8(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        _ExprResult_10 : 1;                                // Mask: 0x1, PropSize: 0x10xC9(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_394 : 7;                                    // Fixing Bit-Field Size 
	uint8                                        Pad_5EBE[0x6];                                     // Fixing Size After Last Property 
	FVerseStringProperty_                        _ExprResult_11;                                    // 0xD0(0x10)(HasGetValueTypeHash)
	TArray<struct FVerseMovement_move_trigger>   _ExprResult_12;                                    // 0xE0(0x10)(ContainsInstancedReference)
	TArray<enum class EVerseFalse>               __verse_0xFFC68BC5_Array_9;                        // 0xF0(0x10)(ContainsInstancedReference)
	TArray<struct FVerseMovement_move_trigger>   _ForResult_13;                                     // 0x100(0x10)(ContainsInstancedReference)
	int64                                        _ForIndex_14;                                      // 0x110(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        _ForLength_15;                                     // 0x118(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class EVerseFalse                       __verse_0xFB88B569_Item_11;                        // 0x120(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        _ExprResult_16 : 1;                                // Mask: 0x1, PropSize: 0x10x121(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_395 : 7;                                    // Fixing Bit-Field Size 
	uint8                                        Pad_5EBF[0x6];                                     // Fixing Size After Last Property 
	TArray<struct FVerseMovement_move_response>  _ExprResult_17;                                    // 0x128(0x10)(ContainsInstancedReference)
	TArray<enum class EVerseFalse>               __verse_0xFFC68BC5_Array_13;                       // 0x138(0x10)(ContainsInstancedReference)
	TArray<struct FVerseMovement_move_response>  _ForResult_18;                                     // 0x148(0x10)(ContainsInstancedReference)
	int64                                        _ForIndex_19;                                      // 0x158(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        _ForLength_20;                                     // 0x160(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class EVerseFalse                       __verse_0xFB88B569_Item_15;                        // 0x168(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        _ExprResult_21 : 1;                                // Mask: 0x1, PropSize: 0x10x169(0x1)(NoDestructor, HasGetValueTypeHash)
};

// 0x3CA (0x3CA - 0x0)
// Function VerseMovement.VerseMovement.VerseMovement_move_response$OverrideFactory
struct UVerseMovement_VerseMovement_move_response_OverrideFactory_Params
{
public:
	struct FVerseMovement_move_response          RetVal;                                            // 0x0(0x50)(Parm, OutParm, ReturnParm, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           __verse_0xFB48ED96__InitOverrideMap;               // 0x50(0x50)(ConstParm, Parm, ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResultStack_0;                                // 0xA0(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_1;                                     // 0xB0(0x2)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_5EDD[0x6];                                     // Fixing Size After Last Property 
	struct FSpatialMath_vector3                  _ExprResult_2;                                     // 0xB8(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseStringProperty_                        _ExprResultStack_3;                                // 0xD0(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_4;                                     // 0xE0(0x2)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_5EE0[0x6];                                     // Fixing Size After Last Property 
	FVerseStringProperty_                        _ExprResultStack_5;                                // 0xE8(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_6;                                     // 0xF8(0x2)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_5EE1[0x6];                                     // Fixing Size After Last Property 
	FOptionalProperty_                           _ExprResult_7;                                     // 0x100(0x8)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FOptionalProperty_                           __verse_0x00000000__1;                             // 0x108(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        _ExprResult_8 : 1;                                 // Mask: 0x1, PropSize: 0x10x10A(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_39A : 7;                                    // Fixing Bit-Field Size 
	FOptionalProperty_                           _ExprResultStack_9;                                // 0x10B(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_5EE3[0x3];                                     // Fixing Size After Last Property 
	FVerseStringProperty_                        _ExprResultStack_10;                               // 0x110(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_11;                                    // 0x120(0x2)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_5EE4[0x6];                                     // Fixing Size After Last Property 
	FVerseStringProperty_                        _ExprResultStack_12;                               // 0x128(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_13;                                    // 0x138(0x2)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_5EE5[0x6];                                     // Fixing Size After Last Property 
	FVerseStringProperty_                        _ExprResultStack_14;                               // 0x140(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_15;                                    // 0x150(0x2)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_5EE6[0x6];                                     // Fixing Size After Last Property 
	FVerseStringProperty_                        _ExprResultStack_16;                               // 0x158(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_17;                                    // 0x168(0x2)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_5EE7[0x6];                                     // Fixing Size After Last Property 
	FVerseStringProperty_                        _ExprResultStack_18;                               // 0x170(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_19;                                    // 0x180(0x2)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_5EE9[0x6];                                     // Fixing Size After Last Property 
	struct FSpatialMath_vector3                  _ExprResult_20;                                    // 0x188(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_21;                               // 0x1A0(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_22;                                    // 0x1F0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_23;                                    // 0x200(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_24;                                    // 0x210(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResultStack_25;                               // 0x220(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_26;                                    // 0x230(0x2)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_5EF4[0x6];                                     // Fixing Size After Last Property 
	FVerseStringProperty_                        _ExprResultStack_27;                               // 0x238(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_28;                                    // 0x248(0x2)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_5EF5[0x6];                                     // Fixing Size After Last Property 
	struct FSpatialMath_vector3                  _ExprResult_29;                                    // 0x250(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseStringProperty_                        _ExprResultStack_30;                               // 0x268(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_31;                                    // 0x278(0x2)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_5EFF[0x6];                                     // Fixing Size After Last Property 
	FVerseStringProperty_                        _ExprResultStack_32;                               // 0x280(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_33;                                    // 0x290(0x2)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_5F01[0x6];                                     // Fixing Size After Last Property 
	FOptionalProperty_                           _ExprResult_34;                                    // 0x298(0x8)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FOptionalProperty_                           __verse_0x00000000__3;                             // 0x2A0(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        _ExprResult_35 : 1;                                // Mask: 0x1, PropSize: 0x10x2A2(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_39B : 7;                                    // Fixing Bit-Field Size 
	FOptionalProperty_                           _ExprResultStack_36;                               // 0x2A3(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_5F09[0x3];                                     // Fixing Size After Last Property 
	FVerseStringProperty_                        _ExprResultStack_37;                               // 0x2A8(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_38;                                    // 0x2B8(0x2)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_5F0A[0x6];                                     // Fixing Size After Last Property 
	FVerseStringProperty_                        _ExprResultStack_39;                               // 0x2C0(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_40;                                    // 0x2D0(0x2)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_5F0B[0x6];                                     // Fixing Size After Last Property 
	FVerseStringProperty_                        _ExprResultStack_41;                               // 0x2D8(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_42;                                    // 0x2E8(0x2)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_5F0C[0x6];                                     // Fixing Size After Last Property 
	FVerseStringProperty_                        _ExprResultStack_43;                               // 0x2F0(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_44;                                    // 0x300(0x2)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_5F0D[0x6];                                     // Fixing Size After Last Property 
	FVerseStringProperty_                        _ExprResultStack_45;                               // 0x308(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_46;                                    // 0x318(0x2)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_5F0F[0x6];                                     // Fixing Size After Last Property 
	struct FSpatialMath_vector3                  _ExprResult_47;                                    // 0x320(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_48;                               // 0x338(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_49;                                    // 0x388(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_50;                                    // 0x398(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_51;                                    // 0x3A8(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResultStack_52;                               // 0x3B8(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_53;                                    // 0x3C8(0x2)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

// 0x1D0 (0x1D0 - 0x0)
// Function VerseMovement.VerseMovement.VerseMovement_move_response$Factory
struct UVerseMovement_VerseMovement_move_response_Factory_Params
{
public:
	struct FVerseMovement_move_response          RetVal;                                            // 0x0(0x50)(Parm, OutParm, ReturnParm, NoDestructor)
	struct FSpatialMath_vector3                  _ExprResult_0;                                     // 0x50(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FOptionalProperty_                           _ExprResult_1;                                     // 0x68(0x8)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FOptionalProperty_                           __verse_0x00000000__1;                             // 0x70(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        _ExprResult_2 : 1;                                 // Mask: 0x1, PropSize: 0x10x72(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_39C : 7;                                    // Fixing Bit-Field Size 
	FOptionalProperty_                           _ExprResultStack_3;                                // 0x73(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_5F34[0x3];                                     // Fixing Size After Last Property 
	struct FSpatialMath_vector3                  _ExprResult_4;                                     // 0x78(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_5;                                // 0x90(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_6;                                     // 0xE0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_7;                                     // 0xF0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_8;                                     // 0x100(0x10)(HasGetValueTypeHash)
	struct FSpatialMath_vector3                  _ExprResult_9;                                     // 0x110(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FOptionalProperty_                           _ExprResult_10;                                    // 0x128(0x8)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FOptionalProperty_                           __verse_0x00000000__3;                             // 0x130(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        _ExprResult_11 : 1;                                // Mask: 0x1, PropSize: 0x10x132(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_39D : 7;                                    // Fixing Bit-Field Size 
	FOptionalProperty_                           _ExprResultStack_12;                               // 0x133(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_5F35[0x3];                                     // Fixing Size After Last Property 
	struct FSpatialMath_vector3                  _ExprResult_13;                                    // 0x138(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_14;                               // 0x150(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_15;                                    // 0x1A0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_16;                                    // 0x1B0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_17;                                    // 0x1C0(0x10)(HasGetValueTypeHash)
};

// 0x2B0 (0x2B0 - 0x0)
// Function VerseMovement.VerseMovement.VerseMovement_move_trigger$OverrideFactory
struct UVerseMovement_VerseMovement_move_trigger_OverrideFactory_Params
{
public:
	struct FVerseMovement_move_trigger           RetVal;                                            // 0x0(0x90)(Parm, OutParm, ReturnParm)
	TMap<FVerseStringProperty_, uint8>           __verse_0xFB48ED96__InitOverrideMap;               // 0x90(0x50)(ConstParm, Parm, ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResultStack_0;                                // 0xE0(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_1;                                     // 0xF0(0x2)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_5F41[0x6];                                     // Fixing Size After Last Property 
	FVerseStringProperty_                        _ExprResultStack_2;                                // 0xF8(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_3;                                     // 0x108(0x2)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_5F42[0x6];                                     // Fixing Size After Last Property 
	struct FVerseMovement_move_input_trigger_params _ExprResult_4;                                     // 0x110(0x38)(None)
	FVerseStringProperty_                        _ExprResultStack_5;                                // 0x148(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_6;                                     // 0x158(0x2)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_5F43[0x6];                                     // Fixing Size After Last Property 
	struct FVerseMovement_move_physics_trigger_params _ExprResult_7;                                     // 0x160(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseStringProperty_                        _ExprResultStack_8;                                // 0x178(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_9;                                     // 0x188(0x2)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_5F44[0x6];                                     // Fixing Size After Last Property 
	struct FVerseMovement_move_trace_trigger_params _ExprResult_10;                                    // 0x190(0x38)(NoDestructor)
	FVerseStringProperty_                        _ExprResultStack_11;                               // 0x1C8(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_12;                                    // 0x1D8(0x2)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_5F46[0x6];                                     // Fixing Size After Last Property 
	FVerseStringProperty_                        _ExprResultStack_13;                               // 0x1E0(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_14;                                    // 0x1F0(0x2)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_5F47[0x6];                                     // Fixing Size After Last Property 
	struct FVerseMovement_move_input_trigger_params _ExprResult_15;                                    // 0x1F8(0x38)(None)
	FVerseStringProperty_                        _ExprResultStack_16;                               // 0x230(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_17;                                    // 0x240(0x2)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_5F49[0x6];                                     // Fixing Size After Last Property 
	struct FVerseMovement_move_physics_trigger_params _ExprResult_18;                                    // 0x248(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseStringProperty_                        _ExprResultStack_19;                               // 0x260(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_20;                                    // 0x270(0x2)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_5F4A[0x6];                                     // Fixing Size After Last Property 
	struct FVerseMovement_move_trace_trigger_params _ExprResult_21;                                    // 0x278(0x38)(NoDestructor)
};

// 0x1A0 (0x1A0 - 0x0)
// Function VerseMovement.VerseMovement.VerseMovement_move_trigger$Factory
struct UVerseMovement_VerseMovement_move_trigger_Factory_Params
{
public:
	struct FVerseMovement_move_trigger           RetVal;                                            // 0x0(0x90)(Parm, OutParm, ReturnParm)
	struct FVerseMovement_move_input_trigger_params _ExprResult_0;                                     // 0x90(0x38)(None)
	struct FVerseMovement_move_physics_trigger_params _ExprResult_1;                                     // 0xC8(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVerseMovement_move_trace_trigger_params _ExprResult_2;                                     // 0xE0(0x38)(NoDestructor)
	struct FVerseMovement_move_input_trigger_params _ExprResult_3;                                     // 0x118(0x38)(None)
	struct FVerseMovement_move_physics_trigger_params _ExprResult_4;                                     // 0x150(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVerseMovement_move_trace_trigger_params _ExprResult_5;                                     // 0x168(0x38)(NoDestructor)
};

// 0x1C5 (0x1C5 - 0x0)
// Function VerseMovement.VerseMovement.VerseMovement_move_trace_trigger_params$OverrideFactory
struct UVerseMovement_VerseMovement_move_trace_trigger_params_OverrideFactory_Params
{
public:
	struct FVerseMovement_move_trace_trigger_params RetVal;                                            // 0x0(0x38)(Parm, OutParm, ReturnParm, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           __verse_0xFB48ED96__InitOverrideMap;               // 0x38(0x50)(ConstParm, Parm, ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResultStack_0;                                // 0x88(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_1;                                     // 0x98(0x2)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_5F5F[0x6];                                     // Fixing Size After Last Property 
	struct FSpatialMath_vector3                  _ExprResult_2;                                     // 0xA0(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseStringProperty_                        _ExprResultStack_3;                                // 0xB8(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_4;                                     // 0xC8(0x2)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_5F60[0x6];                                     // Fixing Size After Last Property 
	FVerseStringProperty_                        _ExprResultStack_5;                                // 0xD0(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_6;                                     // 0xE0(0x2)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_5F62[0x6];                                     // Fixing Size After Last Property 
	FVerseStringProperty_                        _ExprResultStack_7;                                // 0xE8(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_8;                                     // 0xF8(0x2)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_5F64[0x6];                                     // Fixing Size After Last Property 
	FVerseStringProperty_                        _ExprResultStack_9;                                // 0x100(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_10;                                    // 0x110(0x2)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_5F65[0x6];                                     // Fixing Size After Last Property 
	FOptionalProperty_                           _ExprResult_11;                                    // 0x118(0x8)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FOptionalProperty_                           __verse_0x00000000__1;                             // 0x120(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        _ExprResult_12 : 1;                                // Mask: 0x1, PropSize: 0x10x122(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_39E : 7;                                    // Fixing Bit-Field Size 
	FOptionalProperty_                           _ExprResultStack_13;                               // 0x123(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_5F68[0x3];                                     // Fixing Size After Last Property 
	FVerseStringProperty_                        _ExprResultStack_14;                               // 0x128(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_15;                                    // 0x138(0x2)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_5F6A[0x6];                                     // Fixing Size After Last Property 
	struct FSpatialMath_vector3                  _ExprResult_16;                                    // 0x140(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseStringProperty_                        _ExprResultStack_17;                               // 0x158(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_18;                                    // 0x168(0x2)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_5F6B[0x6];                                     // Fixing Size After Last Property 
	FVerseStringProperty_                        _ExprResultStack_19;                               // 0x170(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_20;                                    // 0x180(0x2)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_5F6C[0x6];                                     // Fixing Size After Last Property 
	FVerseStringProperty_                        _ExprResultStack_21;                               // 0x188(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_22;                                    // 0x198(0x2)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_5F6D[0x6];                                     // Fixing Size After Last Property 
	FVerseStringProperty_                        _ExprResultStack_23;                               // 0x1A0(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_24;                                    // 0x1B0(0x2)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_5F6E[0x6];                                     // Fixing Size After Last Property 
	FOptionalProperty_                           _ExprResult_25;                                    // 0x1B8(0x8)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FOptionalProperty_                           __verse_0x00000000__3;                             // 0x1C0(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        _ExprResult_26 : 1;                                // Mask: 0x1, PropSize: 0x10x1C2(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_39F : 7;                                    // Fixing Bit-Field Size 
	FOptionalProperty_                           _ExprResultStack_27;                               // 0x1C3(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x85 (0x85 - 0x0)
// Function VerseMovement.VerseMovement.VerseMovement_move_trace_trigger_params$Factory
struct UVerseMovement_VerseMovement_move_trace_trigger_params_Factory_Params
{
public:
	struct FVerseMovement_move_trace_trigger_params RetVal;                                            // 0x0(0x38)(Parm, OutParm, ReturnParm, NoDestructor)
	struct FSpatialMath_vector3                  _ExprResult_0;                                     // 0x38(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FOptionalProperty_                           _ExprResult_1;                                     // 0x50(0x8)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FOptionalProperty_                           __verse_0x00000000__1;                             // 0x58(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        _ExprResult_2 : 1;                                 // Mask: 0x1, PropSize: 0x10x5A(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_3A0 : 7;                                    // Fixing Bit-Field Size 
	FOptionalProperty_                           _ExprResultStack_3;                                // 0x5B(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_5F77[0x3];                                     // Fixing Size After Last Property 
	struct FSpatialMath_vector3                  _ExprResult_4;                                     // 0x60(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FOptionalProperty_                           _ExprResult_5;                                     // 0x78(0x8)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FOptionalProperty_                           __verse_0x00000000__3;                             // 0x80(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        _ExprResult_6 : 1;                                 // Mask: 0x1, PropSize: 0x10x82(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_3A1 : 7;                                    // Fixing Bit-Field Size 
	FOptionalProperty_                           _ExprResultStack_7;                                // 0x83(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0xC8 (0xC8 - 0x0)
// Function VerseMovement.VerseMovement.VerseMovement_move_physics_trigger_params$OverrideFactory
struct UVerseMovement_VerseMovement_move_physics_trigger_params_OverrideFactory_Params
{
public:
	struct FVerseMovement_move_physics_trigger_params RetVal;                                            // 0x0(0x18)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           __verse_0xFB48ED96__InitOverrideMap;               // 0x18(0x50)(ConstParm, Parm, ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResultStack_0;                                // 0x68(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_1;                                     // 0x78(0x2)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_5F7C[0x6];                                     // Fixing Size After Last Property 
	struct FSpatialMath_vector3                  _ExprResult_2;                                     // 0x80(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseStringProperty_                        _ExprResultStack_3;                                // 0x98(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_4;                                     // 0xA8(0x2)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_5F7D[0x6];                                     // Fixing Size After Last Property 
	struct FSpatialMath_vector3                  _ExprResult_5;                                     // 0xB0(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
};

// 0x48 (0x48 - 0x0)
// Function VerseMovement.VerseMovement.VerseMovement_move_physics_trigger_params$Factory
struct UVerseMovement_VerseMovement_move_physics_trigger_params_Factory_Params
{
public:
	struct FVerseMovement_move_physics_trigger_params RetVal;                                            // 0x0(0x18)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	struct FSpatialMath_vector3                  _ExprResult_0;                                     // 0x18(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FSpatialMath_vector3                  _ExprResult_1;                                     // 0x30(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
};

// 0x2B8 (0x2B8 - 0x0)
// Function VerseMovement.VerseMovement.VerseMovement_move_input_trigger_params$OverrideFactory
struct UVerseMovement_VerseMovement_move_input_trigger_params_OverrideFactory_Params
{
public:
	struct FVerseMovement_move_input_trigger_params RetVal;                                            // 0x0(0x38)(Parm, OutParm, ReturnParm)
	TMap<FVerseStringProperty_, uint8>           __verse_0xFB48ED96__InitOverrideMap;               // 0x38(0x50)(ConstParm, Parm, ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResultStack_0;                                // 0x88(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_1;                                     // 0x98(0x2)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_5F99[0x6];                                     // Fixing Size After Last Property 
	FVerseStringProperty_                        _ExprResultStack_2;                                // 0xA0(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_3;                                     // 0xB0(0x2)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_5F9A[0x6];                                     // Fixing Size After Last Property 
	FVerseStringProperty_                        _ExprResult_4;                                     // 0xB8(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResultStack_5;                                // 0xC8(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_6;                                     // 0xD8(0x2)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_5F9D[0x6];                                     // Fixing Size After Last Property 
	FOptionalProperty_                           _ExprResult_7;                                     // 0xE0(0x8)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FOptionalProperty_                           __verse_0x00000000__1;                             // 0xE8(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        _ExprResult_8 : 1;                                 // Mask: 0x1, PropSize: 0x10xEA(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_3AA : 7;                                    // Fixing Bit-Field Size 
	FOptionalProperty_                           _ExprResultStack_9;                                // 0xEB(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_5FA0[0x3];                                     // Fixing Size After Last Property 
	FVerseStringProperty_                        _ExprResultStack_10;                               // 0xF0(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_11;                                    // 0x100(0x2)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_5FA1[0x6];                                     // Fixing Size After Last Property 
	FVerseStringProperty_                        _ExprResultStack_12;                               // 0x108(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_13;                                    // 0x118(0x2)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_5FA2[0x6];                                     // Fixing Size After Last Property 
	struct FSpatialMath_vector2                  _ExprResult_14;                                    // 0x120(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_15;                               // 0x130(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_16;                                    // 0x180(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_17;                                    // 0x190(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResultStack_18;                               // 0x1A0(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_19;                                    // 0x1B0(0x2)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_5FA3[0x6];                                     // Fixing Size After Last Property 
	FVerseStringProperty_                        _ExprResultStack_20;                               // 0x1B8(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_21;                                    // 0x1C8(0x2)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_5FA4[0x6];                                     // Fixing Size After Last Property 
	FVerseStringProperty_                        _ExprResult_22;                                    // 0x1D0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResultStack_23;                               // 0x1E0(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_24;                                    // 0x1F0(0x2)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_5FA5[0x6];                                     // Fixing Size After Last Property 
	FOptionalProperty_                           _ExprResult_25;                                    // 0x1F8(0x8)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FOptionalProperty_                           __verse_0x00000000__3;                             // 0x200(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        _ExprResult_26 : 1;                                // Mask: 0x1, PropSize: 0x10x202(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_3AB : 7;                                    // Fixing Bit-Field Size 
	FOptionalProperty_                           _ExprResultStack_27;                               // 0x203(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_5FA6[0x3];                                     // Fixing Size After Last Property 
	FVerseStringProperty_                        _ExprResultStack_28;                               // 0x208(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_29;                                    // 0x218(0x2)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_5FA7[0x6];                                     // Fixing Size After Last Property 
	FVerseStringProperty_                        _ExprResultStack_30;                               // 0x220(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_31;                                    // 0x230(0x2)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_5FA9[0x6];                                     // Fixing Size After Last Property 
	struct FSpatialMath_vector2                  _ExprResult_32;                                    // 0x238(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_33;                               // 0x248(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_34;                                    // 0x298(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_35;                                    // 0x2A8(0x10)(HasGetValueTypeHash)
};

// 0x178 (0x178 - 0x0)
// Function VerseMovement.VerseMovement.VerseMovement_move_input_trigger_params$Factory
struct UVerseMovement_VerseMovement_move_input_trigger_params_Factory_Params
{
public:
	struct FVerseMovement_move_input_trigger_params RetVal;                                            // 0x0(0x38)(Parm, OutParm, ReturnParm)
	FVerseStringProperty_                        _ExprResult_0;                                     // 0x38(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_1;                                     // 0x48(0x8)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FOptionalProperty_                           __verse_0x00000000__1;                             // 0x50(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        _ExprResult_2 : 1;                                 // Mask: 0x1, PropSize: 0x10x52(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_3AD : 7;                                    // Fixing Bit-Field Size 
	FOptionalProperty_                           _ExprResultStack_3;                                // 0x53(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_5FAF[0x3];                                     // Fixing Size After Last Property 
	struct FSpatialMath_vector2                  _ExprResult_4;                                     // 0x58(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_5;                                // 0x68(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_6;                                     // 0xB8(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_7;                                     // 0xC8(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_8;                                     // 0xD8(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_9;                                     // 0xE8(0x8)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FOptionalProperty_                           __verse_0x00000000__3;                             // 0xF0(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        _ExprResult_10 : 1;                                // Mask: 0x1, PropSize: 0x10xF2(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_3AE : 7;                                    // Fixing Bit-Field Size 
	FOptionalProperty_                           _ExprResultStack_11;                               // 0xF3(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_5FB5[0x3];                                     // Fixing Size After Last Property 
	struct FSpatialMath_vector2                  _ExprResult_12;                                    // 0xF8(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_13;                               // 0x108(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_14;                                    // 0x158(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_15;                                    // 0x168(0x10)(HasGetValueTypeHash)
};

// 0x0 (0x0 - 0x0)
// Function VerseMovement.VerseMovement.$InitCDO
struct UVerseMovement__InitCDO_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseMovement.VerseMovement_move_config_asset.$InitInstance
struct UVerseMovement_move_config_asset__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseMovement.VerseMovement_move_config_asset.$Block
struct UVerseMovement_move_config_asset__Block_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseMovement.VerseMovement_move_config_asset.$InitCDO
struct UVerseMovement_move_config_asset__InitCDO_Params
{
public:
};

// 0x18 (0x18 - 0x0)
// Function VerseMovement.VerseMovement_movement_component._L_2fUnrealEngine_2ecom_2fEngine_2fVerseMovement_2fmovement__component_N_RSetVelocity_L_Nvector3_R
struct UVerseMovement_movement_component__L_2fUnrealEngine_2ecom_2fEngine_2fVerseMovement_2fmovement__component_N_RSetVelocity_L_Nvector3_R_Params
{
public:
	struct FSpatialMath_vector3                  __verse_0xB2CDDD72_Argument;                       // 0x0(0x18)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// 0x20 (0x20 - 0x0)
// Function VerseMovement.VerseMovement_movement_component._L_2fUnrealEngine_2ecom_2fEngine_2fVerseMovement_2fmovement__component_N_RSetRotation_L_Nrotation_R
struct UVerseMovement_movement_component__L_2fUnrealEngine_2ecom_2fEngine_2fVerseMovement_2fmovement__component_N_RSetRotation_L_Nrotation_R_Params
{
public:
	struct FVerseRotation                        __verse_0xB2CDDD72_Argument;                       // 0x0(0x20)(Parm, NoDestructor)
};

// 0x18 (0x18 - 0x0)
// Function VerseMovement.VerseMovement_movement_component._L_2fUnrealEngine_2ecom_2fEngine_2fVerseMovement_2fmovement__component_N_RSetPosition_L_Nvector3_R
struct UVerseMovement_movement_component__L_2fUnrealEngine_2ecom_2fEngine_2fVerseMovement_2fmovement__component_N_RSetPosition_L_Nvector3_R_Params
{
public:
	struct FSpatialMath_vector3                  __verse_0xB2CDDD72_Argument;                       // 0x0(0x18)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// 0x1 (0x1 - 0x0)
// Function VerseMovement.VerseMovement_movement_component._L_2fUnrealEngine_2ecom_2fEngine_2fVerseMovement_2fmovement__component_N_RSetEnabled_L_Nlogic_R
struct UVerseMovement_movement_component__L_2fUnrealEngine_2ecom_2fEngine_2fVerseMovement_2fmovement__component_N_RSetEnabled_L_Nlogic_R_Params
{
public:
	uint8                                        __verse_0xB2CDDD72_Argument : 1;                   // Mask: 0x1, PropSize: 0x10x0(0x1)(Parm, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function VerseMovement.VerseMovement_movement_component._L_2fUnrealEngine_2ecom_2fEngine_2fVerseMovement_2fmovement__component_N_RSetConfig_L_Nmove__config__asset_R
struct UVerseMovement_movement_component__L_2fUnrealEngine_2ecom_2fEngine_2fVerseMovement_2fmovement__component_N_RSetConfig_L_Nmove__config__asset_R_Params
{
public:
	class UVerseMovement_move_config_asset*      __verse_0xB2CDDD72_Argument;                       // 0x0(0x8)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// 0x10 (0x10 - 0x0)
// Function VerseMovement.VerseMovement_movement_component._L_2fUnrealEngine_2ecom_2fEngine_2fVerseMovement_2fmovement__component_N_RSetConfig_L_Nmove__config_R
struct UVerseMovement_movement_component__L_2fUnrealEngine_2ecom_2fEngine_2fVerseMovement_2fmovement__component_N_RSetConfig_L_Nmove__config_R_Params
{
public:
	struct FVerseMovement_move_config            __verse_0xB2CDDD72_Argument;                       // 0x0(0x10)(Parm)
};

// 0x8 (0x8 - 0x0)
// Function VerseMovement.VerseMovement_movement_component._L_2fUnrealEngine_2ecom_2fEngine_2fVerseMovement_2fmovement__component_N_REnableInput_L_Nplayer__component_R
struct UVerseMovement_movement_component__L_2fUnrealEngine_2ecom_2fEngine_2fVerseMovement_2fmovement__component_N_REnableInput_L_Nplayer__component_R_Params
{
public:
	class USimulation_player_component*          __verse_0xB2CDDD72_Argument;                       // 0x0(0x8)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function VerseMovement.VerseMovement_movement_component._L_2fUnrealEngine_2ecom_2fEngine_2fVerseMovement_2fmovement__component_N_RDisableInput_L_Nplayer__component_R
struct UVerseMovement_movement_component__L_2fUnrealEngine_2ecom_2fEngine_2fVerseMovement_2fmovement__component_N_RDisableInput_L_Nplayer__component_R_Params
{
public:
	class USimulation_player_component*          __verse_0xB2CDDD72_Argument;                       // 0x0(0x8)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// 0x18 (0x18 - 0x0)
// Function VerseMovement.VerseMovement_movement_component._L_2fUnrealEngine_2ecom_2fEngine_2fVerseMovement_2fmovement__component_N_RAddImpulse_L_Nvector3_R
struct UVerseMovement_movement_component__L_2fUnrealEngine_2ecom_2fEngine_2fVerseMovement_2fmovement__component_N_RAddImpulse_L_Nvector3_R_Params
{
public:
	struct FSpatialMath_vector3                  __verse_0xB2CDDD72_Argument;                       // 0x0(0x18)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// 0x18 (0x18 - 0x0)
// Function VerseMovement.VerseMovement_movement_component._L_2fUnrealEngine_2ecom_2fEngine_2fVerseMovement_2fmovement__component_N_RAddAngularImpulse_L_Nvector3_R
struct UVerseMovement_movement_component__L_2fUnrealEngine_2ecom_2fEngine_2fVerseMovement_2fmovement__component_N_RAddAngularImpulse_L_Nvector3_R_Params
{
public:
	struct FSpatialMath_vector3                  __verse_0xB2CDDD72_Argument;                       // 0x0(0x18)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// 0x0 (0x0 - 0x0)
// Function VerseMovement.VerseMovement_movement_component.$InitInstance
struct UVerseMovement_movement_component__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseMovement.VerseMovement_movement_component.$Block
struct UVerseMovement_movement_component__Block_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseMovement.VerseMovement_movement_component.$InitCDO
struct UVerseMovement_movement_component__InitCDO_Params
{
public:
};

// 0x5070 (0x5070 - 0x0)
// Function VerseMovement.VerseMovement_VerseMovementUtil.$InitCDO
struct UVerseMovement_VerseMovementUtil__InitCDO_Params
{
public:
	struct FVerseMovement_move_config            _ExprResult_0;                                     // 0x0(0x10)(None)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_1;                                // 0x10(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_2;                                     // 0x60(0x10)(HasGetValueTypeHash)
	TArray<struct FVerseMovement_move_config_entry> _ExprResult_3;                                     // 0x70(0x10)(ContainsInstancedReference)
	struct FVerseMovement_move_config_entry      _ExprResult_4;                                     // 0x80(0x30)(None)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_5;                                // 0xB0(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_6;                                     // 0x100(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_7;                                     // 0x110(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_8;                                     // 0x120(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_9;                                     // 0x130(0x10)(HasGetValueTypeHash)
	TArray<struct FVerseMovement_move_trigger>   _ExprResult_10;                                    // 0x140(0x10)(ContainsInstancedReference)
	struct FVerseMovement_move_trigger           _ExprResult_11;                                    // 0x150(0x90)(None)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_12;                               // 0x1E0(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_13;                                    // 0x230(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_14;                                    // 0x240(0x10)(HasGetValueTypeHash)
	struct FVerseMovement_move_input_trigger_params _ExprResult_15;                                    // 0x250(0x38)(None)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_16;                               // 0x288(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_17;                                    // 0x2D8(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_18;                                    // 0x2E8(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_19;                                    // 0x2F8(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_20;                                    // 0x308(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_21;                                    // 0x318(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_22;                                    // 0x328(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_23;                                    // 0x338(0x8)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FOptionalProperty_                           __verse_0x00000000__1;                             // 0x340(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        _ExprResult_24 : 1;                                // Mask: 0x1, PropSize: 0x10x342(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_3D5 : 7;                                    // Fixing Bit-Field Size 
	FOptionalProperty_                           _ExprResultStack_25;                               // 0x343(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_61A7[0x3];                                     // Fixing Size After Last Property 
	struct FSpatialMath_vector2                  _ExprResult_26;                                    // 0x348(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_27;                               // 0x358(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_28;                                    // 0x3A8(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_29;                                    // 0x3B8(0x10)(HasGetValueTypeHash)
	TArray<struct FVerseMovement_move_response>  _ExprResult_30;                                    // 0x3C8(0x10)(ContainsInstancedReference)
	struct FVerseMovement_move_response          _ExprResult_31;                                    // 0x3D8(0x50)(NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_32;                               // 0x428(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_33;                                    // 0x478(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_34;                                    // 0x488(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_35;                                    // 0x498(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_36;                                    // 0x4A8(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_37;                                    // 0x4B8(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_38;                                    // 0x4C8(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_39;                                    // 0x4D8(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_40;                                    // 0x4E8(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_41;                                    // 0x4F8(0x10)(HasGetValueTypeHash)
	struct FSpatialMath_vector3                  _ExprResult_42;                                    // 0x508(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_43;                               // 0x520(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_44;                                    // 0x570(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_45;                                    // 0x580(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_46;                                    // 0x590(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_47;                                    // 0x5A0(0x8)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FOptionalProperty_                           __verse_0x00000000__3;                             // 0x5A8(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        _ExprResult_48 : 1;                                // Mask: 0x1, PropSize: 0x10x5AA(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_3D6 : 7;                                    // Fixing Bit-Field Size 
	FOptionalProperty_                           _ExprResultStack_49;                               // 0x5AB(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_61A8[0x3];                                     // Fixing Size After Last Property 
	struct FSpatialMath_vector3                  _ExprResult_50;                                    // 0x5B0(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_51;                               // 0x5C8(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_52;                                    // 0x618(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_53;                                    // 0x628(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_54;                                    // 0x638(0x10)(HasGetValueTypeHash)
	struct FVerseMovement_move_config_entry      _ExprResult_55;                                    // 0x648(0x30)(None)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_56;                               // 0x678(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_57;                                    // 0x6C8(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_58;                                    // 0x6D8(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_59;                                    // 0x6E8(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_60;                                    // 0x6F8(0x10)(HasGetValueTypeHash)
	TArray<struct FVerseMovement_move_trigger>   _ExprResult_61;                                    // 0x708(0x10)(ContainsInstancedReference)
	struct FVerseMovement_move_trigger           _ExprResult_62;                                    // 0x718(0x90)(None)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_63;                               // 0x7A8(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_64;                                    // 0x7F8(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_65;                                    // 0x808(0x10)(HasGetValueTypeHash)
	struct FVerseMovement_move_input_trigger_params _ExprResult_66;                                    // 0x818(0x38)(None)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_67;                               // 0x850(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_68;                                    // 0x8A0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_69;                                    // 0x8B0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_70;                                    // 0x8C0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_71;                                    // 0x8D0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_72;                                    // 0x8E0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_73;                                    // 0x8F0(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_74;                                    // 0x900(0x8)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FOptionalProperty_                           __verse_0x00000000__5;                             // 0x908(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        _ExprResult_75 : 1;                                // Mask: 0x1, PropSize: 0x10x90A(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_3D7 : 7;                                    // Fixing Bit-Field Size 
	FOptionalProperty_                           _ExprResultStack_76;                               // 0x90B(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_61AD[0x3];                                     // Fixing Size After Last Property 
	struct FSpatialMath_vector2                  _ExprResult_77;                                    // 0x910(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_78;                               // 0x920(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_79;                                    // 0x970(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_80;                                    // 0x980(0x10)(HasGetValueTypeHash)
	TArray<struct FVerseMovement_move_response>  _ExprResult_81;                                    // 0x990(0x10)(ContainsInstancedReference)
	struct FVerseMovement_move_response          _ExprResult_82;                                    // 0x9A0(0x50)(NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_83;                               // 0x9F0(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_84;                                    // 0xA40(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_85;                                    // 0xA50(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_86;                                    // 0xA60(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_87;                                    // 0xA70(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_88;                                    // 0xA80(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_89;                                    // 0xA90(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_90;                                    // 0xAA0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_91;                                    // 0xAB0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_92;                                    // 0xAC0(0x10)(HasGetValueTypeHash)
	struct FSpatialMath_vector3                  _ExprResult_93;                                    // 0xAD0(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_94;                               // 0xAE8(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_95;                                    // 0xB38(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_96;                                    // 0xB48(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_97;                                    // 0xB58(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_98;                                    // 0xB68(0x8)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FOptionalProperty_                           __verse_0x00000000__7;                             // 0xB70(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        _ExprResult_99 : 1;                                // Mask: 0x1, PropSize: 0x10xB72(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_3D8 : 7;                                    // Fixing Bit-Field Size 
	FOptionalProperty_                           _ExprResultStack_100;                              // 0xB73(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_61B0[0x3];                                     // Fixing Size After Last Property 
	struct FSpatialMath_vector3                  _ExprResult_101;                                   // 0xB78(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_102;                              // 0xB90(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_103;                                   // 0xBE0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_104;                                   // 0xBF0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_105;                                   // 0xC00(0x10)(HasGetValueTypeHash)
	struct FVerseMovement_move_config_entry      _ExprResult_106;                                   // 0xC10(0x30)(None)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_107;                              // 0xC40(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_108;                                   // 0xC90(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_109;                                   // 0xCA0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_110;                                   // 0xCB0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_111;                                   // 0xCC0(0x10)(HasGetValueTypeHash)
	TArray<struct FVerseMovement_move_trigger>   _ExprResult_112;                                   // 0xCD0(0x10)(ContainsInstancedReference)
	struct FVerseMovement_move_trigger           _ExprResult_113;                                   // 0xCE0(0x90)(None)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_114;                              // 0xD70(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_115;                                   // 0xDC0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_116;                                   // 0xDD0(0x10)(HasGetValueTypeHash)
	struct FVerseMovement_move_input_trigger_params _ExprResult_117;                                   // 0xDE0(0x38)(None)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_118;                              // 0xE18(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_119;                                   // 0xE68(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_120;                                   // 0xE78(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_121;                                   // 0xE88(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_122;                                   // 0xE98(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_123;                                   // 0xEA8(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_124;                                   // 0xEB8(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_125;                                   // 0xEC8(0x8)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FOptionalProperty_                           __verse_0x00000000__9;                             // 0xED0(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        _ExprResult_126 : 1;                               // Mask: 0x1, PropSize: 0x10xED2(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_3D9 : 7;                                    // Fixing Bit-Field Size 
	FOptionalProperty_                           _ExprResultStack_127;                              // 0xED3(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_61B3[0x3];                                     // Fixing Size After Last Property 
	struct FSpatialMath_vector2                  _ExprResult_128;                                   // 0xED8(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_129;                              // 0xEE8(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_130;                                   // 0xF38(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_131;                                   // 0xF48(0x10)(HasGetValueTypeHash)
	struct FVerseMovement_move_trigger           _ExprResult_132;                                   // 0xF58(0x90)(None)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_133;                              // 0xFE8(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_134;                                   // 0x1038(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_135;                                   // 0x1048(0x10)(HasGetValueTypeHash)
	struct FVerseMovement_move_trace_trigger_params _ExprResult_136;                                   // 0x1058(0x38)(NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_137;                              // 0x1090(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_138;                                   // 0x10E0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_139;                                   // 0x10F0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_140;                                   // 0x1100(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_141;                                   // 0x1110(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_142;                                   // 0x1120(0x10)(HasGetValueTypeHash)
	struct FSpatialMath_vector3                  _ExprResult_143;                                   // 0x1130(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_144;                              // 0x1148(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_145;                                   // 0x1198(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_146;                                   // 0x11A8(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_147;                                   // 0x11B8(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_148;                                   // 0x11C8(0x8)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FOptionalProperty_                           __verse_0x00000000__11;                            // 0x11D0(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        _ExprResult_149 : 1;                               // Mask: 0x1, PropSize: 0x10x11D2(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_3DA : 7;                                    // Fixing Bit-Field Size 
	FOptionalProperty_                           _ExprResultStack_150;                              // 0x11D3(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_61B7[0x3];                                     // Fixing Size After Last Property 
	TArray<struct FVerseMovement_move_response>  _ExprResult_151;                                   // 0x11D8(0x10)(ContainsInstancedReference)
	struct FVerseMovement_move_response          _ExprResult_152;                                   // 0x11E8(0x50)(NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_153;                              // 0x1238(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_154;                                   // 0x1288(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_155;                                   // 0x1298(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_156;                                   // 0x12A8(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_157;                                   // 0x12B8(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_158;                                   // 0x12C8(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_159;                                   // 0x12D8(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_160;                                   // 0x12E8(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_161;                                   // 0x12F8(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_162;                                   // 0x1308(0x10)(HasGetValueTypeHash)
	struct FSpatialMath_vector3                  _ExprResult_163;                                   // 0x1318(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_164;                              // 0x1330(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_165;                                   // 0x1380(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_166;                                   // 0x1390(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_167;                                   // 0x13A0(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_168;                                   // 0x13B0(0x8)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FOptionalProperty_                           __verse_0x00000000__13;                            // 0x13B8(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        _ExprResult_169 : 1;                               // Mask: 0x1, PropSize: 0x10x13BA(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_3DB : 7;                                    // Fixing Bit-Field Size 
	FOptionalProperty_                           _ExprResultStack_170;                              // 0x13BB(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_61BD[0x3];                                     // Fixing Size After Last Property 
	struct FSpatialMath_vector3                  _ExprResult_171;                                   // 0x13C0(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_172;                              // 0x13D8(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_173;                                   // 0x1428(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_174;                                   // 0x1438(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_175;                                   // 0x1448(0x10)(HasGetValueTypeHash)
	struct FVerseMovement_move_config_entry      _ExprResult_176;                                   // 0x1458(0x30)(None)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_177;                              // 0x1488(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_178;                                   // 0x14D8(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_179;                                   // 0x14E8(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_180;                                   // 0x14F8(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_181;                                   // 0x1508(0x10)(HasGetValueTypeHash)
	TArray<struct FVerseMovement_move_trigger>   _ExprResult_182;                                   // 0x1518(0x10)(ContainsInstancedReference)
	struct FVerseMovement_move_trigger           _ExprResult_183;                                   // 0x1528(0x90)(None)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_184;                              // 0x15B8(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_185;                                   // 0x1608(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_186;                                   // 0x1618(0x10)(HasGetValueTypeHash)
	struct FVerseMovement_move_input_trigger_params _ExprResult_187;                                   // 0x1628(0x38)(None)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_188;                              // 0x1660(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_189;                                   // 0x16B0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_190;                                   // 0x16C0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_191;                                   // 0x16D0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_192;                                   // 0x16E0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_193;                                   // 0x16F0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_194;                                   // 0x1700(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_195;                                   // 0x1710(0x8)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FOptionalProperty_                           __verse_0x00000000__15;                            // 0x1718(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        _ExprResult_196 : 1;                               // Mask: 0x1, PropSize: 0x10x171A(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_3DD : 7;                                    // Fixing Bit-Field Size 
	FOptionalProperty_                           _ExprResultStack_197;                              // 0x171B(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_61C3[0x3];                                     // Fixing Size After Last Property 
	struct FSpatialMath_vector2                  _ExprResult_198;                                   // 0x1720(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_199;                              // 0x1730(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_200;                                   // 0x1780(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_201;                                   // 0x1790(0x10)(HasGetValueTypeHash)
	struct FVerseMovement_move_trigger           _ExprResult_202;                                   // 0x17A0(0x90)(None)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_203;                              // 0x1830(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_204;                                   // 0x1880(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_205;                                   // 0x1890(0x10)(HasGetValueTypeHash)
	struct FVerseMovement_move_trace_trigger_params _ExprResult_206;                                   // 0x18A0(0x38)(NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_207;                              // 0x18D8(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_208;                                   // 0x1928(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_209;                                   // 0x1938(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_210;                                   // 0x1948(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_211;                                   // 0x1958(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_212;                                   // 0x1968(0x10)(HasGetValueTypeHash)
	struct FSpatialMath_vector3                  _ExprResult_213;                                   // 0x1978(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_214;                              // 0x1990(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_215;                                   // 0x19E0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_216;                                   // 0x19F0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_217;                                   // 0x1A00(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_218;                                   // 0x1A10(0x8)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FOptionalProperty_                           __verse_0x00000000__17;                            // 0x1A18(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        _ExprResult_219 : 1;                               // Mask: 0x1, PropSize: 0x10x1A1A(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_3DE : 7;                                    // Fixing Bit-Field Size 
	FOptionalProperty_                           _ExprResultStack_220;                              // 0x1A1B(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_61C9[0x3];                                     // Fixing Size After Last Property 
	TArray<struct FVerseMovement_move_response>  _ExprResult_221;                                   // 0x1A20(0x10)(ContainsInstancedReference)
	struct FVerseMovement_move_response          _ExprResult_222;                                   // 0x1A30(0x50)(NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_223;                              // 0x1A80(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_224;                                   // 0x1AD0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_225;                                   // 0x1AE0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_226;                                   // 0x1AF0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_227;                                   // 0x1B00(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_228;                                   // 0x1B10(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_229;                                   // 0x1B20(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_230;                                   // 0x1B30(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_231;                                   // 0x1B40(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_232;                                   // 0x1B50(0x10)(HasGetValueTypeHash)
	struct FSpatialMath_vector3                  _ExprResult_233;                                   // 0x1B60(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_234;                              // 0x1B78(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_235;                                   // 0x1BC8(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_236;                                   // 0x1BD8(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_237;                                   // 0x1BE8(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_238;                                   // 0x1BF8(0x8)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FOptionalProperty_                           __verse_0x00000000__19;                            // 0x1C00(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        _ExprResult_239 : 1;                               // Mask: 0x1, PropSize: 0x10x1C02(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_3DF : 7;                                    // Fixing Bit-Field Size 
	FOptionalProperty_                           _ExprResultStack_240;                              // 0x1C03(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_61CF[0x3];                                     // Fixing Size After Last Property 
	struct FSpatialMath_vector3                  _ExprResult_241;                                   // 0x1C08(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_242;                              // 0x1C20(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_243;                                   // 0x1C70(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_244;                                   // 0x1C80(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_245;                                   // 0x1C90(0x10)(HasGetValueTypeHash)
	struct FVerseMovement_move_config_entry      _ExprResult_246;                                   // 0x1CA0(0x30)(None)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_247;                              // 0x1CD0(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_248;                                   // 0x1D20(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_249;                                   // 0x1D30(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_250;                                   // 0x1D40(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_251;                                   // 0x1D50(0x10)(HasGetValueTypeHash)
	TArray<struct FVerseMovement_move_trigger>   _ExprResult_252;                                   // 0x1D60(0x10)(ContainsInstancedReference)
	struct FVerseMovement_move_trigger           _ExprResult_253;                                   // 0x1D70(0x90)(None)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_254;                              // 0x1E00(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_255;                                   // 0x1E50(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_256;                                   // 0x1E60(0x10)(HasGetValueTypeHash)
	struct FVerseMovement_move_input_trigger_params _ExprResult_257;                                   // 0x1E70(0x38)(None)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_258;                              // 0x1EA8(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_259;                                   // 0x1EF8(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_260;                                   // 0x1F08(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_261;                                   // 0x1F18(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_262;                                   // 0x1F28(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_263;                                   // 0x1F38(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_264;                                   // 0x1F48(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_265;                                   // 0x1F58(0x8)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FOptionalProperty_                           __verse_0x00000000__21;                            // 0x1F60(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        _ExprResult_266 : 1;                               // Mask: 0x1, PropSize: 0x10x1F62(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_3E0 : 7;                                    // Fixing Bit-Field Size 
	FOptionalProperty_                           _ExprResultStack_267;                              // 0x1F63(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_61D4[0x3];                                     // Fixing Size After Last Property 
	struct FSpatialMath_vector2                  _ExprResult_268;                                   // 0x1F68(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_269;                              // 0x1F78(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_270;                                   // 0x1FC8(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_271;                                   // 0x1FD8(0x10)(HasGetValueTypeHash)
	TArray<struct FVerseMovement_move_response>  _ExprResult_272;                                   // 0x1FE8(0x10)(ContainsInstancedReference)
	struct FVerseMovement_move_response          _ExprResult_273;                                   // 0x1FF8(0x50)(NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_274;                              // 0x2048(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_275;                                   // 0x2098(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_276;                                   // 0x20A8(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_277;                                   // 0x20B8(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_278;                                   // 0x20C8(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_279;                                   // 0x20D8(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_280;                                   // 0x20E8(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_281;                                   // 0x20F8(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_282;                                   // 0x2108(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_283;                                   // 0x2118(0x10)(HasGetValueTypeHash)
	struct FSpatialMath_vector3                  _ExprResult_284;                                   // 0x2128(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_285;                              // 0x2140(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_286;                                   // 0x2190(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_287;                                   // 0x21A0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_288;                                   // 0x21B0(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_289;                                   // 0x21C0(0x8)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FOptionalProperty_                           __verse_0x00000000__23;                            // 0x21C8(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        _ExprResult_290 : 1;                               // Mask: 0x1, PropSize: 0x10x21CA(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_3E1 : 7;                                    // Fixing Bit-Field Size 
	FOptionalProperty_                           _ExprResultStack_291;                              // 0x21CB(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_61D6[0x3];                                     // Fixing Size After Last Property 
	struct FSpatialMath_vector3                  _ExprResult_292;                                   // 0x21D0(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_293;                              // 0x21E8(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_294;                                   // 0x2238(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_295;                                   // 0x2248(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_296;                                   // 0x2258(0x10)(HasGetValueTypeHash)
	struct FVerseMovement_move_config_entry      _ExprResult_297;                                   // 0x2268(0x30)(None)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_298;                              // 0x2298(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_299;                                   // 0x22E8(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_300;                                   // 0x22F8(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_301;                                   // 0x2308(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_302;                                   // 0x2318(0x10)(HasGetValueTypeHash)
	TArray<struct FVerseMovement_move_trigger>   _ExprResult_303;                                   // 0x2328(0x10)(ContainsInstancedReference)
	struct FVerseMovement_move_trigger           _ExprResult_304;                                   // 0x2338(0x90)(None)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_305;                              // 0x23C8(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_306;                                   // 0x2418(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_307;                                   // 0x2428(0x10)(HasGetValueTypeHash)
	struct FVerseMovement_move_trace_trigger_params _ExprResult_308;                                   // 0x2438(0x38)(NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_309;                              // 0x2470(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_310;                                   // 0x24C0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_311;                                   // 0x24D0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_312;                                   // 0x24E0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_313;                                   // 0x24F0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_314;                                   // 0x2500(0x10)(HasGetValueTypeHash)
	struct FSpatialMath_vector3                  _ExprResult_315;                                   // 0x2510(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_316;                              // 0x2528(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_317;                                   // 0x2578(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_318;                                   // 0x2588(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_319;                                   // 0x2598(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_320;                                   // 0x25A8(0x8)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FOptionalProperty_                           __verse_0x00000000__25;                            // 0x25B0(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        _ExprResult_321 : 1;                               // Mask: 0x1, PropSize: 0x10x25B2(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_3E2 : 7;                                    // Fixing Bit-Field Size 
	FOptionalProperty_                           _ExprResultStack_322;                              // 0x25B3(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_61DE[0x3];                                     // Fixing Size After Last Property 
	TArray<struct FVerseMovement_move_response>  _ExprResult_323;                                   // 0x25B8(0x10)(ContainsInstancedReference)
	struct FVerseMovement_move_response          _ExprResult_324;                                   // 0x25C8(0x50)(NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_325;                              // 0x2618(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_326;                                   // 0x2668(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_327;                                   // 0x2678(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_328;                                   // 0x2688(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_329;                                   // 0x2698(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_330;                                   // 0x26A8(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_331;                                   // 0x26B8(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_332;                                   // 0x26C8(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_333;                                   // 0x26D8(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_334;                                   // 0x26E8(0x10)(HasGetValueTypeHash)
	struct FSpatialMath_vector3                  _ExprResult_335;                                   // 0x26F8(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_336;                              // 0x2710(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_337;                                   // 0x2760(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_338;                                   // 0x2770(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_339;                                   // 0x2780(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_340;                                   // 0x2790(0x8)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FOptionalProperty_                           __verse_0x00000000__27;                            // 0x2798(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        _ExprResult_341 : 1;                               // Mask: 0x1, PropSize: 0x10x279A(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_3E3 : 7;                                    // Fixing Bit-Field Size 
	FOptionalProperty_                           _ExprResultStack_342;                              // 0x279B(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_61E7[0x3];                                     // Fixing Size After Last Property 
	struct FSpatialMath_vector3                  _ExprResult_343;                                   // 0x27A0(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_344;                              // 0x27B8(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_345;                                   // 0x2808(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_346;                                   // 0x2818(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_347;                                   // 0x2828(0x10)(HasGetValueTypeHash)
	struct FVerseMovement_move_config            _ExprResult_348;                                   // 0x2838(0x10)(None)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_349;                              // 0x2848(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_350;                                   // 0x2898(0x10)(HasGetValueTypeHash)
	TArray<struct FVerseMovement_move_config_entry> _ExprResult_351;                                   // 0x28A8(0x10)(ContainsInstancedReference)
	struct FVerseMovement_move_config_entry      _ExprResult_352;                                   // 0x28B8(0x30)(None)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_353;                              // 0x28E8(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_354;                                   // 0x2938(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_355;                                   // 0x2948(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_356;                                   // 0x2958(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_357;                                   // 0x2968(0x10)(HasGetValueTypeHash)
	TArray<struct FVerseMovement_move_trigger>   _ExprResult_358;                                   // 0x2978(0x10)(ContainsInstancedReference)
	struct FVerseMovement_move_trigger           _ExprResult_359;                                   // 0x2988(0x90)(None)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_360;                              // 0x2A18(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_361;                                   // 0x2A68(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_362;                                   // 0x2A78(0x10)(HasGetValueTypeHash)
	struct FVerseMovement_move_input_trigger_params _ExprResult_363;                                   // 0x2A88(0x38)(None)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_364;                              // 0x2AC0(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_365;                                   // 0x2B10(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_366;                                   // 0x2B20(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_367;                                   // 0x2B30(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_368;                                   // 0x2B40(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_369;                                   // 0x2B50(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_370;                                   // 0x2B60(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_371;                                   // 0x2B70(0x8)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FOptionalProperty_                           __verse_0x00000000__29;                            // 0x2B78(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        _ExprResult_372 : 1;                               // Mask: 0x1, PropSize: 0x10x2B7A(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_3E4 : 7;                                    // Fixing Bit-Field Size 
	FOptionalProperty_                           _ExprResultStack_373;                              // 0x2B7B(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_61F4[0x3];                                     // Fixing Size After Last Property 
	struct FSpatialMath_vector2                  _ExprResult_374;                                   // 0x2B80(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_375;                              // 0x2B90(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_376;                                   // 0x2BE0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_377;                                   // 0x2BF0(0x10)(HasGetValueTypeHash)
	TArray<struct FVerseMovement_move_response>  _ExprResult_378;                                   // 0x2C00(0x10)(ContainsInstancedReference)
	struct FVerseMovement_move_response          _ExprResult_379;                                   // 0x2C10(0x50)(NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_380;                              // 0x2C60(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_381;                                   // 0x2CB0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_382;                                   // 0x2CC0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_383;                                   // 0x2CD0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_384;                                   // 0x2CE0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_385;                                   // 0x2CF0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_386;                                   // 0x2D00(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_387;                                   // 0x2D10(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_388;                                   // 0x2D20(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_389;                                   // 0x2D30(0x10)(HasGetValueTypeHash)
	struct FSpatialMath_vector3                  _ExprResult_390;                                   // 0x2D40(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_391;                              // 0x2D58(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_392;                                   // 0x2DA8(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_393;                                   // 0x2DB8(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_394;                                   // 0x2DC8(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_395;                                   // 0x2DD8(0x8)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FOptionalProperty_                           __verse_0x00000000__31;                            // 0x2DE0(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        _ExprResult_396 : 1;                               // Mask: 0x1, PropSize: 0x10x2DE2(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_3E5 : 7;                                    // Fixing Bit-Field Size 
	FOptionalProperty_                           _ExprResultStack_397;                              // 0x2DE3(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_6204[0x3];                                     // Fixing Size After Last Property 
	struct FSpatialMath_vector3                  _ExprResult_398;                                   // 0x2DE8(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_399;                              // 0x2E00(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_400;                                   // 0x2E50(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_401;                                   // 0x2E60(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_402;                                   // 0x2E70(0x10)(HasGetValueTypeHash)
	struct FVerseMovement_move_config_entry      _ExprResult_403;                                   // 0x2E80(0x30)(None)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_404;                              // 0x2EB0(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_405;                                   // 0x2F00(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_406;                                   // 0x2F10(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_407;                                   // 0x2F20(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_408;                                   // 0x2F30(0x10)(HasGetValueTypeHash)
	TArray<struct FVerseMovement_move_trigger>   _ExprResult_409;                                   // 0x2F40(0x10)(ContainsInstancedReference)
	struct FVerseMovement_move_trigger           _ExprResult_410;                                   // 0x2F50(0x90)(None)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_411;                              // 0x2FE0(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_412;                                   // 0x3030(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_413;                                   // 0x3040(0x10)(HasGetValueTypeHash)
	struct FVerseMovement_move_input_trigger_params _ExprResult_414;                                   // 0x3050(0x38)(None)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_415;                              // 0x3088(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_416;                                   // 0x30D8(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_417;                                   // 0x30E8(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_418;                                   // 0x30F8(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_419;                                   // 0x3108(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_420;                                   // 0x3118(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_421;                                   // 0x3128(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_422;                                   // 0x3138(0x8)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FOptionalProperty_                           __verse_0x00000000__33;                            // 0x3140(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        _ExprResult_423 : 1;                               // Mask: 0x1, PropSize: 0x10x3142(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_3E6 : 7;                                    // Fixing Bit-Field Size 
	FOptionalProperty_                           _ExprResultStack_424;                              // 0x3143(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_6211[0x3];                                     // Fixing Size After Last Property 
	struct FSpatialMath_vector2                  _ExprResult_425;                                   // 0x3148(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_426;                              // 0x3158(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_427;                                   // 0x31A8(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_428;                                   // 0x31B8(0x10)(HasGetValueTypeHash)
	TArray<struct FVerseMovement_move_response>  _ExprResult_429;                                   // 0x31C8(0x10)(ContainsInstancedReference)
	struct FVerseMovement_move_response          _ExprResult_430;                                   // 0x31D8(0x50)(NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_431;                              // 0x3228(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_432;                                   // 0x3278(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_433;                                   // 0x3288(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_434;                                   // 0x3298(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_435;                                   // 0x32A8(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_436;                                   // 0x32B8(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_437;                                   // 0x32C8(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_438;                                   // 0x32D8(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_439;                                   // 0x32E8(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_440;                                   // 0x32F8(0x10)(HasGetValueTypeHash)
	struct FSpatialMath_vector3                  _ExprResult_441;                                   // 0x3308(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_442;                              // 0x3320(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_443;                                   // 0x3370(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_444;                                   // 0x3380(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_445;                                   // 0x3390(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_446;                                   // 0x33A0(0x8)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FOptionalProperty_                           __verse_0x00000000__35;                            // 0x33A8(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        _ExprResult_447 : 1;                               // Mask: 0x1, PropSize: 0x10x33AA(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_3E7 : 7;                                    // Fixing Bit-Field Size 
	FOptionalProperty_                           _ExprResultStack_448;                              // 0x33AB(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_6218[0x3];                                     // Fixing Size After Last Property 
	struct FSpatialMath_vector3                  _ExprResult_449;                                   // 0x33B0(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_450;                              // 0x33C8(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_451;                                   // 0x3418(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_452;                                   // 0x3428(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_453;                                   // 0x3438(0x10)(HasGetValueTypeHash)
	struct FVerseMovement_move_config_entry      _ExprResult_454;                                   // 0x3448(0x30)(None)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_455;                              // 0x3478(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_456;                                   // 0x34C8(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_457;                                   // 0x34D8(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_458;                                   // 0x34E8(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_459;                                   // 0x34F8(0x10)(HasGetValueTypeHash)
	TArray<struct FVerseMovement_move_trigger>   _ExprResult_460;                                   // 0x3508(0x10)(ContainsInstancedReference)
	struct FVerseMovement_move_trigger           _ExprResult_461;                                   // 0x3518(0x90)(None)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_462;                              // 0x35A8(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_463;                                   // 0x35F8(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_464;                                   // 0x3608(0x10)(HasGetValueTypeHash)
	struct FVerseMovement_move_input_trigger_params _ExprResult_465;                                   // 0x3618(0x38)(None)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_466;                              // 0x3650(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_467;                                   // 0x36A0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_468;                                   // 0x36B0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_469;                                   // 0x36C0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_470;                                   // 0x36D0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_471;                                   // 0x36E0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_472;                                   // 0x36F0(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_473;                                   // 0x3700(0x8)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FOptionalProperty_                           __verse_0x00000000__37;                            // 0x3708(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        _ExprResult_474 : 1;                               // Mask: 0x1, PropSize: 0x10x370A(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_3E8 : 7;                                    // Fixing Bit-Field Size 
	FOptionalProperty_                           _ExprResultStack_475;                              // 0x370B(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_621C[0x3];                                     // Fixing Size After Last Property 
	struct FSpatialMath_vector2                  _ExprResult_476;                                   // 0x3710(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_477;                              // 0x3720(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_478;                                   // 0x3770(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_479;                                   // 0x3780(0x10)(HasGetValueTypeHash)
	struct FVerseMovement_move_trigger           _ExprResult_480;                                   // 0x3790(0x90)(None)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_481;                              // 0x3820(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_482;                                   // 0x3870(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_483;                                   // 0x3880(0x10)(HasGetValueTypeHash)
	struct FVerseMovement_move_trace_trigger_params _ExprResult_484;                                   // 0x3890(0x38)(NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_485;                              // 0x38C8(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_486;                                   // 0x3918(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_487;                                   // 0x3928(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_488;                                   // 0x3938(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_489;                                   // 0x3948(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_490;                                   // 0x3958(0x10)(HasGetValueTypeHash)
	struct FSpatialMath_vector3                  _ExprResult_491;                                   // 0x3968(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_492;                              // 0x3980(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_493;                                   // 0x39D0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_494;                                   // 0x39E0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_495;                                   // 0x39F0(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_496;                                   // 0x3A00(0x8)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FOptionalProperty_                           __verse_0x00000000__39;                            // 0x3A08(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        _ExprResult_497 : 1;                               // Mask: 0x1, PropSize: 0x10x3A0A(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_3E9 : 7;                                    // Fixing Bit-Field Size 
	FOptionalProperty_                           _ExprResultStack_498;                              // 0x3A0B(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_622B[0x3];                                     // Fixing Size After Last Property 
	TArray<struct FVerseMovement_move_response>  _ExprResult_499;                                   // 0x3A10(0x10)(ContainsInstancedReference)
	struct FVerseMovement_move_response          _ExprResult_500;                                   // 0x3A20(0x50)(NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_501;                              // 0x3A70(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_502;                                   // 0x3AC0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_503;                                   // 0x3AD0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_504;                                   // 0x3AE0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_505;                                   // 0x3AF0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_506;                                   // 0x3B00(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_507;                                   // 0x3B10(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_508;                                   // 0x3B20(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_509;                                   // 0x3B30(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_510;                                   // 0x3B40(0x10)(HasGetValueTypeHash)
	struct FSpatialMath_vector3                  _ExprResult_511;                                   // 0x3B50(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_512;                              // 0x3B68(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_513;                                   // 0x3BB8(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_514;                                   // 0x3BC8(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_515;                                   // 0x3BD8(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_516;                                   // 0x3BE8(0x8)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FOptionalProperty_                           __verse_0x00000000__41;                            // 0x3BF0(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        _ExprResult_517 : 1;                               // Mask: 0x1, PropSize: 0x10x3BF2(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_3EA : 7;                                    // Fixing Bit-Field Size 
	FOptionalProperty_                           _ExprResultStack_518;                              // 0x3BF3(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_6230[0x3];                                     // Fixing Size After Last Property 
	struct FSpatialMath_vector3                  _ExprResult_519;                                   // 0x3BF8(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_520;                              // 0x3C10(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_521;                                   // 0x3C60(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_522;                                   // 0x3C70(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_523;                                   // 0x3C80(0x10)(HasGetValueTypeHash)
	struct FVerseMovement_move_config_entry      _ExprResult_524;                                   // 0x3C90(0x30)(None)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_525;                              // 0x3CC0(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_526;                                   // 0x3D10(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_527;                                   // 0x3D20(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_528;                                   // 0x3D30(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_529;                                   // 0x3D40(0x10)(HasGetValueTypeHash)
	TArray<struct FVerseMovement_move_trigger>   _ExprResult_530;                                   // 0x3D50(0x10)(ContainsInstancedReference)
	struct FVerseMovement_move_trigger           _ExprResult_531;                                   // 0x3D60(0x90)(None)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_532;                              // 0x3DF0(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_533;                                   // 0x3E40(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_534;                                   // 0x3E50(0x10)(HasGetValueTypeHash)
	struct FVerseMovement_move_input_trigger_params _ExprResult_535;                                   // 0x3E60(0x38)(None)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_536;                              // 0x3E98(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_537;                                   // 0x3EE8(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_538;                                   // 0x3EF8(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_539;                                   // 0x3F08(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_540;                                   // 0x3F18(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_541;                                   // 0x3F28(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_542;                                   // 0x3F38(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_543;                                   // 0x3F48(0x8)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FOptionalProperty_                           __verse_0x00000000__43;                            // 0x3F50(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        _ExprResult_544 : 1;                               // Mask: 0x1, PropSize: 0x10x3F52(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_3EB : 7;                                    // Fixing Bit-Field Size 
	FOptionalProperty_                           _ExprResultStack_545;                              // 0x3F53(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_6231[0x3];                                     // Fixing Size After Last Property 
	struct FSpatialMath_vector2                  _ExprResult_546;                                   // 0x3F58(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_547;                              // 0x3F68(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_548;                                   // 0x3FB8(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_549;                                   // 0x3FC8(0x10)(HasGetValueTypeHash)
	struct FVerseMovement_move_trigger           _ExprResult_550;                                   // 0x3FD8(0x90)(None)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_551;                              // 0x4068(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_552;                                   // 0x40B8(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_553;                                   // 0x40C8(0x10)(HasGetValueTypeHash)
	struct FVerseMovement_move_trace_trigger_params _ExprResult_554;                                   // 0x40D8(0x38)(NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_555;                              // 0x4110(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_556;                                   // 0x4160(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_557;                                   // 0x4170(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_558;                                   // 0x4180(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_559;                                   // 0x4190(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_560;                                   // 0x41A0(0x10)(HasGetValueTypeHash)
	struct FSpatialMath_vector3                  _ExprResult_561;                                   // 0x41B0(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_562;                              // 0x41C8(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_563;                                   // 0x4218(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_564;                                   // 0x4228(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_565;                                   // 0x4238(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_566;                                   // 0x4248(0x8)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FOptionalProperty_                           __verse_0x00000000__45;                            // 0x4250(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        _ExprResult_567 : 1;                               // Mask: 0x1, PropSize: 0x10x4252(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_3EC : 7;                                    // Fixing Bit-Field Size 
	FOptionalProperty_                           _ExprResultStack_568;                              // 0x4253(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_6233[0x3];                                     // Fixing Size After Last Property 
	TArray<struct FVerseMovement_move_response>  _ExprResult_569;                                   // 0x4258(0x10)(ContainsInstancedReference)
	struct FVerseMovement_move_response          _ExprResult_570;                                   // 0x4268(0x50)(NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_571;                              // 0x42B8(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_572;                                   // 0x4308(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_573;                                   // 0x4318(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_574;                                   // 0x4328(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_575;                                   // 0x4338(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_576;                                   // 0x4348(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_577;                                   // 0x4358(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_578;                                   // 0x4368(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_579;                                   // 0x4378(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_580;                                   // 0x4388(0x10)(HasGetValueTypeHash)
	struct FSpatialMath_vector3                  _ExprResult_581;                                   // 0x4398(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_582;                              // 0x43B0(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_583;                                   // 0x4400(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_584;                                   // 0x4410(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_585;                                   // 0x4420(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_586;                                   // 0x4430(0x8)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FOptionalProperty_                           __verse_0x00000000__47;                            // 0x4438(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        _ExprResult_587 : 1;                               // Mask: 0x1, PropSize: 0x10x443A(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_3ED : 7;                                    // Fixing Bit-Field Size 
	FOptionalProperty_                           _ExprResultStack_588;                              // 0x443B(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_6234[0x3];                                     // Fixing Size After Last Property 
	struct FSpatialMath_vector3                  _ExprResult_589;                                   // 0x4440(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_590;                              // 0x4458(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_591;                                   // 0x44A8(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_592;                                   // 0x44B8(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_593;                                   // 0x44C8(0x10)(HasGetValueTypeHash)
	struct FVerseMovement_move_config_entry      _ExprResult_594;                                   // 0x44D8(0x30)(None)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_595;                              // 0x4508(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_596;                                   // 0x4558(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_597;                                   // 0x4568(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_598;                                   // 0x4578(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_599;                                   // 0x4588(0x10)(HasGetValueTypeHash)
	TArray<struct FVerseMovement_move_trigger>   _ExprResult_600;                                   // 0x4598(0x10)(ContainsInstancedReference)
	struct FVerseMovement_move_trigger           _ExprResult_601;                                   // 0x45A8(0x90)(None)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_602;                              // 0x4638(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_603;                                   // 0x4688(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_604;                                   // 0x4698(0x10)(HasGetValueTypeHash)
	struct FVerseMovement_move_input_trigger_params _ExprResult_605;                                   // 0x46A8(0x38)(None)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_606;                              // 0x46E0(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_607;                                   // 0x4730(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_608;                                   // 0x4740(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_609;                                   // 0x4750(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_610;                                   // 0x4760(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_611;                                   // 0x4770(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_612;                                   // 0x4780(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_613;                                   // 0x4790(0x8)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FOptionalProperty_                           __verse_0x00000000__49;                            // 0x4798(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        _ExprResult_614 : 1;                               // Mask: 0x1, PropSize: 0x10x479A(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_3EE : 7;                                    // Fixing Bit-Field Size 
	FOptionalProperty_                           _ExprResultStack_615;                              // 0x479B(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_6235[0x3];                                     // Fixing Size After Last Property 
	struct FSpatialMath_vector2                  _ExprResult_616;                                   // 0x47A0(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_617;                              // 0x47B0(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_618;                                   // 0x4800(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_619;                                   // 0x4810(0x10)(HasGetValueTypeHash)
	TArray<struct FVerseMovement_move_response>  _ExprResult_620;                                   // 0x4820(0x10)(ContainsInstancedReference)
	struct FVerseMovement_move_response          _ExprResult_621;                                   // 0x4830(0x50)(NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_622;                              // 0x4880(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_623;                                   // 0x48D0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_624;                                   // 0x48E0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_625;                                   // 0x48F0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_626;                                   // 0x4900(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_627;                                   // 0x4910(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_628;                                   // 0x4920(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_629;                                   // 0x4930(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_630;                                   // 0x4940(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_631;                                   // 0x4950(0x10)(HasGetValueTypeHash)
	struct FSpatialMath_vector3                  _ExprResult_632;                                   // 0x4960(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_633;                              // 0x4978(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_634;                                   // 0x49C8(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_635;                                   // 0x49D8(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_636;                                   // 0x49E8(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_637;                                   // 0x49F8(0x8)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FOptionalProperty_                           __verse_0x00000000__51;                            // 0x4A00(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        _ExprResult_638 : 1;                               // Mask: 0x1, PropSize: 0x10x4A02(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_3EF : 7;                                    // Fixing Bit-Field Size 
	FOptionalProperty_                           _ExprResultStack_639;                              // 0x4A03(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_623D[0x3];                                     // Fixing Size After Last Property 
	struct FSpatialMath_vector3                  _ExprResult_640;                                   // 0x4A08(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_641;                              // 0x4A20(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_642;                                   // 0x4A70(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_643;                                   // 0x4A80(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_644;                                   // 0x4A90(0x10)(HasGetValueTypeHash)
	struct FVerseMovement_move_config_entry      _ExprResult_645;                                   // 0x4AA0(0x30)(None)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_646;                              // 0x4AD0(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_647;                                   // 0x4B20(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_648;                                   // 0x4B30(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_649;                                   // 0x4B40(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_650;                                   // 0x4B50(0x10)(HasGetValueTypeHash)
	TArray<struct FVerseMovement_move_trigger>   _ExprResult_651;                                   // 0x4B60(0x10)(ContainsInstancedReference)
	struct FVerseMovement_move_trigger           _ExprResult_652;                                   // 0x4B70(0x90)(None)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_653;                              // 0x4C00(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_654;                                   // 0x4C50(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_655;                                   // 0x4C60(0x10)(HasGetValueTypeHash)
	struct FVerseMovement_move_trace_trigger_params _ExprResult_656;                                   // 0x4C70(0x38)(NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_657;                              // 0x4CA8(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_658;                                   // 0x4CF8(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_659;                                   // 0x4D08(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_660;                                   // 0x4D18(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_661;                                   // 0x4D28(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_662;                                   // 0x4D38(0x10)(HasGetValueTypeHash)
	struct FSpatialMath_vector3                  _ExprResult_663;                                   // 0x4D48(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_664;                              // 0x4D60(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_665;                                   // 0x4DB0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_666;                                   // 0x4DC0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_667;                                   // 0x4DD0(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_668;                                   // 0x4DE0(0x8)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FOptionalProperty_                           __verse_0x00000000__53;                            // 0x4DE8(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        _ExprResult_669 : 1;                               // Mask: 0x1, PropSize: 0x10x4DEA(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_3F0 : 7;                                    // Fixing Bit-Field Size 
	FOptionalProperty_                           _ExprResultStack_670;                              // 0x4DEB(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_6243[0x3];                                     // Fixing Size After Last Property 
	TArray<struct FVerseMovement_move_response>  _ExprResult_671;                                   // 0x4DF0(0x10)(ContainsInstancedReference)
	struct FVerseMovement_move_response          _ExprResult_672;                                   // 0x4E00(0x50)(NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_673;                              // 0x4E50(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_674;                                   // 0x4EA0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_675;                                   // 0x4EB0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_676;                                   // 0x4EC0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_677;                                   // 0x4ED0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_678;                                   // 0x4EE0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_679;                                   // 0x4EF0(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_680;                                   // 0x4F00(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_681;                                   // 0x4F10(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_682;                                   // 0x4F20(0x10)(HasGetValueTypeHash)
	struct FSpatialMath_vector3                  _ExprResult_683;                                   // 0x4F30(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_684;                              // 0x4F48(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_685;                                   // 0x4F98(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_686;                                   // 0x4FA8(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_687;                                   // 0x4FB8(0x10)(HasGetValueTypeHash)
	FOptionalProperty_                           _ExprResult_688;                                   // 0x4FC8(0x8)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FOptionalProperty_                           __verse_0x00000000__55;                            // 0x4FD0(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        _ExprResult_689 : 1;                               // Mask: 0x1, PropSize: 0x10x4FD2(0x1)(NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_3F1 : 7;                                    // Fixing Bit-Field Size 
	FOptionalProperty_                           _ExprResultStack_690;                              // 0x4FD3(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_6244[0x3];                                     // Fixing Size After Last Property 
	struct FSpatialMath_vector3                  _ExprResult_691;                                   // 0x4FD8(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           _ExprResultStack_692;                              // 0x4FF0(0x50)(ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResult_693;                                   // 0x5040(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_694;                                   // 0x5050(0x10)(HasGetValueTypeHash)
	FVerseStringProperty_                        _ExprResult_695;                                   // 0x5060(0x10)(HasGetValueTypeHash)
};

}
}


