#pragma once

// Dumped with Dumper-7!


#include "../SDK.hpp"

namespace SDK
{
namespace Params
{
//---------------------------------------------------------------------------------------------------------------------
// PARAMETERS
//---------------------------------------------------------------------------------------------------------------------

// 0x28 (0x28 - 0x0)
// Function VerseAssets.Assets._L_2fVerse_2eorg_2fAssets_N_RMakeAsset_L_NAssetType_M_N_Kchar_20where_20AssetType_R
struct UAssets__L_2fVerse_2eorg_2fAssets_N_RMakeAsset_L_NAssetType_M_N_Kchar_20where_20AssetType_R_Params
{
public:
	struct FTuple_Lany_M_Kchar_R                 __verse_0xB2CDDD72_Argument;                       // 0x0(0x18)(Parm, HasGetValueTypeHash)
	FVerseDynamicProperty_                       RetVal;                                            // 0x18(0x10)(Parm, OutParm, ReturnParm, HasGetValueTypeHash)
};

// 0x0 (0x0 - 0x0)
// Function VerseAssets.Assets.$InitCDO
struct UAssets__InitCDO_Params
{
public:
};

// 0x2 (0x2 - 0x0)
// Function VerseAssets.Assets_asset._L_2fVerse_2eorg_2fAssets_2fasset_N_RSyncLoad
struct UAssets_asset__L_2fVerse_2eorg_2fAssets_2fasset_N_RSyncLoad_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        RetVal : 1;                                        // Mask: 0x1, PropSize: 0x10x1(0x1)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash)
};

// 0x10 (0x10 - 0x0)
// Function VerseAssets.Assets_asset._L_2fVerse_2eorg_2fAssets_2fasset_N_RGetAsyncLoadEvent
struct UAssets_asset__L_2fVerse_2eorg_2fAssets_2fasset_N_RGetAsyncLoadEvent_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_5E52[0x7];                                     // Fixing Size After Last Property 
	FOptionalProperty_                           RetVal;                                            // 0x8(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};

// 0x18 (0x18 - 0x0)
// Function VerseAssets.Assets_asset._L_2fVerse_2eorg_2fAssets_2fasset_N_RGetAssetType
struct UAssets_asset__L_2fVerse_2eorg_2fAssets_2fasset_N_RGetAssetType_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_5E53[0x7];                                     // Fixing Size After Last Property 
	FOptionalProperty_                           RetVal;                                            // 0x8(0x10)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};

// 0x10 (0x10 - 0x0)
// Function VerseAssets.Assets_asset._L_2fVerse_2eorg_2fAssets_2fasset_N_RAsync__Load
struct UAssets_asset__L_2fVerse_2eorg_2fAssets_2fasset_N_RAsync__Load_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_5E58[0x7];                                     // Fixing Size After Last Property 
	FOptionalProperty_                           RetVal;                                            // 0x8(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};

// 0x0 (0x0 - 0x0)
// Function VerseAssets.Assets_asset.$InitInstance
struct UAssets_asset__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseAssets.Assets_asset.$Block
struct UAssets_asset__Block_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseAssets.Assets_asset.$InitCDO
struct UAssets_asset__InitCDO_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseAssets.Assets_animation.$InitInstance
struct UAssets_animation__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseAssets.Assets_animation.$Block
struct UAssets_animation__Block_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseAssets.Assets_animation.$InitCDO
struct UAssets_animation__InitCDO_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseAssets.Assets_animation_blueprint.$InitInstance
struct UAssets_animation_blueprint__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseAssets.Assets_animation_blueprint.$Block
struct UAssets_animation_blueprint__Block_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseAssets.Assets_animation_blueprint.$InitCDO
struct UAssets_animation_blueprint__InitCDO_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseAssets.Assets_animation_instance.$InitInstance
struct UAssets_animation_instance__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseAssets.Assets_animation_instance.$Block
struct UAssets_animation_instance__Block_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseAssets.Assets_animation_instance.$InitCDO
struct UAssets_animation_instance__InitCDO_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseAssets.Assets_client_asset.$InitInstance
struct UAssets_client_asset__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseAssets.Assets_client_asset.$Block
struct UAssets_client_asset__Block_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseAssets.Assets_client_asset.$InitCDO
struct UAssets_client_asset__InitCDO_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseAssets.Assets_font.$InitInstance
struct UAssets_font__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseAssets.Assets_font.$Block
struct UAssets_font__Block_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseAssets.Assets_font.$InitCDO
struct UAssets_font__InitCDO_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseAssets.Assets_level.$InitInstance
struct UAssets_level__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseAssets.Assets_level.$Block
struct UAssets_level__Block_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseAssets.Assets_level.$InitCDO
struct UAssets_level__InitCDO_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseAssets.Assets_material.$InitInstance
struct UAssets_material__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseAssets.Assets_material.$Block
struct UAssets_material__Block_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseAssets.Assets_material.$InitCDO
struct UAssets_material__InitCDO_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseAssets.Assets_mesh.$InitInstance
struct UAssets_mesh__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseAssets.Assets_mesh.$Block
struct UAssets_mesh__Block_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseAssets.Assets_mesh.$InitCDO
struct UAssets_mesh__InitCDO_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseAssets.Assets_particle_system.$InitInstance
struct UAssets_particle_system__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseAssets.Assets_particle_system.$Block
struct UAssets_particle_system__Block_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseAssets.Assets_particle_system.$InitCDO
struct UAssets_particle_system__InitCDO_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseAssets.Assets_skeletal_mesh.$InitInstance
struct UAssets_skeletal_mesh__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseAssets.Assets_skeletal_mesh.$Block
struct UAssets_skeletal_mesh__Block_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseAssets.Assets_skeletal_mesh.$InitCDO
struct UAssets_skeletal_mesh__InitCDO_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseAssets.Assets_sound.$InitInstance
struct UAssets_sound__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseAssets.Assets_sound.$Block
struct UAssets_sound__Block_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseAssets.Assets_sound.$InitCDO
struct UAssets_sound__InitCDO_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseAssets.Assets_texture_base.$InitInstance
struct UAssets_texture_base__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseAssets.Assets_texture_base.$Block
struct UAssets_texture_base__Block_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseAssets.Assets_texture_base.$InitCDO
struct UAssets_texture_base__InitCDO_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseAssets.Assets_texture.$InitInstance
struct UAssets_texture__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseAssets.Assets_texture.$Block
struct UAssets_texture__Block_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseAssets.Assets_texture.$InitCDO
struct UAssets_texture__InitCDO_Params
{
public:
};

}
}


