#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x0 (0x28 - 0x28)
// VerseClass VerseAIBase.$SolarisSignatureFunctionOuter
class U_SolarisSignatureFunctionOuter : public UObject
{
public:

	static class UClass* StaticClass();
	static class U_SolarisSignatureFunctionOuter* GetDefaultObj();

};

// 0x31 (0x171 - 0x140)
// VerseClass VerseAIBase.task_VerseAIBase_fort_character_actions_interface$AttackObstacle_L_Nfort__obstacle__info_R
class UTask_VerseAIBase_fort_character_actions_interface_AttackObstacle_L_Nfort__obstacle__info_R : public UConcurrency_task
{
public:
	class UVerseAIBase_fort_character_actions_interface* _Self;                                             // 0x140(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVerseAIBase_fort_obstacle_info       __verse_0xB2CDDD72_Argument;                       // 0x148(0x28)(Parm, NoDestructor)
	enum class EVerseAIBase_action_result        _RetVal;                                           // 0x170(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	static class UClass* StaticClass();
	static class UTask_VerseAIBase_fort_character_actions_interface_AttackObstacle_L_Nfort__obstacle__info_R* GetDefaultObj();

	int64 Update();
};

// 0x41 (0x181 - 0x140)
// VerseClass VerseAIBase.task_VerseAIBase_fort_character_actions_interface$AttackThreat_L_Nfort__threat__info_R
class UTask_VerseAIBase_fort_character_actions_interface_AttackThreat_L_Nfort__threat__info_R : public UConcurrency_task
{
public:
	class UVerseAIBase_fort_character_actions_interface* _Self;                                             // 0x140(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FAI_fort_threat_info                  __verse_0xB2CDDD72_Argument;                       // 0x148(0x38)(Parm, NoDestructor)
	enum class EVerseAIBase_action_result        _RetVal;                                           // 0x180(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	static class UClass* StaticClass();
	static class UTask_VerseAIBase_fort_character_actions_interface_AttackThreat_L_Nfort__threat__info_R* GetDefaultObj();

	int64 Update();
};

// 0x31 (0x171 - 0x140)
// VerseClass VerseAIBase.task_VerseAIBase_fort_character_actions_interface$LootObject_L_Nfort__loot__info_R
class UTask_VerseAIBase_fort_character_actions_interface_LootObject_L_Nfort__loot__info_R : public UConcurrency_task
{
public:
	class UVerseAIBase_fort_character_actions_interface* _Self;                                             // 0x140(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVerseAIBase_fort_loot_info           __verse_0xB2CDDD72_Argument;                       // 0x148(0x28)(Parm, NoDestructor)
	enum class EVerseAIBase_action_result        _RetVal;                                           // 0x170(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	static class UClass* StaticClass();
	static class UTask_VerseAIBase_fort_character_actions_interface_LootObject_L_Nfort__loot__info_R* GetDefaultObj();

	int64 Update();
};

// 0xA (0x14A - 0x140)
// VerseClass VerseAIBase.task_VerseAIBase_fort_character_actions_interface$PlayRandomEmote
class UTask_VerseAIBase_fort_character_actions_interface_PlayRandomEmote : public UConcurrency_task
{
public:
	class UVerseAIBase_fort_character_actions_interface* _Self;                                             // 0x140(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x148(0x1)(Parm, HasGetValueTypeHash)
	enum class EVerseAIBase_action_result        _RetVal;                                           // 0x149(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	static class UClass* StaticClass();
	static class UTask_VerseAIBase_fort_character_actions_interface_PlayRandomEmote* GetDefaultObj();

	int64 Update();
};

// 0x11 (0x151 - 0x140)
// VerseClass VerseAIBase.task_VerseAIBase_fort_character_actions_interface$Revive_L_Nagent_R
class UTask_VerseAIBase_fort_character_actions_interface_Revive_L_Nagent_R : public UConcurrency_task
{
public:
	class UVerseAIBase_fort_character_actions_interface* _Self;                                             // 0x140(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USimulation_agent*                     __verse_0xB2CDDD72_Argument;                       // 0x148(0x8)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	enum class EVerseAIBase_fallible_action_result _RetVal;                                           // 0x150(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	static class UClass* StaticClass();
	static class UTask_VerseAIBase_fort_character_actions_interface_Revive_L_Nagent_R* GetDefaultObj();

	int64 Update();
};

// 0xA (0x14A - 0x140)
// VerseClass VerseAIBase.task_VerseAIBase_fort_character_movement_interface$Crouch
class UTask_VerseAIBase_fort_character_movement_interface_Crouch : public UConcurrency_task
{
public:
	class UVerseAIBase_fort_character_movement_interface* _Self;                                             // 0x140(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x148(0x1)(Parm, HasGetValueTypeHash)
	enum class EVerseAIBase_fallible_action_result _RetVal;                                           // 0x149(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	static class UClass* StaticClass();
	static class UTask_VerseAIBase_fort_character_movement_interface_Crouch* GetDefaultObj();

	int64 Update();
};

// 0xA (0x14A - 0x140)
// VerseClass VerseAIBase.task_VerseAIBase_fort_character_movement_interface$Jump
class UTask_VerseAIBase_fort_character_movement_interface_Jump : public UConcurrency_task
{
public:
	class UVerseAIBase_fort_character_movement_interface* _Self;                                             // 0x140(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x148(0x1)(Parm, HasGetValueTypeHash)
	enum class EVerseAIBase_action_result        _RetVal;                                           // 0x149(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	static class UClass* StaticClass();
	static class UTask_VerseAIBase_fort_character_movement_interface_Jump* GetDefaultObj();

	int64 Update();
};

// 0xA (0x14A - 0x140)
// VerseClass VerseAIBase.task_VerseAIBase_fort_character_movement_interface$Slide
class UTask_VerseAIBase_fort_character_movement_interface_Slide : public UConcurrency_task
{
public:
	class UVerseAIBase_fort_character_movement_interface* _Self;                                             // 0x140(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x148(0x1)(Parm, HasGetValueTypeHash)
	enum class EVerseAIBase_action_result        _RetVal;                                           // 0x149(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	static class UClass* StaticClass();
	static class UTask_VerseAIBase_fort_character_movement_interface_Slide* GetDefaultObj();

	int64 Update();
};

// 0xA (0x14A - 0x140)
// VerseClass VerseAIBase.task_VerseAIBase_fort_character_movement_interface$Sprint
class UTask_VerseAIBase_fort_character_movement_interface_Sprint : public UConcurrency_task
{
public:
	class UVerseAIBase_fort_character_movement_interface* _Self;                                             // 0x140(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x148(0x1)(Parm, HasGetValueTypeHash)
	enum class EVerseAIBase_action_result        _RetVal;                                           // 0x149(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	static class UClass* StaticClass();
	static class UTask_VerseAIBase_fort_character_movement_interface_Sprint* GetDefaultObj();

	int64 Update();
};

// 0xA (0x14A - 0x140)
// VerseClass VerseAIBase.task_VerseAIBase_fort_character_movement_interface$TacticalSprint
class UTask_VerseAIBase_fort_character_movement_interface_TacticalSprint : public UConcurrency_task
{
public:
	class UVerseAIBase_fort_character_movement_interface* _Self;                                             // 0x140(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x148(0x1)(Parm, HasGetValueTypeHash)
	enum class EVerseAIBase_action_result        _RetVal;                                           // 0x149(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	static class UClass* StaticClass();
	static class UTask_VerseAIBase_fort_character_movement_interface_TacticalSprint* GetDefaultObj();

	int64 Update();
};

// 0xA (0x14A - 0x140)
// VerseClass VerseAIBase.task_VerseAIBase_fort_character_movement_interface$Walk
class UTask_VerseAIBase_fort_character_movement_interface_Walk : public UConcurrency_task
{
public:
	class UVerseAIBase_fort_character_movement_interface* _Self;                                             // 0x140(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x148(0x1)(Parm, HasGetValueTypeHash)
	enum class EVerseAIBase_action_result        _RetVal;                                           // 0x149(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	static class UClass* StaticClass();
	static class UTask_VerseAIBase_fort_character_movement_interface_Walk* GetDefaultObj();

	int64 Update();
};

// 0xA (0x14A - 0x140)
// VerseClass VerseAIBase.task_VerseAIBase_fort_navigatable$MoveInRangeToAttack
class UTask_VerseAIBase_fort_navigatable_MoveInRangeToAttack : public UConcurrency_task
{
public:
	class UVerseAIBase_fort_navigatable*         _Self;                                             // 0x140(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x148(0x1)(Parm, HasGetValueTypeHash)
	enum class EVerseAIBase_action_result        _RetVal;                                           // 0x149(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	static class UClass* StaticClass();
	static class UTask_VerseAIBase_fort_navigatable_MoveInRangeToAttack* GetDefaultObj();

	int64 Update();
};

// 0xA (0x14A - 0x140)
// VerseClass VerseAIBase.task_VerseAIBase_fort_navigatable$RoamAround
class UTask_VerseAIBase_fort_navigatable_RoamAround : public UConcurrency_task
{
public:
	class UVerseAIBase_fort_navigatable*         _Self;                                             // 0x140(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x148(0x1)(Parm, HasGetValueTypeHash)
	enum class EAI_navigation_result             _RetVal;                                           // 0x149(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	static class UClass* StaticClass();
	static class UTask_VerseAIBase_fort_navigatable_RoamAround* GetDefaultObj();

	int64 Update();
};

// 0x0 (0x28 - 0x28)
// VerseClass VerseAIBase.VerseAIBase
class UVerseAIBase : public UObject
{
public:

	static class UClass* StaticClass();
	static class UVerseAIBase* GetDefaultObj();

	FOptionalProperty_ _L_2fFortnite_2ecom_2fAI_2fVerseAIBase_N_Roperator_U_2eGetFortWeaponActions_U_L_Nfort__character_M_Ntuple_L_R_M_Ntuple_L_R_R(const struct FTuple_Lfort__character_Mtuple_L_R_Mtuple_L_R_R& __verse_0xB2CDDD72_Argument);
