#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// ENUMS
//---------------------------------------------------------------------------------------------------------------------


//---------------------------------------------------------------------------------------------------------------------
// STRUCTS
//---------------------------------------------------------------------------------------------------------------------

// 0x960 (0x960 - 0x0)
// UserDefinedStruct WindGustParamsStruct.WindGustParamsStruct
struct FWindGustParamsStruct
{
public:
	struct FWindGustSettingStruct                Skydive_GoingUp_28_C026BDA74BFBABA6672DFE8FFDAAFC1B; // 0x0(0x78)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FWindGustSettingStruct                Skydive_FloatingDown_29_2CBF3D3F421785F8994502931454A81F; // 0x78(0x78)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FWindGustSettingStruct                Skydive_DivingDown_30_EC7BEC4D406A8A98E60D7B9374C5E457; // 0xF0(0x78)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FWindGustSettingStruct                Skydive_Parachuting_31_A88C4A0A407F497561D31287CB20250F; // 0x168(0x78)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FWindGustSettingStruct                OnGround_Standing_32_267DB1464D0D3A29D99E94ADFCB4AFEC; // 0x1E0(0x78)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FWindGustSettingStruct                OnGround_Moving_33_807A66B64D7B3B2FCF080B833B8A6254; // 0x258(0x78)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FWindGustSettingStruct                OnGround_Crouch_Moving_34_CE0B8BFB4E3417C0F790F7AE38DD7735; // 0x2D0(0x78)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FWindGustSettingStruct                EmoteOrMelee_35_CFCF66B5492987CBD638EC98EB34D572;  // 0x348(0x78)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FWindGustSettingStruct                Swimming_36_33CE87CE4D4F712B1384E29115845962;      // 0x3C0(0x78)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FWindGustSettingStruct                Front_End_37_C7A4562A48E9BC9B4CD34D963CFC6490;     // 0x438(0x78)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FWindGustSettingStruct                DBNO_41_0C046BF1406AB4B752DB3A99949FE3A3;          // 0x4B0(0x78)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FWindGustSettingStruct                DBNO_Carried_42_3E9FADC247359FEE88C7B4A3453449E6;  // 0x528(0x78)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FWindGustSettingStruct                OnGround_Falling_46_2CC5CD2149D12B7C53D91E8D6AA90C03; // 0x5A0(0x78)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FWindGustSettingStruct                Ziplining_47_B8BBEA804F8C515EA80FE7897BB99CF6;     // 0x618(0x78)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FWindGustSettingStruct                Skydive_Surfing_50_2B64886E4E6F0E8CFC180E81FDF37F62; // 0x690(0x78)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FWindGustSettingStruct                Riding_Standing_55_206A781845EAC0A66D2BBC8981041DBD; // 0x708(0x78)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FWindGustSettingStruct                Riding_Moving_56_963FD3424B0D070C81120599A5AED02A; // 0x780(0x78)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FWindGustSettingStruct                Riding_Moving_Targeting_59_93868B48485365007E3BD8BD8A527B39; // 0x7F8(0x78)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FWindGustSettingStruct                Tactical_Sprint_58_7E4BD4244308EE1199AA48ACF8871E68; // 0x870(0x78)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FWindGustSettingStruct                Rail_Grinding_62_FF88FD5F4A9AB308E2F095B9F0657D82; // 0x8E8(0x78)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}


