#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x138 (0x878 - 0x740)
// BlueprintGeneratedClass BP_PG_Game_Character.BP_PG_Game_Character_C
class UBP_PG_Game_Character_C : public UPG_Game_Character
{
public:
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0x740(0x8)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                  SM_Chr_Attach_Patch_Squad_03;                      // 0x748(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                  SM_Item_Crowbar_01;                                // 0x750(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                  SM_Item_Pencil_01;                                 // 0x758(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                  Equipment_PouchB_01;                               // 0x760(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                  Equipment_Glowstick_03;                            // 0x768(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                  Equipment_PouchM_01;                               // 0x770(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                  Equipment_PouchM_02;                               // 0x778(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                  Equipment_PouchM_04;                               // 0x780(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                  Equipment_Glowstick_01;                            // 0x788(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                  Equipment_Glowstick_02;                            // 0x790(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                  Equipment_PouchM_03;                               // 0x798(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                  Equipment_Radio_02;                                // 0x7A0(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                  Equipment_Radio_01;                                // 0x7A8(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                  Equipment_Pouch_Mag_04;                            // 0x7B0(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                  Equipment_PouchM_07;                               // 0x7B8(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                  Equipment_TactFlashlight_01;                       // 0x7C0(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                  Equipment_Grenade_Flash_01;                        // 0x7C8(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                  Equipment_Grenade_Smoke_01;                        // 0x7D0(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                  Equipment_Pouch_Grenade_03;                        // 0x7D8(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                  Equipment_Pouch_Grenade_04;                        // 0x7E0(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                  Equipment_Scissors_01;                             // 0x7E8(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                  Equipment_PouchM_06;                               // 0x7F0(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                  Equipment_PouchM_05;                               // 0x7F8(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                  Equipment_Pouch_Grenade_02;                        // 0x800(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                  Equipment_Pouch_Grenade_01;                        // 0x808(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                  Equipment_Pouch_Mag_01;                            // 0x810(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                  Equipment_Pouch_Mag_02;                            // 0x818(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                  Equipment_Pouch_Mag_03;                            // 0x820(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                  Equipment_Belt;                                    // 0x828(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                  Holster_mesh;                                      // 0x830(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                       Arrow1;                                            // 0x838(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                        Timeline_NeutralizationVignetteImpact_Aplha_C3DAEC164EEEDF0B1E076F90BD0F5BC3; // 0x840(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class ETimelineDirection                Timeline_NeutralizationVignetteImpact__Direction_C3DAEC164EEEDF0B1E076F90BD0F5BC3; // 0x844(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_1D69[0x3];                                     // Fixing Size After Last Property 
	class UTimelineComponent*                    Timeline_NeutralizationVignetteImpact;             // 0x848(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                        Timeline_PostProcessScopeBlurWeight_Alpha_3680AFA946185937314F8B81F52A2B4F; // 0x850(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class ETimelineDirection                Timeline_PostProcessScopeBlurWeight__Direction_3680AFA946185937314F8B81F52A2B4F; // 0x854(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_1D6C[0x3];                                     // Fixing Size After Last Property 
	class UTimelineComponent*                    Timeline_PostProcessScopeBlurWeight;               // 0x858(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*              MI_ScopeBlur;                                      // 0x860(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*              MI_GunBlur;                                        // 0x868(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	double                                       SaveNeutralizationFire;                            // 0x870(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)

	static class UClass* StaticClass();
	static class UBP_PG_Game_Character_C* GetDefaultObj();

	void SetCorrectiveFovMaterialImplementation(bool UseFovMaterial, bool Temp_bool_Variable, int32 CallFunc_GetMaterialIndex_ReturnValue, class UMaterialInterface* CallFunc_GetMaterial_ReturnValue, class UMaterialInterface* CallFunc_GetMaterial_ReturnValue_1, class UMaterialInterface* K2Node_Select_Default);
	void SetVisibleMarkerByDistance(class UCharacter* CallFunc_GetPlayerCharacter_ReturnValue, bool CallFunc_IsValid_ReturnValue, class UCharacter* CallFunc_GetPlayerCharacter_ReturnValue_1, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue_1, const struct FVector& CallFunc_Subtract_VectorVector_ReturnValue, double CallFunc_VSize_ReturnValue, double CallFunc_MapRangeClamped_ReturnValue, const struct FVector2D& CallFunc_MakeVector2D_ReturnValue);
	void OnAiming(class UItem_Module_Optic* Optic, class UItem_Module_Optic* L_Optic, double Temp_real_Variable, double Temp_real_Variable_1, bool Temp_bool_Variable, double Temp_real_Variable_2, double Temp_real_Variable_3, bool CallFunc_IsValid_ReturnValue, bool Temp_bool_Variable_1, bool CallFunc_Greater_DoubleDouble_ReturnValue, bool CallFunc_IsValid_ReturnValue_1, bool CallFunc_IsAiming_ReturnValue, bool CallFunc_BooleanAND_ReturnValue, class UMaterialInstanceDynamic* CallFunc_CreateDynamicMaterialInstance_ReturnValue, enum class ENetRole CallFunc_GetLocalRole_ReturnValue, bool CallFunc_EqualEqual_ByteByte_ReturnValue, bool CallFunc_IsAiming_ReturnValue_1, double K2Node_Select_Default, bool CallFunc_IsAiming_ReturnValue_2, double K2Node_Select_Default_1, double CallFunc_Greater_DoubleDouble_A_ImplicitCast, float CallFunc_SetScalarParameterValue_Value_ImplicitCast, float CallFunc_SetScalarParameterValue_Value_ImplicitCast_1);
	void SetPlayerLooksOverride(class UPG_Game_Character* Character, bool IsLooks, bool L_IsLooks, class UPG_Game_Character* L_Character, bool Temp_bool_Variable, int32 Temp_int_Variable, int32 Temp_int_Variable_1, int32 Temp_int_Array_Index_Variable, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, class UPlayerController* CallFunc_GetPlayerController_ReturnValue, class UBP_PG_PlayerState_Game_C* K2Node_DynamicCast_AsBP_PG_Player_State_Game, bool K2Node_DynamicCast_bSuccess, enum class ETeam CallFunc_GetTeam_ReturnValue, enum class ETeam CallFunc_GetTeam_ReturnValue_1, bool CallFunc_EqualEqual_ByteByte_ReturnValue, class UPG_PlayerState_Game* CallFunc_Array_Get_Item, bool CallFunc_EqualEqual_ObjectObject_ReturnValue, int32 CallFunc_Array_Length_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue, int32 K2Node_Select_Default, class UUserWidget* CallFunc_GetWidget_ReturnValue, class UUI_PlayerMarker_C* K2Node_DynamicCast_AsUI_Player_Marker, bool K2Node_DynamicCast_bSuccess_1, enum class ETeam CallFunc_GetTeam_ReturnValue_2, enum class ETeam CallFunc_GetTeam_ReturnValue_3, bool CallFunc_NotEqual_ByteByte_ReturnValue, bool CallFunc_BooleanAND_ReturnValue, bool CallFunc_BooleanAND_ReturnValue_1);
	void UserConstructionScript(class UMaterialInstanceDynamic* CallFunc_CreateDynamicMaterialInstance_ReturnValue);
	void Timeline_NeutralizationVignetteImpact__FinishedFunc();
	void Timeline_NeutralizationVignetteImpact__UpdateFunc();
	void Timeline_PostProcessScopeBlurWeight__FinishedFunc();
	void Timeline_PostProcessScopeBlurWeight__UpdateFunc();
	void BndEvt__BP_PG_Character_WeaponComponent_K2Node_ComponentBoundEvent_0_OnAimingDelegate__DelegateSignature(class UItem_Module_Optic* OpticItem);
	void OnIsAlive_Event();
	void SetPlayerLooks(class UPG_Game_Character* Character, bool bIsLooks);
	void CameraNeutralizationEffectEvent(float Damage);
	void EventTakeDamage(struct FVector& Origin);
	void Respawn();
	void HitAtProtectedCharacter();
	void DeathEvent(class UPG_PlayerState_Game* Killer, enum class EPlayerDeathType DeathType);
	void OnJumped();
	void SetCorrectiveFovMaterial(bool UseFovMaterial);
	void ReceiveBeginPlay();
	void ExecuteUbergraph_BP_PG_Game_Character(int32 EntryPoint, class UPlayerController* CallFunc_GetPlayerController_ReturnValue, class UPlayerController* CallFunc_GetPlayerController_ReturnValue_1, class UUI_HitIndicator_C* CallFunc_Create_ReturnValue, class UItem_Module_Optic* K2Node_ComponentBoundEvent_OpticItem, class UPG_Game_Character* K2Node_Event_character, bool K2Node_Event_bIsLooks, class UUserWidget* CallFunc_GetWidget_ReturnValue, class UUI_PlayerMarker_C* K2Node_DynamicCast_AsUI_Player_Marker, bool K2Node_DynamicCast_bSuccess, class UUserWidget* CallFunc_GetWidget_ReturnValue_1, class UUI_PlayerMarker_C* K2Node_DynamicCast_AsUI_Player_Marker_1, bool K2Node_DynamicCast_bSuccess_1, float CallFunc_GetNeutralizationVignetteImpact_ReturnValue, class UUMGSequencePlayer* CallFunc_PlayAnimationForward_ReturnValue, float CallFunc_GetNeutralizationVignetteImpact_ReturnValue_1, float CallFunc_GetNeutralizationVignetteImpact_ReturnValue_2, double CallFunc_Multiply_DoubleDouble_ReturnValue, float CallFunc_GetNeutralizationVignetteImpact_ReturnValue_3, double CallFunc_Add_DoubleDouble_ReturnValue, float CallFunc_GetNeutralizationVignetteImpact_ReturnValue_4, double CallFunc_Multiply_DoubleDouble_ReturnValue_1, class UPlayerController* CallFunc_GetPlayerController_ReturnValue_2, class UBP_PG_PlayerController_Game_C* K2Node_DynamicCast_AsBP_PG_Player_Controller_Game, bool K2Node_DynamicCast_bSuccess_2, class UBP_PG_PlayerState_Game_C* K2Node_DynamicCast_AsBP_PG_Player_State_Game, bool K2Node_DynamicCast_bSuccess_3, bool CallFunc_IsLocallyControlled_ReturnValue, class UPlayerController* CallFunc_GetPlayerController_ReturnValue_3, float K2Node_Event_damage, class UUI_KillCam_C* CallFunc_Create_ReturnValue_1, double CallFunc_MapRangeClamped_ReturnValue, double CallFunc_Add_DoubleDouble_ReturnValue_1, const struct FVector& K2Node_Event_origin, double CallFunc_FMin_ReturnValue, class UPG_PlayerState_Game* K2Node_Event_killer, enum class EPlayerDeathType K2Node_Event_deathType, bool CallFunc_NotEqual_ObjectObject_ReturnValue, bool CallFunc_BooleanAND_ReturnValue, class UAnimInstance* CallFunc_GetAnimInstance_ReturnValue, bool CallFunc_IsDedicatedServer_ReturnValue, class UABP_CharacterPG_FP_C* K2Node_DynamicCast_AsABP_Character_PG_FP, bool K2Node_DynamicCast_bSuccess_4, bool CallFunc_Not_PreBool_ReturnValue, bool K2Node_Event_useFovMaterial, bool CallFunc_IsValid_ReturnValue, bool CallFunc_IsAiming_ReturnValue, enum class ENetRole CallFunc_GetLocalRole_ReturnValue, bool CallFunc_EqualEqual_ByteByte_ReturnValue, const struct FTransform& CallFunc_MakeTransform_ReturnValue, class USkeletalMeshComponent* CallFunc_AddComponent_ReturnValue, bool CallFunc_K2_AttachToComponent_ReturnValue, bool CallFunc_EqualEqual_ByteByte_ReturnValue_1, bool CallFunc_IsDedicatedServer_ReturnValue_1, bool CallFunc_IsDedicatedServer_ReturnValue_2, bool CallFunc_Not_PreBool_ReturnValue_1, bool CallFunc_Not_PreBool_ReturnValue_2, bool CallFunc_IsDedicatedServer_ReturnValue_3, bool CallFunc_IsDedicatedServer_ReturnValue_4, bool CallFunc_Not_PreBool_ReturnValue_3, bool CallFunc_Not_PreBool_ReturnValue_4, bool CallFunc_IsDedicatedServer_ReturnValue_5, bool CallFunc_Not_PreBool_ReturnValue_5, bool CallFunc_IsDedicatedServer_ReturnValue_6, class UCharacter* CallFunc_GetPlayerCharacter_ReturnValue, bool CallFunc_IsValid_ReturnValue_1, class UPlayerController* CallFunc_GetPlayerController_ReturnValue_4, enum class ETeam CallFunc_GetTeam_ReturnValue, class UBP_PG_PlayerState_Game_C* K2Node_DynamicCast_AsBP_PG_Player_State_Game_1, bool K2Node_DynamicCast_bSuccess_5, bool CallFunc_NotEqual_ByteByte_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue_6, bool CallFunc_IsLocallyControlled_ReturnValue_1, class UCharacter* CallFunc_GetPlayerCharacter_ReturnValue_1, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue_1, const struct FVector& CallFunc_Subtract_VectorVector_ReturnValue, double CallFunc_VSize_ReturnValue, class UTask_Character_SetupByTeam_C* CallFunc_CreateAction_ReturnValue, bool CallFunc_Less_DoubleDouble_ReturnValue, bool CallFunc_BooleanAND_ReturnValue_1, class UUserWidget* CallFunc_GetWidget_ReturnValue_2, class UUI_PlayerMarker_C* K2Node_DynamicCast_AsUI_Player_Marker_2, bool K2Node_DynamicCast_bSuccess_6, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate, class UUMGSequencePlayer* CallFunc_PlayAnimationForward_ReturnValue_1, class UUserWidget* CallFunc_GetWidget_ReturnValue_3, class UUI_PlayerMarker_C* K2Node_DynamicCast_AsUI_Player_Marker_3, bool K2Node_DynamicCast_bSuccess_7, double CallFunc_Lerp_ReturnValue, enum class ENetRole CallFunc_GetLocalRole_ReturnValue_1, class UUMGSequencePlayer* CallFunc_PlayAnimationReverse_ReturnValue, bool CallFunc_EqualEqual_ByteByte_ReturnValue_2, class UBP_PG_PlayerState_Game_C* K2Node_DynamicCast_AsBP_PG_Player_State_Game_2, bool K2Node_DynamicCast_bSuccess_8, class UPlayerController* CallFunc_GetPlayerController_ReturnValue_5, class UBP_PG_PlayerState_Game_C* K2Node_DynamicCast_AsBP_PG_Player_State_Game_3, bool K2Node_DynamicCast_bSuccess_9, bool CallFunc_EqualEqual_ByteByte_ReturnValue_3, double CallFunc_Add_DoubleDouble_A_ImplicitCast, double CallFunc_Multiply_DoubleDouble_A_ImplicitCast, double K2Node_VariableSet_SaveNeutralizationFire_ImplicitCast, float K2Node_SetFieldsInStruct_SceneFringeIntensity_ImplicitCast, double CallFunc_Multiply_DoubleDouble_A_ImplicitCast_1, float K2Node_SetFieldsInStruct_SceneFringeIntensity_ImplicitCast_1, double CallFunc_MapRangeClamped_Value_ImplicitCast, float CallFunc_SetNeutralizationVignetteImpact_newNeutralizationVignetteImpact_ImplicitCast, double CallFunc_Lerp_Alpha_ImplicitCast, float CallFunc_SetNeutralizationVignetteImpact_newNeutralizationVignetteImpact_ImplicitCast_1);
};

}


