#pragma once

// Dumped with Dumper-7!


#include "../SDK.hpp"

namespace SDK
{
namespace Params
{
//---------------------------------------------------------------------------------------------------------------------
// PARAMETERS
//---------------------------------------------------------------------------------------------------------------------

// 0x49 (0x49 - 0x0)
// Function UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage.UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C.OnPlayFabResponse_FE91C55C4E378CD7857BB59E2178DE86
struct UUI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_OnPlayFabResponse_FE91C55C4E378CD7857BB59E2178DE86_Params
{
public:
	struct FPlayFabBaseModel                     Response;                                          // 0x0(0x40)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UObject*                               CustomData;                                        // 0x40(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                         Successful;                                        // 0x48(0x1)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x49 (0x49 - 0x0)
// Function UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage.UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C.OnPlayFabResponse_5DA0BE294571A5A8AD9BC6B9466BD4AE
struct UUI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_OnPlayFabResponse_5DA0BE294571A5A8AD9BC6B9466BD4AE_Params
{
public:
	struct FPlayFabBaseModel                     Response;                                          // 0x0(0x40)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UObject*                               CustomData;                                        // 0x40(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                         Successful;                                        // 0x48(0x1)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x49 (0x49 - 0x0)
// Function UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage.UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C.OnPlayFabResponse_2A0A1F3C4F8BCDA832A91C8AD07F23E3
struct UUI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_OnPlayFabResponse_2A0A1F3C4F8BCDA832A91C8AD07F23E3_Params
{
public:
	struct FPlayFabBaseModel                     Response;                                          // 0x0(0x40)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UObject*                               CustomData;                                        // 0x40(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                         Successful;                                        // 0x48(0x1)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x49 (0x49 - 0x0)
// Function UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage.UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C.OnPlayFabResponse_6695E14941FF59ADB00A03832CAD2A63
struct UUI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_OnPlayFabResponse_6695E14941FF59ADB00A03832CAD2A63_Params
{
public:
	struct FPlayFabBaseModel                     Response;                                          // 0x0(0x40)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UObject*                               CustomData;                                        // 0x40(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                         Successful;                                        // 0x48(0x1)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x49 (0x49 - 0x0)
// Function UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage.UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C.OnPlayFabResponse_A45D227F4C0154EE73B40998FC922B35
struct UUI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_OnPlayFabResponse_A45D227F4C0154EE73B40998FC922B35_Params
{
public:
	struct FPlayFabBaseModel                     Response;                                          // 0x0(0x40)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UObject*                               CustomData;                                        // 0x40(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                         Successful;                                        // 0x48(0x1)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x0 (0x0 - 0x0)
// Function UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage.UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C.BndEvt__UI_MainMenu_Offers_StarterPack_BuyPage_Button_Close_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature
struct UUI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_BndEvt__UI_MainMenu_Offers_StarterPack_BuyPage_Button_Close_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage.UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C.BndEvt__UI_MainMenu_Offers_StarterPack_BuyPage_Button_Close_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature
struct UUI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_BndEvt__UI_MainMenu_Offers_StarterPack_BuyPage_Button_Close_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage.UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C.BndEvt__UI_MainMenu_Offers_StarterPack_BuyPage_Button_Close_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature
struct UUI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_BndEvt__UI_MainMenu_Offers_StarterPack_BuyPage_Button_Close_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage.UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C.BndEvt__UI_MainMenu_Offers_StarterPack_BuyPage_Button_Details_K2Node_ComponentBoundEvent_3_OnButtonPressedEvent__DelegateSignature
struct UUI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_BndEvt__UI_MainMenu_Offers_StarterPack_BuyPage_Button_Details_K2Node_ComponentBoundEvent_3_OnButtonPressedEvent__DelegateSignature_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage.UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C.BndEvt__UI_MainMenu_Offers_StarterPack_BuyPage_Button_Details_K2Node_ComponentBoundEvent_4_OnButtonHoverEvent__DelegateSignature
struct UUI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_BndEvt__UI_MainMenu_Offers_StarterPack_BuyPage_Button_Details_K2Node_ComponentBoundEvent_4_OnButtonHoverEvent__DelegateSignature_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage.UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C.BndEvt__UI_MainMenu_Offers_StarterPack_BuyPage_Button_Details_K2Node_ComponentBoundEvent_5_OnButtonHoverEvent__DelegateSignature
struct UUI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_BndEvt__UI_MainMenu_Offers_StarterPack_BuyPage_Button_Details_K2Node_ComponentBoundEvent_5_OnButtonHoverEvent__DelegateSignature_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage.UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C.BndEvt__UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_Button_Buy_K2Node_ComponentBoundEvent_6_OnButtonPressedEvent__DelegateSignature
struct UUI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_BndEvt__UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_Button_Buy_K2Node_ComponentBoundEvent_6_OnButtonPressedEvent__DelegateSignature_Params
{
public:
};

// 0x48 (0x48 - 0x0)
// Function UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage.UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C.Purchase_Success
struct UUI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_Purchase_Success_Params
{
public:
	struct FClientStartPurchaseResult            Result;                                            // 0x0(0x40)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UObject*                               CustomData;                                        // 0x40(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

// 0x40 (0x40 - 0x0)
// Function UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage.UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C.Purchase_Failure
struct UUI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_Purchase_Failure_Params
{
public:
	struct FPlayFabError                         Error;                                             // 0x0(0x38)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UObject*                               CustomData;                                        // 0x38(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

// 0x80 (0x80 - 0x0)
// Function UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage.UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C.PayForPurchase_Success
struct UUI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_PayForPurchase_Success_Params
{
public:
	struct FClientPayForPurchaseResult           Result;                                            // 0x0(0x78)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UObject*                               CustomData;                                        // 0x78(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

// 0x40 (0x40 - 0x0)
// Function UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage.UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C.PayForPurchase_Failure
struct UUI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_PayForPurchase_Failure_Params
{
public:
	struct FPlayFabError                         Error;                                             // 0x0(0x38)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UObject*                               CustomData;                                        // 0x38(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

// 0x40 (0x40 - 0x0)
// Function UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage.UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C.ConfirmPurchase_Success
struct UUI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_ConfirmPurchase_Success_Params
{
public:
	struct FClientConfirmPurchaseResult          Result;                                            // 0x0(0x38)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UObject*                               CustomData;                                        // 0x38(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

// 0x40 (0x40 - 0x0)
// Function UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage.UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C.ConfirmPurchase_Failure
struct UUI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_ConfirmPurchase_Failure_Params
{
public:
	struct FPlayFabError                         Error;                                             // 0x0(0x38)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UObject*                               CustomData;                                        // 0x38(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

// 0x20 (0x20 - 0x0)
// Function UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage.UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C.WritePlayerEvent_Success
struct UUI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_WritePlayerEvent_Success_Params
{
public:
	struct FClientWriteEventResponse             Result;                                            // 0x0(0x18)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UObject*                               CustomData;                                        // 0x18(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

// 0x40 (0x40 - 0x0)
// Function UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage.UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C.WritePlayerEvent_Failure
struct UUI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_WritePlayerEvent_Failure_Params
{
public:
	struct FPlayFabError                         Error;                                             // 0x0(0x38)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UObject*                               CustomData;                                        // 0x38(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

// 0x18 (0x18 - 0x0)
// Function UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage.UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C.SetOfferAsPurchased_Success
struct UUI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_SetOfferAsPurchased_Success_Params
{
public:
	struct FClientUpdateUserDataResult           Result;                                            // 0x0(0x10)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	class UObject*                               CustomData;                                        // 0x10(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

// 0x40 (0x40 - 0x0)
// Function UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage.UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C.SetOfferAsPurchased_Failure
struct UUI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_SetOfferAsPurchased_Failure_Params
{
public:
	struct FPlayFabError                         Error;                                             // 0x0(0x38)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UObject*                               CustomData;                                        // 0x38(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

// 0x3C (0x3C - 0x0)
// Function UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage.UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C.Tick
struct UUI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_Tick_Params
{
public:
	struct FGeometry                             MyGeometry;                                        // 0x0(0x38)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                        InDeltaTime;                                       // 0x38(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x0 (0x0 - 0x0)
// Function UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage.UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C.Construct
struct UUI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_Construct_Params
{
public:
};

// 0x20 (0x20 - 0x0)
// Function UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage.UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C.MicroTxnAuthorizationResponse_Event
struct UUI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_MicroTxnAuthorizationResponse_Event_Params
{
public:
	struct FMicroTxnAuthorizationResponse        Data;                                              // 0x0(0x20)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};

// 0x9A4 (0x9A4 - 0x0)
// Function UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage.UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C.ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage
struct UUI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_Params
{
public:
	int32                                        EntryPoint;                                        // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Temp_bool_Variable;                                // 0x4(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2A69[0x3];                                     // Fixing Size After Last Property 
	FDelegateProperty_                           K2Node_CreateDelegate_OutputDelegate;              // 0x8(0x10)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	FDelegateProperty_                           K2Node_CreateDelegate_OutputDelegate_1;            // 0x18(0x10)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPlayFabBaseModel                     K2Node_CustomEvent_response_3;                     // 0x28(0x40)(None)
	class UObject*                               K2Node_CustomEvent_customData_13;                  // 0x68(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                         K2Node_CustomEvent_successful_3;                   // 0x70(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Temp_bool_Variable_1;                              // 0x71(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2A6B[0x6];                                     // Fixing Size After Last Property 
	class UObject*                               Temp_object_Variable;                              // 0x78(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPlayFabBaseModel                     Temp_struct_Variable;                              // 0x80(0x40)(None)
	FDelegateProperty_                           K2Node_CreateDelegate_OutputDelegate_2;            // 0xC0(0x10)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPlayFabBaseModel                     K2Node_CustomEvent_response_2;                     // 0xD0(0x40)(None)
	class UObject*                               K2Node_CustomEvent_customData_12;                  // 0x110(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                         K2Node_CustomEvent_successful_2;                   // 0x118(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Temp_bool_Variable_2;                              // 0x119(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2A6E[0x6];                                     // Fixing Size After Last Property 
	class UObject*                               Temp_object_Variable_1;                            // 0x120(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPlayFabBaseModel                     Temp_struct_Variable_1;                            // 0x128(0x40)(None)
	FDelegateProperty_                           K2Node_CreateDelegate_OutputDelegate_3;            // 0x168(0x10)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	FDelegateProperty_                           K2Node_CreateDelegate_OutputDelegate_4;            // 0x178(0x10)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	FDelegateProperty_                           K2Node_CreateDelegate_OutputDelegate_5;            // 0x188(0x10)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPlayFabBaseModel                     K2Node_CustomEvent_response_1;                     // 0x198(0x40)(None)
	class UObject*                               K2Node_CustomEvent_customData_11;                  // 0x1D8(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                         K2Node_CustomEvent_successful_1;                   // 0x1E0(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Temp_bool_Variable_3;                              // 0x1E1(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2A72[0x6];                                     // Fixing Size After Last Property 
	class UObject*                               Temp_object_Variable_2;                            // 0x1E8(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPlayFabBaseModel                     Temp_struct_Variable_2;                            // 0x1F0(0x40)(None)
	FDelegateProperty_                           K2Node_CreateDelegate_OutputDelegate_6;            // 0x230(0x10)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	FDelegateProperty_                           K2Node_CreateDelegate_OutputDelegate_7;            // 0x240(0x10)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	FDelegateProperty_                           K2Node_CreateDelegate_OutputDelegate_8;            // 0x250(0x10)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPlayFabBaseModel                     K2Node_CustomEvent_response;                       // 0x260(0x40)(None)
	class UObject*                               K2Node_CustomEvent_customData_10;                  // 0x2A0(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                         K2Node_CustomEvent_successful;                     // 0x2A8(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Temp_bool_Variable_4;                              // 0x2A9(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2A76[0x6];                                     // Fixing Size After Last Property 
	class UObject*                               Temp_object_Variable_3;                            // 0x2B0(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPlayFabBaseModel                     Temp_struct_Variable_3;                            // 0x2B8(0x40)(None)
	FDelegateProperty_                           K2Node_CreateDelegate_OutputDelegate_9;            // 0x2F8(0x10)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUser*                                 CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x308(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	FDelegateProperty_                           K2Node_CreateDelegate_OutputDelegate_10;           // 0x310(0x10)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUI_Shop_SteamOverlayIsDisabled_C*     CallFunc_Create_ReturnValue;                       // 0x320(0x8)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	FDelegateProperty_                           K2Node_CreateDelegate_OutputDelegate_11;           // 0x328(0x10)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUI_Shop_MicroTxnError_C*              CallFunc_Create_ReturnValue_1;                     // 0x338(0x8)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUI_Shop_MicroTxnError_C*              CallFunc_Create_ReturnValue_2;                     // 0x340(0x8)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUI_Shop_MicroTxnError_C*              CallFunc_Create_ReturnValue_3;                     // 0x348(0x8)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                        Temp_int_Loop_Counter_Variable;                    // 0x350(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        CallFunc_Add_IntInt_ReturnValue;                   // 0x354(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Temp_bool_True_if_break_was_hit_Variable;          // 0x358(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2A7C[0x3];                                     // Fixing Size After Last Property 
	int32                                        Temp_int_Array_Index_Variable;                     // 0x35C(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         CallFunc_Not_PreBool_ReturnValue;                  // 0x360(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2A7E[0x3];                                     // Fixing Size After Last Property 
	FDelegateProperty_                           K2Node_CreateDelegate_OutputDelegate_12;           // 0x364(0x10)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                         Temp_bool_Variable_5;                              // 0x374(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         CallFunc_Not_PreBool_ReturnValue_1;                // 0x375(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2A81[0x2];                                     // Fixing Size After Last Property 
	class UPlayFabJsonObject*                    CallFunc_ConstructJsonObject_ReturnValue;          // 0x378(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayFabJsonObject*                    K2Node_LowEntry_LocalVariable_Value__Object;       // 0x380(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UPlayFabJsonObject*>            K2Node_MakeArray_Array;                            // 0x388(0x10)(ReferenceParm)
	struct FClientPayForPurchaseRequest          K2Node_MakeStruct_ClientPayForPurchaseRequest;     // 0x398(0x50)(None)
	struct FClientStartPurchaseRequest           K2Node_MakeStruct_ClientStartPurchaseRequest;      // 0x3E8(0x40)(None)
	class UPlayFabClientAPI*                     CallFunc_PayForPurchase_ReturnValue;               // 0x428(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                         CallFunc_IsValid_ReturnValue;                      // 0x430(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2A85[0x3];                                     // Fixing Size After Last Property 
	FDelegateProperty_                           K2Node_CreateDelegate_OutputDelegate_13;           // 0x434(0x10)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2A86[0x4];                                     // Fixing Size After Last Property 
	struct FClientStartPurchaseResult            K2Node_CustomEvent_result_4;                       // 0x448(0x40)(None)
	class UObject*                               K2Node_CustomEvent_customData_9;                   // 0x488(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPlayFabError                         K2Node_CustomEvent_error_4;                        // 0x490(0x38)(None)
	class UObject*                               K2Node_CustomEvent_customData_8;                   // 0x4C8(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FClientPayForPurchaseResult           K2Node_CustomEvent_result_3;                       // 0x4D0(0x78)(None)
	class UObject*                               K2Node_CustomEvent_customData_7;                   // 0x548(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPlayFabError                         K2Node_CustomEvent_error_3;                        // 0x550(0x38)(None)
	class UObject*                               K2Node_CustomEvent_customData_6;                   // 0x588(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FClientConfirmPurchaseResult          K2Node_CustomEvent_result_2;                       // 0x590(0x38)(None)
	class UObject*                               K2Node_CustomEvent_customData_5;                   // 0x5C8(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPlayFabError                         K2Node_CustomEvent_error_2;                        // 0x5D0(0x38)(None)
	class UObject*                               K2Node_CustomEvent_customData_4;                   // 0x608(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayerController*                     CallFunc_GetPlayerController_ReturnValue;          // 0x610(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                         CallFunc_NotEqual_IntInt_ReturnValue;              // 0x618(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2A8B[0x7];                                     // Fixing Size After Last Property 
	class UPG_PlayerState_Menu*                  K2Node_DynamicCast_AsPG_Player_State_Menu;         // 0x620(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                         K2Node_DynamicCast_bSuccess;                       // 0x628(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2A8C[0x3];                                     // Fixing Size After Last Property 
	FDelegateProperty_                           K2Node_CreateDelegate_OutputDelegate_14;           // 0x62C(0x10)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2A8D[0x4];                                     // Fixing Size After Last Property 
	class UPlayFabJsonObject*                    CallFunc_GetPlayerCombinedInfo_ReturnValue;        // 0x640(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayFabClientAPI*                     CallFunc_StartPurchase_ReturnValue;                // 0x648(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayFabJsonObject*                    CallFunc_GetObjectField_ReturnValue;               // 0x650(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_GetNumberField_ReturnValue;               // 0x658(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         CallFunc_IsValid_ReturnValue_1;                    // 0x65C(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2A8F[0x3];                                     // Fixing Size After Last Property 
	double                                       CallFunc_Add_DoubleDouble_ReturnValue;             // 0x660(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPlayFabBaseModel                     Temp_struct_Variable_4;                            // 0x668(0x40)(None)
	struct FClientConfirmPurchaseRequest         K2Node_MakeStruct_ClientConfirmPurchaseRequest;    // 0x6A8(0x20)(None)
	TArray<enum class EModifiedData>             K2Node_MakeArray_Array_1;                          // 0x6C8(0x10)(ConstParm, ReferenceParm)
	class UPlayFabClientAPI*                     CallFunc_ConfirmPurchase_ReturnValue;              // 0x6D8(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                         CallFunc_IsValid_ReturnValue_2;                    // 0x6E0(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2A92[0x7];                                     // Fixing Size After Last Property 
	class UObject*                               Temp_object_Variable_4;                            // 0x6E8(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayerController*                     CallFunc_GetPlayerController_ReturnValue_1;        // 0x6F0(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	enum class EUMGSequencePlayMode              Temp_byte_Variable;                                // 0x6F8(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2A93[0x7];                                     // Fixing Size After Last Property 
	class UBP_PG_PlayerController_Menu_C*        K2Node_DynamicCast_AsBP_PG_Player_Controller_Menu; // 0x700(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                         K2Node_DynamicCast_bSuccess_1;                     // 0x708(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2A95[0x7];                                     // Fixing Size After Last Property 
	struct FClientWriteClientPlayerEventRequest  K2Node_MakeStruct_ClientWriteClientPlayerEventRequest; // 0x710(0x38)(None)
	class UPlayFabClientAPI*                     CallFunc_WritePlayerEvent_ReturnValue;             // 0x748(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                         CallFunc_IsValid_ReturnValue_3;                    // 0x750(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2A96[0x7];                                     // Fixing Size After Last Property 
	struct FClientWriteEventResponse             K2Node_CustomEvent_result_1;                       // 0x758(0x18)(None)
	class UObject*                               K2Node_CustomEvent_customData_3;                   // 0x770(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPlayFabError                         K2Node_CustomEvent_error_1;                        // 0x778(0x38)(None)
	class UObject*                               K2Node_CustomEvent_customData_2;                   // 0x7B0(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FClientUpdateUserDataResult           K2Node_CustomEvent_result;                         // 0x7B8(0x10)(NoDestructor)
	class UObject*                               K2Node_CustomEvent_customData_1;                   // 0x7C8(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPlayFabError                         K2Node_CustomEvent_error;                          // 0x7D0(0x38)(None)
	class UObject*                               K2Node_CustomEvent_customData;                     // 0x808(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayFabJsonObject*                    CallFunc_ConstructJsonObject_ReturnValue_1;        // 0x810(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                         Temp_bool_Variable_6;                              // 0x818(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2A98[0x7];                                     // Fixing Size After Last Property 
	class UPlayFabJsonObject*                    K2Node_LowEntry_LocalVariable_Value__1_Object;     // 0x820(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FClientUpdateUserDataRequest          K2Node_MakeStruct_ClientUpdateUserDataRequest;     // 0x828(0x30)(None)
	class UPlayFabClientAPI*                     CallFunc_UpdateUserData_ReturnValue;               // 0x858(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayerController*                     CallFunc_GetPlayerController_ReturnValue_2;        // 0x860(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_PG_PlayerController_Menu_C*        K2Node_DynamicCast_AsBP_PG_Player_Controller_Menu_1; // 0x868(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                         K2Node_DynamicCast_bSuccess_2;                     // 0x870(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         CallFunc_IsValid_ReturnValue_4;                    // 0x871(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class EUMGSequencePlayMode              Temp_byte_Variable_1;                              // 0x872(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class EUMGSequencePlayMode              K2Node_Select_Default;                             // 0x873(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2A99[0x4];                                     // Fixing Size After Last Property 
	TArray<class UWidget*>                       CallFunc_GetAllChildren_ReturnValue;               // 0x878(0x10)(ReferenceParm, ContainsInstancedReference)
	class UUMGSequencePlayer*                    CallFunc_PlayAnimation_ReturnValue;                // 0x888(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidget*                               CallFunc_Array_Get_Item;                           // 0x890(0x8)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                        CallFunc_Array_Length_ReturnValue;                 // 0x898(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2A9A[0x4];                                     // Fixing Size After Last Property 
	class UUI_MainMenu_Shop_Premium_Offers_BoosterBundle_C* K2Node_DynamicCast_AsUI_Main_Menu_Shop_Premium_Offers_Booster_Bundle; // 0x8A0(0x8)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                         K2Node_DynamicCast_bSuccess_3;                     // 0x8A8(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         CallFunc_Less_IntInt_ReturnValue;                  // 0x8A9(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         CallFunc_BooleanAND_ReturnValue;                   // 0x8AA(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2A9B[0x5];                                     // Fixing Size After Last Property 
	class UClass*                                CallFunc_GetObjectClass_ReturnValue;               // 0x8B0(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                         CallFunc_EqualEqual_ClassClass_ReturnValue;        // 0x8B8(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2A9C[0x7];                                     // Fixing Size After Last Property 
	struct FPlayFabBaseModel                     K2Node_CustomEvent_response_4;                     // 0x8C0(0x40)(None)
	class UObject*                               K2Node_CustomEvent_customData_14;                  // 0x900(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                         K2Node_CustomEvent_successful_4;                   // 0x908(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2A9D[0x3];                                     // Fixing Size After Last Property 
	struct FGeometry                             K2Node_Event_MyGeometry;                           // 0x90C(0x38)(IsPlainOldData, NoDestructor)
	float                                        K2Node_Event_InDeltaTime;                          // 0x944(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FDelegateProperty_                           K2Node_CreateDelegate_OutputDelegate_15;           // 0x948(0x10)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                  CallFunc_GetText_ReturnValue;                      // 0x958(0x18)(None)
	struct FMicroTxnAuthorizationResponse        K2Node_CustomEvent_Data;                           // 0x970(0x20)(ConstParm)
	bool                                         CallFunc_IsOverlayEnabled_ReturnValue;             // 0x990(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2A9E[0x7];                                     // Fixing Size After Last Property 
	double                                       CallFunc_Add_DoubleDouble_A_ImplicitCast;          // 0x998(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_SetNumberField_Number_ImplicitCast;       // 0x9A0(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}
}


