#pragma once

// Dumped with Dumper-7!


#include "../SDK.hpp"

namespace SDK
{
namespace Params
{
//---------------------------------------------------------------------------------------------------------------------
// PARAMETERS
//---------------------------------------------------------------------------------------------------------------------

// 0x0 (0x0 - 0x0)
// Function UI_Shop_WarningNoPC.UI_Shop_WarningNoPC_C.OnSucceed_FA7395AF4FD96A0A881A4EAA2B69E0A2
struct UUI_Shop_WarningNoPC_C_OnSucceed_FA7395AF4FD96A0A881A4EAA2B69E0A2_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function UI_Shop_WarningNoPC.UI_Shop_WarningNoPC_C.BndEvt__UI_WarningNoPC_Button_No_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature
struct UUI_Shop_WarningNoPC_C_BndEvt__UI_WarningNoPC_Button_No_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function UI_Shop_WarningNoPC.UI_Shop_WarningNoPC_C.BndEvt__UI_WarningNoPC_Button_Yes_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature
struct UUI_Shop_WarningNoPC_C_BndEvt__UI_WarningNoPC_Button_Yes_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature_Params
{
public:
};

// 0x1 (0x1 - 0x0)
// Function UI_Shop_WarningNoPC.UI_Shop_WarningNoPC_C.PreConstruct
struct UUI_Shop_WarningNoPC_C_PreConstruct_Params
{
public:
	bool                                         IsDesignTime;                                      // 0x0(0x1)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x58 (0x58 - 0x0)
// Function UI_Shop_WarningNoPC.UI_Shop_WarningNoPC_C.ExecuteUbergraph_UI_Shop_WarningNoPC
struct UUI_Shop_WarningNoPC_C_ExecuteUbergraph_UI_Shop_WarningNoPC_Params
{
public:
	int32                                        EntryPoint;                                        // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FDelegateProperty_                           K2Node_CreateDelegate_OutputDelegate;              // 0x4(0x10)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2B3C[0x4];                                     // Fixing Size After Last Property 
	class UTask_Menu_GeneralMenuScreen_SetActivePage_C* CallFunc_CreateAction_ReturnValue;                 // 0x18(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayerController*                     CallFunc_GetPlayerController_ReturnValue;          // 0x20(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                         K2Node_Event_IsDesignTime;                         // 0x28(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2B40[0x7];                                     // Fixing Size After Last Property 
	class UBP_PG_PlayerController_Menu_C*        K2Node_DynamicCast_AsBP_PG_Player_Controller_Menu; // 0x30(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                         K2Node_DynamicCast_bSuccess;                       // 0x38(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2B44[0x7];                                     // Fixing Size After Last Property 
	class FText                                  CallFunc_Conv_IntToText_ReturnValue;               // 0x40(0x18)(None)
};

// 0x1 (0x1 - 0x0)
// Function UI_Shop_WarningNoPC.UI_Shop_WarningNoPC_C.OnMadeChoice__DelegateSignature
struct UUI_Shop_WarningNoPC_C_OnMadeChoice__DelegateSignature_Params
{
public:
	bool                                         Yes;                                               // 0x0(0x1)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}
}


