#pragma once

// Dumper.

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x338 (0xE60 - 0xB28)
// BlueprintGeneratedClass GA_NPC_Parent.GA_NPC_Parent_C
class UGA_NPC_Parent_C : public UFortGameplayAbility
{
public:
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0xB28(0x8)(ZeroConstructor, Transient, DuplicateTransient)
	class AFortAIPawn*                           NPC_ActivatingFortAIPawn;                          // 0xB30(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	enum class EFortMovementUrgency              NPC_InitialMovementUrgency;                        // 0xB38(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         NPC_DebugAbility;                                  // 0xB39(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_A0A3[0x6];                                     // Fixing Size After Last Property..
	struct FGameplayTagContainer                 NPC_IgnoreDamageAndOnlyDoKnockbackIfTheseAbilitiesAreActive; // 0xB40(0x20)(Edit, BlueprintVisible)
	bool                                         NPC_DebugFreezeFrameEnabled;                       // 0xB60(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         NPC_DebugFreezeFrameOnlyWhenAbilityTargetHit;      // 0xB61(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         NPC_DebugFreezeFrameOnlyWhenWeHaveSomeTarget;      // 0xB62(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         NPC_DamageHitAbilityTargetDuringThisAbilityActivation; // 0xB63(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_A0A4[0x4];                                     // Fixing Size After Last Property..
	TArray<class AActor*>                        NPC_DamageActorsWeHaveHitDuringThisAbilityActivation; // 0xB68(0x10)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	double                                       NPC_CanActivateAbility_MaxTargetZDistanceBelow;    // 0xB78(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       NPC_CanActivateAbility_MaxTargetZDistanceAbove;    // 0xB80(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       NPC_CanActivateAbility_MaxTargetZDistanceAbove_ForIntentionalFailedAttack; // 0xB88(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                        BuildingTargetingHitActors;                        // 0xB90(0x10)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	struct FGameplayTagContainer                 TC_NPC_FrustrationTagsToClearForGoals;             // 0xBA0(0x20)(Edit, BlueprintVisible)
	enum class Enum_NPC_AlertLevel               NPC_AlertLevelGoalIsFortPawn;                      // 0xBC0(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class Enum_NPC_AlertLevel               NPC_AlertLevelGoalIsOther;                         // 0xBC1(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class Enum_NPC_AlertLevel               NPC_AlertLevelGoalIsNotValid;                      // 0xBC2(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_A0A5[0x5];                                     // Fixing Size After Last Property..
	struct FScalableFloat                        NPC_DamageKnockbackVelocityHF;                     // 0xBC8(0x28)(Edit, BlueprintVisible)
	struct FScalableFloat                        NPC_DamageKnockbackVerticalAngleHF;                // 0xBF0(0x28)(Edit, BlueprintVisible)
	struct FScalableFloat                        NPC_DamageKnockbackMinimumYawValueHF;              // 0xC18(0x28)(Edit, BlueprintVisible)
	struct FScalableFloat                        NPC_DamageCanAttackDBNOPlayersHF;                  // 0xC40(0x28)(Edit, BlueprintVisible)
	struct FScalableFloat                        NPC_DamageKnockbackVelocityVehicleHF;              // 0xC68(0x28)(Edit, BlueprintVisible)
	struct FScalableFloat                        NPC_DamageKnockbackVerticalAngleVehicleHF;         // 0xC90(0x28)(Edit, BlueprintVisible)
	struct FScalableFloat                        NPC_DamageKnockbackMinimumYawValueVehicleHF;       // 0xCB8(0x28)(Edit, BlueprintVisible)
	struct FScalableFloat                        NPC_DamageChanceToEjectFromVehicleHF;              // 0xCE0(0x28)(Edit, BlueprintVisible)
	struct FGameplayTag                          DestroyBuildingGC;                                 // 0xD08(0x4)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_A0A6[0x4];                                     // Fixing Size After Last Property..
	class UClass*                                DestroyBuildingGE;                                 // 0xD10(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                 TC_NPC_FrustrationTagsToClearForMovement;          // 0xD18(0x20)(Edit, BlueprintVisible)
	struct FGameplayTag                          TC_NPC_FrustrationBuildDueToGoal;                  // 0xD38(0x4)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                          TC_NPC_FrustrationBuildDueToMovement;              // 0xD3C(0x4)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagQuery                     TQ_NPC_RequirementsToBuildFrustrationDueToGoal;    // 0xD40(0x48)(Edit, BlueprintVisible)
	struct FGameplayTagQuery                     TQ_NPC_RequirementsToBuildFrustrationDueToMovement; // 0xD88(0x48)(Edit, BlueprintVisible)
	struct FScalableFloat                        NPC_BodyBumpBuildingsWhenBuildingMovementFrustrationHF; // 0xDD0(0x28)(Edit, BlueprintVisible)
	struct FScalableFloat                        NPC_FrustrationBodyBumpOnlyDestroyPlayerBuildingsHF; // 0xDF8(0x28)(Edit, BlueprintVisible)
	struct FGameplayTag                          TC_NPC_EffectContainer_BodyBumpBuildingsWhenBuildingMovementFrustration; // 0xE20(0x4)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_A0A7[0x4];                                     // Fixing Size After Last Property..
	struct FGameplayAbilityTargetDataHandle      BuildingTargetingTargetData;                       // 0xE28(0x28)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTag                          BuildingTargetingApplicationTag;                   // 0xE50(0x4)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                          TC_BuildingTypePlayer;                             // 0xE54(0x4)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UClass*                                GE_NPC_MMR_Scaling_AbilityCooldown;                // 0xE58(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("GA_NPC_Parent_C");
		return Clss;
	}

	void FilterHitActors(TArray<class AActor*>& HitActors);
	void NPC_ResetRotationRate(bool CallFunc_IsValid_ReturnValue);
	void NPC_OverrideRotationRate(const struct FScalableFloat& RotationRate, bool CallFunc_NPC_GetScalableFloatHotfixValue_AsBool, int32 CallFunc_NPC_GetScalableFloatHotfixValue_AsIntRounded, double CallFunc_NPC_GetScalableFloatHotfixValue_AsFloat, bool CallFunc_IsValid_ReturnValue, bool CallFunc_NotEqual_DoubleDouble_ReturnValue, float CallFunc_BreakRotator_Roll, float CallFunc_BreakRotator_Pitch, float CallFunc_BreakRotator_Yaw, const struct FRotator& CallFunc_MakeRotator_ReturnValue, float CallFunc_MakeRotator_Yaw_ImplicitCast);
