#pragma once

// Dumper.

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x4750 (0x4EF0 - 0x7A0)
// AnimBlueprintGeneratedClass Grandma_AnimBP.Grandma_AnimBP_C
class UGrandma_AnimBP_C : public UFortAIFaunaAnimInstance_Grandma
{
public:
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0x7A0(0x8)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimBlueprintGeneratedMutableData    __AnimBlueprintMutables;                           // 0x7A8(0x71)(HasGetValueTypeHash)
	uint8                                        Pad_85E2[0x7];                                     // Fixing Size After Last Property..
	struct FAnimSubsystemInstance                AnimBlueprintExtension_PropertyAccess;             // 0x820(0x8)()
	struct FAnimSubsystemInstance                AnimBlueprintExtension_Base;                       // 0x828(0x8)()
	struct FAnimNode_Root                        AnimGraphNode_Root_3;                              // 0x830(0x20)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_60;                 // 0x850(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_59;                 // 0x878(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_58;                 // 0x8A0(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_57;                 // 0x8C8(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_56;                 // 0x8F0(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_55;                 // 0x918(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_54;                 // 0x940(0x28)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_41;                   // 0x968(0x48)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_35;                      // 0x9B0(0x20)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_40;                   // 0x9D0(0x48)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_34;                      // 0xA18(0x20)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_39;                   // 0xA38(0x48)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_33;                      // 0xA80(0x20)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_38;                   // 0xAA0(0x48)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_32;                      // 0xAE8(0x20)()
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine_8;                      // 0xB08(0xC8)()
	struct FAnimNode_Root                        AnimGraphNode_Root_2;                              // 0xBD0(0x20)()
	struct FAnimNode_LinkedInputPose             AnimGraphNode_LinkedInputPose_1;                   // 0xBF0(0xC0)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_37;                   // 0xCB0(0x48)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_36;                   // 0xCF8(0x48)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_13;                  // 0xD40(0x48)()
	struct FAnimNode_Root                        AnimGraphNode_Root_1;                              // 0xD88(0x20)()
	struct FAnimNode_LinkedInputPose             AnimGraphNode_LinkedInputPose;                     // 0xDA8(0xC0)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_35;                   // 0xE68(0x48)()
	struct FAnimNode_Root                        AnimGraphNode_Root;                                // 0xEB0(0x20)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_53;                 // 0xED0(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_52;                 // 0xEF8(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_51;                 // 0xF20(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_50;                 // 0xF48(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_49;                 // 0xF70(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_48;                 // 0xF98(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_47;                 // 0xFC0(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_46;                 // 0xFE8(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_45;                 // 0x1010(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_44;                 // 0x1038(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_43;                 // 0x1060(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_42;                 // 0x1088(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_41;                 // 0x10B0(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_40;                 // 0x10D8(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_39;                 // 0x1100(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_38;                 // 0x1128(0x28)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_34;                   // 0x1150(0x48)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_31;                      // 0x1198(0x20)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_33;                   // 0x11B8(0x48)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_30;                      // 0x1200(0x20)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_32;                   // 0x1220(0x48)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_29;                      // 0x1268(0x20)()
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_11;                    // 0x1288(0xC8)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_9;                  // 0x1350(0x70)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_12;                  // 0x13C0(0x48)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_31;                   // 0x1408(0x48)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_30;                   // 0x1450(0x48)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_28;                      // 0x1498(0x20)()
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_10;                    // 0x14B8(0xC8)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_8;                  // 0x1580(0x70)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_37;                 // 0x15F0(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_36;                 // 0x1618(0x28)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_29;                   // 0x1640(0x48)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_27;                      // 0x1688(0x20)()
	struct FAnimNode_RefPose                     AnimGraphNode_IdentityPose_3;                      // 0x16A8(0x10)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_26;                      // 0x16B8(0x20)()
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine_7;                      // 0x16D8(0xC8)()
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_9;                     // 0x17A0(0xC8)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_7;                  // 0x1868(0x70)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_25;                      // 0x18D8(0x20)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_6;                  // 0x18F8(0x70)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_28;                   // 0x1968(0x48)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_27;                   // 0x19B0(0x48)()
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_4;                     // 0x19F8(0x28)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_11;                  // 0x1A20(0x48)()
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_2;                  // 0x1A68(0xE0)()
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_8;                     // 0x1B48(0xC8)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_10;                  // 0x1C10(0x48)()
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_3;                     // 0x1C58(0x28)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_24;                      // 0x1C80(0x20)()
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine_6;                      // 0x1CA0(0xC8)()
	struct FAnimNode_Slot                        AnimGraphNode_Slot_4;                              // 0x1D68(0x48)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x1DB0(0x20)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x1DD0(0x20)()
	struct FAnimNode_Slot                        AnimGraphNode_Slot_3;                              // 0x1DF0(0x48)()
	struct FAnimNode_LegIK                       AnimGraphNode_LegIK;                               // 0x1E38(0xF8)()
	struct FAnimNode_Slot                        AnimGraphNode_Slot_2;                              // 0x1F30(0x48)()
	struct FAnimNode_Slot                        AnimGraphNode_Slot_1;                              // 0x1F78(0x48)()
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_1;                    // 0x1FC0(0x100)()
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_2;                     // 0x20C0(0x28)()
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_1;                     // 0x20E8(0x28)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_9;                   // 0x2110(0x48)()
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_1;                  // 0x2158(0xE0)()
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose;                       // 0x2238(0x28)()
	struct FAnimNode_Slot                        AnimGraphNode_Slot;                                // 0x2260(0x48)()
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_7;                     // 0x22A8(0xC8)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_35;                 // 0x2370(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_34;                 // 0x2398(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_33;                 // 0x23C0(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_32;                 // 0x23E8(0x28)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_26;                   // 0x2410(0x48)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_23;                      // 0x2458(0x20)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_25;                   // 0x2478(0x48)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_22;                      // 0x24C0(0x20)()
	struct FAnimNode_RefPose                     AnimGraphNode_IdentityPose_2;                      // 0x24E0(0x10)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_21;                      // 0x24F0(0x20)()
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine_5;                      // 0x2510(0xC8)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_24;                   // 0x25D8(0x48)()
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend;                    // 0x2620(0xE0)()
	struct FFortAnimNode_QuadrupedSlopeWarping   FortAnimGraphNode_QuadrupedSlopeWarping;           // 0x2700(0x5C8)()
	uint8                                        Pad_85E3[0x8];                                     // Fixing Size After Last Property..
	struct FFortAnimNode_WeightedLookAt          FortAnimGraphNode_WeightedLookAt;                  // 0x2CD0(0x250)()
	struct FAnimNode_Inertialization             AnimGraphNode_Inertialization;                     // 0x2F20(0x100)()
	struct FAnimNode_LinkedAnimLayer             AnimGraphNode_LinkedAnimLayer;                     // 0x3020(0xC8)()
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose;                      // 0x30E8(0x100)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_23;                   // 0x31E8(0x48)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_8;                   // 0x3230(0x48)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_31;                 // 0x3278(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_30;                 // 0x32A0(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_29;                 // 0x32C8(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_28;                 // 0x32F0(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_27;                 // 0x3318(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_26;                 // 0x3340(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_25;                 // 0x3368(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_24;                 // 0x3390(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_23;                 // 0x33B8(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_22;                 // 0x33E0(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_21;                 // 0x3408(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_20;                 // 0x3430(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_19;                 // 0x3458(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_18;                 // 0x3480(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_17;                 // 0x34A8(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_16;                 // 0x34D0(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_15;                 // 0x34F8(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_14;                 // 0x3520(0x28)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_22;                   // 0x3548(0x48)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_21;                   // 0x3590(0x48)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_7;                   // 0x35D8(0x48)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_20;                      // 0x3620(0x20)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_20;                   // 0x3640(0x48)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_19;                   // 0x3688(0x48)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_6;                   // 0x36D0(0x48)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_19;                      // 0x3718(0x20)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_13;                 // 0x3738(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_12;                 // 0x3760(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_11;                 // 0x3788(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_10;                 // 0x37B0(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_9;                  // 0x37D8(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_8;                  // 0x3800(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_7;                  // 0x3828(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_6;                  // 0x3850(0x28)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_18;                   // 0x3878(0x48)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_18;                      // 0x38C0(0x20)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_17;                   // 0x38E0(0x48)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_17;                      // 0x3928(0x20)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_16;                   // 0x3948(0x48)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_16;                      // 0x3990(0x20)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_15;                   // 0x39B0(0x48)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_15;                      // 0x39F8(0x20)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_5;                  // 0x3A18(0x28)()
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine_4;                      // 0x3A40(0xC8)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_14;                      // 0x3B08(0x20)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_14;                   // 0x3B28(0x48)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_13;                      // 0x3B70(0x20)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_13;                   // 0x3B90(0x48)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_12;                      // 0x3BD8(0x20)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_12;                   // 0x3BF8(0x48)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_11;                      // 0x3C40(0x20)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_4;                  // 0x3C60(0x28)()
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine_3;                      // 0x3C88(0xC8)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_10;                      // 0x3D50(0x20)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_11;                   // 0x3D70(0x48)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_9;                       // 0x3DB8(0x20)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_10;                   // 0x3DD8(0x48)()
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_6;                     // 0x3E20(0xC8)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_5;                  // 0x3EE8(0x70)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_5;                   // 0x3F58(0x48)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_9;                    // 0x3FA0(0x48)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_8;                       // 0x3FE8(0x20)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_8;                    // 0x4008(0x48)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_7;                       // 0x4050(0x20)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_7;                    // 0x4070(0x48)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_4;                   // 0x40B8(0x48)()
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_5;                     // 0x4100(0xC8)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_4;                  // 0x41C8(0x70)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_3;                   // 0x4238(0x48)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_6;                    // 0x4280(0x48)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_5;                    // 0x42C8(0x48)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_6;                       // 0x4310(0x20)()
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_4;                     // 0x4330(0xC8)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_3;                  // 0x43F8(0x70)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_4;                    // 0x4468(0x48)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_2;                   // 0x44B0(0x48)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_3;                    // 0x44F8(0x48)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_1;                   // 0x4540(0x48)()
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_3;                     // 0x4588(0xC8)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_2;                  // 0x4650(0x70)()
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_2;                     // 0x46C0(0xC8)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_1;                  // 0x4788(0x70)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_3;                  // 0x47F8(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_2;                  // 0x4820(0x28)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_2;                    // 0x4848(0x48)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_5;                       // 0x4890(0x20)()
	struct FAnimNode_RefPose                     AnimGraphNode_IdentityPose_1;                      // 0x48B0(0x10)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_4;                       // 0x48C0(0x20)()
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine_2;                      // 0x48E0(0xC8)()
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_1;                     // 0x49A8(0xC8)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer;                    // 0x4A70(0x70)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_3;                       // 0x4AE0(0x20)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_1;                    // 0x4B00(0x48)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_2;                       // 0x4B48(0x20)()
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine_1;                      // 0x4B68(0xC8)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool;                     // 0x4C30(0x48)()
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive;                       // 0x4C78(0xC8)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_1;                  // 0x4D40(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult;                    // 0x4D68(0x28)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer;                      // 0x4D90(0x48)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_1;                       // 0x4DD8(0x20)()
	struct FAnimNode_RefPose                     AnimGraphNode_IdentityPose;                        // 0x4DF8(0x10)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult;                         // 0x4E08(0x20)()
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine;                        // 0x4E28(0xC8)()

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("Grandma_AnimBP_C");
		return Clss;
	}

	void Fauna_Jump(struct FPoseLink* Fauna_Jump);
	void Fauna_IdleTurn(const struct FPoseLink& InPose_IdleTurn, struct FPoseLink* Fauna_IdleTurn);
	void Fauna_Idle(const struct FPoseLink& InPose_Idle, struct FPoseLink* Fauna_Idle);
	void AnimGraph(struct FPoseLink* AnimGraph);
	void AnimNotify_FallExit();
	void AnimNotify_LandAddExit();
	void AnimNotify_LandEnter();
	void ExecuteUbergraph_Grandma_AnimBP(int32 EntryPoint);
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
