#pragma once

// Dumper.

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x86C (0x3CFC - 0x3490)
// BlueprintGeneratedClass NPC_Pawn_Parent.NPC_Pawn_Parent_C
class ANPC_Pawn_Parent_C : public AFortAIPawn
{
public:
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0x3490(0x8)(ZeroConstructor, Transient, DuplicateTransient)
	class USoundLibraryComponent*                SoundLibrary;                                      // 0x3498(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UFortPawnComponent_CustomDepth*        FortPawnComponent_CustomDepth;                     // 0x34A0(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCapsuleComponent*                     WeaponCapsuleCollision;                            // 0x34A8(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UFortTaggedNavFiltersComponent*        FortTaggedNavFilters;                              // 0x34B0(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UFortActorComponent_Affiliation*       FortActorComponent_Affiliation;                    // 0x34B8(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USoundLibraryComponent*                SoundLibrary_Component;                            // 0x34C0(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                       MovementAudioComponent;                            // 0x34C8(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNPC_VoiceComponent_C*                 NPC_VoiceComponent;                                // 0x34D0(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                       VOAudioComponent;                                  // 0x34D8(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UFortWidgetComponent*                  NPCStatusWidget;                                   // 0x34E0(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                        Timeline_ScaleMeshInOrOut_MeshScaleAlpha_9DAAC0B243D26E4160CEC3A458AE0E86; // 0x34E8(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class ETimelineDirection                Timeline_ScaleMeshInOrOut__Direction_9DAAC0B243D26E4160CEC3A458AE0E86; // 0x34EC(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4816[0x3];                                     // Fixing Size After Last Property..
	class UTimelineComponent*                    Timeline_ScaleMeshInOrOut;                         // 0x34F0(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UClass*                                GE_NPC_RecentlyDamaged;                            // 0x34F8(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	enum class Enum_NPC_AlertLevel               NPC_AlertLevel;                                    // 0x3500(0x1)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	enum class Enum_NPC_AlertLevel               NPC_AlertLevelPrevious;                            // 0x3501(0x1)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4817[0x6];                                     // Fixing Size After Last Property..
	TMap<enum class Enum_NPC_AlertLevel, struct FGameplayTag> NPC_AlertLevelToTagMap;                            // 0x3508(0x50)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                         NPC_StatusWidgetHealthBarDisabled;                 // 0x3558(0x1)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4818[0x3];                                     // Fixing Size After Last Property..
	struct FGameplayTag                          GameplayCue_PickupGrabbed;                         // 0x355C(0x4)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	enum class EFortRarity                       NPC_BestLootRarityInInventory;                     // 0x3560(0x1)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	bool                                         NPC_DebugPawn;                                     // 0x3561(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         NPC_ShowInventoryRarityVisuals;                    // 0x3562(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4819[0x5];                                     // Fixing Size After Last Property..
	double                                       InventoryGlowDelay;                                // 0x3568(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                        NPC_NumberOfInventoryItemsToDeliverHF;             // 0x3570(0x28)(Edit, BlueprintVisible)
	bool                                         NPC_SpawnInvisible;                                // 0x3598(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         NPC_ScaleMeshInOnSpawn;                            // 0x3599(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_481A[0x6];                                     // Fixing Size After Last Property..
	struct FGameplayTagContainer                 TC_NPC_SpawnAbilityTag;                            // 0x35A0(0x20)(Edit, BlueprintVisible)
	struct FGameplayTagContainer                 TC_NPC_AlternateSpawnAbilityTag;                   // 0x35C0(0x20)(Edit, BlueprintVisible)
	bool                                         NPC_IsSpawning;                                    // 0x35E0(0x1)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_481B[0x7];                                     // Fixing Size After Last Property..
	double                                       NPC_OriginalGravityScale;                          // 0x35E8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                              NPC_OriginalRotationRate;                          // 0x35F0(0x18)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                         NPC_HasPawnGoal;                                   // 0x3608(0x1)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_481C[0x7];                                     // Fixing Size After Last Property..
	class AActor*                                NPC_PawnGoalActor;                                 // 0x3610(0x8)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                        NPC_NumberOfInventoryItemsToConsumeBeforeFullHF;   // 0x3618(0x28)(Edit, BlueprintVisible)
	bool                                         NPC_PawnIsDestroyingBuildingForNavigation;         // 0x3640(0x1)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_481D[0x7];                                     // Fixing Size After Last Property..
	struct FScalableFloat                        MaxIdleVODelay;                                    // 0x3648(0x28)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                        MinIdleVODelay;                                    // 0x3670(0x28)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                        NPC_DeathDropLootDelay;                            // 0x3698(0x28)(Edit, BlueprintVisible)
	class FName                                  NPC_DeathDropLootTierGroupName;                    // 0x36C0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_481E[0x4];                                     // Fixing Size After Last Property..
	struct FGameplayTagContainer                 NPC_DeathDropLootRequiredDamageTags;               // 0x36C8(0x20)(Edit, BlueprintVisible)
	struct FGameplayTagContainer                 NPC_DeathDropLootForbiddenDamageTags;              // 0x36E8(0x20)(Edit, BlueprintVisible)
	struct FGameplayTagContainer                 GrantStartingItemsAbilityTC;                       // 0x3708(0x20)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                         NPC_HasItemInInventory;                            // 0x3728(0x1)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_481F[0x3];                                     // Fixing Size After Last Property..
	struct FGameplayTag                          VoiceTag_FullAlertIdle;                            // 0x372C(0x4)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                          VoiceTag_Idle;                                     // 0x3730(0x4)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                          VoiceTag_ReturnToIdle;                             // 0x3734(0x4)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                          VoiceTag_LostTarget;                               // 0x3738(0x4)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                          VoiceTag_Suspicious;                               // 0x373C(0x4)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                          VoiceTag_FullAlert;                                // 0x3740(0x4)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4820[0x4];                                     // Fixing Size After Last Property..
	TArray<struct FStruct_NPC_TargetSlots>       NPC_TargetSlotsHF;                                 // 0x3748(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                         NPC_DamageCanCancelIntroPhase;                     // 0x3758(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4821[0x7];                                     // Fixing Size After Last Property..
	struct FGameplayTagQuery                     TQ_NPC_DamageTagsThatCanCancelIntroPhase;          // 0x3760(0x48)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UClass*                                GE_NPC_IntroPhaseBehaviorCooldown;                 // 0x37A8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                 TC_IntroBehaviorActive;                            // 0x37B0(0x20)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                         Debug_NPC_AlertLevelForced;                        // 0x37D0(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         NPC_PawnCanInteractInternal;                       // 0x37D1(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4822[0x6];                                     // Fixing Size After Last Property..
	struct FScalableFloat                        NPC_PrimtiveDataFloatSetRandomlyInRange;           // 0x37D8(0x28)(Edit, BlueprintVisible)
	struct FScalableFloat                        NPC_PrimtiveDataFloatIndexHF;                      // 0x3800(0x28)(Edit, BlueprintVisible)
	struct FScalableFloat                        NPC_PrimtiveDataFloatMinRangeHF;                   // 0x3828(0x28)(Edit, BlueprintVisible)
	struct FScalableFloat                        NPC_PrimtiveDataFloatMaxRangeHF;                   // 0x3850(0x28)(Edit, BlueprintVisible)
	class AActor*                                NPC_Leader;                                        // 0x3878(0x8)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, RepNotify, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                          GameplayCue_LeaderSet;                             // 0x3880(0x4)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4823[0x4];                                     // Fixing Size After Last Property..
	double                                       NPC_Skeletal_Mesh_Index;                           // 0x3888(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                            TamedSound;                                        // 0x3890(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                       StateChangeSound;                                  // 0x3898(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                        NPC_ShouldDespawnFromStormHF;                      // 0x38A0(0x28)(Edit, BlueprintVisible)
	struct FScalableFloat                        NPC_DespawnTimerHF;                                // 0x38C8(0x28)(Edit, BlueprintVisible)
	struct FGameplayTag                          NPC_DespawnGameplayTag;                            // 0x38F0(0x4)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4824[0x4];                                     // Fixing Size After Last Property..
	struct FTimerHandle                          NPC_TestIsInSafeZoneTimer;                         // 0x38F8(0x8)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                          NPC_DespawnFromStormTimer;                         // 0x3900(0x8)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                         NPC_isTryingToDespawn;                             // 0x3908(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4825[0x3];                                     // Fixing Size After Last Property..
	struct FGameplayTag                          NPC_ResetIntroGameplayTags;                        // 0x390C(0x4)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	double                                       SelectedPrimitiveDataFloat;                        // 0x3910(0x8)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                          GameplayCue_Death;                                 // 0x3918(0x4)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4826[0x4];                                     // Fixing Size After Last Property..
	TArray<class UMaterialInterface*>            OG_Materials;                                      // 0x3920(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                         NPC_Apply_GE_for_Swimming;                         // 0x3930(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4827[0x7];                                     // Fixing Size After Last Property..
	class UClass*                                NPC_GE_ClassToApplyForSwimming;                    // 0x3938(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                         Exit_Burst_GC;                                     // 0x3940(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4828[0x3];                                     // Fixing Size After Last Property..
	struct FActiveGameplayEffectHandle           NPC_GE_AppliedForSwimming;                         // 0x3944(0x8)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	class FName                                  GoalActorBBKey;                                    // 0x394C(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                          GameplayCueLureInterest;                           // 0x3950(0x4)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4829[0x4];                                     // Fixing Size After Last Property..
	class UObject*                               NPC_PreviousLureGoal;                              // 0x3958(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                          Exit_Water;                                        // 0x3960(0x4)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                          Enter_Water;                                       // 0x3964(0x4)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                        NPC_MaxDistanceFromDamagedNPCToDrawHeallthBarHF;   // 0x3968(0x28)(Edit, BlueprintVisible)
	struct FScalableFloat                        NPC_HealthBarHideTimeAfterDeathHF;                 // 0x3990(0x28)(Edit, BlueprintVisible)
	struct FScalableFloat                        NPC_PlayEffectWhenLuredHF;                         // 0x39B8(0x28)(Edit, BlueprintVisible)
	struct FScalableFloat                        NPC_PawnCanInteractHF;                             // 0x39E0(0x28)(Edit, BlueprintVisible)
	struct FScalableFloat                        NPC_AllowInteractOnlyWhenUnawareHF;                // 0x3A08(0x28)(Edit, BlueprintVisible)
	struct FScalableFloat                        NPC_AllowInteractWhenHasLeaderHF;                  // 0x3A30(0x28)(Edit, BlueprintVisible)
	struct FScalableFloat                        NPC_AllowDrownInShallowWaterHF;                    // 0x3A58(0x28)(Edit, BlueprintVisible)
	bool                                         NPC_IsInventoryInitialized;                        // 0x3A80(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_482A[0x3];                                     // Fixing Size After Last Property..
	float                                        LeaderClearedCueDelay;                             // 0x3A84(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                          GameplayCue_LeaderCleared;                         // 0x3A88(0x4)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                         IsGCForLeaderSetLooping;                           // 0x3A8C(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_482B[0x3];                                     // Fixing Size After Last Property..
	struct FGameplayTag                          NPC_DeathByStormTag;                               // 0x3A90(0x4)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                         NPC_TryDespawnAbility;                             // 0x3A94(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_482C[0x3];                                     // Fixing Size After Last Property..
	struct FActiveGameplayEffectHandle           GeOutsideSafeZoneDamageHandle;                     // 0x3A98(0x8)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                         IsGEStormDamageInit;                               // 0x3AA0(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         NPC_MeshScalingInProgress;                         // 0x3AA1(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         NPC_DisableCapsuleOverlapsWhenScalingOut;          // 0x3AA2(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_482D[0x5];                                     // Fixing Size After Last Property..
	struct FVector                               NPC_OriginalMeshScale;                             // 0x3AA8(0x18)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_            NPCScaleMeshInCompleted;                           // 0x3AC0(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_            NPCScaleMeshOutCompleted;                          // 0x3AD0(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                         NPC_CanDropLoot;                                   // 0x3AE0(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_482E[0x7];                                     // Fixing Size After Last Property..
	struct FScalableFloat                        NPC_StaleDespawnTestDistance_HF;                   // 0x3AE8(0x28)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                        NPC_StaleDespawnTimeThreshold_HF;                  // 0x3B10(0x28)(Edit, BlueprintVisible, DisableEditOnInstance)
	double                                       NPC_LastNonStaleCheckTime;                         // 0x3B38(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         bCanBeDamagedByNullInstigator;                     // 0x3B40(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         IsEnteringWater;                                   // 0x3B41(0x1)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_482F[0x6];                                     // Fixing Size After Last Property..
	FMulticastInlineDelegateProperty_            NPCPawnInteractWithDispatcher;                     // 0x3B48(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                         NPCDynamicBlockConversionOnInteract;               // 0x3B58(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         NPC_TempInteractOverride;                          // 0x3B59(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4830[0x6];                                     // Fixing Size After Last Property..
	class USoundBase*                            HeadShot_Sound;                                    // 0x3B60(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class FName                                  Headshot_FX_Socket;                                // 0x3B68(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         UseHeadShotFX;                                     // 0x3B6C(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4831[0x3];                                     // Fixing Size After Last Property..
	struct FGameplayTagContainer                 TC_WeaponTypesAllowedForHeadshotFX;                // 0x3B70(0x20)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                         AllowHeadshot;                                     // 0x3B90(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4832[0x7];                                     // Fixing Size After Last Property..
	double                                       AdditiveHitReactRetriggerDelay;                    // 0x3B98(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                          Additive_Hit_React_Montage;                        // 0x3BA0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                            Death_Normal_Sound;                                // 0x3BA8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                       HeadshotFXEmitterTemplate;                         // 0x3BB0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                 Sound_Library_Collection_Tags;                     // 0x3BB8(0x20)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTagContainer                 Sound_Library_Default_Tags;                        // 0x3BD8(0x20)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTagContainer                 Sound_Library_Alert_Tags;                          // 0x3BF8(0x20)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTagContainer                 Sound_Library_Aggressive_Tags;                     // 0x3C18(0x20)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class USoundLibrary*>                 SoundLibs_Default;                                 // 0x3C38(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class USoundLibrary*>                 SoundLibs_Alert;                                   // 0x3C48(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	class USoundLibrary*                         CurrentSoundLib;                                   // 0x3C58(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class USoundLibrary*>                 SoundLibs_Aggressive;                              // 0x3C60(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class USoundLibrary*>                 SoundLibs_Foley;                                   // 0x3C70(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class USoundLibrary*>                 SoundLibs_Foley_Water;                             // 0x3C80(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	class USoundLibrary*                         CurrentFoleyLib;                                   // 0x3C90(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                       Custom_Depth_Update_Rate;                          // 0x3C98(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                Class;                                             // 0x3CA0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TSubclassOf<class UGameplayEffect>           GE_Converted;                                      // 0x3CA8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle           GE_Converted_Handle;                               // 0x3CB0(0x8)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                       NPC_Death_Time;                                    // 0x3CB8(0x8)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	float                                        ScaleMeshInOrOutPlayRate;                          // 0x3CC0(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         AllowSkipScaleOutIfNotRecentlyRendered;            // 0x3CC4(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4833[0x3];                                     // Fixing Size After Last Property..
	FMulticastInlineDelegateProperty_            NPCAlertLevelUpdated;                              // 0x3CC8(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FGameplayTagContainer                 GameplayTagsToBlockHitReact;                       // 0x3CD8(0x20)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTag                          GCInstantDeathTag;                                 // 0x3CF8(0x4)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("NPC_Pawn_Parent_C");
		return Clss;
	}

	void Orphaned(bool* IsOrphaned, class AFortPawn** AttachedPawn);
	void RemoveLibraryCollection(class USoundLibrarySubsystem* CallFunc_GetWorldSubsystem_ReturnValue, int32 CallFunc_GetNumGameplayTagsInContainer_ReturnValue, bool CallFunc_GreaterEqual_IntInt_ReturnValue);
	void Check_Tag(const struct FGameplayTagContainer& Tag_Container, bool* ShouldDefault, int32 CallFunc_GetNumGameplayTagsInContainer_ReturnValue, bool CallFunc_GreaterEqual_IntInt_ReturnValue);
