#pragma once

// Dumper.

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

#include "../SDK.hpp"

namespace SDK
{
namespace Params
{
//---------------------------------------------------------------------------------------------------------------------
// PARAMETERS
//---------------------------------------------------------------------------------------------------------------------

// 0x8 (0x8 - 0x0)
// Function VerseAIBase.task_VerseAIBase_ai_behavior$OnBegin.Update
struct UTask_VerseAIBase_ai_behavior_OnBegin_Update_Params
{
public:
	int64                                        RetVal;                                            // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function VerseAIBase.task_VerseAIBase_fort_character_actions_interface$AttackObstacle_L_Nfort__obstacle__info_R.Update
struct UTask_VerseAIBase_fort_character_actions_interface_AttackObstacle_L_Nfort__obstacle__info_R_Update_Params
{
public:
	int64                                        RetVal;                                            // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function VerseAIBase.task_VerseAIBase_fort_character_actions_interface$AttackThreat_L_Nfort__threat__info_R.Update
struct UTask_VerseAIBase_fort_character_actions_interface_AttackThreat_L_Nfort__threat__info_R_Update_Params
{
public:
	int64                                        RetVal;                                            // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function VerseAIBase.task_VerseAIBase_fort_character_actions_interface$LootObject_L_Nfort__loot__info_R.Update
struct UTask_VerseAIBase_fort_character_actions_interface_LootObject_L_Nfort__loot__info_R_Update_Params
{
public:
	int64                                        RetVal;                                            // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function VerseAIBase.task_VerseAIBase_fort_character_actions_interface$PlayRandomEmote.Update
struct UTask_VerseAIBase_fort_character_actions_interface_PlayRandomEmote_Update_Params
{
public:
	int64                                        RetVal;                                            // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function VerseAIBase.task_VerseAIBase_fort_character_actions_interface$Revive_L_Nagent_R.Update
struct UTask_VerseAIBase_fort_character_actions_interface_Revive_L_Nagent_R_Update_Params
{
public:
	int64                                        RetVal;                                            // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function VerseAIBase.task_VerseAIBase_fort_character_movement_interface$Crouch.Update
struct UTask_VerseAIBase_fort_character_movement_interface_Crouch_Update_Params
{
public:
	int64                                        RetVal;                                            // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function VerseAIBase.task_VerseAIBase_fort_character_movement_interface$Jump.Update
struct UTask_VerseAIBase_fort_character_movement_interface_Jump_Update_Params
{
public:
	int64                                        RetVal;                                            // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function VerseAIBase.task_VerseAIBase_fort_character_movement_interface$Slide.Update
struct UTask_VerseAIBase_fort_character_movement_interface_Slide_Update_Params
{
public:
	int64                                        RetVal;                                            // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function VerseAIBase.task_VerseAIBase_fort_character_movement_interface$Sprint.Update
struct UTask_VerseAIBase_fort_character_movement_interface_Sprint_Update_Params
{
public:
	int64                                        RetVal;                                            // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function VerseAIBase.task_VerseAIBase_fort_character_movement_interface$TacticalSprint.Update
struct UTask_VerseAIBase_fort_character_movement_interface_TacticalSprint_Update_Params
{
public:
	int64                                        RetVal;                                            // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function VerseAIBase.task_VerseAIBase_fort_character_movement_interface$Walk.Update
struct UTask_VerseAIBase_fort_character_movement_interface_Walk_Update_Params
{
public:
	int64                                        RetVal;                                            // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function VerseAIBase.task_VerseAIBase_fort_navigatable$MoveInRangeToAttack.Update
struct UTask_VerseAIBase_fort_navigatable_MoveInRangeToAttack_Update_Params
{
public:
	int64                                        RetVal;                                            // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function VerseAIBase.task_VerseAIBase_fort_navigatable$RoamAround.Update
struct UTask_VerseAIBase_fort_navigatable_RoamAround_Update_Params
{
public:
	int64                                        RetVal;                                            // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x18 (0x18 - 0x0)
// Function VerseAIBase.VerseAIBase._L_2fFortnite_2ecom_2fAI_2fVerseAIBase_N_Roperator_U_2eGetFortWeaponActions_U_L_Nfort__character_M_Ntuple_L_R_M_Ntuple_L_R_R
struct UVerseAIBase__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_N_Roperator_U_2eGetFortWeaponActions_U_L_Nfort__character_M_Ntuple_L_R_M_Ntuple_L_R_R_Params
{
public:
	struct FTuple_Lfort__character_Mtuple_L_R_Mtuple_L_R_R __verse_0xB2CDDD72_Argument;                       // 0x0(0xA)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_3B32[0x6];                                     // Fixing Size After Last Property..
	FOptionProperty_                             RetVal;                                            // 0x10(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};

// 0x18 (0x18 - 0x0)
// Function VerseAIBase.VerseAIBase._L_2fFortnite_2ecom_2fAI_2fVerseAIBase_N_Roperator_U_2eGetFortThreatPerception_U_L_Nfort__character_M_Ntuple_L_R_M_Ntuple_L_R_R
struct UVerseAIBase__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_N_Roperator_U_2eGetFortThreatPerception_U_L_Nfort__character_M_Ntuple_L_R_M_Ntuple_L_R_R_Params
{
public:
	struct FTuple_Lfort__character_Mtuple_L_R_Mtuple_L_R_R __verse_0xB2CDDD72_Argument;                       // 0x0(0xA)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_3B33[0x6];                                     // Fixing Size After Last Property..
	FOptionProperty_                             RetVal;                                            // 0x10(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};

// 0x18 (0x18 - 0x0)
// Function VerseAIBase.VerseAIBase._L_2fFortnite_2ecom_2fAI_2fVerseAIBase_N_Roperator_U_2eGetFortTargetSelection_U_L_Nfort__character_M_Ntuple_L_R_M_Ntuple_L_R_R
struct UVerseAIBase__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_N_Roperator_U_2eGetFortTargetSelection_U_L_Nfort__character_M_Ntuple_L_R_M_Ntuple_L_R_R_Params
{
public:
	struct FTuple_Lfort__character_Mtuple_L_R_Mtuple_L_R_R __verse_0xB2CDDD72_Argument;                       // 0x0(0xA)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_3B34[0x6];                                     // Fixing Size After Last Property..
	FOptionProperty_                             RetVal;                                            // 0x10(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};

// 0x18 (0x18 - 0x0)
// Function VerseAIBase.VerseAIBase._L_2fFortnite_2ecom_2fAI_2fVerseAIBase_N_Roperator_U_2eGetFortObstaclePerception_U_L_Nfort__character_M_Ntuple_L_R_M_Ntuple_L_R_R
struct UVerseAIBase__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_N_Roperator_U_2eGetFortObstaclePerception_U_L_Nfort__character_M_Ntuple_L_R_M_Ntuple_L_R_R_Params
{
public:
	struct FTuple_Lfort__character_Mtuple_L_R_Mtuple_L_R_R __verse_0xB2CDDD72_Argument;                       // 0x0(0xA)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_3B35[0x6];                                     // Fixing Size After Last Property..
	FOptionProperty_                             RetVal;                                            // 0x10(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};

// 0x18 (0x18 - 0x0)
// Function VerseAIBase.VerseAIBase._L_2fFortnite_2ecom_2fAI_2fVerseAIBase_N_Roperator_U_2eGetFortNavigatable_U_L_Nfort__character_M_Ntuple_L_R_M_Ntuple_L_R_R
struct UVerseAIBase__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_N_Roperator_U_2eGetFortNavigatable_U_L_Nfort__character_M_Ntuple_L_R_M_Ntuple_L_R_R_Params
{
public:
	struct FTuple_Lfort__character_Mtuple_L_R_Mtuple_L_R_R __verse_0xB2CDDD72_Argument;                       // 0x0(0xA)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_3B36[0x6];                                     // Fixing Size After Last Property..
	FOptionProperty_                             RetVal;                                            // 0x10(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};

// 0x18 (0x18 - 0x0)
// Function VerseAIBase.VerseAIBase._L_2fFortnite_2ecom_2fAI_2fVerseAIBase_N_Roperator_U_2eGetFortLootPerception_U_L_Nfort__character_M_Ntuple_L_R_M_Ntuple_L_R_R
struct UVerseAIBase__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_N_Roperator_U_2eGetFortLootPerception_U_L_Nfort__character_M_Ntuple_L_R_M_Ntuple_L_R_R_Params
{
public:
	struct FTuple_Lfort__character_Mtuple_L_R_Mtuple_L_R_R __verse_0xB2CDDD72_Argument;                       // 0x0(0xA)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_3B37[0x6];                                     // Fixing Size After Last Property..
	FOptionProperty_                             RetVal;                                            // 0x10(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};

// 0x18 (0x18 - 0x0)
// Function VerseAIBase.VerseAIBase._L_2fFortnite_2ecom_2fAI_2fVerseAIBase_N_Roperator_U_2eGetFortInventory_U_L_Nfort__character_M_Ntuple_L_R_M_Ntuple_L_R_R
struct UVerseAIBase__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_N_Roperator_U_2eGetFortInventory_U_L_Nfort__character_M_Ntuple_L_R_M_Ntuple_L_R_R_Params
{
public:
	struct FTuple_Lfort__character_Mtuple_L_R_Mtuple_L_R_R __verse_0xB2CDDD72_Argument;                       // 0x0(0xA)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_3B38[0x6];                                     // Fixing Size After Last Property..
	FOptionProperty_                             RetVal;                                            // 0x10(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};

// 0x18 (0x18 - 0x0)
// Function VerseAIBase.VerseAIBase._L_2fFortnite_2ecom_2fAI_2fVerseAIBase_N_Roperator_U_2eGetFortCreatureActions_U_L_Nfort__character_M_Ntuple_L_R_M_Ntuple_L_R_R
struct UVerseAIBase__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_N_Roperator_U_2eGetFortCreatureActions_U_L_Nfort__character_M_Ntuple_L_R_M_Ntuple_L_R_R_Params
{
public:
	struct FTuple_Lfort__character_Mtuple_L_R_Mtuple_L_R_R __verse_0xB2CDDD72_Argument;                       // 0x0(0xA)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_3B39[0x6];                                     // Fixing Size After Last Property..
	FOptionProperty_                             RetVal;                                            // 0x10(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};

// 0x18 (0x18 - 0x0)
// Function VerseAIBase.VerseAIBase._L_2fFortnite_2ecom_2fAI_2fVerseAIBase_N_Roperator_U_2eGetFortCharacterMovement_U_L_Nfort__character_M_Ntuple_L_R_M_Ntuple_L_R_R
struct UVerseAIBase__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_N_Roperator_U_2eGetFortCharacterMovement_U_L_Nfort__character_M_Ntuple_L_R_M_Ntuple_L_R_R_Params
{
public:
	struct FTuple_Lfort__character_Mtuple_L_R_Mtuple_L_R_R __verse_0xB2CDDD72_Argument;                       // 0x0(0xA)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_3B3A[0x6];                                     // Fixing Size After Last Property..
	FOptionProperty_                             RetVal;                                            // 0x10(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};

// 0x18 (0x18 - 0x0)
// Function VerseAIBase.VerseAIBase._L_2fFortnite_2ecom_2fAI_2fVerseAIBase_N_Roperator_U_2eGetFortCharacterActions_U_L_Nfort__character_M_Ntuple_L_R_M_Ntuple_L_R_R
struct UVerseAIBase__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_N_Roperator_U_2eGetFortCharacterActions_U_L_Nfort__character_M_Ntuple_L_R_M_Ntuple_L_R_R_Params
{
public:
	struct FTuple_Lfort__character_Mtuple_L_R_Mtuple_L_R_R __verse_0xB2CDDD72_Argument;                       // 0x0(0xA)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_3B3B[0x6];                                     // Fixing Size After Last Property..
	FOptionProperty_                             RetVal;                                            // 0x10(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};

// 0x38 (0x38 - 0x0)
// Function VerseAIBase.VerseAIBase._L_2fFortnite_2ecom_2fAI_2fVerseAIBase_N_RMakeNavigationTarget_L_Nfort__loot__info_R
struct UVerseAIBase__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_N_RMakeNavigationTarget_L_Nfort__loot__info_R_Params
{
public:
	struct FVerseAIBase_fort_loot_info           __verse_0xB2CDDD72_Argument;                       // 0x0(0x28)(Parm, NoDestructor)
	uint64                                       InstancingGraph;                                   // 0x28(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAI_navigation_target*                 __verse_0xB482F2DD_CurrentlyInstantiatedObject;    // 0x30(0x8)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// 0x48 (0x48 - 0x0)
// Function VerseAIBase.VerseAIBase._L_2fFortnite_2ecom_2fAI_2fVerseAIBase_N_RMakeNavigationTarget_L_Nfort__threat__info_R
struct UVerseAIBase__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_N_RMakeNavigationTarget_L_Nfort__threat__info_R_Params
{
public:
	struct FVerseAIBase_fort_threat_info         __verse_0xB2CDDD72_Argument;                       // 0x0(0x38)(Parm, NoDestructor)
	uint64                                       InstancingGraph;                                   // 0x38(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAI_navigation_target*                 __verse_0xB482F2DD_CurrentlyInstantiatedObject;    // 0x40(0x8)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// 0x50 (0x50 - 0x0)
// Function VerseAIBase.VerseAIBase._L_2fFortnite_2ecom_2fAI_2fVerseAIBase_N_RGetThreatLocation_L_Nfort__threat__info_R
struct UVerseAIBase__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_N_RGetThreatLocation_L_Nfort__threat__info_R_Params
{
public:
	struct FVerseAIBase_fort_threat_info         __verse_0xB2CDDD72_Argument;                       // 0x0(0x38)(Parm, NoDestructor)
	struct FSpatialMath_vector3                  RetVal;                                            // 0x38(0x18)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// 0x88 (0x88 - 0x0)
// Function VerseAIBase.VerseAIBase.VerseAIBase_fort_threat_info$OverrideFactory
struct UVerseAIBase_VerseAIBase_fort_threat_info_OverrideFactory_Params
{
public:
	struct FVerseAIBase_fort_threat_info         RetVal;                                            // 0x0(0x38)(Parm, OutParm, ReturnParm, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           __verse_0xFB48ED96__InitOverrideMap;               // 0x38(0x50)(ConstParm, Parm, ContainsInstancedReference)
};

// 0x38 (0x38 - 0x0)
// Function VerseAIBase.VerseAIBase.VerseAIBase_fort_threat_info$Factory
struct UVerseAIBase_VerseAIBase_fort_threat_info_Factory_Params
{
public:
	struct FVerseAIBase_fort_threat_info         RetVal;                                            // 0x0(0x38)(Parm, OutParm, ReturnParm, NoDestructor)
};

// 0x78 (0x78 - 0x0)
// Function VerseAIBase.VerseAIBase.VerseAIBase_fort_obstacle_info$OverrideFactory
struct UVerseAIBase_VerseAIBase_fort_obstacle_info_OverrideFactory_Params
{
public:
	struct FVerseAIBase_fort_obstacle_info       RetVal;                                            // 0x0(0x28)(Parm, OutParm, ReturnParm, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           __verse_0xFB48ED96__InitOverrideMap;               // 0x28(0x50)(ConstParm, Parm, ContainsInstancedReference)
};

// 0x28 (0x28 - 0x0)
// Function VerseAIBase.VerseAIBase.VerseAIBase_fort_obstacle_info$Factory
struct UVerseAIBase_VerseAIBase_fort_obstacle_info_Factory_Params
{
public:
	struct FVerseAIBase_fort_obstacle_info       RetVal;                                            // 0x0(0x28)(Parm, OutParm, ReturnParm, NoDestructor)
};

// 0x78 (0x78 - 0x0)
// Function VerseAIBase.VerseAIBase.VerseAIBase_fort_loot_info$OverrideFactory
struct UVerseAIBase_VerseAIBase_fort_loot_info_OverrideFactory_Params
{
public:
	struct FVerseAIBase_fort_loot_info           RetVal;                                            // 0x0(0x28)(Parm, OutParm, ReturnParm, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           __verse_0xFB48ED96__InitOverrideMap;               // 0x28(0x50)(ConstParm, Parm, ContainsInstancedReference)
};

// 0x28 (0x28 - 0x0)
// Function VerseAIBase.VerseAIBase.VerseAIBase_fort_loot_info$Factory
struct UVerseAIBase_VerseAIBase_fort_loot_info_Factory_Params
{
public:
	struct FVerseAIBase_fort_loot_info           RetVal;                                            // 0x0(0x28)(Parm, OutParm, ReturnParm, NoDestructor)
};

// 0xAA (0xAA - 0x0)
// Function VerseAIBase.VerseAIBase.VerseAIBase_fort_weapon_descriptor$OverrideFactory
struct UVerseAIBase_VerseAIBase_fort_weapon_descriptor_OverrideFactory_Params
{
public:
	struct FVerseAIBase_fort_weapon_descriptor   RetVal;                                            // 0x0(0x18)(Parm, OutParm, ReturnParm, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           __verse_0xFB48ED96__InitOverrideMap;               // 0x18(0x50)(ConstParm, Parm, ContainsInstancedReference)
	FVerseStringProperty_                        _ExprResultStack_0;                                // 0x68(0x10)(HasGetValueTypeHash)
	FOptionProperty_                             _ExprResult_1;                                     // 0x78(0x2)(NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_3B3C[0x6];                                     // Fixing Size After Last Property..
	FVerseStringProperty_                        _ExprResultStack_2;                                // 0x80(0x10)(HasGetValueTypeHash)
	FOptionProperty_                             _ExprResult_3;                                     // 0x90(0x2)(NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_3B3D[0x6];                                     // Fixing Size After Last Property..
	FVerseStringProperty_                        _ExprResultStack_4;                                // 0x98(0x10)(HasGetValueTypeHash)
	FOptionProperty_                             _ExprResult_5;                                     // 0xA8(0x2)(NoDestructor, HasGetValueTypeHash)
};

// 0x18 (0x18 - 0x0)
// Function VerseAIBase.VerseAIBase.VerseAIBase_fort_weapon_descriptor$Factory
struct UVerseAIBase_VerseAIBase_fort_weapon_descriptor_Factory_Params
{
public:
	struct FVerseAIBase_fort_weapon_descriptor   RetVal;                                            // 0x0(0x18)(Parm, OutParm, ReturnParm, NoDestructor)
};

// 0x68 (0x68 - 0x0)
// Function VerseAIBase.VerseAIBase.VerseAIBase_fort_item_descriptor$OverrideFactory
struct UVerseAIBase_VerseAIBase_fort_item_descriptor_OverrideFactory_Params
{
public:
	struct FVerseAIBase_fort_item_descriptor     RetVal;                                            // 0x0(0x18)(Parm, OutParm, ReturnParm, NoDestructor)
	TMap<FVerseStringProperty_, uint8>           __verse_0xFB48ED96__InitOverrideMap;               // 0x18(0x50)(ConstParm, Parm, ContainsInstancedReference)
};

// 0x18 (0x18 - 0x0)
// Function VerseAIBase.VerseAIBase.VerseAIBase_fort_item_descriptor$Factory
struct UVerseAIBase_VerseAIBase_fort_item_descriptor_Factory_Params
{
public:
	struct FVerseAIBase_fort_item_descriptor     RetVal;                                            // 0x0(0x18)(Parm, OutParm, ReturnParm, NoDestructor)
};

// 0x0 (0x0 - 0x0)
// Function VerseAIBase.VerseAIBase.$InitCDO
struct UVerseAIBase__InitCDO_Params
{
public:
};

// 0x1 (0x1 - 0x0)
// Function VerseAIBase.VerseAIBase_ai_behavior._L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2fai__behavior_N_ROnEnd
struct UVerseAIBase_ai_behavior__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2fai__behavior_N_ROnEnd_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
};

// 0x28 (0x28 - 0x0)
// Function VerseAIBase.VerseAIBase_ai_behavior.OnBegin
struct UVerseAIBase_ai_behavior_OnBegin_Params
{
public:
	class UConcurrency_task*                     __verse_0xC1E81372_CallingTask;                    // 0x0(0x8)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                        __verse_0xA3A00DDB_CallerResumeState;              // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        __verse_0x2AC0E4D8_CallerCancelState;              // 0x10(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x18(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_3B3E[0x7];                                     // Fixing Size After Last Property..
	class UConcurrency_task*                     RetVal;                                            // 0x20(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// 0x10 (0x10 - 0x0)
// Function VerseAIBase.VerseAIBase_ai_behavior._L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2fai__behavior_N_RGetAgent
struct UVerseAIBase_ai_behavior__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2fai__behavior_N_RGetAgent_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_3B3F[0x7];                                     // Fixing Size After Last Property..
	FOptionProperty_                             RetVal;                                            // 0x8(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};

// 0x0 (0x0 - 0x0)
// Function VerseAIBase.VerseAIBase_ai_behavior.$InitInstance
struct UVerseAIBase_ai_behavior__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseAIBase.VerseAIBase_ai_behavior.$Block
struct UVerseAIBase_ai_behavior__Block_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseAIBase.VerseAIBase_ai_behavior.$InitCDO
struct UVerseAIBase_ai_behavior__InitCDO_Params
{
public:
};

// 0x28 (0x28 - 0x0)
// Function VerseAIBase.VerseAIBase_fort_character_actions_interface.Revive_L_Nagent_R
struct UVerseAIBase_fort_character_actions_interface_Revive_L_Nagent_R_Params
{
public:
	class UConcurrency_task*                     __verse_0xC1E81372_CallingTask;                    // 0x0(0x8)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                        __verse_0xA3A00DDB_CallerResumeState;              // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        __verse_0x2AC0E4D8_CallerCancelState;              // 0x10(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USimulation_agent*                     __verse_0xB2CDDD72_Argument;                       // 0x18(0x8)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UConcurrency_task*                     RetVal;                                            // 0x20(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// 0x28 (0x28 - 0x0)
// Function VerseAIBase.VerseAIBase_fort_character_actions_interface.PlayRandomEmote
struct UVerseAIBase_fort_character_actions_interface_PlayRandomEmote_Params
{
public:
	class UConcurrency_task*                     __verse_0xC1E81372_CallingTask;                    // 0x0(0x8)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                        __verse_0xA3A00DDB_CallerResumeState;              // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        __verse_0x2AC0E4D8_CallerCancelState;              // 0x10(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x18(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_3B42[0x7];                                     // Fixing Size After Last Property..
	class UConcurrency_task*                     RetVal;                                            // 0x20(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// 0x48 (0x48 - 0x0)
// Function VerseAIBase.VerseAIBase_fort_character_actions_interface.LootObject_L_Nfort__loot__info_R
struct UVerseAIBase_fort_character_actions_interface_LootObject_L_Nfort__loot__info_R_Params
{
public:
	class UConcurrency_task*                     __verse_0xC1E81372_CallingTask;                    // 0x0(0x8)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                        __verse_0xA3A00DDB_CallerResumeState;              // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        __verse_0x2AC0E4D8_CallerCancelState;              // 0x10(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVerseAIBase_fort_loot_info           __verse_0xB2CDDD72_Argument;                       // 0x18(0x28)(Parm, NoDestructor)
	class UConcurrency_task*                     RetVal;                                            // 0x40(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// 0x58 (0x58 - 0x0)
// Function VerseAIBase.VerseAIBase_fort_character_actions_interface.AttackThreat_L_Nfort__threat__info_R
struct UVerseAIBase_fort_character_actions_interface_AttackThreat_L_Nfort__threat__info_R_Params
{
public:
	class UConcurrency_task*                     __verse_0xC1E81372_CallingTask;                    // 0x0(0x8)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                        __verse_0xA3A00DDB_CallerResumeState;              // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        __verse_0x2AC0E4D8_CallerCancelState;              // 0x10(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVerseAIBase_fort_threat_info         __verse_0xB2CDDD72_Argument;                       // 0x18(0x38)(Parm, NoDestructor)
	class UConcurrency_task*                     RetVal;                                            // 0x50(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// 0x48 (0x48 - 0x0)
// Function VerseAIBase.VerseAIBase_fort_character_actions_interface.AttackObstacle_L_Nfort__obstacle__info_R
struct UVerseAIBase_fort_character_actions_interface_AttackObstacle_L_Nfort__obstacle__info_R_Params
{
public:
	class UConcurrency_task*                     __verse_0xC1E81372_CallingTask;                    // 0x0(0x8)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                        __verse_0xA3A00DDB_CallerResumeState;              // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        __verse_0x2AC0E4D8_CallerCancelState;              // 0x10(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVerseAIBase_fort_obstacle_info       __verse_0xB2CDDD72_Argument;                       // 0x18(0x28)(Parm, NoDestructor)
	class UConcurrency_task*                     RetVal;                                            // 0x40(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// 0x28 (0x28 - 0x0)
// Function VerseAIBase.VerseAIBase_fort_character_movement_interface.Walk
struct UVerseAIBase_fort_character_movement_interface_Walk_Params
{
public:
	class UConcurrency_task*                     __verse_0xC1E81372_CallingTask;                    // 0x0(0x8)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                        __verse_0xA3A00DDB_CallerResumeState;              // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        __verse_0x2AC0E4D8_CallerCancelState;              // 0x10(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x18(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_3B43[0x7];                                     // Fixing Size After Last Property..
	class UConcurrency_task*                     RetVal;                                            // 0x20(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// 0x28 (0x28 - 0x0)
// Function VerseAIBase.VerseAIBase_fort_character_movement_interface.TacticalSprint
struct UVerseAIBase_fort_character_movement_interface_TacticalSprint_Params
{
public:
	class UConcurrency_task*                     __verse_0xC1E81372_CallingTask;                    // 0x0(0x8)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                        __verse_0xA3A00DDB_CallerResumeState;              // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        __verse_0x2AC0E4D8_CallerCancelState;              // 0x10(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x18(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_3B44[0x7];                                     // Fixing Size After Last Property..
	class UConcurrency_task*                     RetVal;                                            // 0x20(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// 0x2 (0x2 - 0x0)
// Function VerseAIBase.VerseAIBase_fort_character_movement_interface._L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__character__movement__interface_N_RStandUp
struct UVerseAIBase_fort_character_movement_interface__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__character__movement__interface_N_RStandUp_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	enum class EVerseAIBase_action_result        RetVal;                                            // 0x1(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x28 (0x28 - 0x0)
// Function VerseAIBase.VerseAIBase_fort_character_movement_interface.Sprint
struct UVerseAIBase_fort_character_movement_interface_Sprint_Params
{
public:
	class UConcurrency_task*                     __verse_0xC1E81372_CallingTask;                    // 0x0(0x8)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                        __verse_0xA3A00DDB_CallerResumeState;              // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        __verse_0x2AC0E4D8_CallerCancelState;              // 0x10(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x18(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_3B45[0x7];                                     // Fixing Size After Last Property..
	class UConcurrency_task*                     RetVal;                                            // 0x20(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// 0x28 (0x28 - 0x0)
// Function VerseAIBase.VerseAIBase_fort_character_movement_interface.Slide
struct UVerseAIBase_fort_character_movement_interface_Slide_Params
{
public:
	class UConcurrency_task*                     __verse_0xC1E81372_CallingTask;                    // 0x0(0x8)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                        __verse_0xA3A00DDB_CallerResumeState;              // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        __verse_0x2AC0E4D8_CallerCancelState;              // 0x10(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x18(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_3B46[0x7];                                     // Fixing Size After Last Property..
	class UConcurrency_task*                     RetVal;                                            // 0x20(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// 0x28 (0x28 - 0x0)
// Function VerseAIBase.VerseAIBase_fort_character_movement_interface.Jump
struct UVerseAIBase_fort_character_movement_interface_Jump_Params
{
public:
	class UConcurrency_task*                     __verse_0xC1E81372_CallingTask;                    // 0x0(0x8)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                        __verse_0xA3A00DDB_CallerResumeState;              // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        __verse_0x2AC0E4D8_CallerCancelState;              // 0x10(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x18(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_3B47[0x7];                                     // Fixing Size After Last Property..
	class UConcurrency_task*                     RetVal;                                            // 0x20(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// 0x28 (0x28 - 0x0)
// Function VerseAIBase.VerseAIBase_fort_character_movement_interface.Crouch
struct UVerseAIBase_fort_character_movement_interface_Crouch_Params
{
public:
	class UConcurrency_task*                     __verse_0xC1E81372_CallingTask;                    // 0x0(0x8)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                        __verse_0xA3A00DDB_CallerResumeState;              // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        __verse_0x2AC0E4D8_CallerCancelState;              // 0x10(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x18(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_3B48[0x7];                                     // Fixing Size After Last Property..
	class UConcurrency_task*                     RetVal;                                            // 0x20(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function VerseAIBase.VerseAIBase_fort_inventory_interface._L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RUnregisterUseSuggestedWeaponCallback_L_Nint_R
struct UVerseAIBase_fort_inventory_interface__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RUnregisterUseSuggestedWeaponCallback_L_Nint_R_Params
{
public:
	int64                                        __verse_0xB2CDDD72_Argument;                       // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x18 (0x18 - 0x0)
// Function VerseAIBase.VerseAIBase_fort_inventory_interface._L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RRegisterUseSuggestedWeaponCallback_L_Nfort__item__descriptor_Tlogic_R
struct UVerseAIBase_fort_inventory_interface__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RRegisterUseSuggestedWeaponCallback_L_Nfort__item__descriptor_Tlogic_R_Params
{
public:
	FVerseFunctionProperty_                      __verse_0xB2CDDD72_Argument;                       // 0x0(0x10)(Parm, HasGetValueTypeHash)
	int64                                        RetVal;                                            // 0x10(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x19 (0x19 - 0x0)
// Function VerseAIBase.VerseAIBase_fort_inventory_interface._L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RIsWeaponEquipped_L_Nfort__item__descriptor_R
struct UVerseAIBase_fort_inventory_interface__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RIsWeaponEquipped_L_Nfort__item__descriptor_R_Params
{
public:
	struct FVerseAIBase_fort_item_descriptor     __verse_0xB2CDDD72_Argument;                       // 0x0(0x18)(Parm, NoDestructor)
	uint8                                        RetVal : 1;                                        // Mask: 0x1, PropSize: 0x10x18(0x1)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash)
};

// 0x38 (0x38 - 0x0)
// Function VerseAIBase.VerseAIBase_fort_inventory_interface._L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RGetWeaponDescriptor_L_Nfort__item__descriptor_R
struct UVerseAIBase_fort_inventory_interface__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RGetWeaponDescriptor_L_Nfort__item__descriptor_R_Params
{
public:
	struct FVerseAIBase_fort_item_descriptor     __verse_0xB2CDDD72_Argument;                       // 0x0(0x18)(Parm, NoDestructor)
	FOptionProperty_                             RetVal;                                            // 0x18(0x20)(Parm, OutParm, ReturnParm, NoDestructor)
};

// 0x28 (0x28 - 0x0)
// Function VerseAIBase.VerseAIBase_fort_inventory_interface._L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RGetCurrentWeapon
struct UVerseAIBase_fort_inventory_interface__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RGetCurrentWeapon_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_3B49[0x7];                                     // Fixing Size After Last Property..
	FOptionProperty_                             RetVal;                                            // 0x8(0x20)(Parm, OutParm, ReturnParm, NoDestructor)
};

// 0x18 (0x18 - 0x0)
// Function VerseAIBase.VerseAIBase_fort_inventory_interface._L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RGetAllItems
struct UVerseAIBase_fort_inventory_interface__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RGetAllItems_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_3B4A[0x7];                                     // Fixing Size After Last Property..
	TArray<struct FVerseAIBase_fort_item_descriptor> RetVal;                                            // 0x8(0x10)(Parm, OutParm, ReturnParm, ContainsInstancedReference)
};

// 0x1A (0x1A - 0x0)
// Function VerseAIBase.VerseAIBase_fort_inventory_interface._L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_REquipWeapon_L_Nfort__item__descriptor_R
struct UVerseAIBase_fort_inventory_interface__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_REquipWeapon_L_Nfort__item__descriptor_R_Params
{
public:
	struct FVerseAIBase_fort_item_descriptor     __verse_0xB2CDDD72_Argument;                       // 0x0(0x18)(Parm, NoDestructor)
	FOptionProperty_                             RetVal;                                            // 0x18(0x2)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x19 (0x19 - 0x0)
// Function VerseAIBase.VerseAIBase_fort_inventory_interface._L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RDropItem_L_Nfort__item__descriptor_R
struct UVerseAIBase_fort_inventory_interface__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RDropItem_L_Nfort__item__descriptor_R_Params
{
public:
	struct FVerseAIBase_fort_item_descriptor     __verse_0xB2CDDD72_Argument;                       // 0x0(0x18)(Parm, NoDestructor)
	uint8                                        RetVal : 1;                                        // Mask: 0x1, PropSize: 0x10x18(0x1)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash)
};

// 0x30 (0x30 - 0x0)
// Function VerseAIBase.VerseAIBase_fort_inventory_interface._L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RAddItemToInventory_L_Nfort__inventory__item__asset_M_Nint_R
struct UVerseAIBase_fort_inventory_interface__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RAddItemToInventory_L_Nfort__inventory__item__asset_M_Nint_R_Params
{
public:
	struct FTuple_Lfort__inventory__item__asset_Mint_R __verse_0xB2CDDD72_Argument;                       // 0x0(0x10)(Parm, HasGetValueTypeHash)
	FOptionProperty_                             RetVal;                                            // 0x10(0x20)(Parm, OutParm, ReturnParm, NoDestructor)
};

// 0x0 (0x0 - 0x0)
// Function VerseAIBase.VerseAIBase_fort_inventory_item_asset.$InitInstance
struct UVerseAIBase_fort_inventory_item_asset__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseAIBase.VerseAIBase_fort_inventory_item_asset.$Block
struct UVerseAIBase_fort_inventory_item_asset__Block_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseAIBase.VerseAIBase_fort_inventory_item_asset.$InitCDO
struct UVerseAIBase_fort_inventory_item_asset__InitCDO_Params
{
public:
};

// 0x21 (0x21 - 0x0)
// Function VerseAIBase.VerseAIBase_fort_item_interface._L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__item__interface_N_RHasTag_L_Nfort__item__descriptor_M_Nfort__item__tag_R
struct UVerseAIBase_fort_item_interface__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__item__interface_N_RHasTag_L_Nfort__item__descriptor_M_Nfort__item__tag_R_Params
{
public:
	struct FTuple_Lfort__item__descriptor_Mfort__item__tag_R __verse_0xB2CDDD72_Argument;                       // 0x0(0x20)(Parm, HasGetValueTypeHash)
	uint8                                        RetVal : 1;                                        // Mask: 0x1, PropSize: 0x10x20(0x1)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash)
};

// 0x0 (0x0 - 0x0)
// Function VerseAIBase.VerseAIBase_fort_item_interface.$InitCDO
struct UVerseAIBase_fort_item_interface__InitCDO_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseAIBase.VerseAIBase_fort_item_tag.$InitInstance
struct UVerseAIBase_fort_item_tag__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseAIBase.VerseAIBase_fort_item_tag.$Block
struct UVerseAIBase_fort_item_tag__Block_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseAIBase.VerseAIBase_fort_item_tag.$InitCDO
struct UVerseAIBase_fort_item_tag__InitCDO_Params
{
public:
};

// 0x38 (0x38 - 0x0)
// Function VerseAIBase.VerseAIBase_fort_loot_perception_interface._L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__loot__perception__interface_N_RGetBestObjectToLoot
struct UVerseAIBase_fort_loot_perception_interface__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__loot__perception__interface_N_RGetBestObjectToLoot_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_3B4B[0x7];                                     // Fixing Size After Last Property..
	FOptionProperty_                             RetVal;                                            // 0x8(0x30)(Parm, OutParm, ReturnParm, NoDestructor)
};

// 0x10 (0x10 - 0x0)
// Function VerseAIBase.VerseAIBase_fort_loot_perception_interface._L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__loot__perception__interface_N_RBestObjectTolootChangedEvent
struct UVerseAIBase_fort_loot_perception_interface__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__loot__perception__interface_N_RBestObjectTolootChangedEvent_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_3B4C[0x7];                                     // Fixing Size After Last Property..
	class UObject*                               RetVal;                                            // 0x8(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// 0x28 (0x28 - 0x0)
// Function VerseAIBase.VerseAIBase_fort_navigatable.RoamAround
struct UVerseAIBase_fort_navigatable_RoamAround_Params
{
public:
	class UConcurrency_task*                     __verse_0xC1E81372_CallingTask;                    // 0x0(0x8)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                        __verse_0xA3A00DDB_CallerResumeState;              // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        __verse_0x2AC0E4D8_CallerCancelState;              // 0x10(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x18(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_3B4D[0x7];                                     // Fixing Size After Last Property..
	class UConcurrency_task*                     RetVal;                                            // 0x20(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// 0x28 (0x28 - 0x0)
// Function VerseAIBase.VerseAIBase_fort_navigatable.MoveInRangeToAttack
struct UVerseAIBase_fort_navigatable_MoveInRangeToAttack_Params
{
public:
	class UConcurrency_task*                     __verse_0xC1E81372_CallingTask;                    // 0x0(0x8)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                        __verse_0xA3A00DDB_CallerResumeState;              // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                        __verse_0x2AC0E4D8_CallerCancelState;              // 0x10(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x18(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_3B4E[0x7];                                     // Fixing Size After Last Property..
	class UConcurrency_task*                     RetVal;                                            // 0x20(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// 0x10 (0x10 - 0x0)
// Function VerseAIBase.VerseAIBase_fort_obstacle_perception_interface._L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__obstacle__perception__interface_N_RObstacleChangedEvent
struct UVerseAIBase_fort_obstacle_perception_interface__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__obstacle__perception__interface_N_RObstacleChangedEvent_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_3B4F[0x7];                                     // Fixing Size After Last Property..
	class UObject*                               RetVal;                                            // 0x8(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// 0x38 (0x38 - 0x0)
// Function VerseAIBase.VerseAIBase_fort_obstacle_perception_interface._L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__obstacle__perception__interface_N_RGetObstacleInfo
struct UVerseAIBase_fort_obstacle_perception_interface__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__obstacle__perception__interface_N_RGetObstacleInfo_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_3B50[0x7];                                     // Fixing Size After Last Property..
	FOptionProperty_                             RetVal;                                            // 0x8(0x30)(Parm, OutParm, ReturnParm, NoDestructor)
};

// 0x0 (0x0 - 0x0)
// Function VerseAIBase.VerseAIBase_fort_resource_tag.$InitInstance
struct UVerseAIBase_fort_resource_tag__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseAIBase.VerseAIBase_fort_resource_tag.$Block
struct UVerseAIBase_fort_resource_tag__Block_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseAIBase.VerseAIBase_fort_resource_tag.$InitCDO
struct UVerseAIBase_fort_resource_tag__InitCDO_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseAIBase.VerseAIBase_fort_metal_tag.$InitInstance
struct UVerseAIBase_fort_metal_tag__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseAIBase.VerseAIBase_fort_metal_tag.$Block
struct UVerseAIBase_fort_metal_tag__Block_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseAIBase.VerseAIBase_fort_metal_tag.$InitCDO
struct UVerseAIBase_fort_metal_tag__InitCDO_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseAIBase.VerseAIBase_fort_stone_tag.$InitInstance
struct UVerseAIBase_fort_stone_tag__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseAIBase.VerseAIBase_fort_stone_tag.$Block
struct UVerseAIBase_fort_stone_tag__Block_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseAIBase.VerseAIBase_fort_stone_tag.$InitCDO
struct UVerseAIBase_fort_stone_tag__InitCDO_Params
{
public:
};

// 0x48 (0x48 - 0x0)
// Function VerseAIBase.VerseAIBase_fort_target_selection_interface._L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__target__selection__interface_N_RGetCurrentThreatInfo
struct UVerseAIBase_fort_target_selection_interface__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__target__selection__interface_N_RGetCurrentThreatInfo_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_3B51[0x7];                                     // Fixing Size After Last Property..
	FOptionProperty_                             RetVal;                                            // 0x8(0x40)(Parm, OutParm, ReturnParm, NoDestructor)
};

// 0x10 (0x10 - 0x0)
// Function VerseAIBase.VerseAIBase_fort_target_selection_interface._L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__target__selection__interface_N_RCurrentThreatStatusChangedEvent
struct UVerseAIBase_fort_target_selection_interface__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__target__selection__interface_N_RCurrentThreatStatusChangedEvent_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_3B52[0x7];                                     // Fixing Size After Last Property..
	class UObject*                               RetVal;                                            // 0x8(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// 0x10 (0x10 - 0x0)
// Function VerseAIBase.VerseAIBase_fort_target_selection_interface._L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__target__selection__interface_N_RCurrentThreatChangedEvent
struct UVerseAIBase_fort_target_selection_interface__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__target__selection__interface_N_RCurrentThreatChangedEvent_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_3B53[0x7];                                     // Fixing Size After Last Property..
	class UObject*                               RetVal;                                            // 0x8(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// 0x20 (0x20 - 0x0)
// Function VerseAIBase.VerseAIBase_fort_threat_perception_interface._L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__threat__perception__interface_N_RGetThreatsInfo
struct UVerseAIBase_fort_threat_perception_interface__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__threat__perception__interface_N_RGetThreatsInfo_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        Pad_3B54[0x7];                                     // Fixing Size After Last Property..
	FOptionProperty_                             RetVal;                                            // 0x8(0x18)(Parm, OutParm, ReturnParm, ContainsInstancedReference)
};

// 0x48 (0x48 - 0x0)
// Function VerseAIBase.VerseAIBase_fort_threat_perception_interface._L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__threat__perception__interface_N_RGetThreatInfo_L_Nagent_R
struct UVerseAIBase_fort_threat_perception_interface__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__threat__perception__interface_N_RGetThreatInfo_L_Nagent_R_Params
{
public:
	class USimulation_agent*                     __verse_0xB2CDDD72_Argument;                       // 0x0(0x8)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FOptionProperty_                             RetVal;                                            // 0x8(0x40)(Parm, OutParm, ReturnParm, NoDestructor)
};

// 0x2 (0x2 - 0x0)
// Function VerseAIBase.VerseAIBase_fort_weapon_actions_interface._L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__weapon__actions__interface_N_RReload
struct UVerseAIBase_fort_weapon_actions_interface__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__weapon__actions__interface_N_RReload_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        RetVal : 1;                                        // Mask: 0x1, PropSize: 0x10x1(0x1)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash)
};

// 0x2 (0x2 - 0x0)
// Function VerseAIBase.VerseAIBase_fort_weapon_actions_interface._L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__weapon__actions__interface_N_RMeleeAttack
struct UVerseAIBase_fort_weapon_actions_interface__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__weapon__actions__interface_N_RMeleeAttack_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        RetVal : 1;                                        // Mask: 0x1, PropSize: 0x10x1(0x1)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash)
};

// 0x2 (0x2 - 0x0)
// Function VerseAIBase.VerseAIBase_fort_weapon_actions_interface._L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__weapon__actions__interface_N_RFire
struct UVerseAIBase_fort_weapon_actions_interface__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__weapon__actions__interface_N_RFire_Params
{
public:
	struct FTuple_L_R                            __verse_0xB2CDDD72_Argument;                       // 0x0(0x1)(Parm, HasGetValueTypeHash)
	uint8                                        RetVal : 1;                                        // Mask: 0x1, PropSize: 0x10x1(0x1)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash)
};

// 0x0 (0x0 - 0x0)
// Function VerseAIBase.VerseAIBase_fort_weapon_tag.$InitInstance
struct UVerseAIBase_fort_weapon_tag__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseAIBase.VerseAIBase_fort_weapon_tag.$Block
struct UVerseAIBase_fort_weapon_tag__Block_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseAIBase.VerseAIBase_fort_weapon_tag.$InitCDO
struct UVerseAIBase_fort_weapon_tag__InitCDO_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseAIBase.VerseAIBase_fort_melee_weapon_tag.$InitInstance
struct UVerseAIBase_fort_melee_weapon_tag__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseAIBase.VerseAIBase_fort_melee_weapon_tag.$Block
struct UVerseAIBase_fort_melee_weapon_tag__Block_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseAIBase.VerseAIBase_fort_melee_weapon_tag.$InitCDO
struct UVerseAIBase_fort_melee_weapon_tag__InitCDO_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseAIBase.VerseAIBase_fort_pickaxe_tag.$InitInstance
struct UVerseAIBase_fort_pickaxe_tag__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseAIBase.VerseAIBase_fort_pickaxe_tag.$Block
struct UVerseAIBase_fort_pickaxe_tag__Block_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseAIBase.VerseAIBase_fort_pickaxe_tag.$InitCDO
struct UVerseAIBase_fort_pickaxe_tag__InitCDO_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseAIBase.VerseAIBase_fort_range_weapon_tag.$InitInstance
struct UVerseAIBase_fort_range_weapon_tag__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseAIBase.VerseAIBase_fort_range_weapon_tag.$Block
struct UVerseAIBase_fort_range_weapon_tag__Block_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseAIBase.VerseAIBase_fort_range_weapon_tag.$InitCDO
struct UVerseAIBase_fort_range_weapon_tag__InitCDO_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseAIBase.VerseAIBase_fort_biplane_gun_tag.$InitInstance
struct UVerseAIBase_fort_biplane_gun_tag__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseAIBase.VerseAIBase_fort_biplane_gun_tag.$Block
struct UVerseAIBase_fort_biplane_gun_tag__Block_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseAIBase.VerseAIBase_fort_biplane_gun_tag.$InitCDO
struct UVerseAIBase_fort_biplane_gun_tag__InitCDO_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseAIBase.VerseAIBase_fort_bow_tag.$InitInstance
struct UVerseAIBase_fort_bow_tag__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseAIBase.VerseAIBase_fort_bow_tag.$Block
struct UVerseAIBase_fort_bow_tag__Block_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseAIBase.VerseAIBase_fort_bow_tag.$InitCDO
struct UVerseAIBase_fort_bow_tag__InitCDO_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseAIBase.VerseAIBase_fort_grenade_launcher_tag.$InitInstance
struct UVerseAIBase_fort_grenade_launcher_tag__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseAIBase.VerseAIBase_fort_grenade_launcher_tag.$Block
struct UVerseAIBase_fort_grenade_launcher_tag__Block_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseAIBase.VerseAIBase_fort_grenade_launcher_tag.$InitCDO
struct UVerseAIBase_fort_grenade_launcher_tag__InitCDO_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseAIBase.VerseAIBase_fort_LMG_tag.$InitInstance
struct UVerseAIBase_fort_LMG_tag__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseAIBase.VerseAIBase_fort_LMG_tag.$Block
struct UVerseAIBase_fort_LMG_tag__Block_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseAIBase.VerseAIBase_fort_LMG_tag.$InitCDO
struct UVerseAIBase_fort_LMG_tag__InitCDO_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseAIBase.VerseAIBase_fort_mini_gun_tag.$InitInstance
struct UVerseAIBase_fort_mini_gun_tag__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseAIBase.VerseAIBase_fort_mini_gun_tag.$Block
struct UVerseAIBase_fort_mini_gun_tag__Block_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseAIBase.VerseAIBase_fort_mini_gun_tag.$InitCDO
struct UVerseAIBase_fort_mini_gun_tag__InitCDO_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseAIBase.VerseAIBase_fort_pistol_tag.$InitInstance
struct UVerseAIBase_fort_pistol_tag__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseAIBase.VerseAIBase_fort_pistol_tag.$Block
struct UVerseAIBase_fort_pistol_tag__Block_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseAIBase.VerseAIBase_fort_pistol_tag.$InitCDO
struct UVerseAIBase_fort_pistol_tag__InitCDO_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseAIBase.VerseAIBase_fort_rifle_tag.$InitInstance
struct UVerseAIBase_fort_rifle_tag__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseAIBase.VerseAIBase_fort_rifle_tag.$Block
struct UVerseAIBase_fort_rifle_tag__Block_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseAIBase.VerseAIBase_fort_rifle_tag.$InitCDO
struct UVerseAIBase_fort_rifle_tag__InitCDO_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseAIBase.VerseAIBase_fort_rocket_launcher_tag.$InitInstance
struct UVerseAIBase_fort_rocket_launcher_tag__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseAIBase.VerseAIBase_fort_rocket_launcher_tag.$Block
struct UVerseAIBase_fort_rocket_launcher_tag__Block_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseAIBase.VerseAIBase_fort_rocket_launcher_tag.$InitCDO
struct UVerseAIBase_fort_rocket_launcher_tag__InitCDO_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseAIBase.VerseAIBase_fort_shotgun_tag.$InitInstance
struct UVerseAIBase_fort_shotgun_tag__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseAIBase.VerseAIBase_fort_shotgun_tag.$Block
struct UVerseAIBase_fort_shotgun_tag__Block_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseAIBase.VerseAIBase_fort_shotgun_tag.$InitCDO
struct UVerseAIBase_fort_shotgun_tag__InitCDO_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseAIBase.VerseAIBase_fort_SMG_tag.$InitInstance
struct UVerseAIBase_fort_SMG_tag__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseAIBase.VerseAIBase_fort_SMG_tag.$Block
struct UVerseAIBase_fort_SMG_tag__Block_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseAIBase.VerseAIBase_fort_SMG_tag.$InitCDO
struct UVerseAIBase_fort_SMG_tag__InitCDO_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseAIBase.VerseAIBase_fort_sniper_tag.$InitInstance
struct UVerseAIBase_fort_sniper_tag__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseAIBase.VerseAIBase_fort_sniper_tag.$Block
struct UVerseAIBase_fort_sniper_tag__Block_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseAIBase.VerseAIBase_fort_sniper_tag.$InitCDO
struct UVerseAIBase_fort_sniper_tag__InitCDO_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseAIBase.VerseAIBase_fort_wood_tag.$InitInstance
struct UVerseAIBase_fort_wood_tag__InitInstance_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseAIBase.VerseAIBase_fort_wood_tag.$Block
struct UVerseAIBase_fort_wood_tag__Block_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function VerseAIBase.VerseAIBase_fort_wood_tag.$InitCDO
struct UVerseAIBase_fort_wood_tag__InitCDO_Params
{
public:
};

// 0x50 (0x50 - 0x0)
// Function VerseAIBase.VerseAIBase_FortCreatureActionsModule._L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2fFortCreatureActionsModule_N_RGetGameplayAbility_L_N_Kchar_R
struct UVerseAIBase_FortCreatureActionsModule__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2fFortCreatureActionsModule_N_RGetGameplayAbility_L_N_Kchar_R_Params
{
public:
	FVerseStringProperty_                        __verse_0xB2CDDD72_Argument;                       // 0x0(0x10)(Parm, HasGetValueTypeHash)
	class UGame_Abilities_gameplay_ability_asset* RetVal;                                            // 0x10(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseDynamicProperty_                       _ExprResultStack_0;                                // 0x18(0x10)(HasGetValueTypeHash)
	FVerseFunctionProperty_                      _Callee_1;                                         // 0x28(0x10)(HasGetValueTypeHash)
	struct FTuple_Lgameplay__ability__asset_M_Kchar_R _ExprResult_2;                                     // 0x38(0x18)(HasGetValueTypeHash)
};

// 0x0 (0x0 - 0x0)
// Function VerseAIBase.VerseAIBase_FortCreatureActionsModule.$InitCDO
struct UVerseAIBase_FortCreatureActionsModule__InitCDO_Params
{
public:
};

}
}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
