#pragma once

// Dumped with Dumper-7!


#include "../SDK.hpp"

namespace SDK
{
namespace Params
{
//---------------------------------------------------------------------------------------------------------------------
// PARAMETERS
//---------------------------------------------------------------------------------------------------------------------

// 0x10 (0x10 - 0x0)
// Function MeshModelingToolsExp.BakeInputMeshProperties.GetTargetUVLayerNamesFunc
struct UBakeInputMeshProperties_GetTargetUVLayerNamesFunc_Params
{
public:
	TArray<class FString>                        ReturnValue;                                       // 0x0(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function MeshModelingToolsExp.BakeInputMeshProperties.GetSourceUVLayerNamesFunc
struct UBakeInputMeshProperties_GetSourceUVLayerNamesFunc_Params
{
public:
	TArray<class FString>                        ReturnValue;                                       // 0x0(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function MeshModelingToolsExp.BakeTexture2DProperties.GetUVLayerNamesFunc
struct UBakeTexture2DProperties_GetUVLayerNamesFunc_Params
{
public:
	TArray<class FString>                        ReturnValue;                                       // 0x0(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function MeshModelingToolsExp.BakeMultiTexture2DProperties.GetUVLayerNamesFunc
struct UBakeMultiTexture2DProperties_GetUVLayerNamesFunc_Params
{
public:
	TArray<class FString>                        ReturnValue;                                       // 0x0(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function MeshModelingToolsExp.BakeMeshAttributeMapsToolProperties.GetMapPreviewNamesFunc
struct UBakeMeshAttributeMapsToolProperties_GetMapPreviewNamesFunc_Params
{
public:
	TArray<class FString>                        ReturnValue;                                       // 0x0(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function MeshModelingToolsExp.BakeMultiMeshAttributeMapsToolProperties.GetMapPreviewNamesFunc
struct UBakeMultiMeshAttributeMapsToolProperties_GetMapPreviewNamesFunc_Params
{
public:
	TArray<class FString>                        ReturnValue;                                       // 0x0(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function MeshModelingToolsExp.BakeMultiMeshInputToolProperties.GetTargetUVLayerNamesFunc
struct UBakeMultiMeshInputToolProperties_GetTargetUVLayerNamesFunc_Params
{
public:
	TArray<class FString>                        ReturnValue;                                       // 0x0(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function MeshModelingToolsExp.BakeRenderCaptureToolProperties.GetMapPreviewNamesFunc
struct UBakeRenderCaptureToolProperties_GetMapPreviewNamesFunc_Params
{
public:
	TArray<class FString>                        ReturnValue;                                       // 0x0(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function MeshModelingToolsExp.BakeRenderCaptureInputToolProperties.GetTargetUVLayerNamesFunc
struct UBakeRenderCaptureInputToolProperties_GetTargetUVLayerNamesFunc_Params
{
public:
	TArray<class FString>                        ReturnValue;                                       // 0x0(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function MeshModelingToolsExp.BakeRenderCaptureInputToolProperties.GetTargetUVLayerIndex
struct UBakeRenderCaptureInputToolProperties_GetTargetUVLayerIndex_Params
{
public:
	int32                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function MeshModelingToolsExp.OutputPolygroupLayerProperties.GetGroupOptionsList
struct UOutputPolygroupLayerProperties_GetGroupOptionsList_Params
{
public:
	TArray<class FString>                        ReturnValue;                                       // 0x0(0x10)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function MeshModelingToolsExp.CubeGridToolActions.SlideForward
struct UCubeGridToolActions_SlideForward_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function MeshModelingToolsExp.CubeGridToolActions.SlideBack
struct UCubeGridToolActions_SlideBack_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function MeshModelingToolsExp.CubeGridToolActions.ResetGridFromActor
struct UCubeGridToolActions_ResetGridFromActor_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function MeshModelingToolsExp.CubeGridToolActions.Push
struct UCubeGridToolActions_Push_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function MeshModelingToolsExp.CubeGridToolActions.Pull
struct UCubeGridToolActions_Pull_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function MeshModelingToolsExp.CubeGridToolActions.Flip
struct UCubeGridToolActions_Flip_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function MeshModelingToolsExp.CubeGridToolActions.CornerMode
struct UCubeGridToolActions_CornerMode_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function MeshModelingToolsExp.CubeGridDuringActivityActions.Done
struct UCubeGridDuringActivityActions_Done_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function MeshModelingToolsExp.CubeGridDuringActivityActions.Cancel
struct UCubeGridDuringActivityActions_Cancel_Params
{
public:
};

// 0x10 (0x10 - 0x0)
// Function MeshModelingToolsExp.DisplaceMeshCommonProperties.GetWeightMapsFunc
struct UDisplaceMeshCommonProperties_GetWeightMapsFunc_Params
{
public:
	TArray<class FString>                        ReturnValue;                                       // 0x0(0x10)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function MeshModelingToolsExp.SelectiveTessellationProperties.GetMaterialIDsFunc
struct USelectiveTessellationProperties_GetMaterialIDsFunc_Params
{
public:
	TArray<class FString>                        ReturnValue;                                       // 0x0(0x10)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function MeshModelingToolsExp.DynamicSculptToolActions.DiscardAttributes
struct UDynamicSculptToolActions_DiscardAttributes_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function MeshModelingToolsExp.EditPivotToolActionPropertySet.WorldOrigin
struct UEditPivotToolActionPropertySet_WorldOrigin_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function MeshModelingToolsExp.EditPivotToolActionPropertySet.Top
struct UEditPivotToolActionPropertySet_Top_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function MeshModelingToolsExp.EditPivotToolActionPropertySet.Right
struct UEditPivotToolActionPropertySet_Right_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function MeshModelingToolsExp.EditPivotToolActionPropertySet.Left
struct UEditPivotToolActionPropertySet_Left_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function MeshModelingToolsExp.EditPivotToolActionPropertySet.Front
struct UEditPivotToolActionPropertySet_Front_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function MeshModelingToolsExp.EditPivotToolActionPropertySet.Center
struct UEditPivotToolActionPropertySet_Center_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function MeshModelingToolsExp.EditPivotToolActionPropertySet.Bottom
struct UEditPivotToolActionPropertySet_Bottom_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function MeshModelingToolsExp.EditPivotToolActionPropertySet.Back
struct UEditPivotToolActionPropertySet_Back_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function MeshModelingToolsExp.HoleFillToolActions.SelectAll
struct UHoleFillToolActions_SelectAll_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function MeshModelingToolsExp.HoleFillToolActions.Clear
struct UHoleFillToolActions_Clear_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function MeshModelingToolsExp.LatticeDeformerToolProperties.Constrain
struct ULatticeDeformerToolProperties_Constrain_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function MeshModelingToolsExp.LatticeDeformerToolProperties.ClearConstraints
struct ULatticeDeformerToolProperties_ClearConstraints_Params
{
public:
};

// 0x10 (0x10 - 0x0)
// Function MeshModelingToolsExp.MeshAttributePaintToolProperties.GetAttributeNames
struct UMeshAttributePaintToolProperties_GetAttributeNames_Params
{
public:
	TArray<class FString>                        ReturnValue;                                       // 0x0(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function MeshModelingToolsExp.MeshGroupPaintToolFreezeActions.UnfreezeAll
struct UMeshGroupPaintToolFreezeActions_UnfreezeAll_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function MeshModelingToolsExp.MeshGroupPaintToolFreezeActions.ShrinkCurrent
struct UMeshGroupPaintToolFreezeActions_ShrinkCurrent_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function MeshModelingToolsExp.MeshGroupPaintToolFreezeActions.GrowCurrent
struct UMeshGroupPaintToolFreezeActions_GrowCurrent_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function MeshModelingToolsExp.MeshGroupPaintToolFreezeActions.FreezeOthers
struct UMeshGroupPaintToolFreezeActions_FreezeOthers_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function MeshModelingToolsExp.MeshGroupPaintToolFreezeActions.FreezeCurrent
struct UMeshGroupPaintToolFreezeActions_FreezeCurrent_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function MeshModelingToolsExp.MeshGroupPaintToolFreezeActions.FloodFillCurrent
struct UMeshGroupPaintToolFreezeActions_FloodFillCurrent_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function MeshModelingToolsExp.MeshGroupPaintToolFreezeActions.ClearCurrent
struct UMeshGroupPaintToolFreezeActions_ClearCurrent_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function MeshModelingToolsExp.MeshGroupPaintToolFreezeActions.ClearAll
struct UMeshGroupPaintToolFreezeActions_ClearAll_Params
{
public:
};

// 0x10 (0x10 - 0x0)
// Function MeshModelingToolsExp.MeshInspectorMaterialProperties.GetUVChannelNamesFunc
struct UMeshInspectorMaterialProperties_GetUVChannelNamesFunc_Params
{
public:
	TArray<class FString>                        ReturnValue;                                       // 0x0(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function MeshModelingToolsExp.MeshSelectionEditActions.Shrink
struct UMeshSelectionEditActions_Shrink_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function MeshModelingToolsExp.MeshSelectionEditActions.SelectAll
struct UMeshSelectionEditActions_SelectAll_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function MeshModelingToolsExp.MeshSelectionEditActions.OptimizeBorder
struct UMeshSelectionEditActions_OptimizeBorder_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function MeshModelingToolsExp.MeshSelectionEditActions.LargestTriCountPart
struct UMeshSelectionEditActions_LargestTriCountPart_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function MeshModelingToolsExp.MeshSelectionEditActions.LargestAreaPart
struct UMeshSelectionEditActions_LargestAreaPart_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function MeshModelingToolsExp.MeshSelectionEditActions.Invert
struct UMeshSelectionEditActions_Invert_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function MeshModelingToolsExp.MeshSelectionEditActions.Grow
struct UMeshSelectionEditActions_Grow_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function MeshModelingToolsExp.MeshSelectionEditActions.FloodFill
struct UMeshSelectionEditActions_FloodFill_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function MeshModelingToolsExp.MeshSelectionEditActions.ExpandToMaterials
struct UMeshSelectionEditActions_ExpandToMaterials_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function MeshModelingToolsExp.MeshSelectionEditActions.Clear
struct UMeshSelectionEditActions_Clear_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function MeshModelingToolsExp.MeshSelectionMeshEditActions.SmoothBorder
struct UMeshSelectionMeshEditActions_SmoothBorder_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function MeshModelingToolsExp.MeshSelectionMeshEditActions.Separate
struct UMeshSelectionMeshEditActions_Separate_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function MeshModelingToolsExp.MeshSelectionMeshEditActions.FlipNormals
struct UMeshSelectionMeshEditActions_FlipNormals_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function MeshModelingToolsExp.MeshSelectionMeshEditActions.Duplicate
struct UMeshSelectionMeshEditActions_Duplicate_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function MeshModelingToolsExp.MeshSelectionMeshEditActions.Disconnect
struct UMeshSelectionMeshEditActions_Disconnect_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function MeshModelingToolsExp.MeshSelectionMeshEditActions.Delete
struct UMeshSelectionMeshEditActions_Delete_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function MeshModelingToolsExp.MeshSelectionMeshEditActions.CreatePolygroup
struct UMeshSelectionMeshEditActions_CreatePolygroup_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function MeshModelingToolsExp.MeshSpaceDeformerToolActionPropertySet.ShiftToCenter
struct UMeshSpaceDeformerToolActionPropertySet_ShiftToCenter_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function MeshModelingToolsExp.MirrorToolActionPropertySet.Up
struct UMirrorToolActionPropertySet_Up_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function MeshModelingToolsExp.MirrorToolActionPropertySet.ShiftToCenter
struct UMirrorToolActionPropertySet_ShiftToCenter_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function MeshModelingToolsExp.MirrorToolActionPropertySet.Right
struct UMirrorToolActionPropertySet_Right_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function MeshModelingToolsExp.MirrorToolActionPropertySet.Left
struct UMirrorToolActionPropertySet_Left_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function MeshModelingToolsExp.MirrorToolActionPropertySet.Forward
struct UMirrorToolActionPropertySet_Forward_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function MeshModelingToolsExp.MirrorToolActionPropertySet.Down
struct UMirrorToolActionPropertySet_Down_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function MeshModelingToolsExp.MirrorToolActionPropertySet.Backward
struct UMirrorToolActionPropertySet_Backward_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function MeshModelingToolsExp.PlaneCutTool.FlipPlane
struct UPlaneCutTool_FlipPlane_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function MeshModelingToolsExp.PlaneCutTool.Cut
struct UPlaneCutTool_Cut_Params
{
public:
};

// 0x10 (0x10 - 0x0)
// Function MeshModelingToolsExp.TransferMeshToolProperties.GetTargetLODNamesFunc
struct UTransferMeshToolProperties_GetTargetLODNamesFunc_Params
{
public:
	TArray<class FString>                        ReturnValue;                                       // 0x0(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function MeshModelingToolsExp.TransferMeshToolProperties.GetSourceLODNamesFunc
struct UTransferMeshToolProperties_GetSourceLODNamesFunc_Params
{
public:
	TArray<class FString>                        ReturnValue;                                       // 0x0(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};

}
}


