#pragma once

// Dumped with Dumper-7!


#include "../SDK.hpp"

namespace SDK
{
namespace Params
{
//---------------------------------------------------------------------------------------------------------------------
// PARAMETERS
//---------------------------------------------------------------------------------------------------------------------

// 0x10 (0x10 - 0x0)
// Function PlayFabCommon.PlayFabAuthenticationContext.SetPlayFabId
struct UPlayFabAuthenticationContext_SetPlayFabId_Params
{
public:
	class FString                                InKey;                                             // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function PlayFabCommon.PlayFabAuthenticationContext.SetEntityToken
struct UPlayFabAuthenticationContext_SetEntityToken_Params
{
public:
	class FString                                InToken;                                           // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function PlayFabCommon.PlayFabAuthenticationContext.SetDeveloperSecretKey
struct UPlayFabAuthenticationContext_SetDeveloperSecretKey_Params
{
public:
	class FString                                InKey;                                             // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function PlayFabCommon.PlayFabAuthenticationContext.SetClientSessionTicket
struct UPlayFabAuthenticationContext_SetClientSessionTicket_Params
{
public:
	class FString                                InTicket;                                          // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function PlayFabCommon.PlayFabAuthenticationContext.GetPlayFabId
struct UPlayFabAuthenticationContext_GetPlayFabId_Params
{
public:
	class FString                                ReturnValue;                                       // 0x0(0x10)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function PlayFabCommon.PlayFabAuthenticationContext.GetEntityToken
struct UPlayFabAuthenticationContext_GetEntityToken_Params
{
public:
	class FString                                ReturnValue;                                       // 0x0(0x10)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function PlayFabCommon.PlayFabAuthenticationContext.GetDeveloperSecretKey
struct UPlayFabAuthenticationContext_GetDeveloperSecretKey_Params
{
public:
	class FString                                ReturnValue;                                       // 0x0(0x10)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function PlayFabCommon.PlayFabAuthenticationContext.GetClientSessionTicket
struct UPlayFabAuthenticationContext_GetClientSessionTicket_Params
{
public:
	class FString                                ReturnValue;                                       // 0x0(0x10)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function PlayFabCommon.PlayFabAuthenticationContext.ForgetAllCredentials
struct UPlayFabAuthenticationContext_ForgetAllCredentials_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function PlayFabCommon.PlayFabAuthenticationContext.ClientAdminSecurityCheck
struct UPlayFabAuthenticationContext_ClientAdminSecurityCheck_Params
{
public:
};

}
}


