#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x0 (0x28 - 0x28)
// Class SteamCoreWeb.SteamCoreWeb
class USteamCoreWeb : public UObject
{
public:

	static class UClass* StaticClass();
	static class USteamCoreWeb* GetDefaultObj();

};

// 0x18 (0x48 - 0x30)
// Class SteamCoreWeb.SteamCoreWebSubsystem
class USteamCoreWebSubsystem : public UGameInstanceSubsystem
{
public:
	uint8                                        Pad_B82[0x18];                                     // Fixing Size Of Struct

	static class UClass* StaticClass();
	static class USteamCoreWebSubsystem* GetDefaultObj();

};

// 0x28 (0x58 - 0x30)
// Class SteamCoreWeb.SteamCoreWebAsyncAction
class USteamCoreWebAsyncAction : public UBlueprintAsyncActionBase
{
public:
	FMulticastInlineDelegateProperty_            OnCallback;                                        // 0x30(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                        Pad_B8A[0x18];                                     // Fixing Size Of Struct

	static class UClass* StaticClass();
	static class USteamCoreWebAsyncAction* GetDefaultObj();

	void HandleCallback(const class FString& Data, bool bWasSuccessful);
};

// 0x40 (0x78 - 0x38)
// Class SteamCoreWeb.SteamCoreWebSettings
class USteamCoreWebSettings : public UDeveloperSettings
{
public:
	float                                        AsyncTaskTimeout;                                  // 0x38(0x4)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        DisabledSubsystems;                                // 0x3C(0x4)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bDebugging;                                        // 0x40(0x1)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bDevMode;                                          // 0x41(0x1)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_B8D[0x6];                                      // Fixing Size After Last Property 
	class FString                                Key;                                               // 0x48(0x10)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        AppID;                                             // 0x58(0x4)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_B8E[0x4];                                      // Fixing Size After Last Property 
	class FString                                DevSteamID;                                        // 0x60(0x10)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bSandboxMode;                                      // 0x70(0x1)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_B8F[0x7];                                      // Fixing Size Of Struct

	static class UClass* StaticClass();
	static class USteamCoreWebSettings* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class SteamCoreWeb.SteamWebUtilities
class USteamWebUtilities : public UBlueprintFunctionLibrary
{
public:

	static class UClass* StaticClass();
	static class USteamWebUtilities* GetDefaultObj();

	bool ParseJson(const class FString& JsonString, TArray<struct FSteamCoreJson>* Data);
	class FString GetProjectKey();
	int32 GetProjectAppID();
	class FString GetDevSteamID();
	void FindJsonStrings(const class FString& JsonString, const class FString& Key, TArray<class FString>* Values, enum class ESteamJsonResult* Result);
	void FindJsonString(const class FString& JsonString, const class FString& Key, class FString* Value, enum class ESteamJsonResult* Result);
	void FindJsonNumbers(const class FString& JsonString, const class FString& Key, TArray<int32>* Values, enum class ESteamJsonResult* Result);
	void FindJsonNumber(const class FString& JsonString, const class FString& Key, int32* Value, enum class ESteamJsonResult* Result);
	void FindJsonBools(const class FString& JsonString, const class FString& Key, TArray<bool>* bValues, enum class ESteamJsonResult* Result);
	void FindJsonBool(const class FString& JsonString, const class FString& Key, bool* bValue, enum class ESteamJsonResult* Result);
};

// 0x0 (0x48 - 0x48)
// Class SteamCoreWeb.WebApps
class UWebApps : public USteamCoreWebSubsystem
{
public:

	static class UClass* StaticClass();
	static class UWebApps* GetDefaultObj();

	void UpToDateCheck(FDelegateProperty_& Callback, int32 AppID, int32 Version);
	void SetAppBuildLive(FDelegateProperty_& Callback, const class FString& Key, int32 AppID, int32 BuildId, const class FString& BetaKey, const class FString& Description);
	void GetServersAtAddress(FDelegateProperty_& Callback, const class FString& Addr);
	void GetServerList(FDelegateProperty_& Callback, const class FString& Key, const class FString& Filter, int32 Limit);
	void GetPlayersBanned(FDelegateProperty_& Callback, const class FString& Key, int32 AppID);
	void GetCheatingReports(FDelegateProperty_& Callback, const class FString& Key, int32 AppID, int32 TimeBegin, int32 TimeEnd, bool bIncludeReports, bool bIncludeBans, int32 ReportidMin);
	void GetAppList(FDelegateProperty_& Callback, const class FString& Key);
	void GetAppDepotVersions(FDelegateProperty_& Callback, const class FString& Key, int32 AppID);
	void GetAppBuilds(FDelegateProperty_& Callback, const class FString& Key, int32 AppID, int32 Count);
	void GetAppBetas(FDelegateProperty_& Callback, const class FString& Key, int32 AppID);
};

// 0x0 (0x58 - 0x58)
// Class SteamCoreWeb.SteamCoreAppsAsyncActionGetAppBetas
class USteamCoreAppsAsyncActionGetAppBetas : public USteamCoreWebAsyncAction
{
public:

	static class UClass* StaticClass();
	static class USteamCoreAppsAsyncActionGetAppBetas* GetDefaultObj();

	class USteamCoreAppsAsyncActionGetAppBetas* GetAppBetasAsync(class UObject* WorldContextObject, const class FString& Key, int32 AppID);
};

// 0x0 (0x58 - 0x58)
// Class SteamCoreWeb.SteamCoreAppsAsyncActionGetAppBuilds
class USteamCoreAppsAsyncActionGetAppBuilds : public USteamCoreWebAsyncAction
{
public:

	static class UClass* StaticClass();
	static class USteamCoreAppsAsyncActionGetAppBuilds* GetDefaultObj();

	class USteamCoreAppsAsyncActionGetAppBuilds* GetAppBuildsAsync(class UObject* WorldContextObject, const class FString& Key, int32 AppID, int32 Count);
};

// 0x0 (0x58 - 0x58)
// Class SteamCoreWeb.SteamCoreAppsAsyncActionGetAppDepotVersions
class USteamCoreAppsAsyncActionGetAppDepotVersions : public USteamCoreWebAsyncAction
{
public:

	static class UClass* StaticClass();
	static class USteamCoreAppsAsyncActionGetAppDepotVersions* GetDefaultObj();

	class USteamCoreAppsAsyncActionGetAppDepotVersions* GetAppDepotVersionsAsync(class UObject* WorldContextObject, const class FString& Key, int32 AppID);
};

// 0x20 (0x50 - 0x30)
// Class SteamCoreWeb.SteamCoreAppsAsyncActionGetAppList
class USteamCoreAppsAsyncActionGetAppList : public UBlueprintAsyncActionBase
{
public:
	FMulticastInlineDelegateProperty_            OnCallback;                                        // 0x30(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                        Pad_C24[0x10];                                     // Fixing Size Of Struct

	static class UClass* StaticClass();
	static class USteamCoreAppsAsyncActionGetAppList* GetDefaultObj();

	void HandleCallback(TArray<struct FWebAppsGetAppList>& Data, bool bWasSuccessful);
	class USteamCoreAppsAsyncActionGetAppList* GetAppListAsync(class UObject* WorldContextObject);
};

// 0x0 (0x58 - 0x58)
// Class SteamCoreWeb.SteamCoreAppsAsyncActionGetCheatingReports
class USteamCoreAppsAsyncActionGetCheatingReports : public USteamCoreWebAsyncAction
{
public:

	static class UClass* StaticClass();
	static class USteamCoreAppsAsyncActionGetCheatingReports* GetDefaultObj();

