#pragma once

// Dumper.

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x478 (0x1088 - 0xC10)
// BlueprintGeneratedClass BP_GrindingComponent.BP_GrindingComponent_C
class UBP_GrindingComponent_C : public UFortPawnComponent_GrindRail
{
public:
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0xC10(0x8)(ZeroConstructor, Transient, DuplicateTransient)
	class APlayerPawn_Athena_C*                  Player;                                            // 0xC18(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UCharacterMovementComponent*           MovementComponent;                                 // 0xC20(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                         Grinding;                                          // 0xC28(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_A01B[0x3];                                     // Fixing Size After Last Property..
	float                                        Delta_Seconds;                                     // 0xC2C(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTacticalSprintEnergyComponent_C*      SprintComponent;                                   // 0xC30(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                          GC_Sprint;                                         // 0xC38(0x4)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_A01C[0x4];                                     // Fixing Size After Last Property..
	class USkeletalMeshComponent*                PlayerMesh;                                        // 0xC40(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                         CurrentlyADS;                                      // 0xC48(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_A01D[0x7];                                     // Fixing Size After Last Property..
	double                                       _new__CurrentSidewaysLeanBoostAmount;              // 0xC50(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       _new__GoalSidewaysLeanBoostAmount;                 // 0xC58(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       CurrentMaxSpeed;                                   // 0xC60(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         HitObstacle;                                       // 0xC68(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         AnimLayerActive;                                   // 0xC69(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Turning;                                           // 0xC6A(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_A01E[0x5];                                     // Fixing Size After Last Property..
	double                                       TurningAlpha;                                      // 0xC70(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       TurningDirection;                                  // 0xC78(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       LastRailSwitchTime;                                // 0xC80(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_            JumpedOff;                                         // 0xC88(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class ABGA_GrindRail_C*                      CurrentRail;                                       // 0xC98(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                       MaximumAngleForSideJump;                           // 0xCA0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        SideJump_NumberOfNewLocationsToTry;                // 0xCA8(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_A01F[0x4];                                     // Fixing Size After Last Property..
	double                                       SideJump_MinSpeedPercentToMaintain;                // 0xCB0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       SideJump_MaxSpeedWithoutAnchor;                    // 0xCB8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         DrawAnchorDebug;                                   // 0xCC0(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_A020[0x7];                                     // Fixing Size After Last Property..
	double                                       SF_SpeedHardCap;                                   // 0xCC8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        SF_SprintingMaxSpeed;                              // 0xCD0(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        SF_BoosterMaxSpeed;                                // 0xCD4(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        SF_ShootingMaxSpeedMultiplier;                     // 0xCD8(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        SF_BaseMaxSpeed;                                   // 0xCDC(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        SF_IncreasedMaxSpeedFromLeaningIntoTurn;           // 0xCE0(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_A021[0x4];                                     // Fixing Size After Last Property..
	double                                       SF_SpeedForMinBaseAcceleration;                    // 0xCE8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       SF_SpeedForMaxBaseAcceleration;                    // 0xCF0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       SF_MinBaseAcceleration;                            // 0xCF8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       SF_MaxBaseAcceleration;                            // 0xD00(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       SF_BaseGoalSpeed;                                  // 0xD08(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       SF_MaxDragForSpeedSoftCap;                         // 0xD10(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       SF_GravityForceWhenGoingUp;                        // 0xD18(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       SF_GravityForceWhenGoingDown;                      // 0xD20(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       SF_MinLeanAcceleration;                            // 0xD28(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       SF_MaxLeanAcceleration;                            // 0xD30(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       SF_SpeedThresholdForTurn;                          // 0xD38(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       SF_TimeToTurnAround;                               // 0xD40(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       SF_SpeedForMaxLeanAcceleration;                    // 0xD48(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       SF_SpeedForMinLeanAcceleration;                    // 0xD50(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       SF_SprintingAcceleration;                          // 0xD58(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       SF_Boosters_AccelerationOnSpeedUpBooster;          // 0xD60(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       SF_Boosters_SprintingAccelerationWhenOnSlowDownBooster; // 0xD68(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       SF_Boosters_SlowDownBoostersDragMultiplier;        // 0xD70(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       SF_Boosters_SlowDownBoosterGoalSpeed;              // 0xD78(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         SF_AccelerateByLeaningIntoTurns;                   // 0xD80(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_A022[0x7];                                     // Fixing Size After Last Property..
	double                                       SF_LeanIntoTurnsMaxAcceleration;                   // 0xD88(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       SF_CurvatureForMaxLeanIntoTurnsAcceleration;       // 0xD90(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       SF_MinSpeedAfterBouncedOffRailCap;                 // 0xD98(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       SF_SpeedMultiplierOnHitRailCap;                    // 0xDA0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                        SF_Sprinting_EnergyToUsePerSecond;                 // 0xDA8(0x28)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                        SF_MinStartSpeed;                                  // 0xDD0(0x28)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                        SF_MaxStartSpeed;                                  // 0xDF8(0x28)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                        SF_LandingSpeedBoost;                              // 0xE20(0x28)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                        SF_SameRailAnchoring_MaxForwardDistanceMultiplier; // 0xE48(0x28)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                        SF_SameRailAnchoring_MaxAngle;                     // 0xE70(0x28)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                        SF_InfluenceOfMomentumOnAnchorJump;                // 0xE98(0x28)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                        SF_NoAnchorJumpDistanceMultiplier;                 // 0xEC0(0x28)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                        SF_MinJumpOffSpeed;                                // 0xEE8(0x28)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                        SF_JumpHeight;                                     // 0xF10(0x28)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                        SF_JumpDistanceMultiplier;                         // 0xF38(0x28)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                        SF_SpeedMultiplierWhenImpactedPlayer;              // 0xF60(0x28)(Edit, BlueprintVisible, DisableEditOnInstance)
	double                                       SF_AngleForMaxSpeedIncreaseFromDownwardSlope;      // 0xF88(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       SF_MaxSpeedIncreaseFromDownwardSlope;              // 0xF90(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        SF_SideJump_HorizontalAngleMultiplier;             // 0xF98(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        SF_JumpModifierFromAccelerationVec;                // 0xF9C(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       SF_MaxDistanceFromJumpGoalForSameRailAnchoring;    // 0xFA0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       SF_HorizontalRailJumpHeight;                       // 0xFA8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       _new__SF_SidewaysLeanBoostReductionRate;           // 0xFB0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       _New__SF_BaseGoalDecelerationSpeed;                // 0xFB8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       _New__SF_FrictionWhenNotLeaning;                   // 0xFC0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                       JumpOnAudio;                                       // 0xFC8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UForceFeedbackComponent*               ForceFeedback_Sprinting;                           // 0xFD0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                       LastJumpedTime;                                    // 0xFD8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class EGrindRailBoosterMode             _new__PreviousBoosterMode;                         // 0xFE0(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         _new__GenerallyAccelerating;                       // 0xFE1(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_A023[0x2];                                     // Fixing Size After Last Property..
	struct FGameplayTag                          GC_GenerallyAccelerating;                          // 0xFE4(0x4)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                 BeginGrindBlockTags;                               // 0xFE8(0x20)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FVector                               CameraLocationOnStartedGrinding;                   // 0x1008(0x18)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortGrindRail*                        WaitingForCamera_SavedGrindRail;                   // 0x1020(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                         WaitingForCamera;                                  // 0x1028(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_A024[0x7];                                     // Fixing Size After Last Property..
	class UCameraModifier_Grinding_C*            CameraModifier;                                    // 0x1030(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                         StartedGrindFromLand;                              // 0x1038(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_A025[0x7];                                     // Fixing Size After Last Property..
	FMulticastInlineDelegateProperty_            OnFeetLanded;                                      // 0x1040(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FScalableFloat                        SF_MinBounceOffPlayerSpeed;                        // 0x1050(0x28)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                         IgnoreStaticPlacedBuilding;                        // 0x1078(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         UseNativizedGrindingIgnoreActors;                  // 0x1079(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         UseNativizedSprintInput;                           // 0x107A(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_A026[0x1];                                     // Fixing Size After Last Property..
	struct FGameplayTag                          Start_Grinding_Event_Tag;                          // 0x107C(0x4)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                          Stop_Grinding_Event_Tag;                           // 0x1080(0x4)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                          Start_Sprinting_Event_Tag;                         // 0x1084(0x4)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("BP_GrindingComponent_C");
		return Clss;
	}

	void Send_Gameplay_Event_Tag_To_Actor_Func(const struct FGameplayTag& EventTag, bool CallFunc_IsValid_ReturnValue, FInterfaceProperty_ CallFunc_GetOwnedGameplayTags_self_CastInput, const struct FGameplayTagContainer& CallFunc_GetOwnedGameplayTags_TagContainer, const struct FGameplayEventData& K2Node_MakeStruct_GameplayEventData);
	void CacheGrindRailActor(class ABGA_GrindRail_C* K2Node_DynamicCast_AsBGA_Grind_Rail, bool K2Node_DynamicCast_bSuccess, bool CallFunc_NotEqual_ObjectObject_ReturnValue);
	void LinkAnimLayer(class UAnimInstance* CallFunc_GetLinkedAnimLayerInstanceByClass_ReturnValue, bool CallFunc_IsValid_ReturnValue);
