#pragma once

// Dumper.

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// ENUMS
//---------------------------------------------------------------------------------------------------------------------


//---------------------------------------------------------------------------------------------------------------------
// STRUCTS
//---------------------------------------------------------------------------------------------------------------------

// 0x780 (0x780 - 0x0)
// UserDefinedStruct ClothParamsStruct.ClothParamsStruct
struct FClothParamsStruct
{
public:
	struct FClothSettingStruct                   Skydive_GoingUp_12_C026BDA74BFBABA6672DFE8FFDAAFC1B; // 0x0(0x5C)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_9AB5[0x4];                                     // Fixing Size After Last Property..
	struct FClothSettingStruct                   Skydive_FloatingDown_10_2CBF3D3F421785F8994502931454A81F; // 0x60(0x5C)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_9AB6[0x4];                                     // Fixing Size After Last Property..
	struct FClothSettingStruct                   Skydive_DivingDown_11_EC7BEC4D406A8A98E60D7B9374C5E457; // 0xC0(0x5C)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_9AB7[0x4];                                     // Fixing Size After Last Property..
	struct FClothSettingStruct                   Skydive_Parachuting_13_A88C4A0A407F497561D31287CB20250F; // 0x120(0x5C)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_9AB8[0x4];                                     // Fixing Size After Last Property..
	struct FClothSettingStruct                   OnGround_Standing_15_267DB1464D0D3A29D99E94ADFCB4AFEC; // 0x180(0x5C)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_9AB9[0x4];                                     // Fixing Size After Last Property..
	struct FClothSettingStruct                   OnGround_Moving_16_807A66B64D7B3B2FCF080B833B8A6254; // 0x1E0(0x5C)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_9ABA[0x4];                                     // Fixing Size After Last Property..
	struct FClothSettingStruct                   OnGround_Crouch_Moving_27_CE0B8BFB4E3417C0F790F7AE38DD7735; // 0x240(0x5C)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_9ABB[0x4];                                     // Fixing Size After Last Property..
	struct FClothSettingStruct                   EmoteOrMelee_25_CFCF66B5492987CBD638EC98EB34D572;  // 0x2A0(0x5C)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_9ABC[0x4];                                     // Fixing Size After Last Property..
	struct FClothSettingStruct                   Swimming_3_33CE87CE4D4F712B1384E29115845962;       // 0x300(0x5C)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_9ABD[0x4];                                     // Fixing Size After Last Property..
	struct FClothSettingStruct                   Front_End_20_C7A4562A48E9BC9B4CD34D963CFC6490;     // 0x360(0x5C)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_9ABE[0x4];                                     // Fixing Size After Last Property..
	struct FClothSettingStruct                   DBNO_30_2D70D4004D0E9B117F6CE9A09C362B74;          // 0x3C0(0x5C)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_9ABF[0x4];                                     // Fixing Size After Last Property..
	struct FClothSettingStruct                   DBNO_Carried_32_99829B99495FCFE3488A9A86B549ECE5;  // 0x420(0x5C)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_9AC0[0x4];                                     // Fixing Size After Last Property..
	struct FClothSettingStruct                   OnGround_Falling_36_CDAA0F4D476157E4137548BDCE8776F2; // 0x480(0x5C)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_9AC1[0x4];                                     // Fixing Size After Last Property..
	struct FClothSettingStruct                   Ziplining_39_BCCDB7E1431A4C174F1040ABC81FD8A8;     // 0x4E0(0x5C)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_9AC2[0x4];                                     // Fixing Size After Last Property..
	struct FClothSettingStruct                   Skydive_Surfing_42_408E65FF484AA54111E1ED8A69D8240D; // 0x540(0x5C)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_9AC3[0x4];                                     // Fixing Size After Last Property..
	struct FClothSettingStruct                   Riding_Standing_46_952A2A43408C37C44E4CBFAE3F3001B0; // 0x5A0(0x5C)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_9AC4[0x4];                                     // Fixing Size After Last Property..
	struct FClothSettingStruct                   Riding_Moving_47_EE7A01794460B9753E5076A5A3B3080A; // 0x600(0x5C)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_9AC5[0x4];                                     // Fixing Size After Last Property..
	struct FClothSettingStruct                   Riding_Moving_Targeting_52_2F57FD9E477C515D70B3DA9D75453357; // 0x660(0x5C)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_9AC6[0x4];                                     // Fixing Size After Last Property..
	struct FClothSettingStruct                   Tactical_Sprint_51_5B2273A1499D34BDEC52E6A8E3F274D4; // 0x6C0(0x5C)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_9AC7[0x4];                                     // Fixing Size After Last Property..
	struct FClothSettingStruct                   Rail_Grinding_55_DEEB00A04DB992DF5EEB40BD6518EA4E; // 0x720(0x5C)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_9AC8[0x4];                                     // Fixing Size Of Struct..
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
