#pragma once

// Dumper.

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x260 (0x288 - 0x28)
// Class Engine.Actor
class AActor : public UObject
{
public:
	struct FActorTickFunction                    PrimaryActorTick;                                  // 0x28(0x30)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	uint8                                        bNetTemporary : 1;                                 // Mask: 0x1, PropSize: 0x10x58(0x1)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        BitPad_6 : 1;                                      // Fixing Bit-Field Size..
	uint8                                        bOnlyRelevantToOwner : 1;                          // Mask: 0x4, PropSize: 0x10x58(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bAlwaysRelevant : 1;                               // Mask: 0x8, PropSize: 0x10x58(0x1)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bReplicateMovement : 1;                            // Mask: 0x10, PropSize: 0x10x58(0x1)(Edit, Net, DisableEditOnInstance, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        bCallPreReplication : 1;                           // Mask: 0x20, PropSize: 0x10x58(0x1)(Edit, DisableEditOnInstance, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        bCallPreReplicationForReplay : 1;                  // Mask: 0x40, PropSize: 0x10x58(0x1)(Edit, DisableEditOnInstance, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        bHidden : 1;                                       // Mask: 0x80, PropSize: 0x10x58(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, Net, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        bTearOff : 1;                                      // Mask: 0x1, PropSize: 0x10x59(0x1)(Net, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        bForceNetAddressable : 1;                          // Mask: 0x2, PropSize: 0x10x59(0x1)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        bExchangedRoles : 1;                               // Mask: 0x4, PropSize: 0x10x59(0x1)(Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bNetLoadOnClient : 1;                              // Mask: 0x8, PropSize: 0x10x59(0x1)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bNetUseOwnerRelevancy : 1;                         // Mask: 0x10, PropSize: 0x10x59(0x1)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bRelevantForNetworkReplays : 1;                    // Mask: 0x20, PropSize: 0x10x59(0x1)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bRelevantForLevelBounds : 1;                       // Mask: 0x40, PropSize: 0x10x59(0x1)(Edit, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bReplayRewindable : 1;                             // Mask: 0x80, PropSize: 0x10x59(0x1)(Edit, DisableEditOnInstance, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bAllowTickBeforeBeginPlay : 1;                     // Mask: 0x1, PropSize: 0x10x5A(0x1)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bAutoDestroyWhenFinished : 1;                      // Mask: 0x2, PropSize: 0x10x5A(0x1)(BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        bCanBeDamaged : 1;                                 // Mask: 0x4, PropSize: 0x10x5A(0x1)(Edit, BlueprintVisible, Net, SaveGame, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        bBlockInput : 1;                                   // Mask: 0x8, PropSize: 0x10x5A(0x1)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bCollideWhenPlacing : 1;                           // Mask: 0x10, PropSize: 0x10x5A(0x1)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bFindCameraComponentWhenViewTarget : 1;            // Mask: 0x20, PropSize: 0x10x5A(0x1)(Edit, BlueprintVisible, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bGenerateOverlapEventsDuringLevelStreaming : 1;    // Mask: 0x40, PropSize: 0x10x5A(0x1)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bIgnoresOriginShifting : 1;                        // Mask: 0x80, PropSize: 0x10x5A(0x1)(Edit, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bEnableAutoLODGeneration : 1;                      // Mask: 0x1, PropSize: 0x10x5B(0x1)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bIsEditorOnlyActor : 1;                            // Mask: 0x2, PropSize: 0x10x5B(0x1)(Edit, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bActorSeamlessTraveled : 1;                        // Mask: 0x4, PropSize: 0x10x5B(0x1)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bReplicates : 1;                                   // Mask: 0x8, PropSize: 0x10x5B(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bCanBeInCluster : 1;                               // Mask: 0x10, PropSize: 0x10x5B(0x1)(Edit, NoDestructor, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bAllowReceiveTickEventOnDedicatedServer : 1;       // Mask: 0x20, PropSize: 0x10x5B(0x1)(NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        BitPad_7 : 1;                                      // Fixing Bit-Field Size..
	uint8                                        bReplicateUsingRegisteredSubObjectList : 1;        // Mask: 0x80, PropSize: 0x10x5B(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, Config, DisableEditOnInstance, NoDestructor, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        BitPad_8 : 7;                                      // Fixing Bit-Field Size..
	uint8                                        bActorEnableCollision : 1;                         // Mask: 0x80, PropSize: 0x10x5C(0x1)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        bActorIsBeingDestroyed : 1;                        // Mask: 0x1, PropSize: 0x10x5D(0x1)(Transient, DuplicateTransient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        BitPad_9 : 4;                                      // Fixing Bit-Field Size..
	uint8                                        bAsyncPhysicsTickEnabled : 1;                      // Mask: 0x20, PropSize: 0x10x5D(0x1)(Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        BitPad_A : 2;                                      // Fixing Bit-Field Size..
	enum class EActorUpdateOverlapsMethod        UpdateOverlapsMethodDuringLevelStreaming;          // 0x5E(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EActorUpdateOverlapsMethod        DefaultUpdateOverlapsMethodDuringLevelStreaming;   // 0x5F(0x1)(Edit, ZeroConstructor, Config, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        InitialLifeSpan;                                   // 0x60(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        CustomTimeDilation;                                // 0x64(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class ENetRole                          RemoteRole;                                        // 0x68(0x1)(Edit, Net, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_17C[0x3];                                      // Fixing Size After Last Property..
	int32                                        RayTracingGroupId;                                 // 0x6C(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FRepAttachment                        AttachmentReplication;                             // 0x70(0x60)(Net, Transient, RepNotify, NoDestructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	struct FRepMovement                          ReplicatedMovement;                                // 0xD0(0x70)(Edit, Net, DisableEditOnInstance, RepNotify, NoDestructor, AdvancedDisplay, NativeAccessSpecifierPrivate)
	class AActor*                                Owner;                                             // 0x140(0x8)(Net, ZeroConstructor, RepNotify, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  NetDriverName;                                     // 0x148(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class ENetRole                          Role;                                              // 0x14C(0x1)(Edit, Net, ZeroConstructor, DisableEditOnTemplate, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	enum class ENetDormancy                      NetDormancy;                                       // 0x14D(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class ESpawnActorCollisionHandlingMethod SpawnCollisionHandlingMethod;                      // 0x14E(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EAutoReceiveInput                 AutoReceiveInput;                                  // 0x14F(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        InputPriority;                                     // 0x150(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_17D[0x4];                                      // Fixing Size After Last Property..
	class UInputComponent*                       InputComponent;                                    // 0x158(0x8)(ExportObject, ZeroConstructor, InstancedReference, DuplicateTransient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        NetCullDistanceSquared;                            // 0x160(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        NetTag;                                            // 0x164(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        NetUpdateFrequency;                                // 0x168(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MinNetUpdateFrequency;                             // 0x16C(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        NetPriority;                                       // 0x170(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_17E[0x4];                                      // Fixing Size After Last Property..
	class APawn*                                 Instigator;                                        // 0x178(0x8)(BlueprintVisible, Net, ZeroConstructor, RepNotify, NoDestructor, ExposeOnSpawn, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class AActor*>                        Children;                                          // 0x180(0x10)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPublic)
	class USceneComponent*                       RootComponent;                                     // 0x190(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_17F[0x8];                                      // Fixing Size After Last Property..
	TArray<class FName>                          Layers;                                            // 0x1A0(0x10)(Edit, ZeroConstructor, AdvancedDisplay, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class UChildActorComponent>   ParentComponent;                                   // 0x1B0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_180[0x10];                                     // Fixing Size After Last Property..
	TArray<class FName>                          Tags;                                              // 0x1C8(0x10)(Edit, BlueprintVisible, ZeroConstructor, AdvancedDisplay, NativeAccessSpecifierPublic)
	FMulticastSparseDelegateProperty_            OnTakeAnyDamage;                                   // 0x1D8(0x1)(InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic)
	FMulticastSparseDelegateProperty_            OnTakePointDamage;                                 // 0x1D9(0x1)(InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic)
	FMulticastSparseDelegateProperty_            OnTakeRadialDamage;                                // 0x1DA(0x1)(InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic)
	FMulticastSparseDelegateProperty_            OnActorBeginOverlap;                               // 0x1DB(0x1)(InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic)
	FMulticastSparseDelegateProperty_            OnActorEndOverlap;                                 // 0x1DC(0x1)(InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic)
	FMulticastSparseDelegateProperty_            OnBeginCursorOver;                                 // 0x1DD(0x1)(InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic)
	FMulticastSparseDelegateProperty_            OnEndCursorOver;                                   // 0x1DE(0x1)(InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic)
	FMulticastSparseDelegateProperty_            OnClicked;                                         // 0x1DF(0x1)(InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic)
	FMulticastSparseDelegateProperty_            OnReleased;                                        // 0x1E0(0x1)(InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic)
	FMulticastSparseDelegateProperty_            OnInputTouchBegin;                                 // 0x1E1(0x1)(InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic)
	FMulticastSparseDelegateProperty_            OnInputTouchEnd;                                   // 0x1E2(0x1)(InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic)
	FMulticastSparseDelegateProperty_            OnInputTouchEnter;                                 // 0x1E3(0x1)(InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic)
	FMulticastSparseDelegateProperty_            OnInputTouchLeave;                                 // 0x1E4(0x1)(InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic)
	FMulticastSparseDelegateProperty_            OnActorHit;                                        // 0x1E5(0x1)(InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic)
	FMulticastSparseDelegateProperty_            OnDestroyed;                                       // 0x1E6(0x1)(InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic)
	FMulticastSparseDelegateProperty_            OnEndPlay;                                         // 0x1E7(0x1)(InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                        Pad_181[0x80];                                     // Fixing Size After Last Property..
	TArray<class UActorComponent*>               InstanceComponents;                                // 0x268(0x10)(ExportObject, ZeroConstructor, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPrivate)
	TArray<class UActorComponent*>               BlueprintCreatedComponents;                        // 0x278(0x10)(ExportObject, ZeroConstructor, NonTransactional, ContainsInstancedReference, TextExportTransient, UObjectWrapper, NativeAccessSpecifierPublic)

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("Actor");
		return Clss;
	}

	bool WasRecentlyRendered(float Tolerance);
	void UserConstructionScript();
	void TearOff();
	void SetTickGroup(enum class ETickingGroup NewTickGroup);
	void SetTickableWhenPaused(bool bTickableWhenPaused);
	void SetReplicates(bool bInReplicates);
	void SetReplicateMovement(bool bInReplicateMovement);
	void SetRayTracingGroupId(int32 InRaytracingGroupId);
	void SetOwner(class AActor* NewOwner);
	void SetNetDormancy(enum class ENetDormancy NewDormancy);
	void SetLifeSpan(float InLifespan);
	void SetAutoDestroyWhenFinished(bool bVal);
	void SetActorTickInterval(float TickInterval);
	void SetActorTickEnabled(bool bEnabled);
	void SetActorScale3D(const struct FVector& NewScale3D);
	void SetActorRelativeScale3D(const struct FVector& NewRelativeScale);
	void SetActorHiddenInGame(bool bNewHidden);
	void SetActorEnableCollision(bool bNewActorEnableCollision);
	void RemoveTickPrerequisiteComponent(class UActorComponent* PrerequisiteComponent);
	void RemoveTickPrerequisiteActor(class AActor* PrerequisiteActor);
	void ReceiveTick(float DeltaSeconds);
	void ReceiveRadialDamage(float DamageReceived, class UDamageType* DamageType, const struct FVector& Origin, struct FHitResult& HitInfo, class AController* InstigatedBy, class AActor* DamageCauser);
	void ReceivePointDamage(float Damage, class UDamageType* DamageType, const struct FVector& HitLocation, const struct FVector& HitNormal, class UPrimitiveComponent* HitComponent, class FName BoneName, const struct FVector& ShotFromDirection, class AController* InstigatedBy, class AActor* DamageCauser, struct FHitResult& HitInfo);
	void ReceiveHit(class UPrimitiveComponent* MyComp, class AActor* Other, class UPrimitiveComponent* OtherComp, bool bSelfMoved, const struct FVector& HitLocation, const struct FVector& HitNormal, const struct FVector& NormalImpulse, struct FHitResult& Hit);
	void ReceiveEndPlay(enum class EEndPlayReason EndPlayReason);
	void ReceiveDestroyed();
	void ReceiveBeginPlay();
	void ReceiveAsyncPhysicsTick(float DeltaSeconds, float SimSeconds);
	void ReceiveAnyDamage(float Damage, class UDamageType* DamageType, class AController* InstigatedBy, class AActor* DamageCauser);
	void ReceiveActorOnReleased(const struct FKey& ButtonReleased);
	void ReceiveActorOnInputTouchLeave(enum class ETouchIndex FingerIndex);
	void ReceiveActorOnInputTouchEnter(enum class ETouchIndex FingerIndex);
	void ReceiveActorOnInputTouchEnd(enum class ETouchIndex FingerIndex);
	void ReceiveActorOnInputTouchBegin(enum class ETouchIndex FingerIndex);
	void ReceiveActorOnClicked(const struct FKey& ButtonPressed);
	void ReceiveActorEndOverlap(class AActor* OtherActor);
	void ReceiveActorEndCursorOver();
	void ReceiveActorBeginOverlap(class AActor* OtherActor);
	void ReceiveActorBeginCursorOver();
	void PrestreamTextures(float Seconds, bool bEnableStreaming, int32 CinematicTextureGroups);
	void OnRep_ReplicateMovement();
	void OnRep_ReplicatedMovement();
	void OnRep_Owner();
	void OnRep_Instigator();
	void OnRep_AttachmentReplication();
	void MakeNoise(float Loudness, class APawn* NoiseInstigator, const struct FVector& NoiseLocation, float MaxRange, class FName Tag);
	bool K2_TeleportTo(const struct FVector& DestLocation, const struct FRotator& DestRotation);
	bool K2_SetActorTransform(struct FTransform& NewTransform, bool bSweep, struct FHitResult* SweepHitResult, bool bTeleport);
	bool K2_SetActorRotation(const struct FRotator& NewRotation, bool bTeleportPhysics);
	void K2_SetActorRelativeTransform(struct FTransform& NewRelativeTransform, bool bSweep, struct FHitResult* SweepHitResult, bool bTeleport);
	void K2_SetActorRelativeRotation(const struct FRotator& NewRelativeRotation, bool bSweep, struct FHitResult* SweepHitResult, bool bTeleport);
	void K2_SetActorRelativeLocation(const struct FVector& NewRelativeLocation, bool bSweep, struct FHitResult* SweepHitResult, bool bTeleport);
	bool K2_SetActorLocationAndRotation(const struct FVector& NewLocation, const struct FRotator& NewRotation, bool bSweep, struct FHitResult* SweepHitResult, bool bTeleport);
	bool K2_SetActorLocation(const struct FVector& NewLocation, bool bSweep, struct FHitResult* SweepHitResult, bool bTeleport);
	void K2_OnReset();
	void K2_OnEndViewTarget(class APlayerController* PC);
	void K2_OnBecomeViewTarget(class APlayerController* PC);
	class USceneComponent* K2_GetRootComponent();
	TArray<class UActorComponent*> K2_GetComponentsByClass(TSubclassOf<class UActorComponent> ComponentClass);
	struct FRotator K2_GetActorRotation();
	struct FVector K2_GetActorLocation();
	void K2_DetachFromActor(enum class EDetachmentRule LocationRule, enum class EDetachmentRule RotationRule, enum class EDetachmentRule ScaleRule);
	void K2_DestroyActor();
	bool K2_AttachToComponent(class USceneComponent* Parent, class FName SocketName, enum class EAttachmentRule LocationRule, enum class EAttachmentRule RotationRule, enum class EAttachmentRule ScaleRule, bool bWeldSimulatedBodies);
	bool K2_AttachToActor(class AActor* ParentActor, class FName SocketName, enum class EAttachmentRule LocationRule, enum class EAttachmentRule RotationRule, enum class EAttachmentRule ScaleRule, bool bWeldSimulatedBodies);
	void K2_AttachRootComponentToActor(class AActor* InParentActor, class FName InSocketName, enum class EAttachLocation AttachLocationType, bool bWeldSimulatedBodies);
	void K2_AttachRootComponentTo(class USceneComponent* InParent, class FName InSocketName, enum class EAttachLocation AttachLocationType, bool bWeldSimulatedBodies);
	void K2_AddActorWorldTransformKeepScale(struct FTransform& DeltaTransform, bool bSweep, struct FHitResult* SweepHitResult, bool bTeleport);
	void K2_AddActorWorldTransform(struct FTransform& DeltaTransform, bool bSweep, struct FHitResult* SweepHitResult, bool bTeleport);
	void K2_AddActorWorldRotation(const struct FRotator& DeltaRotation, bool bSweep, struct FHitResult* SweepHitResult, bool bTeleport);
	void K2_AddActorWorldOffset(const struct FVector& DeltaLocation, bool bSweep, struct FHitResult* SweepHitResult, bool bTeleport);
	void K2_AddActorLocalTransform(struct FTransform& NewTransform, bool bSweep, struct FHitResult* SweepHitResult, bool bTeleport);
	void K2_AddActorLocalRotation(const struct FRotator& DeltaRotation, bool bSweep, struct FHitResult* SweepHitResult, bool bTeleport);
	void K2_AddActorLocalOffset(const struct FVector& DeltaLocation, bool bSweep, struct FHitResult* SweepHitResult, bool bTeleport);
	bool IsOverlappingActor(class AActor* Other);
	bool IsChildActor();
	bool IsActorTickEnabled();
	bool IsActorBeingDestroyed();
	bool HasAuthority();
	float GetVerticalDistanceTo(class AActor* OtherActor);
	struct FVector GetVelocity();
	struct FTransform GetTransform();
	bool GetTickableWhenPaused();
	float GetSquaredHorizontalDistanceTo(class AActor* OtherActor);
	float GetSquaredDistanceTo(class AActor* OtherActor);
	enum class ENetRole GetRemoteRole();
	int32 GetRayTracingGroupId();
	class UChildActorComponent* GetParentComponent();
	class AActor* GetParentActor();
	class AActor* GetOwner();
	void GetOverlappingComponents(TArray<class UPrimitiveComponent*>* OverlappingComponents);
	void GetOverlappingActors(TArray<class AActor*>* OverlappingActors, TSubclassOf<class AActor> ClassFilter);
	enum class ENetRole GetLocalRole();
	float GetLifeSpan();
	struct FTransform GetLevelTransform();
	class ULevel* GetLevel();
	class AController* GetInstigatorController();
	class APawn* GetInstigator();
	struct FVector GetInputVectorAxisValue(const struct FKey& InputAxisKey);
	float GetInputAxisValue(class FName InputAxisName);
	float GetInputAxisKeyValue(const struct FKey& InputAxisKey);
	float GetHorizontalDotProductTo(class AActor* OtherActor);
	float GetHorizontalDistanceTo(class AActor* OtherActor);
	float GetGameTimeSinceCreation();
	float GetDotProductTo(class AActor* OtherActor);
	float GetDistanceTo(class AActor* OtherActor);
	TArray<class UActorComponent*> GetComponentsByTag(TSubclassOf<class UActorComponent> ComponentClass, class FName Tag);
	TArray<class UActorComponent*> GetComponentsByInterface(TSubclassOf<class UInterface> Interface);
	class UActorComponent* GetComponentByClass(TSubclassOf<class UActorComponent> ComponentClass);
	class FName GetAttachParentSocketName();
	class AActor* GetAttachParentActor();
	void GetAttachedActors(TArray<class AActor*>* OutActors, bool bResetArray, bool bRecursivelyIncludeAttachedActors);
	void GetAllChildActors(TArray<class AActor*>* ChildActors, bool bIncludeDescendants);
	struct FVector GetActorUpVector();
	float GetActorTimeDilation();
	float GetActorTickInterval();
	struct FVector GetActorScale3D();
	struct FVector GetActorRightVector();
	struct FVector GetActorRelativeScale3D();
	struct FVector GetActorForwardVector();
	void GetActorEyesViewPoint(struct FVector* OutLocation, struct FRotator* OutRotation);
	bool GetActorEnableCollision();
	void GetActorBounds(bool bOnlyCollidingComponents, struct FVector* Origin, struct FVector* BoxExtent, bool bIncludeFromChildActors);
	void ForceNetUpdate();
	void FlushNetDormancy();
	void FinishAddComponent(class UActorComponent* Component, bool bManualAttachment, struct FTransform& RelativeTransform);
	void EnableInput(class APlayerController* PlayerController);
	void DisableInput(class APlayerController* PlayerController);
	void DetachRootComponentFromParent(bool bMaintainWorldPosition);
	void CreateInputComponent(TSubclassOf<class UInputComponent> InputComponentToCreate);
	void AddTickPrerequisiteComponent(class UActorComponent* PrerequisiteComponent);
	void AddTickPrerequisiteActor(class AActor* PrerequisiteActor);
	class UActorComponent* AddComponentByClass(TSubclassOf<class UActorComponent> Class, bool bManualAttachment, struct FTransform& RelativeTransform, bool bDeferredFinish);
	class UActorComponent* AddComponent(class FName TemplateName, bool bManualAttachment, struct FTransform& RelativeTransform, class UObject* ComponentTemplateContext, bool bDeferredFinish);
	bool ActorHasTag(class FName Tag);
};

// 0xF0 (0x378 - 0x288)
// Class Engine.HUD
class AHUD : public AActor
{
public:
	class APlayerController*                     PlayerOwner;                                       // 0x288(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bLostFocusPaused : 1;                              // Mask: 0x1, PropSize: 0x10x290(0x1)(BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bShowHUD : 1;                                      // Mask: 0x2, PropSize: 0x10x290(0x1)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bShowDebugInfo : 1;                                // Mask: 0x4, PropSize: 0x10x290(0x1)(BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        BitPad_B : 5;                                      // Fixing Bit-Field Size..
	uint8                                        Pad_192[0x3];                                      // Fixing Size After Last Property..
	int32                                        CurrentTargetIndex;                                // 0x294(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bShowHitBoxDebugInfo : 1;                          // Mask: 0x1, PropSize: 0x10x298(0x1)(BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bShowOverlays : 1;                                 // Mask: 0x2, PropSize: 0x10x298(0x1)(BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bEnableDebugTextShadow : 1;                        // Mask: 0x4, PropSize: 0x10x298(0x1)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        BitPad_C : 5;                                      // Fixing Bit-Field Size..
	uint8                                        Pad_193[0x7];                                      // Fixing Size After Last Property..
	TArray<class AActor*>                        PostRenderedActors;                                // 0x2A0(0x10)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	uint8                                        Pad_194[0x8];                                      // Fixing Size After Last Property..
	TArray<class FName>                          DebugDisplay;                                      // 0x2B8(0x10)(ZeroConstructor, Config, GlobalConfig, NativeAccessSpecifierPublic)
	TArray<class FName>                          ToggledDebugCategories;                            // 0x2C8(0x10)(ZeroConstructor, Config, GlobalConfig, NativeAccessSpecifierPublic)
	class UCanvas*                               Canvas;                                            // 0x2D8(0x8)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCanvas*                               DebugCanvas;                                       // 0x2E0(0x8)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FDebugTextInfo>                DebugTextList;                                     // 0x2E8(0x10)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TSubclassOf<class AActor>                    ShowDebugTargetDesiredClass;                       // 0x2F8(0x8)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class AActor*                                ShowDebugTargetActor;                              // 0x300(0x8)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_195[0x70];                                     // Fixing Size Of Struct..

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("HUD");
		return Clss;
	}

	void ShowHUD();
	void ShowDebugToggleSubCategory(class FName Category);
	void ShowDebugForReticleTargetToggle(TSubclassOf<class AActor> DesiredClass);
	void ShowDebug(class FName DebugType);
	void RemoveDebugText(class AActor* SrcActor, bool bLeaveDurationText);
	void RemoveAllDebugStrings();
	void ReceiveHitBoxRelease(class FName BoxName);
	void ReceiveHitBoxEndCursorOver(class FName BoxName);
	void ReceiveHitBoxClick(class FName BoxName);
	void ReceiveHitBoxBeginCursorOver(class FName BoxName);
	void ReceiveDrawHUD(int32 SizeX, int32 SizeY);
	struct FVector Project(const struct FVector& Location, bool bClampToZeroPlane);
	void PreviousDebugTarget();
	void NextDebugTarget();
	void GetTextSize(const class FString& Text, float* OutWidth, float* OutHeight, class UFont* Font, float Scale);
	class APlayerController* GetOwningPlayerController();
	class APawn* GetOwningPawn();
	void GetActorsInSelectionRectangle(TSubclassOf<class AActor> ClassFilter, struct FVector2D& FirstPoint, struct FVector2D& SecondPoint, TArray<class AActor*>* OutActors, bool bIncludeNonCollidingComponents, bool bActorMustBeFullyEnclosed);
	void DrawTextureSimple(class UTexture* Texture, float ScreenX, float ScreenY, float Scale, bool bScalePosition);
	void DrawTexture(class UTexture* Texture, float ScreenX, float ScreenY, float ScreenW, float ScreenH, float TextureU, float TextureV, float TextureUWidth, float TextureVHeight, const struct FLinearColor& TintColor, enum class EBlendMode BlendMode, float Scale, bool bScalePosition, float Rotation, const struct FVector2D& RotPivot);
	void DrawText(const class FString& Text, const struct FLinearColor& TextColor, float ScreenX, float ScreenY, class UFont* Font, float Scale, bool bScalePosition);
	void DrawRect(const struct FLinearColor& RectColor, float ScreenX, float ScreenY, float ScreenW, float ScreenH);
	void DrawMaterialTriangle(class UMaterialInterface* Material, const struct FVector2D& V0_Pos, const struct FVector2D& V1_Pos, const struct FVector2D& V2_Pos, const struct FVector2D& V0_UV, const struct FVector2D& V1_UV, const struct FVector2D& V2_UV, const struct FLinearColor& V0_Color, const struct FLinearColor& V1_Color, const struct FLinearColor& V2_Color);
	void DrawMaterialSimple(class UMaterialInterface* Material, float ScreenX, float ScreenY, float ScreenW, float ScreenH, float Scale, bool bScalePosition);
	void DrawMaterial(class UMaterialInterface* Material, float ScreenX, float ScreenY, float ScreenW, float ScreenH, float MaterialU, float MaterialV, float MaterialUWidth, float MaterialVHeight, float Scale, bool bScalePosition, float Rotation, const struct FVector2D& RotPivot);
	void DrawLine(float StartScreenX, float StartScreenY, float EndScreenX, float EndScreenY, const struct FLinearColor& LineColor, float LineThickness);
	void Deproject(float ScreenX, float ScreenY, struct FVector* WorldPosition, struct FVector* WorldDirection);
	void AddHitBox(const struct FVector2D& Position, const struct FVector2D& Size, class FName InName, bool bConsumesInput, int32 Priority);
	void AddDebugText(const class FString& DebugText, class AActor* SrcActor, float Duration, const struct FVector& Offset, const struct FVector& DesiredOffset, const struct FColor& TextColor, bool bSkipOverwriteCheck, bool bAbsoluteLocation, bool bKeepAttachedToActor, class UFont* InFont, float FontScale, bool bDrawShadow);
};

// 0x0 (0x28 - 0x28)
// Class Engine.BlueprintFunctionLibrary
class UBlueprintFunctionLibrary : public UObject
{
public:

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("BlueprintFunctionLibrary");
		return Clss;
	}

};

// 0x78 (0xA0 - 0x28)
// Class Engine.ActorComponent
class UActorComponent : public UObject
{
public:
	uint8                                        Pad_197[0x8];                                      // Fixing Size After Last Property..
	struct FActorComponentTickFunction           PrimaryComponentTick;                              // 0x30(0x30)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<class FName>                          ComponentTags;                                     // 0x60(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class UAssetUserData*>                AssetUserData;                                     // 0x70(0x10)(Edit, ExportObject, ZeroConstructor, ContainsInstancedReference, AdvancedDisplay, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	uint8                                        Pad_198[0x4];                                      // Fixing Size After Last Property..
	int32                                        UCSSerializationIndex;                             // 0x84(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        BitPad_D : 3;                                      // Fixing Bit-Field Size..
	uint8                                        bNetAddressable : 1;                               // Mask: 0x8, PropSize: 0x10x88(0x1)(NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bReplicateUsingRegisteredSubObjectList : 1;        // Mask: 0x10, PropSize: 0x10x88(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, Config, DisableEditOnInstance, NoDestructor, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bReplicates : 1;                                   // Mask: 0x20, PropSize: 0x10x88(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, Net, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        BitPad_E : 2;                                      // Fixing Bit-Field Size..
	uint8                                        Pad_199[0x1];                                      // Fixing Size After Last Property..
	uint8                                        BitPad_F : 1;                                      // Fixing Bit-Field Size..
	uint8                                        bAutoActivate : 1;                                 // Mask: 0x2, PropSize: 0x10x8A(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bIsActive : 1;                                     // Mask: 0x4, PropSize: 0x10x8A(0x1)(Net, Transient, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        bEditableWhenInherited : 1;                        // Mask: 0x8, PropSize: 0x10x8A(0x1)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        BitPad_10 : 1;                                     // Fixing Bit-Field Size..
	uint8                                        bCanEverAffectNavigation : 1;                      // Mask: 0x20, PropSize: 0x10x8A(0x1)(Edit, Config, NoDestructor, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        BitPad_11 : 1;                                     // Fixing Bit-Field Size..
	uint8                                        bIsEditorOnly : 1;                                 // Mask: 0x80, PropSize: 0x10x8A(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_19A[0x2];                                      // Fixing Size After Last Property..
	enum class EComponentCreationMethod          CreationMethod;                                    // 0x8D(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FMulticastSparseDelegateProperty_            OnComponentActivated;                              // 0x8E(0x1)(InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic)
	FMulticastSparseDelegateProperty_            OnComponentDeactivated;                            // 0x8F(0x1)(InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                        Pad_19B[0x10];                                     // Fixing Size Of Struct..

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("ActorComponent");
		return Clss;
	}

	void ToggleActive();
	void SetTickGroup(enum class ETickingGroup NewTickGroup);
	void SetTickableWhenPaused(bool bTickableWhenPaused);
	void SetIsReplicated(bool ShouldReplicate);
	void SetComponentTickIntervalAndCooldown(float TickInterval);
	void SetComponentTickInterval(float TickInterval);
	void SetComponentTickEnabled(bool bEnabled);
	void SetAutoActivate(bool bNewAutoActivate);
	void SetActive(bool bNewActive, bool bReset);
	void RemoveTickPrerequisiteComponent(class UActorComponent* PrerequisiteComponent);
	void RemoveTickPrerequisiteActor(class AActor* PrerequisiteActor);
	void ReceiveTick(float DeltaSeconds);
	void ReceiveEndPlay(enum class EEndPlayReason EndPlayReason);
	void ReceiveBeginPlay();
	void ReceiveAsyncPhysicsTick(float DeltaSeconds, float SimSeconds);
	void OnRep_IsActive();
	void K2_DestroyComponent(class UObject* Object);
	bool IsComponentTickEnabled();
	bool IsBeingDestroyed();
	bool IsActive();
	class AActor* GetOwner();
	float GetComponentTickInterval();
	void Deactivate();
	bool ComponentHasTag(class FName Tag);
	void AddTickPrerequisiteComponent(class UActorComponent* PrerequisiteComponent);
	void AddTickPrerequisiteActor(class AActor* PrerequisiteActor);
	void Activate(bool bReset);
};

// 0x200 (0x2A0 - 0xA0)
// Class Engine.SceneComponent
class USceneComponent : public UActorComponent
{
public:
	uint8                                        Pad_1C8[0x8];                                      // Fixing Size After Last Property..
	TWeakObjectPtr<class APhysicsVolume>         PhysicsVolume;                                     // 0xA8(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USceneComponent*                       AttachParent;                                      // 0xB0(0x8)(ExportObject, Net, ZeroConstructor, InstancedReference, RepNotify, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                  AttachSocketName;                                  // 0xB8(0x4)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_1C9[0x4];                                      // Fixing Size After Last Property..
	TArray<class USceneComponent*>               AttachChildren;                                    // 0xC0(0x10)(ExportObject, Net, ZeroConstructor, Transient, RepNotify, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPrivate)
	TArray<class USceneComponent*>               ClientAttachedChildren;                            // 0xD0(0x10)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                        Pad_1CA[0x48];                                     // Fixing Size After Last Property..
	struct FVector                               RelativeLocation;                                  // 0x128(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FRotator                              RelativeRotation;                                  // 0x140(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, NativeAccessSpecifierPrivate)
	struct FVector                               RelativeScale3D;                                   // 0x158(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FVector                               ComponentVelocity;                                 // 0x170(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bComponentToWorldUpdated : 1;                      // Mask: 0x1, PropSize: 0x10x188(0x1)(Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        BitPad_12 : 1;                                     // Fixing Bit-Field Size..
	uint8                                        bAbsoluteLocation : 1;                             // Mask: 0x4, PropSize: 0x10x188(0x1)(Edit, BlueprintVisible, Net, RepNotify, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        bAbsoluteRotation : 1;                             // Mask: 0x8, PropSize: 0x10x188(0x1)(Edit, BlueprintVisible, Net, RepNotify, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        bAbsoluteScale : 1;                                // Mask: 0x10, PropSize: 0x10x188(0x1)(Edit, BlueprintVisible, Net, RepNotify, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        bVisible : 1;                                      // Mask: 0x20, PropSize: 0x10x188(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        bShouldBeAttached : 1;                             // Mask: 0x40, PropSize: 0x10x188(0x1)(Net, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        bShouldSnapLocationWhenAttached : 1;               // Mask: 0x80, PropSize: 0x10x188(0x1)(Net, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        bShouldSnapRotationWhenAttached : 1;               // Mask: 0x1, PropSize: 0x10x189(0x1)(Net, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        bShouldSnapScaleWhenAttached : 1;                  // Mask: 0x2, PropSize: 0x10x189(0x1)(Net, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        bShouldUpdatePhysicsVolume : 1;                    // Mask: 0x4, PropSize: 0x10x189(0x1)(Edit, BlueprintVisible, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        bHiddenInGame : 1;                                 // Mask: 0x8, PropSize: 0x10x189(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bBoundsChangeTriggersStreamingDataRebuild : 1;     // Mask: 0x10, PropSize: 0x10x189(0x1)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bUseAttachParentBound : 1;                         // Mask: 0x20, PropSize: 0x10x189(0x1)(Edit, BlueprintVisible, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bComputeFastLocalBounds : 1;                       // Mask: 0x40, PropSize: 0x10x189(0x1)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bComputeBoundsOnceForGame : 1;                     // Mask: 0x80, PropSize: 0x10x189(0x1)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bComputedBoundsOnceForGame : 1;                    // Mask: 0x1, PropSize: 0x10x18A(0x1)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bIsNotRenderAttachmentRoot : 1;                    // Mask: 0x2, PropSize: 0x10x18A(0x1)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        BitPad_13 : 6;                                     // Fixing Bit-Field Size..
	enum class EComponentMobility                Mobility;                                          // 0x18B(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EDetailMode                       DetailMode;                                        // 0x18C(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FMulticastSparseDelegateProperty_            PhysicsVolumeChangedDelegate;                      // 0x18D(0x1)(InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                        Pad_1CB[0x112];                                    // Fixing Size Of Struct..

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("SceneComponent");
		return Clss;
	}

	void ToggleVisibility(bool bPropagateToChildren);
	void SetWorldScale3D(const struct FVector& NewScale);
	void SetVisibility(bool bNewVisibility, bool bPropagateToChildren);
	void SetShouldUpdatePhysicsVolume(bool bInShouldUpdatePhysicsVolume);
	void SetRelativeScale3D(const struct FVector& NewScale3D);
	void SetMobility(enum class EComponentMobility NewMobility);
	void SetHiddenInGame(bool NewHidden, bool bPropagateToChildren);
	void SetAbsolute(bool bNewAbsoluteLocation, bool bNewAbsoluteRotation, bool bNewAbsoluteScale);
	void ResetRelativeTransform();
	void OnRep_Visibility(bool OldValue);
	void OnRep_Transform();
	void OnRep_AttachSocketName();
	void OnRep_AttachParent();
	void OnRep_AttachChildren();
	void K2_SetWorldTransform(struct FTransform& NewTransform, bool bSweep, struct FHitResult* SweepHitResult, bool bTeleport);
	void K2_SetWorldRotation(const struct FRotator& NewRotation, bool bSweep, struct FHitResult* SweepHitResult, bool bTeleport);
	void K2_SetWorldLocationAndRotation(const struct FVector& NewLocation, const struct FRotator& NewRotation, bool bSweep, struct FHitResult* SweepHitResult, bool bTeleport);
	void K2_SetWorldLocation(const struct FVector& NewLocation, bool bSweep, struct FHitResult* SweepHitResult, bool bTeleport);
	void K2_SetRelativeTransform(struct FTransform& NewTransform, bool bSweep, struct FHitResult* SweepHitResult, bool bTeleport);
	void K2_SetRelativeRotation(const struct FRotator& NewRotation, bool bSweep, struct FHitResult* SweepHitResult, bool bTeleport);
	void K2_SetRelativeLocationAndRotation(const struct FVector& NewLocation, const struct FRotator& NewRotation, bool bSweep, struct FHitResult* SweepHitResult, bool bTeleport);
	void K2_SetRelativeLocation(const struct FVector& NewLocation, bool bSweep, struct FHitResult* SweepHitResult, bool bTeleport);
	struct FTransform K2_GetComponentToWorld();
	struct FVector K2_GetComponentScale();
	struct FRotator K2_GetComponentRotation();
	struct FVector K2_GetComponentLocation();
	void K2_DetachFromComponent(enum class EDetachmentRule LocationRule, enum class EDetachmentRule RotationRule, enum class EDetachmentRule ScaleRule, bool bCallModify);
	bool K2_AttachToComponent(class USceneComponent* Parent, class FName SocketName, enum class EAttachmentRule LocationRule, enum class EAttachmentRule RotationRule, enum class EAttachmentRule ScaleRule, bool bWeldSimulatedBodies);
	bool K2_AttachTo(class USceneComponent* InParent, class FName InSocketName, enum class EAttachLocation AttachType, bool bWeldSimulatedBodies);
	void K2_AddWorldTransformKeepScale(struct FTransform& DeltaTransform, bool bSweep, struct FHitResult* SweepHitResult, bool bTeleport);
	void K2_AddWorldTransform(struct FTransform& DeltaTransform, bool bSweep, struct FHitResult* SweepHitResult, bool bTeleport);
	void K2_AddWorldRotation(const struct FRotator& DeltaRotation, bool bSweep, struct FHitResult* SweepHitResult, bool bTeleport);
	void K2_AddWorldOffset(const struct FVector& DeltaLocation, bool bSweep, struct FHitResult* SweepHitResult, bool bTeleport);
	void K2_AddRelativeRotation(const struct FRotator& DeltaRotation, bool bSweep, struct FHitResult* SweepHitResult, bool bTeleport);
	void K2_AddRelativeLocation(const struct FVector& DeltaLocation, bool bSweep, struct FHitResult* SweepHitResult, bool bTeleport);
	void K2_AddLocalTransform(struct FTransform& DeltaTransform, bool bSweep, struct FHitResult* SweepHitResult, bool bTeleport);
	void K2_AddLocalRotation(const struct FRotator& DeltaRotation, bool bSweep, struct FHitResult* SweepHitResult, bool bTeleport);
	void K2_AddLocalOffset(const struct FVector& DeltaLocation, bool bSweep, struct FHitResult* SweepHitResult, bool bTeleport);
	bool IsVisible();
	bool IsSimulatingPhysics(class FName BoneName);
	bool IsAnySimulatingPhysics();
	struct FVector GetUpVector();
	struct FTransform GetSocketTransform(class FName InSocketName, enum class ERelativeTransformSpace TransformSpace);
	struct FRotator GetSocketRotation(class FName InSocketName);
	struct FQuat GetSocketQuaternion(class FName InSocketName);
	struct FVector GetSocketLocation(class FName InSocketName);
	bool GetShouldUpdatePhysicsVolume();
	struct FVector GetRightVector();
	struct FTransform GetRelativeTransform();
	class APhysicsVolume* GetPhysicsVolume();
	void GetParentComponents(TArray<class USceneComponent*>* Parents);
	int32 GetNumChildrenComponents();
	struct FVector GetForwardVector();
	struct FVector GetComponentVelocity();
	void GetChildrenComponents(bool bIncludeAllDescendants, TArray<class USceneComponent*>* Children);
	class USceneComponent* GetChildComponent(int32 ChildIndex);
	class FName GetAttachSocketName();
	class USceneComponent* GetAttachParent();
	TArray<class FName> GetAllSocketNames();
	bool DoesSocketExist(class FName InSocketName);
	void DetachFromParent(bool bMaintainWorldPosition, bool bCallModify);
};

// 0x2C8 (0x568 - 0x2A0)
// Class Engine.PrimitiveComponent
class UPrimitiveComponent : public USceneComponent
{
public:
	uint8                                        Pad_20E[0x18];                                     // Fixing Size After Last Property..
	float                                        MinDrawDistance;                                   // 0x2B8(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        LDMaxDrawDistance;                                 // 0x2BC(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        CachedMaxDrawDistance;                             // 0x2C0(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class ESceneDepthPriorityGroup          DepthPriorityGroup;                                // 0x2C4(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class ESceneDepthPriorityGroup          ViewOwnerDepthPriorityGroup;                       // 0x2C5(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EIndirectLightingCacheQuality     IndirectLightingCacheQuality;                      // 0x2C6(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class ELightmapType                     LightmapType;                                      // 0x2C7(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EHLODBatchingPolicy               HLODBatchingPolicy;                                // 0x2C8(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bEnableAutoLODGeneration : 1;                      // Mask: 0x1, PropSize: 0x10x2C9(0x1)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bIsActorTextureStreamingBuiltData : 1;             // Mask: 0x2, PropSize: 0x10x2C9(0x1)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bIsValidTextureStreamingBuiltData : 1;             // Mask: 0x4, PropSize: 0x10x2C9(0x1)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bNeverDistanceCull : 1;                            // Mask: 0x8, PropSize: 0x10x2C9(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        BitPad_14 : 4;                                     // Fixing Bit-Field Size..
	uint8                                        BitPad_15 : 1;                                     // Fixing Bit-Field Size..
	uint8                                        bAlwaysCreatePhysicsState : 1;                     // Mask: 0x2, PropSize: 0x10x2CA(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bGenerateOverlapEvents : 1;                        // Mask: 0x4, PropSize: 0x10x2CA(0x1)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        bMultiBodyOverlap : 1;                             // Mask: 0x8, PropSize: 0x10x2CA(0x1)(Edit, BlueprintVisible, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bTraceComplexOnMove : 1;                           // Mask: 0x10, PropSize: 0x10x2CA(0x1)(Edit, BlueprintVisible, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bReturnMaterialOnMove : 1;                         // Mask: 0x20, PropSize: 0x10x2CA(0x1)(Edit, BlueprintVisible, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bUseViewOwnerDepthPriorityGroup : 1;               // Mask: 0x40, PropSize: 0x10x2CA(0x1)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bAllowCullDistanceVolume : 1;                      // Mask: 0x80, PropSize: 0x10x2CA(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bVisibleInReflectionCaptures : 1;                  // Mask: 0x1, PropSize: 0x10x2CB(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bVisibleInRealTimeSkyCaptures : 1;                 // Mask: 0x2, PropSize: 0x10x2CB(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bVisibleInRayTracing : 1;                          // Mask: 0x4, PropSize: 0x10x2CB(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bRenderInMainPass : 1;                             // Mask: 0x8, PropSize: 0x10x2CB(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bRenderInDepthPass : 1;                            // Mask: 0x10, PropSize: 0x10x2CB(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bReceivesDecals : 1;                               // Mask: 0x20, PropSize: 0x10x2CB(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bHoldout : 1;                                      // Mask: 0x40, PropSize: 0x10x2CB(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bOwnerNoSee : 1;                                   // Mask: 0x80, PropSize: 0x10x2CB(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bOnlyOwnerSee : 1;                                 // Mask: 0x1, PropSize: 0x10x2CC(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bTreatAsBackgroundForOcclusion : 1;                // Mask: 0x2, PropSize: 0x10x2CC(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bUseAsOccluder : 1;                                // Mask: 0x4, PropSize: 0x10x2CC(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bSelectable : 1;                                   // Mask: 0x8, PropSize: 0x10x2CC(0x1)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bForceMipStreaming : 1;                            // Mask: 0x10, PropSize: 0x10x2CC(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bHasPerInstanceHitProxies : 1;                     // Mask: 0x20, PropSize: 0x10x2CC(0x1)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        CastShadow : 1;                                    // Mask: 0x40, PropSize: 0x10x2CC(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bEmissiveLightSource : 1;                          // Mask: 0x80, PropSize: 0x10x2CC(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bAffectDynamicIndirectLighting : 1;                // Mask: 0x1, PropSize: 0x10x2CD(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, Interp, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bAffectIndirectLightingWhileHidden : 1;            // Mask: 0x2, PropSize: 0x10x2CD(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, Interp, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bAffectDistanceFieldLighting : 1;                  // Mask: 0x4, PropSize: 0x10x2CD(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bCastDynamicShadow : 1;                            // Mask: 0x8, PropSize: 0x10x2CD(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bCastStaticShadow : 1;                             // Mask: 0x10, PropSize: 0x10x2CD(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bCastVolumetricTranslucentShadow : 1;              // Mask: 0x20, PropSize: 0x10x2CD(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bCastContactShadow : 1;                            // Mask: 0x40, PropSize: 0x10x2CD(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bSelfShadowOnly : 1;                               // Mask: 0x80, PropSize: 0x10x2CD(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bCastFarShadow : 1;                                // Mask: 0x1, PropSize: 0x10x2CE(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bCastInsetShadow : 1;                              // Mask: 0x2, PropSize: 0x10x2CE(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bCastCinematicShadow : 1;                          // Mask: 0x4, PropSize: 0x10x2CE(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bCastHiddenShadow : 1;                             // Mask: 0x8, PropSize: 0x10x2CE(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, Interp, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bCastShadowAsTwoSided : 1;                         // Mask: 0x10, PropSize: 0x10x2CE(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bLightAsIfStatic : 1;                              // Mask: 0x20, PropSize: 0x10x2CE(0x1)(Deprecated, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bLightAttachmentsAsGroup : 1;                      // Mask: 0x40, PropSize: 0x10x2CE(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bExcludeFromLightAttachmentGroup : 1;              // Mask: 0x80, PropSize: 0x10x2CE(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bReceiveMobileCSMShadows : 1;                      // Mask: 0x1, PropSize: 0x10x2CF(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bSingleSampleShadowFromStationaryLights : 1;       // Mask: 0x2, PropSize: 0x10x2CF(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bIgnoreRadialImpulse : 1;                          // Mask: 0x4, PropSize: 0x10x2CF(0x1)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bIgnoreRadialForce : 1;                            // Mask: 0x8, PropSize: 0x10x2CF(0x1)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bApplyImpulseOnDamage : 1;                         // Mask: 0x10, PropSize: 0x10x2CF(0x1)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bReplicatePhysicsToAutonomousProxy : 1;            // Mask: 0x20, PropSize: 0x10x2CF(0x1)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bFillCollisionUnderneathForNavmesh : 1;            // Mask: 0x40, PropSize: 0x10x2CF(0x1)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        AlwaysLoadOnClient : 1;                            // Mask: 0x80, PropSize: 0x10x2CF(0x1)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        AlwaysLoadOnServer : 1;                            // Mask: 0x1, PropSize: 0x10x2D0(0x1)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bUseEditorCompositing : 1;                         // Mask: 0x2, PropSize: 0x10x2D0(0x1)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bIsBeingMovedByEditor : 1;                         // Mask: 0x4, PropSize: 0x10x2D0(0x1)(Transient, DuplicateTransient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bRenderCustomDepth : 1;                            // Mask: 0x8, PropSize: 0x10x2D0(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bVisibleInSceneCaptureOnly : 1;                    // Mask: 0x10, PropSize: 0x10x2D0(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bHiddenInSceneCapture : 1;                         // Mask: 0x20, PropSize: 0x10x2D0(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bRayTracingFarField : 1;                           // Mask: 0x40, PropSize: 0x10x2D0(0x1)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        BitPad_16 : 1;                                     // Fixing Bit-Field Size..
	uint8                                        bHasNoStreamableTextures : 1;                      // Mask: 0x1, PropSize: 0x10x2D1(0x1)(NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bStaticWhenNotMoveable : 1;                        // Mask: 0x2, PropSize: 0x10x2D1(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        BitPad_17 : 6;                                     // Fixing Bit-Field Size..
	uint8                                        Pad_20F[0x1F];                                     // Fixing Size After Last Property..
	enum class EHasCustomNavigableGeometry       bHasCustomNavigableGeometry;                       // 0x2F1(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_210[0x1];                                      // Fixing Size After Last Property..
	enum class ECanBeCharacterBase               CanCharacterStepUpOn;                              // 0x2F3(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLightingChannels                     LightingChannels;                                  // 0x2F4(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AdvancedDisplay, NativeAccessSpecifierPublic)
	uint8                                        Pad_211[0x3];                                      // Fixing Size After Last Property..
	int32                                        RayTracingGroupId;                                 // 0x2F8(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        VisibilityId;                                      // 0x2FC(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        CustomDepthStencilValue;                           // 0x300(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_212[0x4];                                      // Fixing Size After Last Property..
	struct FCustomPrimitiveData                  CustomPrimitiveData;                               // 0x308(0x10)(Edit, NativeAccessSpecifierPrivate)
	struct FCustomPrimitiveData                  CustomPrimitiveDataInternal;                       // 0x318(0x10)(Transient, NativeAccessSpecifierPrivate)
	uint8                                        Pad_213[0x8];                                      // Fixing Size After Last Property..
	int32                                        TranslucencySortPriority;                          // 0x330(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        TranslucencySortDistanceOffset;                    // 0x334(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class URuntimeVirtualTexture*>        RuntimeVirtualTextures;                            // 0x338(0x10)(Edit, BlueprintVisible, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	int8                                         VirtualTextureLodBias;                             // 0x348(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int8                                         VirtualTextureCullMips;                            // 0x349(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int8                                         VirtualTextureMinCoverage;                         // 0x34A(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class ERuntimeVirtualTextureMainPassType VirtualTextureRenderPassType;                      // 0x34B(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_214[0x10];                                     // Fixing Size After Last Property..
	float                                        BoundsScale;                                       // 0x35C(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_215[0x10];                                     // Fixing Size After Last Property..
	TArray<class AActor*>                        MoveIgnoreActors;                                  // 0x370(0x10)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<class UPrimitiveComponent*>           MoveIgnoreComponents;                              // 0x380(0x10)(ExportObject, ZeroConstructor, Transient, DuplicateTransient, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPublic)
	uint8                                        Pad_216[0x10];                                     // Fixing Size After Last Property..
	struct FBodyInstance                         BodyInstance;                                      // 0x3A0(0x188)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	FMulticastSparseDelegateProperty_            OnComponentHit;                                    // 0x528(0x1)(InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic)
	FMulticastSparseDelegateProperty_            OnComponentBeginOverlap;                           // 0x529(0x1)(InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic)
	FMulticastSparseDelegateProperty_            OnComponentEndOverlap;                             // 0x52A(0x1)(InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic)
	FMulticastSparseDelegateProperty_            OnComponentWake;                                   // 0x52B(0x1)(InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic)
	FMulticastSparseDelegateProperty_            OnComponentSleep;                                  // 0x52C(0x1)(InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                        Pad_217[0x1];                                      // Fixing Size After Last Property..
	FMulticastSparseDelegateProperty_            OnComponentPhysicsStateChanged;                    // 0x52E(0x1)(InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic)
	FMulticastSparseDelegateProperty_            OnBeginCursorOver;                                 // 0x52F(0x1)(InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic)
	FMulticastSparseDelegateProperty_            OnEndCursorOver;                                   // 0x530(0x1)(InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic)
	FMulticastSparseDelegateProperty_            OnClicked;                                         // 0x531(0x1)(InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic)
	FMulticastSparseDelegateProperty_            OnReleased;                                        // 0x532(0x1)(InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic)
	FMulticastSparseDelegateProperty_            OnInputTouchBegin;                                 // 0x533(0x1)(InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic)
	FMulticastSparseDelegateProperty_            OnInputTouchEnd;                                   // 0x534(0x1)(InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic)
	FMulticastSparseDelegateProperty_            OnInputTouchEnter;                                 // 0x535(0x1)(InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic)
	FMulticastSparseDelegateProperty_            OnInputTouchLeave;                                 // 0x536(0x1)(InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic)
	enum class ERayTracingGroupCullingPriority   RayTracingGroupCullingPriority;                    // 0x537(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class ERendererStencilMask              CustomDepthStencilWriteMask;                       // 0x538(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_218[0x1F];                                     // Fixing Size After Last Property..
	uint8                                        ExcludeFromHLODLevels;                             // 0x558(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_219[0x7];                                      // Fixing Size After Last Property..
	class UPrimitiveComponent*                   LODParentPrimitive;                                // 0x560(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, NonPIEDuplicateTransient, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("PrimitiveComponent");
		return Clss;
	}

	bool WasRecentlyRendered(float Tolerance);
	void WakeRigidBody(class FName BoneName);
	void WakeAllRigidBodies();
	void SetWalkableSlopeOverride(struct FWalkableSlopeOverride& NewOverride);
	void SetVisibleInSceneCaptureOnly(bool bValue);
	void SetVisibleInRayTracing(bool bNewVisibleInRayTracing);
	void SetVectorParameterForDefaultCustomPrimitiveData(class FName ParameterName, const struct FVector4& Value);
	void SetVectorParameterForCustomPrimitiveData(class FName ParameterName, const struct FVector4& Value);
	void SetUseCCD(bool InUseCCD, class FName BoneName);
	void SetTranslucentSortPriority(int32 NewTranslucentSortPriority);
	void SetTranslucencySortDistanceOffset(float NewTranslucencySortDistanceOffset);
	void SetStaticWhenNotMoveable(bool bInStaticWhenNotMoveable);
	void SetSingleSampleShadowFromStationaryLights(bool bNewSingleSampleShadowFromStationaryLights);
	void SetSimulatePhysics(bool bSimulate);
	void SetScalarParameterForDefaultCustomPrimitiveData(class FName ParameterName, float Value);
	void SetScalarParameterForCustomPrimitiveData(class FName ParameterName, float Value);
	void SetRenderInMainPass(bool bValue);
	void SetRenderInDepthPass(bool bValue);
	void SetRenderCustomDepth(bool bValue);
	void SetReceivesDecals(bool bNewReceivesDecals);
	void SetPhysMaterialOverride(class UPhysicalMaterial* NewPhysMaterial);
	void SetPhysicsMaxAngularVelocityInRadians(float NewMaxAngVel, bool bAddToCurrent, class FName BoneName);
	void SetPhysicsMaxAngularVelocityInDegrees(float NewMaxAngVel, bool bAddToCurrent, class FName BoneName);
	void SetPhysicsLinearVelocity(const struct FVector& NewVel, bool bAddToCurrent, class FName BoneName);
	void SetPhysicsAngularVelocityInRadians(const struct FVector& NewAngVel, bool bAddToCurrent, class FName BoneName);
	void SetPhysicsAngularVelocityInDegrees(const struct FVector& NewAngVel, bool bAddToCurrent, class FName BoneName);
	void SetOwnerNoSee(bool bNewOwnerNoSee);
	void SetOnlyOwnerSee(bool bNewOnlyOwnerSee);
	void SetNotifyRigidBodyCollision(bool bNewNotifyRigidBodyCollision);
	void SetMaterialByName(class FName MaterialSlotName, class UMaterialInterface* Material);
	void SetMaterial(int32 ElementIndex, class UMaterialInterface* Material);
	void SetMassScale(class FName BoneName, float InMassScale);
	void SetMassOverrideInKg(class FName BoneName, float MassInKg, bool bOverrideMass);
	void SetLinearDamping(float InDamping);
	void SetLightingChannels(bool bChannel0, bool bChannel1, bool bChannel2);
	void SetLightAttachmentsAsGroup(bool bInLightAttachmentsAsGroup);
	void SetIgnoreBoundsForEditorFocus(bool bIgnore);
	void SetHoldout(bool bNewHoldout);
	void SetHiddenInSceneCapture(bool bValue);
	void SetGenerateOverlapEvents(bool bInGenerateOverlapEvents);
	void SetExcludeFromLightAttachmentGroup(bool bInExcludeFromLightAttachmentGroup);
	void SetExcludeForSpecificHLODLevels(TArray<int32>& InExcludeForSpecificHLODLevels);
	void SetExcludedFromHLODLevel(enum class EHLODLevelExclusion HLODLevel, bool bExcluded);
	void SetEnableGravity(bool bGravityEnabled);
	void SetEmissiveLightSource(bool NewEmissiveLightSource);
	void SetDefaultCustomPrimitiveDataVector4(int32 DataIndex, const struct FVector4& Value);
	void SetDefaultCustomPrimitiveDataVector3(int32 DataIndex, const struct FVector& Value);
	void SetDefaultCustomPrimitiveDataVector2(int32 DataIndex, const struct FVector2D& Value);
	void SetDefaultCustomPrimitiveDataFloat(int32 DataIndex, float Value);
	void SetCustomPrimitiveDataVector4(int32 DataIndex, const struct FVector4& Value);
	void SetCustomPrimitiveDataVector3(int32 DataIndex, const struct FVector& Value);
	void SetCustomPrimitiveDataVector2(int32 DataIndex, const struct FVector2D& Value);
	void SetCustomPrimitiveDataFloat(int32 DataIndex, float Value);
	void SetCustomDepthStencilWriteMask(enum class ERendererStencilMask WriteMaskBit);
	void SetCustomDepthStencilValue(int32 Value);
	void SetCullDistance(float NewCullDistance);
	void SetConstraintMode(enum class EDOFMode ConstraintMode);
	void SetCollisionResponseToChannel(enum class ECollisionChannel Channel, enum class ECollisionResponse NewResponse);
	void SetCollisionResponseToAllChannels(enum class ECollisionResponse NewResponse);
	void SetCollisionProfileName(class FName InCollisionProfileName, bool bUpdateOverlaps);
	void SetCollisionObjectType(enum class ECollisionChannel Channel);
	void SetCollisionEnabled(enum class ECollisionEnabled NewType);
	void SetCenterOfMass(const struct FVector& CenterOfMassOffset, class FName BoneName);
	void SetCastShadow(bool NewCastShadow);
	void SetCastInsetShadow(bool bInCastInsetShadow);
	void SetCastHiddenShadow(bool NewCastHiddenShadow);
	void SetCastContactShadow(bool bInCastContactShadow);
	void SetBoundsScale(float NewBoundsScale);
	void SetAngularDamping(float InDamping);
	void SetAllUseCCD(bool InUseCCD);
	void SetAllPhysicsLinearVelocity(const struct FVector& NewVel, bool bAddToCurrent);
	void SetAllPhysicsAngularVelocityInRadians(struct FVector& NewAngVel, bool bAddToCurrent);
	void SetAllPhysicsAngularVelocityInDegrees(struct FVector& NewAngVel, bool bAddToCurrent);
	void SetAllMassScale(float InMassScale);
	void SetAffectIndirectLightingWhileHidden(bool bNewAffectIndirectLightingWhileHidden);
	void SetAffectDynamicIndirectLighting(bool bNewAffectDynamicIndirectLighting);
	void SetAffectDistanceFieldLighting(bool NewAffectDistanceFieldLighting);
	struct FVector ScaleByMomentOfInertia(const struct FVector& InputVector, class FName BoneName);
	void PutRigidBodyToSleep(class FName BoneName);
	bool K2_SphereTraceComponent(const struct FVector& TraceStart, const struct FVector& TraceEnd, float SphereRadius, bool bTraceComplex, bool bShowTrace, bool bPersistentShowTrace, struct FVector* HitLocation, struct FVector* HitNormal, class FName* BoneName, struct FHitResult* OutHit);
	bool K2_SphereOverlapComponent(const struct FVector& InSphereCentre, float InSphereRadius, bool bTraceComplex, bool bShowTrace, bool bPersistentShowTrace, struct FVector* HitLocation, struct FVector* HitNormal, class FName* BoneName, struct FHitResult* OutHit);
	bool K2_LineTraceComponent(const struct FVector& TraceStart, const struct FVector& TraceEnd, bool bTraceComplex, bool bShowTrace, bool bPersistentShowTrace, struct FVector* HitLocation, struct FVector* HitNormal, class FName* BoneName, struct FHitResult* OutHit);
	bool K2_IsQueryCollisionEnabled();
	bool K2_IsPhysicsCollisionEnabled();
	bool K2_IsCollisionEnabled();
	bool K2_BoxOverlapComponent(const struct FVector& InBoxCentre, const struct FBox& InBox, bool bTraceComplex, bool bShowTrace, bool bPersistentShowTrace, struct FVector* HitLocation, struct FVector* HitNormal, class FName* BoneName, struct FHitResult* OutHit);
	bool IsOverlappingComponent(class UPrimitiveComponent* OtherComp);
	bool IsOverlappingActor(class AActor* Other);
	bool IsGravityEnabled();
	bool IsExcludedFromHLODLevel(enum class EHLODLevelExclusion HLODLevel);
	bool IsAnyRigidBodyAwake();
	void InvalidateLumenSurfaceCache();
	void IgnoreComponentWhenMoving(class UPrimitiveComponent* Component, bool bShouldIgnore);
	void IgnoreActorWhenMoving(class AActor* Actor, bool bShouldIgnore);
	struct FWalkableSlopeOverride GetWalkableSlopeOverride();
	bool GetStaticWhenNotMoveable();
	struct FVector GetPhysicsLinearVelocityAtPoint(const struct FVector& Point, class FName BoneName);
	struct FVector GetPhysicsLinearVelocity(class FName BoneName);
	struct FVector GetPhysicsAngularVelocityInRadians(class FName BoneName);
	struct FVector GetPhysicsAngularVelocityInDegrees(class FName BoneName);
	void GetOverlappingComponents(TArray<class UPrimitiveComponent*>* OutOverlappingComponents);
	void GetOverlappingActors(TArray<class AActor*>* OverlappingActors, TSubclassOf<class AActor> ClassFilter);
	int32 GetNumMaterials();
	class UMaterialInterface* GetMaterialFromCollisionFaceIndex(int32 FaceIndex, int32* SectionIndex);
	class UMaterialInterface* GetMaterial(int32 ElementIndex);
	float GetMassScale(class FName BoneName);
	float GetMass();
	float GetLinearDamping();
	struct FVector GetInertiaTensor(class FName BoneName);
	bool GetIgnoreBoundsForEditorFocus();
	bool GetGenerateOverlapEvents();
	TArray<int32> GetExcludeForSpecificHLODLevels();
	int32 GetCustomPrimitiveDataIndexForVectorParameter(class FName ParameterName);
	int32 GetCustomPrimitiveDataIndexForScalarParameter(class FName ParameterName);
	enum class ECollisionResponse GetCollisionResponseToChannel(enum class ECollisionChannel Channel);
	class FName GetCollisionProfileName();
	enum class ECollisionChannel GetCollisionObjectType();
	enum class ECollisionEnabled GetCollisionEnabled();
	float GetClosestPointOnCollision(struct FVector& Point, struct FVector* OutPointOnBody, class FName BoneName);
	struct FVector GetCenterOfMass(class FName BoneName);
	struct FBodyInstanceAsyncPhysicsTickHandle GetBodyInstanceAsyncPhysicsTickHandle(class FName BoneName, bool bGetWelded, int32 Index);
	float GetAngularDamping();
	class UMaterialInstanceDynamic* CreateDynamicMaterialInstance(int32 ElementIndex, class UMaterialInterface* SourceMaterial, class FName OptionalName);
	class UMaterialInstanceDynamic* CreateAndSetMaterialInstanceDynamicFromMaterial(int32 ElementIndex, class UMaterialInterface* Parent);
	class UMaterialInstanceDynamic* CreateAndSetMaterialInstanceDynamic(int32 ElementIndex);
	TArray<class UPrimitiveComponent*> CopyArrayOfMoveIgnoreComponents();
	TArray<class AActor*> CopyArrayOfMoveIgnoreActors();
	void ClearMoveIgnoreComponents();
	void ClearMoveIgnoreActors();
	bool CanCharacterStepUp(class APawn* Pawn);
	void AddVelocityChangeImpulseAtLocation(const struct FVector& Impulse, const struct FVector& Location, class FName BoneName);
	void AddTorqueInRadians(const struct FVector& Torque, class FName BoneName, bool bAccelChange);
	void AddTorqueInDegrees(const struct FVector& Torque, class FName BoneName, bool bAccelChange);
	void AddRadialImpulse(const struct FVector& Origin, float Radius, float Strength, enum class ERadialImpulseFalloff Falloff, bool bVelChange);
	void AddRadialForce(const struct FVector& Origin, float Radius, float Strength, enum class ERadialImpulseFalloff Falloff, bool bAccelChange);
	void AddImpulseAtLocation(const struct FVector& Impulse, const struct FVector& Location, class FName BoneName);
	void AddImpulse(const struct FVector& Impulse, class FName BoneName, bool bVelChange);
	void AddForceAtLocationLocal(const struct FVector& Force, const struct FVector& Location, class FName BoneName);
	void AddForceAtLocation(const struct FVector& Force, const struct FVector& Location, class FName BoneName);
	void AddForce(const struct FVector& Force, class FName BoneName, bool bAccelChange);
	void AddAngularImpulseInRadians(const struct FVector& Impulse, class FName BoneName, bool bVelChange);
	void AddAngularImpulseInDegrees(const struct FVector& Impulse, class FName BoneName, bool bVelChange);
};

// 0x0 (0x288 - 0x288)
// Class Engine.Info
class AInfo : public AActor
{
public:

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("Info");
		return Clss;
	}

};

// 0x8 (0x30 - 0x28)
// Class Engine.BlueprintAsyncActionBase
class UBlueprintAsyncActionBase : public UObject
{
public:
	uint8                                        Pad_21A[0x8];                                      // Fixing Size Of Struct..

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("BlueprintAsyncActionBase");
		return Clss;
	}

	void Activate();
};

// 0x8 (0x30 - 0x28)
// Class Engine.DataAsset
class UDataAsset : public UObject
{
public:
	TSubclassOf<class UDataAsset>                NativeClass;                                       // 0x28(0x8)(ZeroConstructor, NoDestructor, AssetRegistrySearchable, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("DataAsset");
		return Clss;
	}

};

// 0xA0 (0x328 - 0x288)
// Class Engine.GameModeBase
class AGameModeBase : public AInfo
{
public:
	class FString                                OptionsString;                                     // 0x288(0x10)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class AGameSession>              GameSessionClass;                                  // 0x298(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class AGameStateBase>            GameStateClass;                                    // 0x2A0(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoClear, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class APlayerController>         PlayerControllerClass;                             // 0x2A8(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoClear, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class APlayerState>              PlayerStateClass;                                  // 0x2B0(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoClear, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class AHUD>                      HUDClass;                                          // 0x2B8(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class APawn>                     DefaultPawnClass;                                  // 0x2C0(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class ASpectatorPawn>            SpectatorClass;                                    // 0x2C8(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoClear, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class APlayerController>         ReplaySpectatorPlayerControllerClass;              // 0x2D0(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoClear, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class AServerStatReplicator>     ServerStatReplicatorClass;                         // 0x2D8(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoClear, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AGameSession*                          GameSession;                                       // 0x2E0(0x8)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AGameStateBase*                        GameState;                                         // 0x2E8(0x8)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AServerStatReplicator*                 ServerStatReplicator;                              // 0x2F0(0x8)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                  DefaultPlayerName;                                 // 0x2F8(0x18)(Edit, NativeAccessSpecifierPublic)
	uint8                                        bUseSeamlessTravel : 1;                            // Mask: 0x1, PropSize: 0x10x310(0x1)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bStartPlayersAsSpectators : 1;                     // Mask: 0x2, PropSize: 0x10x310(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bPauseable : 1;                                    // Mask: 0x4, PropSize: 0x10x310(0x1)(Edit, BlueprintVisible, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_224[0x17];                                     // Fixing Size Of Struct..

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("GameModeBase");
		return Clss;
	}

	void StartPlay();
	class APawn* SpawnDefaultPawnFor(class AController* NewPlayer, class AActor* StartSpot);
	class APawn* SpawnDefaultPawnAtTransform(class AController* NewPlayer, struct FTransform& SpawnTransform);
	bool ShouldReset(class AActor* ActorToReset);
	void ReturnToMainMenuHost();
	void RestartPlayerAtTransform(class AController* NewPlayer, struct FTransform& SpawnTransform);
	void RestartPlayerAtPlayerStart(class AController* NewPlayer, class AActor* StartSpot);
	void RestartPlayer(class AController* NewPlayer);
	void ResetLevel();
	bool PlayerCanRestart(class APlayerController* Player);
	bool MustSpectate(class APlayerController* NewPlayerController);
	void K2_PostLogin(class APlayerController* NewPlayer);
	void K2_OnSwapPlayerControllers(class APlayerController* OldPC, class APlayerController* NewPC);
	void K2_OnRestartPlayer(class AController* NewPlayer);
	void K2_OnLogout(class AController* ExitingController);
	void K2_OnChangeName(class AController* Other, const class FString& NewName, bool bNameChange);
	class AActor* K2_FindPlayerStart(class AController* Player, const class FString& IncomingName);
	void InitStartSpot(class AActor* StartSpot, class AController* NewPlayer);
	void InitializeHUDForPlayer(class APlayerController* NewPlayer);
	bool HasMatchStarted();
	bool HasMatchEnded();
	void HandleStartingNewPlayer(class APlayerController* NewPlayer);
	int32 GetNumSpectators();
	int32 GetNumPlayers();
	class UClass* GetDefaultPawnClassForController(class AController* InController);
	class AActor* FindPlayerStart(class AController* Player, const class FString& IncomingName);
	class AActor* ChoosePlayerStart(class AController* Player);
	void ChangeName(class AController* Controller, const class FString& NewName, bool bNameChange);
	bool CanSpectate(class APlayerController* Viewer, class APlayerState* ViewTarget);
};

// 0x48 (0x370 - 0x328)
// Class Engine.GameMode
class AGameMode : public AGameModeBase
{
public:
	class FName                                  MatchState;                                        // 0x328(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bDelayedStart : 1;                                 // Mask: 0x1, PropSize: 0x10x32C(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        BitPad_18 : 7;                                     // Fixing Bit-Field Size..
	uint8                                        Pad_225[0x3];                                      // Fixing Size After Last Property..
	int32                                        NumSpectators;                                     // 0x330(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        NumPlayers;                                        // 0x334(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        NumBots;                                           // 0x338(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MinRespawnDelay;                                   // 0x33C(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        NumTravellingPlayers;                              // 0x340(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_226[0x4];                                      // Fixing Size After Last Property..
	TSubclassOf<class ULocalMessage>             EngineMessageClass;                                // 0x348(0x8)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class APlayerState*>                  InactivePlayerArray;                               // 0x350(0x10)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	float                                        InactivePlayerStateLifeSpan;                       // 0x360(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        MaxInactivePlayers;                                // 0x364(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bHandleDedicatedServerReplays;                     // 0x368(0x1)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_227[0x7];                                      // Fixing Size Of Struct..

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("GameMode");
		return Clss;
	}

	void StartMatch();
	void Say(const class FString& Msg);
	void RestartGame();
	bool ReadyToStartMatch();
	bool ReadyToEndMatch();
	void K2_OnSetMatchState(class FName NewState);
	bool IsMatchInProgress();
	class FName GetMatchState();
	void EndMatch();
	void AbortMatch();
};

// 0x58 (0x2E0 - 0x288)
// Class Engine.GameStateBase
class AGameStateBase : public AInfo
{
public:
	TSubclassOf<class AGameModeBase>             GameModeClass;                                     // 0x288(0x8)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, Transient, RepNotify, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AGameModeBase*                         AuthorityGameMode;                                 // 0x290(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class ASpectatorPawn>            SpectatorClass;                                    // 0x298(0x8)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, Transient, RepNotify, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class APlayerState*>                  PlayerArray;                                       // 0x2A0(0x10)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPublic)
	bool                                         bReplicatedHasBegunPlay;                           // 0x2B0(0x1)(Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_22A[0x3];                                      // Fixing Size After Last Property..
	float                                        ReplicatedWorldTimeSeconds;                        // 0x2B4(0x4)(Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	double                                       ReplicatedWorldTimeSecondsDouble;                  // 0x2B8(0x8)(Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        ServerWorldTimeSecondsDelta;                       // 0x2C0(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        ServerWorldTimeSecondsUpdateFrequency;             // 0x2C4(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_22B[0x18];                                     // Fixing Size Of Struct..

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("GameStateBase");
		return Clss;
	}

	void OnRep_SpectatorClass();
	void OnRep_ReplicatedWorldTimeSecondsDouble();
	void OnRep_ReplicatedWorldTimeSeconds();
	void OnRep_ReplicatedHasBegunPlay();
	void OnRep_GameModeClass();
	bool HasMatchStarted();
	bool HasMatchEnded();
	bool HasBegunPlay();
	double GetServerWorldTimeSeconds();
	float GetPlayerStartTime(class AController* Controller);
	float GetPlayerRespawnDelay(class AController* Controller);
};

// 0x18 (0x2F8 - 0x2E0)
// Class Engine.GameState
class AGameState : public AGameStateBase
{
public:
	class FName                                  MatchState;                                        // 0x2E0(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, DisableEditOnTemplate, EditConst, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                  PreviousMatchState;                                // 0x2E4(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        ElapsedTime;                                       // 0x2E8(0x4)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_22C[0xC];                                      // Fixing Size Of Struct..

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("GameState");
		return Clss;
	}

	void OnRep_MatchState();
	void OnRep_ElapsedTime();
};

// 0x98 (0x320 - 0x288)
// Class Engine.Controller
class AController : public AActor
{
public:
	uint8                                        Pad_230[0x8];                                      // Fixing Size After Last Property..
	class APlayerState*                          PlayerState;                                       // 0x290(0x8)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, RepNotify, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_231[0x8];                                      // Fixing Size After Last Property..
	FMulticastInlineDelegateProperty_            OnInstigatedAnyDamage;                             // 0x2A0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnPossessedPawnChanged;                            // 0x2B0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class FName                                  StateName;                                         // 0x2C0(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_232[0x4];                                      // Fixing Size After Last Property..
	class APawn*                                 Pawn;                                              // 0x2C8(0x8)(Net, ZeroConstructor, RepNotify, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_233[0x8];                                      // Fixing Size After Last Property..
	class ACharacter*                            Character;                                         // 0x2D8(0x8)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USceneComponent*                       TransformComponent;                                // 0x2E0(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_234[0x18];                                     // Fixing Size After Last Property..
	struct FRotator                              ControlRotation;                                   // 0x300(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                        bAttachToPawn : 1;                                 // Mask: 0x1, PropSize: 0x10x318(0x1)(Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_235[0x7];                                      // Fixing Size Of Struct..

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("Controller");
		return Clss;
	}

	void UnPossess();
	void StopMovement();
	void SetInitialLocationAndRotation(struct FVector& NewLocation, struct FRotator& NewRotation);
	void SetIgnoreMoveInput(bool bNewMoveInput);
	void SetIgnoreLookInput(bool bNewLookInput);
	void SetControlRotation(struct FRotator& NewRotation);
	void ResetIgnoreMoveInput();
	void ResetIgnoreLookInput();
	void ResetIgnoreInputFlags();
	void ReceiveUnPossess(class APawn* UnpossessedPawn);
	void ReceivePossess(class APawn* PossessedPawn);
	void ReceiveInstigatedAnyDamage(float Damage, class UDamageType* DamageType, class AActor* DamagedActor, class AActor* DamageCauser);
	void Possess(class APawn* InPawn);
	void OnRep_PlayerState();
	void OnRep_Pawn();
	bool LineOfSightTo(class AActor* Other, const struct FVector& ViewPoint, bool bAlternateChecks);
	class APawn* K2_GetPawn();
	bool IsPlayerController();
	bool IsMoveInputIgnored();
	bool IsLookInputIgnored();
	bool IsLocalPlayerController();
	bool IsLocalController();
	class AActor* GetViewTarget();
	void GetPlayerViewPoint(struct FVector* Location, struct FRotator* Rotation);
	struct FRotator GetDesiredRotation();
	struct FRotator GetControlRotation();
	void ClientSetRotation(const struct FRotator& NewRotation, bool bResetCamera);
	void ClientSetLocation(const struct FVector& NewLocation, const struct FRotator& NewRotation);
};

// 0x528 (0x848 - 0x320)
// Class Engine.PlayerController
class APlayerController : public AController
{
public:
	uint8                                        Pad_26E[0x8];                                      // Fixing Size After Last Property..
	class UPlayer*                               Player;                                            // 0x328(0x8)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class APawn*                                 AcknowledgedPawn;                                  // 0x330(0x8)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AHUD*                                  MyHUD;                                             // 0x338(0x8)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class APlayerCameraManager*                  PlayerCameraManager;                               // 0x340(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class APlayerCameraManager>      PlayerCameraManagerClass;                          // 0x348(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bAutoManageActiveCameraTarget;                     // 0x350(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_26F[0x7];                                      // Fixing Size After Last Property..
	struct FRotator                              TargetViewRotation;                                // 0x358(0x18)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                        Pad_270[0x18];                                     // Fixing Size After Last Property..
	float                                        SmoothTargetViewRotationSpeed;                     // 0x388(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_271[0x4];                                      // Fixing Size After Last Property..
	TArray<class AActor*>                        HiddenActors;                                      // 0x390(0x10)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<TWeakObjectPtr<class UPrimitiveComponent>> HiddenPrimitiveComponents;                         // 0x3A0(0x10)(ExportObject, ZeroConstructor, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPublic)
	uint8                                        Pad_272[0x4];                                      // Fixing Size After Last Property..
	float                                        LastSpectatorStateSynchTime;                       // 0x3B4(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               LastSpectatorSyncLocation;                         // 0x3B8(0x18)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                              LastSpectatorSyncRotation;                         // 0x3D0(0x18)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	int32                                        ClientCap;                                         // 0x3E8(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_273[0x4];                                      // Fixing Size After Last Property..
	class UCheatManager*                         CheatManager;                                      // 0x3F0(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UCheatManager>             CheatClass;                                        // 0x3F8(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayerInput*                          PlayerInput;                                       // 0x400(0x8)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FActiveForceFeedbackEffect>    ActiveForceFeedbackEffects;                        // 0x408(0x10)(ZeroConstructor, Transient, NativeAccessSpecifierPublic)
	TSubclassOf<class UAsyncPhysicsData>         AsyncPhysicsDataClass;                             // 0x418(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAsyncPhysicsInputComponent*           AsyncPhysicsDataComponent;                         // 0x420(0x8)(ExportObject, Net, ZeroConstructor, InstancedReference, RepNotify, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_274[0x80];                                     // Fixing Size After Last Property..
	uint8                                        BitPad_19 : 4;                                     // Fixing Bit-Field Size..
	uint8                                        bPlayerIsWaiting : 1;                              // Mask: 0x10, PropSize: 0x10x4A8(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnTemplate, EditConst, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        BitPad_1A : 3;                                     // Fixing Bit-Field Size..
	uint8                                        Pad_275[0x3];                                      // Fixing Size After Last Property..
	uint8                                        NetPlayerIndex;                                    // 0x4AC(0x1)(ZeroConstructor, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_276[0x5B];                                     // Fixing Size After Last Property..
	class UNetConnection*                        PendingSwapConnection;                             // 0x508(0x8)(ZeroConstructor, DuplicateTransient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UNetConnection*                        NetConnection;                                     // 0x510(0x8)(ZeroConstructor, DuplicateTransient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_277[0x18];                                     // Fixing Size After Last Property..
	float                                        InputYawScale;                                     // 0x530(0x4)(ZeroConstructor, Config, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        InputPitchScale;                                   // 0x534(0x4)(ZeroConstructor, Config, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        InputRollScale;                                    // 0x538(0x4)(ZeroConstructor, Config, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bShowMouseCursor : 1;                              // Mask: 0x1, PropSize: 0x10x53C(0x1)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bEnableClickEvents : 1;                            // Mask: 0x2, PropSize: 0x10x53C(0x1)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bEnableTouchEvents : 1;                            // Mask: 0x4, PropSize: 0x10x53C(0x1)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bEnableMouseOverEvents : 1;                        // Mask: 0x8, PropSize: 0x10x53C(0x1)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bEnableTouchOverEvents : 1;                        // Mask: 0x10, PropSize: 0x10x53C(0x1)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bForceFeedbackEnabled : 1;                         // Mask: 0x20, PropSize: 0x10x53C(0x1)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bEnableMotionControls : 1;                         // Mask: 0x40, PropSize: 0x10x53C(0x1)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bEnableStreamingSource : 1;                        // Mask: 0x80, PropSize: 0x10x53C(0x1)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bStreamingSourceShouldActivate : 1;                // Mask: 0x1, PropSize: 0x10x53D(0x1)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bStreamingSourceShouldBlockOnSlowStreaming : 1;    // Mask: 0x2, PropSize: 0x10x53D(0x1)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        BitPad_1B : 6;                                     // Fixing Bit-Field Size..
	uint8                                        Pad_278[0x2];                                      // Fixing Size After Last Property..
	enum class EStreamingSourcePriority          StreamingSourcePriority;                           // 0x540(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_279[0x3];                                      // Fixing Size After Last Property..
	struct FColor                                StreamingSourceDebugColor;                         // 0x544(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FStreamingSourceShape>         StreamingSourceShapes;                             // 0x548(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	float                                        ForceFeedbackScale;                                // 0x558(0x4)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_27A[0x4];                                      // Fixing Size After Last Property..
	TArray<struct FKey>                          ClickEventKeys;                                    // 0x560(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	enum class EMouseCursor                      DefaultMouseCursor;                                // 0x570(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EMouseCursor                      CurrentMouseCursor;                                // 0x571(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class ECollisionChannel                 DefaultClickTraceChannel;                          // 0x572(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class ECollisionChannel                 CurrentClickTraceChannel;                          // 0x573(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        HitResultTraceDistance;                            // 0x574(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint16                                       SeamlessTravelCount;                               // 0x578(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint16                                       LastCompletedSeamlessTravelCount;                  // 0x57A(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_27B[0x84];                                     // Fixing Size After Last Property..
	class UInputComponent*                       InactiveStateInputComponent;                       // 0x600(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        BitPad_1C : 2;                                     // Fixing Bit-Field Size..
	uint8                                        bShouldPerformFullTickWhenPaused : 1;              // Mask: 0x4, PropSize: 0x10x608(0x1)(Edit, BlueprintVisible, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        BitPad_1D : 5;                                     // Fixing Bit-Field Size..
	uint8                                        Pad_27C[0x17];                                     // Fixing Size After Last Property..
	class UTouchInterface*                       CurrentTouchInterface;                             // 0x620(0x8)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UPlayerInput>              OverridePlayerInputClass;                          // 0x628(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_27D[0x78];                                     // Fixing Size After Last Property..
	class ASpectatorPawn*                        SpectatorPawn;                                     // 0x6A8(0x8)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_27E[0x4];                                      // Fixing Size After Last Property..
	bool                                         bIsLocalPlayerController;                          // 0x6B4(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_27F[0x3];                                      // Fixing Size After Last Property..
	struct FVector                               SpawnLocation;                                     // 0x6B8(0x18)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_280[0x178];                                    // Fixing Size Of Struct..

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("PlayerController");
		return Clss;
	}

	bool WasInputKeyJustReleased(const struct FKey& Key);
	bool WasInputKeyJustPressed(const struct FKey& Key);
	void ToggleSpeaking(bool bInSpeaking);
	void TestServerLevelVisibilityChange(class FName PackageName, class FName Filename);
	void SwitchLevel(const class FString& URL);
	bool StreamingSourceShouldBlockOnSlowStreaming();
	bool StreamingSourceShouldActivate();
	void StopHapticEffect(enum class EControllerHand Hand);
	void StartFire(uint8 FireModeNum);
	void SetVirtualJoystickVisibility(bool bVisible);
	void SetViewTargetWithBlend(class AActor* NewViewTarget, float BlendTime, enum class EViewTargetBlendFunction BlendFunc, float BlendExp, bool bLockOutgoing);
	void SetName(const class FString& S);
	void SetMouseLocation(int32 X, int32 Y);
	void SetMouseCursorWidget(enum class EMouseCursor Cursor, class UUserWidget* CursorWidget);
	void SetMotionControlsEnabled(bool bEnabled);
	void SetHapticsByValue(float Frequency, float Amplitude, enum class EControllerHand Hand);
	void SetDisableHaptics(bool bNewDisabled);
	void SetDeprecatedInputYawScale(float NewValue);
	void SetDeprecatedInputRollScale(float NewValue);
	void SetDeprecatedInputPitchScale(float NewValue);
	void SetControllerLightColor(const struct FColor& Color);
	void SetCinematicMode(bool bInCinematicMode, bool bHidePlayer, bool bAffectsHUD, bool bAffectsMovement, bool bAffectsTurning);
	void SetAudioListenerOverride(class USceneComponent* AttachToComponent, const struct FVector& Location, const struct FRotator& Rotation);
	void SetAudioListenerAttenuationOverride(class USceneComponent* AttachToComponent, const struct FVector& AttenuationLocationOVerride);
	void ServerViewSelf(const struct FViewTargetTransitionParams& TransitionParams);
	void ServerViewPrevPlayer();
	void ServerViewNextPlayer();
	void ServerVerifyViewTarget();
	void ServerUpdateMultipleLevelsVisibility(TArray<struct FUpdateLevelVisibilityLevelInfo>& LevelVisibilities);
	void ServerUpdateLevelVisibility(struct FUpdateLevelVisibilityLevelInfo& LevelVisibility);
	void ServerUpdateCamera(const struct FVector_NetQuantize& CamLoc, int32 CamPitchAndYaw);
	void ServerUnmutePlayer(const struct FUniqueNetIdRepl& PlayerId);
	void ServerUnblockPlayer(const struct FUniqueNetIdRepl& PlayerId);
	void ServerToggleAILogging();
	void ServerShortTimeout();
	void ServerSetSpectatorWaiting(bool bWaiting);
	void ServerSetSpectatorLocation(const struct FVector& NewLoc, const struct FRotator& NewRot);
	void ServerSendLatestAsyncPhysicsTimestamp(const struct FAsyncPhysicsTimestamp& Timestamp);
	void ServerRestartPlayer();
	void ServerRecvClientInputFrame(int32 RecvClientInputFrame, TArray<uint8>& Data);
	void ServerPause();
	void ServerNotifyLoadedWorld(class FName WorldPackageName);
	void ServerMutePlayer(const struct FUniqueNetIdRepl& PlayerId);
	void ServerExecRPC(const class FString& Msg);
	void ServerExec(const class FString& Msg);
	void ServerCheckClientPossessionReliable();
	void ServerCheckClientPossession();
	void ServerChangeName(const class FString& S);
	void ServerCamera(class FName NewMode);
	void ServerBlockPlayer(const struct FUniqueNetIdRepl& PlayerId);
	void ServerAcknowledgePossession(class APawn* P);
	void SendToConsole(const class FString& Command);
	void RestartLevel();
	void ResetControllerLightColor();
	bool ProjectWorldLocationToScreen(const struct FVector& WorldLocation, struct FVector2D* ScreenLocation, bool bPlayerViewportRelative);
	void PlayHapticEffect(class UHapticFeedbackEffect_Base* HapticEffect, enum class EControllerHand Hand, float Scale, bool bLoop);
	void PlayDynamicForceFeedback(float Intensity, float Duration, bool bAffectsLeftLarge, bool bAffectsLeftSmall, bool bAffectsRightLarge, bool bAffectsRightSmall, enum class EDynamicForceFeedbackAction Action, const struct FLatentActionInfo& LatentInfo);
	void Pause();
	void OnServerStartedVisualLogger(bool bIsLogging);
	void OnRep_AsyncPhysicsDataComponent();
	void LocalTravel(const class FString& URL);
	void K2_ClientPlayForceFeedback(class UForceFeedbackEffect* ForceFeedbackEffect, class FName Tag, bool bLooping, bool bIgnoreTimeDilation, bool bPlayWhilePaused);
	bool IsStreamingSourceEnabled();
	bool IsInputKeyDown(const struct FKey& Key);
	void GetViewportSize(int32* SizeX, int32* SizeY);
	void GetStreamingSourceShapes(TArray<struct FStreamingSourceShape>* OutShapes);
	enum class EStreamingSourcePriority GetStreamingSourcePriority();
	void GetStreamingSourceLocationAndRotation(struct FVector* OutLocation, struct FRotator* OutRotation);
	class ASpectatorPawn* GetSpectatorPawn();
	struct FPlatformUserId GetPlatformUserId();
	TSubclassOf<class UPlayerInput> GetOverridePlayerInputClass();
	bool GetMousePosition(float* LocationX, float* LocationY);
	struct FVector GetInputVectorKeyState(const struct FKey& Key);
	void GetInputTouchState(enum class ETouchIndex FingerIndex, float* LocationX, float* LocationY, bool* bIsCurrentlyPressed);
	void GetInputMouseDelta(float* DeltaX, float* DeltaY);
	void GetInputMotionState(struct FVector* Tilt, struct FVector* RotationRate, struct FVector* Gravity, struct FVector* Acceleration);
	float GetInputKeyTimeDown(const struct FKey& Key);
	void GetInputAnalogStickState(enum class EControllerAnalogStick WhichStick, float* StickX, float* StickY);
	float GetInputAnalogKeyState(const struct FKey& Key);
	class AHUD* GetHUD();
	bool GetHitResultUnderFingerForObjects(enum class ETouchIndex FingerIndex, TArray<enum class EObjectTypeQuery>& ObjectTypes, bool bTraceComplex, struct FHitResult* HitResult);
	bool GetHitResultUnderFingerByChannel(enum class ETouchIndex FingerIndex, enum class ETraceTypeQuery TraceChannel, bool bTraceComplex, struct FHitResult* HitResult);
	bool GetHitResultUnderFinger(enum class ETouchIndex FingerIndex, enum class ECollisionChannel TraceChannel, bool bTraceComplex, struct FHitResult* HitResult);
	bool GetHitResultUnderCursorForObjects(TArray<enum class EObjectTypeQuery>& ObjectTypes, bool bTraceComplex, struct FHitResult* HitResult);
	bool GetHitResultUnderCursorByChannel(enum class ETraceTypeQuery TraceChannel, bool bTraceComplex, struct FHitResult* HitResult);
	bool GetHitResultUnderCursor(enum class ECollisionChannel TraceChannel, bool bTraceComplex, struct FHitResult* HitResult);
	struct FVector GetFocalLocation();
	float GetDeprecatedInputYawScale();
	float GetDeprecatedInputRollScale();
	float GetDeprecatedInputPitchScale();
	class UAsyncPhysicsData* GetAsyncPhysicsDataToWrite();
	class UAsyncPhysicsData* GetAsyncPhysicsDataToConsume();
	void FOV(float NewFOV);
	void EnableCheats();
	bool DeprojectScreenPositionToWorld(float ScreenX, float ScreenY, struct FVector* WorldLocation, struct FVector* WorldDirection);
	bool DeprojectMousePositionToWorld(struct FVector* WorldLocation, struct FVector* WorldDirection);
	void ConsoleKey(const struct FKey& Key);
	void ClientWasKicked(class FText& KickReason);
	void ClientVoiceHandshakeComplete();
	void ClientUpdateMultipleLevelsStreamingStatus(TArray<struct FUpdateLevelStreamingLevelStatus>& LevelStatuses);
	void ClientUpdateLevelStreamingStatus(class FName PackageName, bool bNewShouldBeLoaded, bool bNewShouldBeVisible, bool bNewShouldBlockOnLoad, int32 LODIndex, const struct FNetLevelVisibilityTransactionId& TransactionId, bool bNewShouldBlockOnUnload);
	void ClientUnmutePlayers(TArray<struct FUniqueNetIdRepl>& PlayerIds);
	void ClientUnmutePlayer(const struct FUniqueNetIdRepl& PlayerId);
	void ClientTravelInternal(const class FString& URL, enum class ETravelType TravelType, bool bSeamless, const struct FGuid& MapPackageGuid);
	void ClientTravel(const class FString& URL, enum class ETravelType TravelType, bool bSeamless, const struct FGuid& MapPackageGuid);
	void ClientTeamMessage(class APlayerState* SenderPlayerState, const class FString& S, class FName Type, float MsgLifeTime);
	void ClientStopForceFeedback(class UForceFeedbackEffect* ForceFeedbackEffect, class FName Tag);
	void ClientStopCameraShakesFromSource(class UCameraShakeSourceComponent* SourceComponent, bool bImmediately);
	void ClientStopCameraShake(TSubclassOf<class UCameraShakeBase> Shake, bool bImmediately);
	void ClientStartOnlineSession();
	void ClientStartCameraShakeFromSource(TSubclassOf<class UCameraShakeBase> Shake, class UCameraShakeSourceComponent* SourceComponent);
	void ClientStartCameraShake(TSubclassOf<class UCameraShakeBase> Shake, float Scale, enum class ECameraShakePlaySpace Playspace, const struct FRotator& UserPlaySpaceRot);
	void ClientSpawnGenericCameraLensEffect(TSubclassOf<class AActor> LensEffectEmitterClass);
	void ClientSpawnCameraLensEffect(TSubclassOf<class AEmitterCameraLensEffectBase> LensEffectEmitterClass);
	void ClientSetViewTarget(class AActor* A, const struct FViewTargetTransitionParams& TransitionParams);
	void ClientSetSpectatorWaiting(bool bWaiting);
	void ClientSetHUD(TSubclassOf<class AHUD> NewHUDClass);
	void ClientSetForceMipLevelsToBeResident(class UMaterialInterface* Material, float ForceDuration, int32 CinematicTextureGroups);
	void ClientSetCinematicMode(bool bInCinematicMode, bool bAffectsMovement, bool bAffectsTurning, bool bAffectsHUD);
	void ClientSetCameraMode(class FName NewCamMode);
	void ClientSetCameraFade(bool bEnableFading, const struct FColor& FadeColor, const struct FVector2D& FadeAlpha, float FadeTime, bool bFadeAudio, bool bHoldWhenFinished);
	void ClientSetBlockOnAsyncLoading();
	void ClientReturnToMainMenuWithTextReason(class FText& ReturnReason);
	void ClientReturnToMainMenu(const class FString& ReturnReason);
	void ClientRetryClientRestart(class APawn* NewPawn);
	void ClientRestart(class APawn* NewPawn);
	void ClientReset();
	void ClientRepObjRef(class UObject* Object);
	void ClientRecvServerAckFrameDebug(uint8 NumBuffered, float TargetNumBufferedCmds);
	void ClientRecvServerAckFrame(int32 LastProcessedInputFrame, int32 RecvServerFrameNumber, int8 TimeDilation);
	void ClientReceiveLocalizedMessage(TSubclassOf<class ULocalMessage> Message, int32 Switch, class APlayerState* RelatedPlayerState_1, class APlayerState* RelatedPlayerState_2, class UObject* OptionalObject);
	void ClientPrestreamTextures(class AActor* ForcedActor, float ForceDuration, bool bEnableStreaming, int32 CinematicTextureGroups);
	void ClientPrepareMapChange(class FName LevelName, bool bFirst, bool bLast);
	void ClientPlaySoundAtLocation(class USoundBase* Sound, const struct FVector& Location, float VolumeMultiplier, float PitchMultiplier);
	void ClientPlaySound(class USoundBase* Sound, float VolumeMultiplier, float PitchMultiplier);
	void ClientPlayForceFeedback_Internal(class UForceFeedbackEffect* ForceFeedbackEffect, const struct FForceFeedbackParameters& Params);
	void ClientMutePlayer(const struct FUniqueNetIdRepl& PlayerId);
	void ClientMessage(const class FString& S, class FName Type, float MsgLifeTime);
	void ClientIgnoreMoveInput(bool bIgnore);
	void ClientIgnoreLookInput(bool bIgnore);
	void ClientGotoState(class FName NewState);
	void ClientGameEnded(class AActor* EndGameFocus, bool bIsWinner);
	void ClientForceGarbageCollection();
	void ClientFlushLevelStreaming();
	void ClientEndOnlineSession();
	void ClientEnableNetworkVoice(bool bEnable);
	void ClientCorrectionAsyncPhysicsTimestamp(const struct FAsyncPhysicsTimestamp& Timestamp);
	void ClientCommitMapChange();
	void ClientClearCameraLensEffects();
	void ClientCapBandwidth(int32 Cap);
	void ClientCancelPendingMapChange();
	void ClientAddTextureStreamingLoc(const struct FVector& InLoc, float Duration, bool bOverrideLocation);
	void ClientAckUpdateLevelVisibility(class FName PackageName, const struct FNetLevelVisibilityTransactionId& TransactionId, bool bClientAckCanMakeVisible);
	void ClientAckTimeDilation(float TimeDilation, int32 ServerStep);
	void ClearAudioListenerOverride();
	void ClearAudioListenerAttenuationOverride();
	bool CanRestartPlayer();
	void Camera(class FName NewMode);
	void AddYawInput(float Val);
	void AddRollInput(float Val);
	void AddPitchInput(float Val);
	void ActivateTouchInterface(class UTouchInterface* NewTouchInterface);
};

// 0x10 (0x298 - 0x288)
// Class Engine.SkyLight
class ASkyLight : public AInfo
{
public:
	class USkyLightComponent*                    LightComponent;                                    // 0x288(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        bEnabled : 1;                                      // Mask: 0x1, PropSize: 0x10x290(0x1)(Net, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_281[0x7];                                      // Fixing Size Of Struct..

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("SkyLight");
		return Clss;
	}

	void OnRep_bEnabled();
};

// 0xA0 (0xC8 - 0x28)
// Class Engine.StreamableRenderAsset
class UStreamableRenderAsset : public UObject
{
public:
	uint8                                        Pad_282[0x18];                                     // Fixing Size After Last Property..
	double                                       ForceMipLevelsToBeResidentTimestamp;               // 0x40(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        NumCinematicMipLevels;                             // 0x48(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_283[0x4];                                      // Fixing Size After Last Property..
	struct FPerQualityLevelInt                   NoRefStreamingLODBias;                             // 0x50(0x68)(Protected, NativeAccessSpecifierProtected)
	int32                                        StreamingIndex;                                    // 0xB8(0x4)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NonTransactional, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        NeverStream : 1;                                   // Mask: 0x1, PropSize: 0x10xBC(0x1)(Edit, BlueprintVisible, NoDestructor, AssetRegistrySearchable, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bGlobalForceMipLevelsToBeResident : 1;             // Mask: 0x2, PropSize: 0x10xBC(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bHasStreamingUpdatePending : 1;                    // Mask: 0x4, PropSize: 0x10xBC(0x1)(Transient, NonTransactional, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bForceMiplevelsToBeResident : 1;                   // Mask: 0x8, PropSize: 0x10xBC(0x1)(Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bIgnoreStreamingMipBias : 1;                       // Mask: 0x10, PropSize: 0x10xBC(0x1)(Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bUseCinematicMipLevels : 1;                        // Mask: 0x20, PropSize: 0x10xBC(0x1)(Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_284[0xB];                                      // Fixing Size Of Struct..

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("StreamableRenderAsset");
		return Clss;
	}

	void SetForceMipLevelsToBeResident(float Seconds, int32 CinematicLODGroupMask);
};

// 0x70 (0x138 - 0xC8)
// Class Engine.Texture
class UTexture : public UStreamableRenderAsset
{
public:
	uint8                                        Pad_286[0x10];                                     // Fixing Size After Last Property..
	struct FGuid                                 LightingGuid;                                      // 0xD8(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                        LevelIndex;                                        // 0xE8(0x4)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        LODBias;                                           // 0xEC(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AssetRegistrySearchable, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class ETextureCompressionSettings       CompressionSettings;                               // 0xF0(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AssetRegistrySearchable, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class ETextureFilter                    Filter;                                            // 0xF1(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AssetRegistrySearchable, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class ETextureMipLoadOptions            MipLoadOptions;                                    // 0xF2(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AssetRegistrySearchable, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class ETextureCookPlatformTilingSettings CookPlatformTilingSettings;                        // 0xF3(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class ETextureGroup                     LODGroup;                                          // 0xF4(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AssetRegistrySearchable, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_287[0x3];                                      // Fixing Size After Last Property..
	struct FPerPlatformFloat                     Downscale;                                         // 0xF8(0x4)(Edit, NoDestructor, AdvancedDisplay, NativeAccessSpecifierPublic)
	enum class ETextureDownscaleOptions          DownscaleOptions;                                  // 0xFC(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        SRGB : 1;                                          // Mask: 0x1, PropSize: 0x10xFD(0x1)(Edit, BlueprintVisible, NoDestructor, AssetRegistrySearchable, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bNoTiling : 1;                                     // Mask: 0x2, PropSize: 0x10xFD(0x1)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        VirtualTextureStreaming : 1;                       // Mask: 0x4, PropSize: 0x10xFD(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AssetRegistrySearchable, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        CompressionYCoCg : 1;                              // Mask: 0x8, PropSize: 0x10xFD(0x1)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bNotOfflineProcessed : 1;                          // Mask: 0x10, PropSize: 0x10xFD(0x1)(Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bAsyncResourceReleaseHasBeenStarted : 1;           // Mask: 0x20, PropSize: 0x10xFD(0x1)(Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        BitPad_1E : 2;                                     // Fixing Bit-Field Size..
	uint8                                        Pad_288[0x2];                                      // Fixing Size After Last Property..
	TArray<class UAssetUserData*>                AssetUserData;                                     // 0x100(0x10)(Edit, ExportObject, ZeroConstructor, ContainsInstancedReference, AdvancedDisplay, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	uint8                                        Pad_289[0x28];                                     // Fixing Size Of Struct..

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("Texture");
		return Clss;
	}

	bool ComputeTextureSourceChannelMinMax(struct FLinearColor* OutColorMin, struct FLinearColor* OutColorMax);
	void Blueprint_GetTextureSourceDiskAndMemorySize(int64* OutDiskSize, int64* OutMemorySize);
	int64 Blueprint_GetMemorySize();
};

// 0x8 (0x140 - 0x138)
// Class Engine.TextureCube
class UTextureCube : public UTexture
{
public:
	uint8                                        Pad_28A[0x8];                                      // Fixing Size Of Struct..

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("TextureCube");
		return Clss;
	}

};

// 0x38 (0x5A0 - 0x568)
// Class Engine.MeshComponent
class UMeshComponent : public UPrimitiveComponent
{
public:
	TArray<class UMaterialInterface*>            OverrideMaterials;                                 // 0x568(0x10)(Edit, ZeroConstructor, AdvancedDisplay, UObjectWrapper, NativeAccessSpecifierPublic)
	class UMaterialInterface*                    OverlayMaterial;                                   // 0x578(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, AdvancedDisplay, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        OverlayMaterialMaxDrawDistance;                    // 0x580(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_28E[0x14];                                     // Fixing Size After Last Property..
	uint8                                        bEnableMaterialParameterCaching : 1;               // Mask: 0x1, PropSize: 0x10x598(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_28F[0x7];                                      // Fixing Size Of Struct..

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("MeshComponent");
		return Clss;
	}

	void SetVectorParameterValueOnMaterials(class FName ParameterName, const struct FVector& ParameterValue);
	void SetScalarParameterValueOnMaterials(class FName ParameterName, float ParameterValue);
	void SetOverlayMaterialMaxDrawDistance(float InMaxDrawDistance);
	void SetOverlayMaterial(class UMaterialInterface* NewOverlayMaterial);
	void PrestreamTextures(float Seconds, bool bPrioritizeCharacterTextures, int32 CinematicTextureGroups);
	bool IsMaterialSlotNameValid(class FName MaterialSlotName);
	class UMaterialInterface* GetOverlayMaterial();
	TArray<class FName> GetMaterialSlotNames();
	TArray<class UMaterialInterface*> GetMaterials();
	int32 GetMaterialIndex(class FName MaterialSlotName);
};

// 0x80 (0x620 - 0x5A0)
// Class Engine.StaticMeshComponent
class UStaticMeshComponent : public UMeshComponent
{
public:
	int32                                        ForcedLodModel;                                    // 0x5A0(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        PreviousLODLevel;                                  // 0x5A4(0x4)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        MinLOD;                                            // 0x5A8(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        SubDivisionStepSize;                               // 0x5AC(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStaticMesh*                           StaticMesh;                                        // 0x5B0(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, RepNotify, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FColor                                WireframeColorOverride;                            // 0x5B8(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bForceNaniteForMasked : 1;                         // Mask: 0x1, PropSize: 0x10x5BC(0x1)(Edit, BlueprintVisible, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bDisallowNanite : 1;                               // Mask: 0x2, PropSize: 0x10x5BC(0x1)(Edit, BlueprintVisible, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bForceDisableNanite : 1;                           // Mask: 0x4, PropSize: 0x10x5BC(0x1)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bEvaluateWorldPositionOffset : 1;                  // Mask: 0x8, PropSize: 0x10x5BC(0x1)(Edit, BlueprintVisible, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bEvaluateWorldPositionOffsetInRayTracing : 1;      // Mask: 0x10, PropSize: 0x10x5BC(0x1)(Edit, BlueprintVisible, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        BitPad_1F : 3;                                     // Fixing Bit-Field Size..
	uint8                                        Pad_291[0x3];                                      // Fixing Size After Last Property..
	int32                                        WorldPositionOffsetDisableDistance;                // 0x5C0(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        BitPad_20 : 1;                                     // Fixing Bit-Field Size..
	uint8                                        bOverrideWireframeColor : 1;                       // Mask: 0x2, PropSize: 0x10x5C4(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bOverrideMinLOD : 1;                               // Mask: 0x4, PropSize: 0x10x5C4(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bOverrideNavigationExport : 1;                     // Mask: 0x8, PropSize: 0x10x5C4(0x1)(Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bForceNavigationObstacle : 1;                      // Mask: 0x10, PropSize: 0x10x5C4(0x1)(Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bDisallowMeshPaintPerInstance : 1;                 // Mask: 0x20, PropSize: 0x10x5C4(0x1)(Edit, BlueprintVisible, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bIgnoreInstanceForTextureStreaming : 1;            // Mask: 0x40, PropSize: 0x10x5C4(0x1)(Edit, BlueprintVisible, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bOverrideLightMapRes : 1;                          // Mask: 0x80, PropSize: 0x10x5C4(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bCastDistanceFieldIndirectShadow : 1;              // Mask: 0x1, PropSize: 0x10x5C5(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bOverrideDistanceFieldSelfShadowBias : 1;          // Mask: 0x2, PropSize: 0x10x5C5(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bUseSubDivisions : 1;                              // Mask: 0x4, PropSize: 0x10x5C5(0x1)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bUseDefaultCollision : 1;                          // Mask: 0x8, PropSize: 0x10x5C5(0x1)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bSortTriangles : 1;                                // Mask: 0x10, PropSize: 0x10x5C5(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bReverseCulling : 1;                               // Mask: 0x20, PropSize: 0x10x5C5(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        BitPad_21 : 2;                                     // Fixing Bit-Field Size..
	uint8                                        Pad_292[0x2];                                      // Fixing Size After Last Property..
	int32                                        OverriddenLightMapRes;                             // 0x5C8(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        DistanceFieldIndirectShadowMinVisibility;          // 0x5CC(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        DistanceFieldSelfShadowBias;                       // 0x5D0(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        StreamingDistanceMultiplier;                       // 0x5D4(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FStaticMeshComponentLODInfo>   LodData;                                           // 0x5D8(0x10)(ZeroConstructor, Transient, NativeAccessSpecifierPublic)
	TArray<struct FStreamingTextureBuildInfo>    StreamingTextureData;                              // 0x5E8(0x10)(ZeroConstructor, NonTransactional, NativeAccessSpecifierPublic)
	struct FLightmassPrimitiveSettings           LightmassSettings;                                 // 0x5F8(0x18)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                        Pad_293[0x10];                                     // Fixing Size Of Struct..

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("StaticMeshComponent");
		return Clss;
	}

	void SetWorldPositionOffsetDisableDistance(int32 NewValue);
	bool SetStaticMesh(class UStaticMesh* NewMesh);
	void SetReverseCulling(bool ReverseCulling);
	void SetForcedLodModel(int32 NewForcedLodModel);
	void SetForceDisableNanite(bool bInForceDisableNanite);
	void SetEvaluateWorldPositionOffsetInRayTracing(bool NewValue);
	void SetEvaluateWorldPositionOffset(bool NewValue);
	void SetDistanceFieldSelfShadowBias(float NewValue);
	void OnRep_StaticMesh(class UStaticMesh* OldStaticMesh);
	void GetLocalBounds(struct FVector* Min, struct FVector* Max);
	bool GetInitialEvaluateWorldPositionOffset();
};

// 0x148 (0x768 - 0x620)
// Class Engine.InstancedStaticMeshComponent
class UInstancedStaticMeshComponent : public UStaticMeshComponent
{
public:
	uint8                                        Pad_2A6[0x8];                                      // Fixing Size After Last Property..
	TArray<struct FInstancedStaticMeshInstanceData> PerInstanceSMData;                                 // 0x628(0x10)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FMatrix>                       PerInstancePrevTransform;                          // 0x638(0x10)(ZeroConstructor, Transient, NativeAccessSpecifierPublic)
	int32                                        NumCustomDataFloats;                               // 0x648(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2A7[0x4];                                      // Fixing Size After Last Property..
	TArray<float>                                PerInstanceSMCustomData;                           // 0x650(0x10)(Edit, EditFixedSize, ZeroConstructor, AdvancedDisplay, NativeAccessSpecifierPublic)
	int32                                        InstancingRandomSeed;                              // 0x660(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2A8[0x4];                                      // Fixing Size After Last Property..
	TArray<struct FInstancedStaticMeshRandomSeed> AdditionalRandomSeeds;                             // 0x668(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                        InstanceStartCullDistance;                         // 0x678(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        InstanceEndCullDistance;                           // 0x67C(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<int32>                                InstanceReorderTable;                              // 0x680(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                        Pad_2A9[0xC4];                                     // Fixing Size After Last Property..
	int32                                        NumPendingLightmaps;                               // 0x754(0x4)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, TextExportTransient, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FInstancedStaticMeshMappingInfo> CachedMappings;                                    // 0x758(0x10)(ZeroConstructor, Transient, DuplicateTransient, Protected, TextExportTransient, NativeAccessSpecifierProtected)

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("InstancedStaticMeshComponent");
		return Clss;
	}

	bool UpdateInstanceTransform(int32 InstanceIndex, struct FTransform& NewInstanceTransform, bool bWorldSpace, bool bMarkRenderStateDirty, bool bTeleport);
	bool SetCustomDataValue(int32 InstanceIndex, int32 CustomDataIndex, float CustomDataValue, bool bMarkRenderStateDirty);
	void SetCullDistances(int32 StartCullDistance, int32 EndCullDistance);
	bool RemoveInstances(TArray<int32>& InstancesToRemove);
	bool RemoveInstance(int32 InstanceIndex);
	bool IsValidInstance(int32 InstanceIndex);
	bool GetInstanceTransform(int32 InstanceIndex, struct FTransform* OutInstanceTransform, bool bWorldSpace);
	TArray<int32> GetInstancesOverlappingSphere(struct FVector& Center, float Radius, bool bSphereInWorldSpace);
	TArray<int32> GetInstancesOverlappingBox(struct FBox& Box, bool bBoxInWorldSpace);
	int32 GetInstanceCount();
	void GetCullDistances(int32* OutStartCullDistance, int32* OutEndCullDistance);
	void ClearInstances();
	bool BatchUpdateInstancesTransforms(int32 StartInstanceIndex, TArray<struct FTransform>& NewInstancesTransforms, bool bWorldSpace, bool bMarkRenderStateDirty, bool bTeleport);
	bool BatchUpdateInstancesTransform(int32 StartInstanceIndex, int32 NumInstances, struct FTransform& NewInstancesTransform, bool bWorldSpace, bool bMarkRenderStateDirty, bool bTeleport);
	int32 AddInstanceWorldSpace(struct FTransform& WorldTransform);
	TArray<int32> AddInstances(TArray<struct FTransform>& InstanceTransforms, bool bShouldReturnIndices, bool bWorldSpace);
	int32 AddInstance(struct FTransform& InstanceTransform, bool bWorldSpace);
};

// 0x190 (0x8F8 - 0x768)
// Class Engine.HierarchicalInstancedStaticMeshComponent
class UHierarchicalInstancedStaticMeshComponent : public UInstancedStaticMeshComponent
{
public:
	uint8                                        Pad_2AA[0x10];                                     // Fixing Size After Last Property..
	uint8                                        bUseTranslatedInstanceSpace : 1;                   // Mask: 0x1, PropSize: 0x10x778(0x1)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        BitPad_22 : 7;                                     // Fixing Bit-Field Size..
	uint8                                        Pad_2AB[0x7];                                      // Fixing Size After Last Property..
	struct FVector                               TranslatedInstanceSpaceOrigin;                     // 0x780(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<int32>                                SortedInstances;                                   // 0x798(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                        NumBuiltInstances;                                 // 0x7A8(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2AC[0x4];                                      // Fixing Size After Last Property..
	struct FBox                                  BuiltInstanceBounds;                               // 0x7B0(0x38)(ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FBox                                  UnbuiltInstanceBounds;                             // 0x7E8(0x38)(ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	TArray<struct FBox>                          UnbuiltInstanceBoundsList;                         // 0x820(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                        bEnableDensityScaling : 1;                         // Mask: 0x1, PropSize: 0x10x830(0x1)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        BitPad_23 : 7;                                     // Fixing Bit-Field Size..
	uint8                                        Pad_2AD[0x7];                                      // Fixing Size After Last Property..
	float                                        InstanceLODDistanceScale;                          // 0x838(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        OcclusionLayerNumNodes;                            // 0x83C(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FBoxSphereBounds                      CacheMeshExtendedBounds;                           // 0x840(0x38)(ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                         bDisableCollision;                                 // 0x878(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2AE[0x3];                                      // Fixing Size After Last Property..
	int32                                        InstanceCountToRender;                             // 0x87C(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2AF[0x78];                                     // Fixing Size Of Struct..

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("HierarchicalInstancedStaticMeshComponent");
		return Clss;
	}

	void SetLODDistanceScale(float InLODDistanceScale);
	float GetLODDistanceScale();
};

// 0x0 (0x288 - 0x288)
// Class Engine.PartitionActor
class APartitionActor : public AActor
{
public:

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("PartitionActor");
		return Clss;
	}

};

// 0x10 (0x298 - 0x288)
// Class Engine.ISMPartitionActor
class AISMPartitionActor : public APartitionActor
{
public:
	uint8                                        Pad_2B0[0x10];                                     // Fixing Size Of Struct..

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("ISMPartitionActor");
		return Clss;
	}

};

// 0x10 (0x298 - 0x288)
// Class Engine.StaticMeshActor
class AStaticMeshActor : public AActor
{
public:
	class UStaticMeshComponent*                  StaticMeshComponent;                               // 0x288(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bStaticMeshReplicateMovement;                      // 0x290(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class ENavDataGatheringMode             NavigationGeometryGatheringMode;                   // 0x291(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2B1[0x6];                                      // Fixing Size Of Struct..

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("StaticMeshActor");
		return Clss;
	}

	void SetMobility(enum class EComponentMobility InMobility);
};

// 0x38 (0x2C0 - 0x288)
// Class Engine.Brush
class ABrush : public AActor
{
public:
	enum class EBrushType                        BrushType;                                         // 0x288(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2B2[0x3];                                      // Fixing Size After Last Property..
	struct FColor                                BrushColor;                                        // 0x28C(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        PolyFlags;                                         // 0x290(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bColored : 1;                                      // Mask: 0x1, PropSize: 0x10x294(0x1)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bSolidWhenSelected : 1;                            // Mask: 0x2, PropSize: 0x10x294(0x1)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bPlaceableFromClassBrowser : 1;                    // Mask: 0x4, PropSize: 0x10x294(0x1)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bNotForClientOrServer : 1;                         // Mask: 0x8, PropSize: 0x10x294(0x1)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        BitPad_24 : 4;                                     // Fixing Bit-Field Size..
	uint8                                        Pad_2B3[0x3];                                      // Fixing Size After Last Property..
	class UModel*                                Brush;                                             // 0x298(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UBrushComponent*                       BrushComponent;                                    // 0x2A0(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        bInManipulation : 1;                               // Mask: 0x1, PropSize: 0x10x2A8(0x1)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        BitPad_25 : 7;                                     // Fixing Bit-Field Size..
	uint8                                        Pad_2B4[0x7];                                      // Fixing Size After Last Property..
	TArray<struct FGeomSelection>                SavedSelections;                                   // 0x2B0(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("Brush");
		return Clss;
	}

};

// 0x0 (0x2C0 - 0x2C0)
// Class Engine.Volume
class AVolume : public ABrush
{
public:

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("Volume");
		return Clss;
	}

};

// 0x78 (0xA0 - 0x28)
// Class Engine.MaterialInterface
class UMaterialInterface : public UObject
{
public:
	uint8                                        Pad_2BA[0x10];                                     // Fixing Size After Last Property..
	class USubsurfaceProfile*                    SubsurfaceProfile;                                 // 0x38(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bIncludedInBaseGame : 1;                           // Mask: 0x1, PropSize: 0x10x40(0x1)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        BitPad_26 : 7;                                     // Fixing Bit-Field Size..
	uint8                                        Pad_2BB[0x17];                                     // Fixing Size After Last Property..
	struct FLightmassMaterialInterfaceSettings   LightmassSettings;                                 // 0x58(0x10)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	TArray<struct FMaterialTextureInfo>          TextureStreamingData;                              // 0x68(0x10)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<class UAssetUserData*>                AssetUserData;                                     // 0x78(0x10)(Edit, ExportObject, ZeroConstructor, ContainsInstancedReference, AdvancedDisplay, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	uint8                                        Pad_2BC[0x18];                                     // Fixing Size Of Struct..

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("MaterialInterface");
		return Clss;
	}

	void SetForceMipLevelsToBeResident(bool OverrideForceMiplevelsToBeResident, bool bForceMiplevelsToBeResidentValue, float ForceDuration, int32 CinematicTextureGroups, bool bFastResponse);
	class UPhysicalMaterialMask* GetPhysicalMaterialMask();
	class UPhysicalMaterial* GetPhysicalMaterialFromMap(int32 Index);
	class UPhysicalMaterial* GetPhysicalMaterial();
	struct FMaterialParameterInfo GetParameterInfo(enum class EMaterialParameterAssociation Association, class FName ParameterName, class UMaterialFunctionInterface* LayerFunction);
	enum class EBlendMode GetBlendMode();
	class UMaterial* GetBaseMaterial();
};

// 0x188 (0x228 - 0xA0)
// Class Engine.MaterialInstance
class UMaterialInstance : public UMaterialInterface
{
public:
	class UPhysicalMaterial*                     PhysMaterial;                                      // 0xA0(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPhysicalMaterial*                     PhysicalMaterialMap[0x8];                          // 0xA8(0x40)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInterface*                    Parent;                                            // 0xE8(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, AssetRegistrySearchable, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMaterialOverrideNanite               NaniteOverrideMaterial;                            // 0xF0(0x38)(Edit, NativeAccessSpecifierPublic)
	uint8                                        bHasStaticPermutationResource : 1;                 // Mask: 0x1, PropSize: 0x10x128(0x1)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bOverrideSubsurfaceProfile : 1;                    // Mask: 0x2, PropSize: 0x10x128(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        BitPad_27 : 6;                                     // Fixing Bit-Field Size..
	uint8                                        Pad_2BD[0xF];                                      // Fixing Size After Last Property..
	TArray<struct FScalarParameterValue>         ScalarParameterValues;                             // 0x138(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FVectorParameterValue>         VectorParameterValues;                             // 0x148(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FDoubleVectorParameterValue>   DoubleVectorParameterValues;                       // 0x158(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FTextureParameterValue>        TextureParameterValues;                            // 0x168(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FRuntimeVirtualTextureParameterValue> RuntimeVirtualTextureParameterValues;              // 0x178(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FSparseVolumeTextureParameterValue> SparseVolumeTextureParameterValues;                // 0x188(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FFontParameterValue>           FontParameterValues;                               // 0x198(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FMaterialInstanceBasePropertyOverrides BasePropertyOverrides;                             // 0x1A8(0xC)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                        Pad_2BE[0xC];                                      // Fixing Size After Last Property..
	struct FStaticParameterSetRuntimeData        StaticParametersRuntime;                           // 0x1C0(0x38)(NativeAccessSpecifierPrivate)
	uint8                                        Pad_2BF[0x30];                                     // Fixing Size Of Struct..

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("MaterialInstance");
		return Clss;
	}

};

// 0x8 (0x230 - 0x228)
// Class Engine.MaterialInstanceConstant
class UMaterialInstanceConstant : public UMaterialInstance
{
public:
	class UPhysicalMaterialMask*                 PhysMaterialMask;                                  // 0x228(0x8)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("MaterialInstanceConstant");
		return Clss;
	}

	struct FLinearColor K2_GetVectorParameterValue(class FName ParameterName);
	class UTexture* K2_GetTextureParameterValue(class FName ParameterName);
	float K2_GetScalarParameterValue(class FName ParameterName);
};

// 0x88 (0xB0 - 0x28)
// Class Engine.MaterialExpression
class UMaterialExpression : public UObject
{
public:
	int32                                        MaterialExpressionEditorX;                         // 0x28(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        MaterialExpressionEditorY;                         // 0x2C(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UEdGraphNode*                          GraphNode;                                         // 0x30(0x8)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialExpression*                   SubgraphExpression;                                // 0x38(0x8)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2C1[0x10];                                     // Fixing Size After Last Property..
	struct FGuid                                 MaterialExpressionGuid;                            // 0x50(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterial*                             Material;                                          // 0x60(0x8)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialFunction*                     Function;                                          // 0x68(0x8)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                Desc;                                              // 0x70(0x10)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2C2[0x4];                                      // Fixing Size After Last Property..
	uint8                                        bRealtimePreview : 1;                              // Mask: 0x1, PropSize: 0x10x84(0x1)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bNeedToUpdatePreview : 1;                          // Mask: 0x2, PropSize: 0x10x84(0x1)(Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        BitPad_28 : 6;                                     // Fixing Bit-Field Size..
	uint8                                        Pad_2C3[0x3];                                      // Fixing Size After Last Property..
	uint8                                        bIsParameterExpression : 1;                        // Mask: 0x1, PropSize: 0x10x88(0x1)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        BitPad_29 : 7;                                     // Fixing Bit-Field Size..
	uint8                                        Pad_2C4[0x3];                                      // Fixing Size After Last Property..
	uint8                                        bCommentBubbleVisible : 1;                         // Mask: 0x1, PropSize: 0x10x8C(0x1)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bShowOutputNameOnPin : 1;                          // Mask: 0x2, PropSize: 0x10x8C(0x1)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bShowMaskColorsOnPin : 1;                          // Mask: 0x4, PropSize: 0x10x8C(0x1)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bHidePreviewWindow : 1;                            // Mask: 0x8, PropSize: 0x10x8C(0x1)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bCollapsed : 1;                                    // Mask: 0x10, PropSize: 0x10x8C(0x1)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bShaderInputData : 1;                              // Mask: 0x20, PropSize: 0x10x8C(0x1)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bShowInputs : 1;                                   // Mask: 0x40, PropSize: 0x10x8C(0x1)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bShowOutputs : 1;                                  // Mask: 0x80, PropSize: 0x10x8C(0x1)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2C5[0x3];                                      // Fixing Size After Last Property..
	TArray<class FText>                          MenuCategories;                                    // 0x90(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FExpressionOutput>             Outputs;                                           // 0xA0(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("MaterialExpression");
		return Clss;
	}

};

// 0x0 (0xB0 - 0xB0)
// Class Engine.MaterialExpressionCustomOutput
class UMaterialExpressionCustomOutput : public UMaterialExpression
{
public:

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("MaterialExpressionCustomOutput");
		return Clss;
	}

};

// 0x0 (0x28 - 0x28)
// Class Engine.HLODBuilder
class UHLODBuilder : public UObject
{
public:

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("HLODBuilder");
		return Clss;
	}

};

// 0x8 (0x30 - 0x28)
// Class Engine.Subsystem
class USubsystem : public UObject
{
public:
	uint8                                        Pad_2C6[0x8];                                      // Fixing Size Of Struct..

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("Subsystem");
		return Clss;
	}

};

// 0x0 (0x30 - 0x30)
// Class Engine.WorldSubsystem
class UWorldSubsystem : public USubsystem
{
public:

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("WorldSubsystem");
		return Clss;
	}

};

// 0x10 (0x40 - 0x30)
// Class Engine.TickableWorldSubsystem
class UTickableWorldSubsystem : public UWorldSubsystem
{
public:
	uint8                                        Pad_2C7[0x10];                                     // Fixing Size Of Struct..

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("TickableWorldSubsystem");
		return Clss;
	}

};

// 0x0 (0x28 - 0x28)
// Class Engine.AssetUserData
class UAssetUserData : public UObject
{
public:

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("AssetUserData");
		return Clss;
	}

};

// 0x0 (0x28 - 0x28)
// Class Engine.TextureMipDataProviderFactory
class UTextureMipDataProviderFactory : public UAssetUserData
{
public:

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("TextureMipDataProviderFactory");
		return Clss;
	}

};

// 0x0 (0x28 - 0x28)
// Class Engine.TextureAllMipDataProviderFactory
class UTextureAllMipDataProviderFactory : public UTextureMipDataProviderFactory
{
public:

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("TextureAllMipDataProviderFactory");
		return Clss;
	}

};

// 0x0 (0x28 - 0x28)
// Class Engine.EngineCustomTimeStep
class UEngineCustomTimeStep : public UObject
{
public:

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("EngineCustomTimeStep");
		return Clss;
	}

};

// 0x8 (0x30 - 0x28)
// Class Engine.TimecodeProvider
class UTimecodeProvider : public UObject
{
public:
	float                                        FrameDelay;                                        // 0x28(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2C9[0x4];                                      // Fixing Size Of Struct..

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("TimecodeProvider");
		return Clss;
	}

	struct FTimecode GetTimecode();
	enum class ETimecodeProviderSynchronizationState GetSynchronizationState();
	struct FQualifiedFrameTime GetQualifiedFrameTime();
	struct FFrameRate GetFrameRate();
	struct FTimecode GetDelayedTimecode();
	struct FQualifiedFrameTime GetDelayedQualifiedFrameTime();
	bool FetchTimecode(struct FQualifiedFrameTime* OutFrameTime);
	void FetchAndUpdate();
};

// 0x70 (0x98 - 0x28)
// Class Engine.EdGraphNode
class UEdGraphNode : public UObject
{
public:
	uint8                                        Pad_2CA[0x10];                                     // Fixing Size After Last Property..
	TArray<class UEdGraphPin_Deprecated*>        DeprecatedPins;                                    // 0x38(0x10)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	int32                                        NodePosX;                                          // 0x48(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        NodePosY;                                          // 0x4C(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        NodeWidth;                                         // 0x50(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        NodeHeight;                                        // 0x54(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class ENodeAdvancedPins                 AdvancedPinDisplay;                                // 0x58(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class ENodeEnabledState                 EnabledState;                                      // 0x59(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2CB[0x1];                                      // Fixing Size After Last Property..
	uint8                                        BitPad_2A : 1;                                     // Fixing Bit-Field Size..
	uint8                                        bDisplayAsDisabled : 1;                            // Mask: 0x2, PropSize: 0x10x5B(0x1)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        bUserSetEnabledState : 1;                          // Mask: 0x4, PropSize: 0x10x5B(0x1)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        bIsIntermediateNode : 1;                           // Mask: 0x8, PropSize: 0x10x5B(0x1)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        bHasCompilerMessage : 1;                           // Mask: 0x10, PropSize: 0x10x5B(0x1)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        BitPad_2B : 3;                                     // Fixing Bit-Field Size..
	uint8                                        Pad_2CC[0x4];                                      // Fixing Size After Last Property..
	class FString                                NodeComment;                                       // 0x60(0x10)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        ErrorType;                                         // 0x70(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2CD[0x4];                                      // Fixing Size After Last Property..
	class FString                                ErrorMsg;                                          // 0x78(0x10)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                 NodeGUID;                                          // 0x88(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("EdGraphNode");
		return Clss;
	}

};

// 0x38 (0x60 - 0x28)
// Class Engine.EdGraph
class UEdGraph : public UObject
{
public:
	TSubclassOf<class UEdGraphSchema>            Schema;                                            // 0x28(0x8)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UEdGraphNode*>                  Nodes;                                             // 0x30(0x10)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	uint8                                        bEditable : 1;                                     // Mask: 0x1, PropSize: 0x10x40(0x1)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bAllowDeletion : 1;                                // Mask: 0x2, PropSize: 0x10x40(0x1)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bAllowRenaming : 1;                                // Mask: 0x4, PropSize: 0x10x40(0x1)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2CE[0x1F];                                     // Fixing Size Of Struct..

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("EdGraph");
		return Clss;
	}

};

// 0x50 (0x5B8 - 0x568)
// Class Engine.DebugDrawComponent
class UDebugDrawComponent : public UPrimitiveComponent
{
public:
	uint8                                        Pad_2CF[0x50];                                     // Fixing Size Of Struct..

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("DebugDrawComponent");
		return Clss;
	}

};

// 0x10 (0x38 - 0x28)
// Class Engine.AnimNotify
class UAnimNotify : public UObject
{
public:
	uint8                                        Pad_2D1[0x10];                                     // Fixing Size Of Struct..

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("AnimNotify");
		return Clss;
	}

	bool Received_Notify(class USkeletalMeshComponent* MeshComp, class UAnimSequenceBase* Animation, struct FAnimNotifyEventReference& EventReference);
	class FString GetNotifyName();
	float GetDefaultTriggerWeightThreshold();
};

// 0x8 (0x30 - 0x28)
// Class Engine.AnimNotifyState
class UAnimNotifyState : public UObject
{
public:
	uint8                                        Pad_2D7[0x8];                                      // Fixing Size Of Struct..

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("AnimNotifyState");
		return Clss;
	}

	bool Received_NotifyTick(class USkeletalMeshComponent* MeshComp, class UAnimSequenceBase* Animation, float FrameDeltaTime, struct FAnimNotifyEventReference& EventReference);
	bool Received_NotifyEnd(class USkeletalMeshComponent* MeshComp, class UAnimSequenceBase* Animation, struct FAnimNotifyEventReference& EventReference);
	bool Received_NotifyBegin(class USkeletalMeshComponent* MeshComp, class UAnimSequenceBase* Animation, float TotalDuration, struct FAnimNotifyEventReference& EventReference);
	class FString GetNotifyName();
	float GetDefaultTriggerWeightThreshold();
};

// 0x340 (0x8E0 - 0x5A0)
// Class Engine.SkinnedMeshComponent
class USkinnedMeshComponent : public UMeshComponent
{
public:
	uint8                                        Pad_2ED[0x8];                                      // Fixing Size After Last Property..
	class USkeletalMesh*                         SkeletalMesh;                                      // 0x5A8(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USkinnedAsset*                         SkinnedAsset;                                      // 0x5B0(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TWeakObjectPtr<class USkinnedMeshComponent>  LeaderPoseComponent;                               // 0x5B8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<enum class ESkinCacheUsage>           SkinCacheUsage;                                    // 0x5C0(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                         bSetMeshDeformer;                                  // 0x5D0(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_2EE[0x7];                                      // Fixing Size After Last Property..
	class UMeshDeformer*                         MeshDeformer;                                      // 0x5D8(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMeshDeformerInstanceSettings*         MeshDeformerInstanceSettings;                      // 0x5E0(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMeshDeformerInstance*                 MeshDeformerInstance;                              // 0x5E8(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_2EF[0x178];                                    // Fixing Size After Last Property..
	class UPhysicsAsset*                         PhysicsAssetOverride;                              // 0x768(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, AdvancedDisplay, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        ForcedLodModel;                                    // 0x770(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        MinLodModel;                                       // 0x774(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2F0[0x8];                                      // Fixing Size After Last Property..
	float                                        StreamingDistanceMultiplier;                       // 0x780(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2F1[0xC];                                      // Fixing Size After Last Property..
	TArray<struct FSkelMeshComponentLODInfo>     LODInfo;                                           // 0x790(0x10)(ZeroConstructor, Transient, NativeAccessSpecifierPublic)
	uint8                                        Pad_2F2[0x24];                                     // Fixing Size After Last Property..
	enum class EVisibilityBasedAnimTickOption    VisibilityBasedAnimTickOption;                     // 0x7C4(0x1)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, Interp, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2F3[0x1];                                      // Fixing Size After Last Property..
	uint8                                        BitPad_2C : 3;                                     // Fixing Bit-Field Size..
	uint8                                        bOverrideMinLOD : 1;                               // Mask: 0x8, PropSize: 0x10x7C6(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bUseBoundsFromLeaderPoseComponent : 1;             // Mask: 0x10, PropSize: 0x10x7C6(0x1)(Edit, BlueprintVisible, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bForceWireframe : 1;                               // Mask: 0x20, PropSize: 0x10x7C6(0x1)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bDisableMorphTarget : 1;                           // Mask: 0x40, PropSize: 0x10x7C6(0x1)(Edit, BlueprintVisible, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bHideSkin : 1;                                     // Mask: 0x80, PropSize: 0x10x7C6(0x1)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bPerBoneMotionBlur : 1;                            // Mask: 0x1, PropSize: 0x10x7C7(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bComponentUseFixedSkelBounds : 1;                  // Mask: 0x2, PropSize: 0x10x7C7(0x1)(Edit, BlueprintVisible, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bConsiderAllBodiesForBounds : 1;                   // Mask: 0x4, PropSize: 0x10x7C7(0x1)(Edit, BlueprintVisible, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bSyncAttachParentLOD : 1;                          // Mask: 0x8, PropSize: 0x10x7C7(0x1)(Edit, BlueprintVisible, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bCanHighlightSelectedSections : 1;                 // Mask: 0x10, PropSize: 0x10x7C7(0x1)(Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bRecentlyRendered : 1;                             // Mask: 0x20, PropSize: 0x10x7C7(0x1)(Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bCastCapsuleDirectShadow : 1;                      // Mask: 0x40, PropSize: 0x10x7C7(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bCastCapsuleIndirectShadow : 1;                    // Mask: 0x80, PropSize: 0x10x7C7(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bCPUSkinning : 1;                                  // Mask: 0x1, PropSize: 0x10x7C8(0x1)(Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bEnableUpdateRateOptimizations : 1;                // Mask: 0x2, PropSize: 0x10x7C8(0x1)(Edit, BlueprintVisible, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bDisplayDebugUpdateRateOptimizations : 1;          // Mask: 0x4, PropSize: 0x10x7C8(0x1)(Edit, BlueprintVisible, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bRenderStatic : 1;                                 // Mask: 0x8, PropSize: 0x10x7C8(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bIgnoreLeaderPoseComponentLOD : 1;                 // Mask: 0x10, PropSize: 0x10x7C8(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        BitPad_2D : 2;                                     // Fixing Bit-Field Size..
	uint8                                        bCachedLocalBoundsUpToDate : 1;                    // Mask: 0x80, PropSize: 0x10x7C8(0x1)(Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bCachedWorldSpaceBoundsUpToDate : 1;               // Mask: 0x1, PropSize: 0x10x7C9(0x1)(Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        BitPad_2E : 1;                                     // Fixing Bit-Field Size..
	uint8                                        bForceMeshObjectUpdate : 1;                        // Mask: 0x4, PropSize: 0x10x7C9(0x1)(Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        bForceUpdateDynamicDataImmediately : 1;            // Mask: 0x8, PropSize: 0x10x7C9(0x1)(Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        BitPad_2F : 4;                                     // Fixing Bit-Field Size..
	uint8                                        BitPad_30 : 1;                                     // Fixing Bit-Field Size..
	uint8                                        bFollowerShouldTickPose : 1;                       // Mask: 0x2, PropSize: 0x10x7CA(0x1)(Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        BitPad_31 : 6;                                     // Fixing Bit-Field Size..
	uint8                                        Pad_2F4[0x1];                                      // Fixing Size After Last Property..
	float                                        CapsuleIndirectShadowMinVisibility;                // 0x7CC(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2F5[0x38];                                     // Fixing Size After Last Property..
	struct FBoxSphereBounds                      CachedWorldOrLocalSpaceBounds;                     // 0x808(0x38)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FMatrix                               CachedWorldToLocalTransform;                       // 0x840(0x80)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_2F6[0x20];                                     // Fixing Size Of Struct..

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("SkinnedMeshComponent");
		return Clss;
	}

	void UnsetMeshDeformer();
	void UnloadSkinWeightProfile(class FName InProfileName);
	void UnHideBoneByName(class FName BoneName);
	void TransformToBoneSpace(class FName BoneName, const struct FVector& InPosition, const struct FRotator& InRotation, struct FVector* OutPosition, struct FRotator* OutRotation);
	void TransformFromBoneSpace(class FName BoneName, const struct FVector& InPosition, const struct FRotator& InRotation, struct FVector* OutPosition, struct FRotator* OutRotation);
	void ShowMaterialSection(int32 MaterialID, int32 SectionIndex, bool bShow, int32 LODIndex);
	void ShowAllMaterialSections(int32 LODIndex);
	void SetVertexOffsetUsage(int32 LODIndex, int32 Usage);
	void SetVertexColorOverride_LinearColor(int32 LODIndex, TArray<struct FLinearColor>& VertexColors);
	bool SetSkinWeightProfile(class FName InProfileName);
	void SetSkinWeightOverride(int32 LODIndex, TArray<struct FSkelMeshSkinWeightInfo>& SkinWeights);
	void SetSkinnedAssetAndUpdate(class USkinnedAsset* NewMesh, bool bReinitPose);
	void SetRenderStatic(bool bNewValue);
	void SetPreSkinningOffsets(int32 LODIndex, const TArray<struct FVector>& Offsets);
	void SetPostSkinningOffsets(int32 LODIndex, const TArray<struct FVector>& Offsets);
	void SetPhysicsAsset(class UPhysicsAsset* NewPhysicsAsset, bool bForceReInit);
	void SetMinLOD(int32 InNewMinLOD);
	void SetMeshDeformer(class UMeshDeformer* InMeshDeformer);
	void SetLeaderPoseComponent(class USkinnedMeshComponent* NewLeaderBoneComponent, bool bForceUpdate, bool bInFollowerShouldTickPose);
	void SetForcedLOD(int32 InNewForcedLOD);
	void SetCastCapsuleIndirectShadow(bool bNewValue);
	void SetCastCapsuleDirectShadow(bool bNewValue);
	void SetCapsuleIndirectShadowMinVisibility(float NewValue);
	bool IsUsingSkinWeightProfile();
	bool IsMaterialSectionShown(int32 MaterialID, int32 LODIndex);
	bool IsBoneHiddenByName(class FName BoneName);
	void HideBoneByName(class FName BoneName, enum class EPhysBodyOp PhysBodyOption);
	int32 GetVertexOffsetUsage(int32 LODIndex);
	bool GetTwistAndSwingAngleOfDeltaRotationFromRefPose(class FName BoneName, float* OutTwistAngle, float* OutSwingAngle);
	class FName GetSocketBoneName(class FName InSocketName);
	class USkinnedAsset* GetSkinnedAsset();
	class USkeletalMesh* GetSkeletalMesh_DEPRECATED();
	struct FTransform GetRefPoseTransform(int32 BoneIndex);
	struct FVector GetRefPosePosition(int32 BoneIndex);
	int32 GetPredictedLODLevel();
	class FName GetParentBone(class FName BoneName);
	int32 GetNumLODs();
	int32 GetNumBones();
	class UMeshDeformerInstance* GetMeshDeformerInstance();
	int32 GetForcedLOD();
	struct FTransform GetDeltaTransformFromRefPose(class FName BoneName, class FName BaseName);
	class FName GetCurrentSkinWeightProfileName();
	class FName GetBoneName(int32 BoneIndex);
	int32 GetBoneIndex(class FName BoneName);
	class FName FindClosestBone_K2(const struct FVector& TestLocation, struct FVector* BoneLocation, float IgnoreScale, bool bRequirePhysicsAsset);
	void ClearVertexColorOverride(int32 LODIndex);
	void ClearSkinWeightProfile();
	void ClearSkinWeightOverride(int32 LODIndex);
	bool BoneIsChildOf(class FName BoneName, class FName ParentBoneName);
};

// 0x700 (0xFE0 - 0x8E0)
// Class Engine.SkeletalMeshComponent
class USkeletalMeshComponent : public USkinnedMeshComponent
{
public:
	class USkeletalMesh*                         SkeletalMeshAsset;                                 // 0x8E0(0x8)(Edit, BlueprintVisible, ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UObject>                   AnimBlueprintGeneratedClass;                       // 0x8E8(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UAnimInstance>             AnimClass;                                         // 0x8F0(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimInstance*                         AnimScriptInstance;                                // 0x8F8(0x8)(ZeroConstructor, Transient, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimInstance*                         PostProcessAnimInstance;                           // 0x900(0x8)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSingleAnimationPlayData              AnimationData;                                     // 0x908(0x18)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                        Pad_326[0x10];                                     // Fixing Size After Last Property..
	struct FVector                               RootBoneTranslation;                               // 0x930(0x18)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               LineCheckBoundsScale;                              // 0x948(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_327[0x30];                                     // Fixing Size After Last Property..
	TArray<class UAnimInstance*>                 LinkedInstances;                                   // 0x990(0x10)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                        Pad_328[0x10];                                     // Fixing Size After Last Property..
	TArray<struct FTransform>                    CachedBoneSpaceTransforms;                         // 0x9B0(0x10)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	TArray<struct FTransform>                    CachedComponentSpaceTransforms;                    // 0x9C0(0x10)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	uint8                                        Pad_329[0xB0];                                     // Fixing Size After Last Property..
	float                                        GlobalAnimRateScale;                               // 0xA80(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EKinematicBonesUpdateToPhysics    KinematicBonesUpdateType;                          // 0xA84(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EPhysicsTransformUpdateMode       PhysicsTransformUpdateMode;                        // 0xA85(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_32A[0x1];                                      // Fixing Size After Last Property..
	enum class EAnimationMode                    AnimationMode;                                     // 0xA87(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_32B[0x1];                                      // Fixing Size After Last Property..
	uint8                                        bDisablePostProcessBlueprint : 1;                  // Mask: 0x1, PropSize: 0x10xA89(0x1)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        BitPad_32 : 1;                                     // Fixing Bit-Field Size..
	uint8                                        bUpdateOverlapsOnAnimationFinalize : 1;            // Mask: 0x4, PropSize: 0x10xA89(0x1)(Edit, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        BitPad_33 : 1;                                     // Fixing Bit-Field Size..
	uint8                                        bHasValidBodies : 1;                               // Mask: 0x10, PropSize: 0x10xA89(0x1)(Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bBlendPhysics : 1;                                 // Mask: 0x20, PropSize: 0x10xA89(0x1)(Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bEnablePhysicsOnDedicatedServer : 1;               // Mask: 0x40, PropSize: 0x10xA89(0x1)(Edit, BlueprintVisible, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bUpdateMeshWhenKinematic : 1;                      // Mask: 0x80, PropSize: 0x10xA89(0x1)(Edit, BlueprintVisible, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bUpdateJointsFromAnimation : 1;                    // Mask: 0x1, PropSize: 0x10xA8A(0x1)(Edit, BlueprintVisible, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bAllowClothActors : 1;                             // Mask: 0x2, PropSize: 0x10xA8A(0x1)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bDisableClothSimulation : 1;                       // Mask: 0x4, PropSize: 0x10xA8A(0x1)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        BitPad_34 : 5;                                     // Fixing Bit-Field Size..
	uint8                                        Pad_32C[0x5];                                      // Fixing Size After Last Property..
	uint8                                        bDisableRigidBodyAnimNode : 1;                     // Mask: 0x1, PropSize: 0x10xA90(0x1)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        bAllowAnimCurveEvaluation : 1;                     // Mask: 0x2, PropSize: 0x10xA90(0x1)(Edit, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        BitPad_35 : 3;                                     // Fixing Bit-Field Size..
	uint8                                        bCollideWithEnvironment : 1;                       // Mask: 0x20, PropSize: 0x10xA90(0x1)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bCollideWithAttachedChildren : 1;                  // Mask: 0x40, PropSize: 0x10xA90(0x1)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bForceCollisionUpdate : 1;                         // Mask: 0x80, PropSize: 0x10xA90(0x1)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bLocalSpaceSimulation : 1;                         // Mask: 0x1, PropSize: 0x10xA91(0x1)(BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bResetAfterTeleport : 1;                           // Mask: 0x2, PropSize: 0x10xA91(0x1)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        BitPad_36 : 1;                                     // Fixing Bit-Field Size..
	uint8                                        bDeferKinematicBoneUpdate : 1;                     // Mask: 0x8, PropSize: 0x10xA91(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bNoSkeletonUpdate : 1;                             // Mask: 0x10, PropSize: 0x10xA91(0x1)(Edit, BlueprintVisible, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bPauseAnims : 1;                                   // Mask: 0x20, PropSize: 0x10xA91(0x1)(Edit, BlueprintVisible, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bUseRefPoseOnInitAnim : 1;                         // Mask: 0x40, PropSize: 0x10xA91(0x1)(Edit, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bEnablePerPolyCollision : 1;                       // Mask: 0x80, PropSize: 0x10xA91(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bForceRefpose : 1;                                 // Mask: 0x1, PropSize: 0x10xA92(0x1)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bOnlyAllowAutonomousTickPose : 1;                  // Mask: 0x2, PropSize: 0x10xA92(0x1)(Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bIsAutonomousTickPose : 1;                         // Mask: 0x4, PropSize: 0x10xA92(0x1)(Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bOldForceRefPose : 1;                              // Mask: 0x8, PropSize: 0x10xA92(0x1)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bShowPrePhysBones : 1;                             // Mask: 0x10, PropSize: 0x10xA92(0x1)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bRequiredBonesUpToDate : 1;                        // Mask: 0x20, PropSize: 0x10xA92(0x1)(Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bAnimTreeInitialised : 1;                          // Mask: 0x40, PropSize: 0x10xA92(0x1)(Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bIncludeComponentLocationIntoBounds : 1;           // Mask: 0x80, PropSize: 0x10xA92(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bEnableLineCheckWithBounds : 1;                    // Mask: 0x1, PropSize: 0x10xA93(0x1)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bPropagateCurvesToFollowers : 1;                   // Mask: 0x2, PropSize: 0x10xA93(0x1)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bSkipKinematicUpdateWhenInterpolating : 1;         // Mask: 0x4, PropSize: 0x10xA93(0x1)(Edit, BlueprintVisible, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bSkipBoundsUpdateWhenInterpolating : 1;            // Mask: 0x8, PropSize: 0x10xA93(0x1)(Edit, BlueprintVisible, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        BitPad_37 : 2;                                     // Fixing Bit-Field Size..
	uint8                                        bNeedsQueuedAnimEventsDispatched : 1;              // Mask: 0x40, PropSize: 0x10xA93(0x1)(Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        BitPad_38 : 1;                                     // Fixing Bit-Field Size..
	uint16                                       CachedAnimCurveUidVersion;                         // 0xA94(0x2)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_32D[0x2];                                      // Fixing Size After Last Property..
	float                                        ClothBlendWeight;                                  // 0xA98(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bWaitForParallelClothTask;                         // 0xA9C(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_32E[0x3];                                      // Fixing Size After Last Property..
	TArray<class FName>                          DisallowedAnimCurves;                              // 0xAA0(0x10)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	class UBodySetup*                            BodySetup;                                         // 0xAB0(0x8)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_32F[0x4];                                      // Fixing Size After Last Property..
	float                                        ClothMaxDistanceScale;                             // 0xABC(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnConstraintBroken;                                // 0xAC0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnPlasticDeformation;                              // 0xAD0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TSubclassOf<class UClothingSimulationFactory> ClothingSimulationFactory;                         // 0xAE0(0x8)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_330[0x100];                                    // Fixing Size After Last Property..
	float                                        TeleportDistanceThreshold;                         // 0xBE8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        TeleportRotationThreshold;                         // 0xBEC(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_331[0x8];                                      // Fixing Size After Last Property..
	uint32                                       LastPoseTickFrame;                                 // 0xBF8(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_332[0x94];                                     // Fixing Size After Last Property..
	class UClothingSimulationInteractor*         ClothingInteractor;                                // 0xC90(0x8)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_333[0xC8];                                     // Fixing Size After Last Property..
	FMulticastInlineDelegateProperty_            OnAnimInitialized;                                 // 0xD60(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                        Pad_334[0x270];                                    // Fixing Size Of Struct..

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("SkeletalMeshComponent");
		return Clss;
	}

	void UnlinkAnimClassLayers(TSubclassOf<class UAnimInstance> InClass);
	void UnbindClothFromLeaderPoseComponent(bool bRestoreSimulationSpace);
	void ToggleDisablePostProcessBlueprint();
	void TermBodiesBelow(class FName ParentBoneName);
	void SuspendClothingSimulation();
	void Stop();
	void SnapshotPose(struct FPoseSnapshot& Snapshot);
	void SetUpdateClothInEditor(bool NewUpdateState);
	void SetUpdateAnimationInEditor(bool NewUpdateState);
	void SetTeleportRotationThreshold(float Threshold);
	void SetTeleportDistanceThreshold(float Threshold);
	void SetSkeletalMeshAsset(class USkeletalMesh* NewMesh);
	void SetPosition(float InPos, bool bFireNotifies);
	void SetPlayRate(float Rate);
	void SetPhysicsBlendWeight(float PhysicsBlendWeight);
	void SetNotifyRigidBodyCollisionBelow(bool bNewNotifyRigidBodyCollision, class FName BoneName, bool bIncludeSelf);
	void SetMorphTarget(class FName MorphTargetName, float Value, bool bRemoveZeroWeight);
	void SetEnablePhysicsBlending(bool bNewBlendPhysics);
	void SetEnableGravityOnAllBodiesBelow(bool bEnableGravity, class FName BoneName, bool bIncludeSelf);
	void SetEnableBodyGravity(bool bEnableGravity, class FName BoneName);
	void SetDisablePostProcessBlueprint(bool bInDisablePostProcess);
	void SetDisableAnimCurves(bool bInDisableAnimCurves);
	void SetConstraintProfileForAll(class FName ProfileName, bool bDefaultIfNotFound);
	void SetConstraintProfile(class FName JointName, class FName ProfileName, bool bDefaultIfNotFound);
	void SetClothMaxDistanceScale(float Scale);
	void SetBodyNotifyRigidBodyCollision(bool bNewNotifyRigidBodyCollision, class FName BoneName);
	void SetAnimClass(class UClass* NewClass);
	void SetAnimationMode(enum class EAnimationMode InAnimationMode);
	void SetAnimation(class UAnimationAsset* NewAnimToPlay);
	void SetAngularLimits(class FName InBoneName, float Swing1LimitAngle, float TwistLimitAngle, float Swing2LimitAngle);
	void SetAllowRigidBodyAnimNode(bool bInAllow, bool bReinitAnim);
	void SetAllowedAnimCurvesEvaluation(TArray<class FName>& List, bool bAllow);
	void SetAllowClothActors(bool bInAllow);
	void SetAllowAnimCurveEvaluation(bool bInAllow);
	void SetAllMotorsAngularVelocityDrive(bool bEnableSwingDrive, bool bEnableTwistDrive, bool bSkipCustomPhysicsType);
	void SetAllMotorsAngularPositionDrive(bool bEnableSwingDrive, bool bEnableTwistDrive, bool bSkipCustomPhysicsType);
	void SetAllMotorsAngularDriveParams(float InSpring, float InDamping, float InForceLimit, bool bSkipCustomPhysicsType);
	void SetAllBodiesSimulatePhysics(bool bNewSimulate);
	void SetAllBodiesPhysicsBlendWeight(float PhysicsBlendWeight, bool bSkipCustomPhysicsType);
	void SetAllBodiesBelowSimulatePhysics(class FName& InBoneName, bool bNewSimulate, bool bIncludeSelf);
	void SetAllBodiesBelowPhysicsDisabled(class FName& InBoneName, bool bDisabled, bool bIncludeSelf);
	void SetAllBodiesBelowPhysicsBlendWeight(class FName& InBoneName, float PhysicsBlendWeight, bool bSkipCustomPhysicsType, bool bIncludeSelf);
	void SetAllBodiesBelowLinearVelocity(class FName& InBoneName, struct FVector& LinearVelocity, bool bIncludeSelf);
	void ResumeClothingSimulation();
	void ResetClothTeleportMode();
	void ResetAnimInstanceDynamics(enum class ETeleportType InTeleportType);
	void ResetAllowedAnimCurveEvaluation();
	void ResetAllBodiesSimulatePhysics();
	void PlayAnimation(class UAnimationAsset* NewAnimToPlay, bool bLooping);
	void Play(bool bLooping);
	void OverrideAnimationData(class UAnimationAsset* InAnimToPlay, bool bIsLooping, bool bIsPlaying, float Position, float PlayRate);
	void LinkAnimGraphByTag(class FName InTag, TSubclassOf<class UAnimInstance> InClass);
	void LinkAnimClassLayers(TSubclassOf<class UAnimInstance> InClass);
	bool K2_GetClosestPointOnPhysicsAsset(struct FVector& WorldPosition, struct FVector* ClosestWorldPosition, struct FVector* Normal, class FName* BoneName, float* Distance);
	bool IsPlaying();
	bool IsClothingSimulationSuspended();
	bool IsBodyGravityEnabled(class FName BoneName);
	bool HasValidAnimationInstance();
	bool GetTransformAttribute_Ref(class FName& BoneName, class FName& AttributeName, struct FTransform& OutValue, enum class ECustomBoneAttributeLookup LookupType);
	bool GetTransformAttribute(class FName& BoneName, class FName& AttributeName, const struct FTransform& DefaultValue, struct FTransform* OutValue, enum class ECustomBoneAttributeLookup LookupType);
	float GetTeleportRotationThreshold();
	float GetTeleportDistanceThreshold();
	bool GetStringAttribute_Ref(class FName& BoneName, class FName& AttributeName, class FString& OutValue, enum class ECustomBoneAttributeLookup LookupType);
	bool GetStringAttribute(class FName& BoneName, class FName& AttributeName, const class FString& DefaultValue, class FString* OutValue, enum class ECustomBoneAttributeLookup LookupType);
	class USkeletalMesh* GetSkeletalMeshAsset();
	struct FVector GetSkeletalCenterOfMass();
	class UAnimInstance* GetPostProcessInstance();
	float GetPosition();
	float GetPlayRate();
	float GetMorphTarget(class FName MorphTargetName);
	class UAnimInstance* GetLinkedAnimLayerInstanceByGroup(class FName InGroup);
	class UAnimInstance* GetLinkedAnimLayerInstanceByClass(TSubclassOf<class UAnimInstance> InClass);
	void GetLinkedAnimGraphInstancesByTag(class FName InTag, TArray<class UAnimInstance*>* OutLinkedInstances);
	class UAnimInstance* GetLinkedAnimGraphInstanceByTag(class FName InTag);
	bool GetIntegerAttribute_Ref(class FName& BoneName, class FName& AttributeName, int32& OutValue, enum class ECustomBoneAttributeLookup LookupType);
	bool GetIntegerAttribute(class FName& BoneName, class FName& AttributeName, int32 DefaultValue, int32* OutValue, enum class ECustomBoneAttributeLookup LookupType);
	bool GetFloatAttribute_Ref(class FName& BoneName, class FName& AttributeName, float& OutValue, enum class ECustomBoneAttributeLookup LookupType);
	bool GetFloatAttribute(class FName& BoneName, class FName& AttributeName, float DefaultValue, float* OutValue, enum class ECustomBoneAttributeLookup LookupType);
	bool GetDisablePostProcessBlueprint();
	bool GetDisableAnimCurves();
	void GetCurrentJointAngles(class FName InBoneName, float* Swing1Angle, float* TwistAngle, float* Swing2Angle);
	void GetConstraintsFromBody(class FName BodyName, bool bParentConstraints, bool bChildConstraints, bool bIncludesTerminated, TArray<struct FConstraintInstanceAccessor>* OutConstraints);
	void GetConstraints(bool bIncludesTerminated, TArray<struct FConstraintInstanceAccessor>* OutConstraints);
	struct FConstraintInstanceAccessor GetConstraintByName(class FName ConstraintName, bool bIncludesTerminated);
	float GetClothMaxDistanceScale();
	class UClothingSimulationInteractor* GetClothingSimulationInteractor();
	float GetBoneMass(class FName BoneName, bool bScaleMass);
	struct FVector GetBoneLinearVelocity(class FName& InBoneName);
	class UAnimInstance* GetAnimInstance();
	class UClass* GetAnimClass();
	enum class EAnimationMode GetAnimationMode();
	bool GetAllowRigidBodyAnimNode();
	bool GetAllowedAnimCurveEvaluate();
	bool GetAllowClothActors();
	void ForceClothNextUpdateTeleportAndReset();
	void ForceClothNextUpdateTeleport();
	class FName FindConstraintBoneName(int32 ConstraintIndex);
	void ClearMorphTargets();
	void BreakConstraint(const struct FVector& Impulse, const struct FVector& HitLocation, class FName InBoneName);
	void BindClothToLeaderPoseComponent();
	void AllowAnimCurveEvaluation(class FName NameOfCurve, bool bAllow);
	void AddImpulseToAllBodiesBelow(const struct FVector& Impulse, class FName BoneName, bool bVelChange, bool bIncludeSelf);
	void AddForceToAllBodiesBelow(const struct FVector& Force, class FName BoneName, bool bAccelChange, bool bIncludeSelf);
	void AccumulateAllBodiesBelowPhysicsBlendWeight(class FName& InBoneName, float AddPhysicsBlendWeight, bool bSkipCustomPhysicsType);
};

// 0x328 (0x350 - 0x28)
// Class Engine.AnimInstance
class UAnimInstance : public UObject
{
public:
	class USkeleton*                             CurrentSkeleton;                                   // 0x28(0x8)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class ERootMotionMode                   RootMotionMode;                                    // 0x30(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bUseMultiThreadedAnimationUpdate : 1;              // Mask: 0x1, PropSize: 0x10x31(0x1)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bUsingCopyPoseFromMesh : 1;                        // Mask: 0x2, PropSize: 0x10x31(0x1)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        BitPad_39 : 2;                                     // Fixing Bit-Field Size..
	uint8                                        bReceiveNotifiesFromLinkedInstances : 1;           // Mask: 0x10, PropSize: 0x10x31(0x1)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bPropagateNotifiesToLinkedInstances : 1;           // Mask: 0x20, PropSize: 0x10x31(0x1)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bUseMainInstanceMontageEvaluationData : 1;         // Mask: 0x40, PropSize: 0x10x31(0x1)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bQueueMontageEvents : 1;                           // Mask: 0x80, PropSize: 0x10x31(0x1)(Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_36B[0x6];                                      // Fixing Size After Last Property..
	FMulticastInlineDelegateProperty_            OnMontageBlendingOut;                              // 0x38(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnMontageStarted;                                  // 0x48(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnMontageEnded;                                    // 0x58(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnAllMontageInstancesEnded;                        // 0x68(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                        Pad_36C[0xD8];                                     // Fixing Size After Last Property..
	struct FAnimNotifyQueue                      NotifyQueue;                                       // 0x150(0x70)(Transient, NativeAccessSpecifierPublic)
	TArray<struct FAnimNotifyEvent>              ActiveAnimNotifyState;                             // 0x1C0(0x10)(ZeroConstructor, Transient, ContainsInstancedReference, NativeAccessSpecifierPublic)
	TArray<struct FAnimNotifyEventReference>     ActiveAnimNotifyEventReference;                    // 0x1D0(0x10)(ZeroConstructor, Transient, NativeAccessSpecifierPublic)
	uint8                                        Pad_36D[0x170];                                    // Fixing Size Of Struct..

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("AnimInstance");
		return Clss;
	}

	bool WasAnimNotifyTriggeredInStateMachine(int32 MachineIndex, TSubclassOf<class UAnimNotify> AnimNotifyType);
	bool WasAnimNotifyTriggeredInSourceState(int32 MachineIndex, int32 StateIndex, TSubclassOf<class UAnimNotify> AnimNotifyType);
	bool WasAnimNotifyTriggeredInAnyState(TSubclassOf<class UAnimNotify> AnimNotifyType);
	bool WasAnimNotifyStateActiveInStateMachine(int32 MachineIndex, TSubclassOf<class UAnimNotifyState> AnimNotifyStateType);
	bool WasAnimNotifyStateActiveInSourceState(int32 MachineIndex, int32 StateIndex, TSubclassOf<class UAnimNotifyState> AnimNotifyStateType);
	bool WasAnimNotifyStateActiveInAnyState(TSubclassOf<class UAnimNotifyState> AnimNotifyStateType);
	bool WasAnimNotifyNameTriggeredInStateMachine(int32 MachineIndex, class FName NotifyName);
	bool WasAnimNotifyNameTriggeredInSourceState(int32 MachineIndex, int32 StateIndex, class FName NotifyName);
	bool WasAnimNotifyNameTriggeredInAnyState(class FName NotifyName);
	void UnlockAIResources(bool bUnlockMovement, bool UnlockAILogic);
	void UnlinkAnimClassLayers(TSubclassOf<class UAnimInstance> InClass);
	class APawn* TryGetPawnOwner();
	void StopSlotAnimation(float InBlendOutTime, class FName SlotNodeName);
	void SnapshotPose(struct FPoseSnapshot& Snapshot);
	void SetUseMainInstanceMontageEvaluationData(bool bSet);
	void SetRootMotionMode(enum class ERootMotionMode Value);
	void SetReceiveNotifiesFromLinkedInstances(bool bSet);
	void SetPropagateNotifiesToLinkedInstances(bool bSet);
	void SetMorphTarget(class FName MorphTargetName, float Value);
	void SavePoseSnapshot(class FName SnapshotName);
	void ResetDynamics(enum class ETeleportType InTeleportType);
	bool RequestTransitionEvent(class FName EventName, double RequestTimeout, enum class ETransitionRequestQueueMode QueueMode, enum class ETransitionRequestOverwriteMode OverwriteMode);
	void RequestSlotGroupInertialization(class FName InSlotGroupName, float Duration, class UBlendProfile* BlendProfile);
	void RemovePoseSnapshot(class FName SnapshotName);
	bool QueryTransitionEvent(int32 MachineIndex, int32 TransitionIndex, class FName EventName);
	bool QueryAndMarkTransitionEvent(int32 MachineIndex, int32 TransitionIndex, class FName EventName);
	class UAnimMontage* PlaySlotAnimationAsDynamicMontage_WithBlendSettings(class UAnimSequenceBase* Asset, class FName SlotNodeName, struct FMontageBlendSettings& BlendInSettings, struct FMontageBlendSettings& BlendOutSettings, float InPlayRate, int32 LoopCount, float BlendOutTriggerTime, float InTimeToStartMontageAt);
	class UAnimMontage* PlaySlotAnimationAsDynamicMontage_WithBlendArgs(class UAnimSequenceBase* Asset, class FName SlotNodeName, struct FAlphaBlendArgs& BlendIn, struct FAlphaBlendArgs& BlendOut, float InPlayRate, int32 LoopCount, float BlendOutTriggerTime, float InTimeToStartMontageAt);
	class UAnimMontage* PlaySlotAnimationAsDynamicMontage(class UAnimSequenceBase* Asset, class FName SlotNodeName, float BlendInTime, float BlendOutTime, float InPlayRate, int32 LoopCount, float BlendOutTriggerTime, float InTimeToStartMontageAt);
	void MontageSync_StopFollowing(class UAnimMontage* MontageFollower);
	void MontageSync_Follow(class UAnimMontage* MontageFollower, class UAnimInstance* OtherAnimInstance, class UAnimMontage* MontageLeader);
	void Montage_StopWithBlendSettings(struct FMontageBlendSettings& BlendOutSettings, class UAnimMontage* Montage);
	void Montage_StopWithBlendOut(struct FAlphaBlendArgs& BlendOut, class UAnimMontage* Montage);
	void Montage_StopGroupByName(float InBlendOutTime, class FName GroupName);
	void Montage_Stop(float InBlendOutTime, class UAnimMontage* Montage);
	void Montage_SetPosition(class UAnimMontage* Montage, float NewPosition);
	void Montage_SetPlayRate(class UAnimMontage* Montage, float NewPlayRate);
	void Montage_SetNextSection(class FName SectionNameToChange, class FName NextSection, class UAnimMontage* Montage);
	void Montage_Resume(class UAnimMontage* Montage);
	float Montage_PlayWithBlendSettings(class UAnimMontage* MontageToPlay, struct FMontageBlendSettings& BlendInSettings, float InPlayRate, enum class EMontagePlayReturnType ReturnValueType, float InTimeToStartMontageAt, bool bStopAllMontages);
	float Montage_PlayWithBlendIn(class UAnimMontage* MontageToPlay, struct FAlphaBlendArgs& BlendIn, float InPlayRate, enum class EMontagePlayReturnType ReturnValueType, float InTimeToStartMontageAt, bool bStopAllMontages);
	float Montage_Play(class UAnimMontage* MontageToPlay, float InPlayRate, enum class EMontagePlayReturnType ReturnValueType, float InTimeToStartMontageAt, bool bStopAllMontages);
	void Montage_Pause(class UAnimMontage* Montage);
	void Montage_JumpToSectionsEnd(class FName SectionName, class UAnimMontage* Montage);
	void Montage_JumpToSection(class FName SectionName, class UAnimMontage* Montage);
	bool Montage_IsPlaying(class UAnimMontage* Montage);
	bool Montage_IsActive(class UAnimMontage* Montage);
	float Montage_GetPosition(class UAnimMontage* Montage);
	float Montage_GetPlayRate(class UAnimMontage* Montage);
	bool Montage_GetIsStopped(class UAnimMontage* Montage);
	float Montage_GetEffectivePlayRate(class UAnimMontage* Montage);
	class FName Montage_GetCurrentSection(class UAnimMontage* Montage);
	float Montage_GetBlendTime(class UAnimMontage* Montage);
	void LockAIResources(bool bLockMovement, bool LockAILogic);
	void LinkAnimGraphByTag(class FName InTag, TSubclassOf<class UAnimInstance> InClass);
	void LinkAnimClassLayers(TSubclassOf<class UAnimInstance> InClass);
	bool IsUsingMainInstanceMontageEvaluationData();
	bool IsSyncGroupBetweenMarkers(class FName InSyncGroupName, class FName PreviousMarker, class FName NextMarker, bool bRespectMarkerOrder);
	bool IsSlotActive(class FName SlotNodeName);
	bool IsPlayingSlotAnimation(class UAnimSequenceBase* Asset, class FName SlotNodeName);
	bool IsAnyMontagePlaying();
	bool HasMarkerBeenHitThisFrame(class FName SyncGroup, class FName MarkerName);
	bool GetTimeToClosestMarker(class FName SyncGroup, class FName MarkerName, float* OutMarkerTime);
	struct FMarkerSyncAnimPosition GetSyncGroupPosition(class FName InSyncGroupName);
	float GetRelevantAnimTimeRemainingFraction(int32 MachineIndex, int32 StateIndex);
	float GetRelevantAnimTimeRemaining(int32 MachineIndex, int32 StateIndex);
	float GetRelevantAnimTimeFraction(int32 MachineIndex, int32 StateIndex);
	float GetRelevantAnimTime(int32 MachineIndex, int32 StateIndex);
	float GetRelevantAnimLength(int32 MachineIndex, int32 StateIndex);
	bool GetReceiveNotifiesFromLinkedInstances();
	bool GetPropagateNotifiesToLinkedInstances();
	class USkeletalMeshComponent* GetOwningComponent();
	class AActor* GetOwningActor();
	void GetLinkedAnimLayerInstancesByGroup(class FName InGroup, TArray<class UAnimInstance*>* OutLinkedInstances);
	class UAnimInstance* GetLinkedAnimLayerInstanceByGroupAndClass(class FName InGroup, TSubclassOf<class UAnimInstance> InClass);
	class UAnimInstance* GetLinkedAnimLayerInstanceByGroup(class FName InGroup);
	class UAnimInstance* GetLinkedAnimLayerInstanceByClass(TSubclassOf<class UAnimInstance> InClass);
	void GetLinkedAnimGraphInstancesByTag(class FName InTag, TArray<class UAnimInstance*>* OutLinkedInstances);
	class UAnimInstance* GetLinkedAnimGraphInstanceByTag(class FName InTag);
	float GetInstanceTransitionTimeElapsedFraction(int32 MachineIndex, int32 TransitionIndex);
	float GetInstanceTransitionTimeElapsed(int32 MachineIndex, int32 TransitionIndex);
	float GetInstanceTransitionCrossfadeDuration(int32 MachineIndex, int32 TransitionIndex);
	float GetInstanceStateWeight(int32 MachineIndex, int32 StateIndex);
	float GetInstanceMachineWeight(int32 MachineIndex);
	float GetInstanceCurrentStateElapsedTime(int32 MachineIndex);
	float GetInstanceAssetPlayerTimeFromEndFraction(int32 AssetPlayerIndex);
	float GetInstanceAssetPlayerTimeFromEnd(int32 AssetPlayerIndex);
	float GetInstanceAssetPlayerTimeFraction(int32 AssetPlayerIndex);
	float GetInstanceAssetPlayerTime(int32 AssetPlayerIndex);
	float GetInstanceAssetPlayerLength(int32 AssetPlayerIndex);
	float GetDeltaSeconds();
	bool GetCurveValueWithDefault(class FName CurveName, float DefaultValue, float* OutValue);
	float GetCurveValue(class FName CurveName);
	class FName GetCurrentStateName(int32 MachineIndex);
	class UAnimMontage* GetCurrentActiveMontage();
	void GetAllCurveNames(TArray<class FName>* OutNames);
	void GetActiveCurveNames(enum class EAnimCurveType CurveType, TArray<class FName>* OutNames);
	void ClearTransitionEvents(class FName EventName);
	void ClearMorphTargets();
	void ClearAllTransitionEvents();
	float CalculateDirection(struct FVector& Velocity, struct FRotator& BaseRotation);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void BlueprintThreadSafeUpdateAnimation(float DeltaTime);
	void BlueprintPostEvaluateAnimation();
	void BlueprintLinkedAnimationLayersInitialized();
	void BlueprintInitializeAnimation();
	void BlueprintBeginPlay();
	float Blueprint_GetSlotMontageLocalWeight(class FName SlotNodeName);
};

// 0x28 (0x50 - 0x28)
// Class Engine.BlueprintCore
class UBlueprintCore : public UObject
{
public:
	TSubclassOf<class UObject>                   SkeletonGeneratedClass;                            // 0x28(0x8)(ZeroConstructor, Transient, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UObject>                   GeneratedClass;                                    // 0x30(0x8)(ZeroConstructor, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bLegacyNeedToPurgeSkelRefs;                        // 0x38(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_36E[0x3];                                      // Fixing Size After Last Property..
	struct FGuid                                 BlueprintGuid;                                     // 0x3C(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_36F[0x4];                                      // Fixing Size Of Struct..

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("BlueprintCore");
		return Clss;
	}

};

// 0x58 (0xA8 - 0x50)
// Class Engine.Blueprint
class UBlueprint : public UBlueprintCore
{
public:
	uint8                                        Pad_370[0x8];                                      // Fixing Size After Last Property..
	TSubclassOf<class UObject>                   ParentClass;                                       // 0x58(0x8)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EBlueprintType                    BlueprintType;                                     // 0x60(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, AssetRegistrySearchable, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bRecompileOnLoad : 1;                              // Mask: 0x1, PropSize: 0x10x61(0x1)(Config, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bHasBeenRegenerated : 1;                           // Mask: 0x2, PropSize: 0x10x61(0x1)(Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bIsRegeneratingOnLoad : 1;                         // Mask: 0x4, PropSize: 0x10x61(0x1)(Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        BitPad_3A : 5;                                     // Fixing Bit-Field Size..
	uint8                                        Pad_371[0x2];                                      // Fixing Size After Last Property..
	int32                                        BlueprintSystemVersion;                            // 0x64(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USimpleConstructionScript*             SimpleConstructionScript;                          // 0x68(0x8)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UActorComponent*>               ComponentTemplates;                                // 0x70(0x10)(ExportObject, ZeroConstructor, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<class UTimelineTemplate*>             Timelines;                                         // 0x80(0x10)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<struct FBPComponentClassOverride>     ComponentClassOverrides;                           // 0x90(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
	class UInheritableComponentHandler*          InheritableComponentHandler;                       // 0xA0(0x8)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("Blueprint");
		return Clss;
	}

};

// 0x0 (0x28 - 0x28)
// Class Engine.DynamicBlueprintBinding
class UDynamicBlueprintBinding : public UObject
{
public:

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("DynamicBlueprintBinding");
		return Clss;
	}

};

// 0x0 (0x30 - 0x30)
// Class Engine.DynamicSubsystem
class UDynamicSubsystem : public USubsystem
{
public:

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("DynamicSubsystem");
		return Clss;
	}

};

// 0x0 (0x30 - 0x30)
// Class Engine.EngineSubsystem
class UEngineSubsystem : public UDynamicSubsystem
{
public:

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("EngineSubsystem");
		return Clss;
	}

};

// 0x170 (0x380 - 0x210)
// Class Engine.BlueprintGeneratedClass
class UBlueprintGeneratedClass : public UClass
{
public:
	uint8                                        Pad_372[0x8];                                      // Fixing Size After Last Property..
	int32                                        NumReplicatedProperties;                           // 0x218(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, AssetRegistrySearchable, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bHasNativizedParent : 1;                           // Mask: 0x1, PropSize: 0x10x21C(0x1)(Deprecated, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bHasCookedComponentInstancingData : 1;             // Mask: 0x2, PropSize: 0x10x21C(0x1)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        BitPad_3B : 6;                                     // Fixing Bit-Field Size..
	uint8                                        Pad_373[0x3];                                      // Fixing Size After Last Property..
	TArray<class UDynamicBlueprintBinding*>      DynamicBindingObjects;                             // 0x220(0x10)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<class UActorComponent*>               ComponentTemplates;                                // 0x230(0x10)(ExportObject, ZeroConstructor, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<class UTimelineTemplate*>             Timelines;                                         // 0x240(0x10)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<struct FBPComponentClassOverride>     ComponentClassOverrides;                           // 0x250(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FFieldNotificationId>          FieldNotifies;                                     // 0x260(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                        Pad_374[0x8];                                      // Fixing Size After Last Property..
	class USimpleConstructionScript*             SimpleConstructionScript;                          // 0x278(0x8)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UInheritableComponentHandler*          InheritableComponentHandler;                       // 0x280(0x8)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStructProperty*                       UberGraphFramePointerProperty;                     // 0x288(0x8)(ZeroConstructor, Deprecated, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_375[0x8];                                      // Fixing Size After Last Property..
	class UFunction*                             UberGraphFunction;                                 // 0x298(0x8)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FName, struct FGuid>              CookedPropertyGuids;                               // 0x2A0(0x50)(NativeAccessSpecifierPublic)
	TMap<class FName, struct FBlueprintCookedComponentInstancingData> CookedComponentInstancingData;                     // 0x2F0(0x50)(NativeAccessSpecifierPublic)
	uint8                                        Pad_376[0x40];                                     // Fixing Size Of Struct..

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("BlueprintGeneratedClass");
		return Clss;
	}

};

// 0x708 (0x990 - 0x288)
// Class Engine.CameraActor
class ACameraActor : public AActor
{
public:
	enum class EAutoReceiveInput                 AutoActivateForPlayer;                             // 0x288(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_377[0x7];                                      // Fixing Size After Last Property..
	class UCameraComponent*                      CameraComponent;                                   // 0x290(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USceneComponent*                       SceneComponent;                                    // 0x298(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        bConstrainAspectRatio : 1;                         // Mask: 0x1, PropSize: 0x10x2A0(0x1)(Deprecated, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        BitPad_3C : 7;                                     // Fixing Bit-Field Size..
	uint8                                        Pad_378[0x3];                                      // Fixing Size After Last Property..
	float                                        AspectRatio;                                       // 0x2A4(0x4)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        FOVAngle;                                          // 0x2A8(0x4)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        PostProcessBlendWeight;                            // 0x2AC(0x4)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FPostProcessSettings                  PostProcessSettings;                               // 0x2B0(0x6E0)(Deprecated, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("CameraActor");
		return Clss;
	}

	int32 GetAutoActivatePlayerIndex();
};

// 0x790 (0xA30 - 0x2A0)
// Class Engine.CameraComponent
class UCameraComponent : public USceneComponent
{
public:
	float                                        FieldOfView;                                       // 0x2A0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        OrthoWidth;                                        // 0x2A4(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        OrthoNearClipPlane;                                // 0x2A8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        OrthoFarClipPlane;                                 // 0x2AC(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        AspectRatio;                                       // 0x2B0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bConstrainAspectRatio : 1;                         // Mask: 0x1, PropSize: 0x10x2B4(0x1)(Edit, BlueprintVisible, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bUseFieldOfViewForLOD : 1;                         // Mask: 0x2, PropSize: 0x10x2B4(0x1)(Edit, BlueprintVisible, Interp, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bLockToHmd : 1;                                    // Mask: 0x4, PropSize: 0x10x2B4(0x1)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bUsePawnControlRotation : 1;                       // Mask: 0x8, PropSize: 0x10x2B4(0x1)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        BitPad_3D : 4;                                     // Fixing Bit-Field Size..
	enum class ECameraProjectionMode             ProjectionMode;                                    // 0x2B5(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_37B[0x6A];                                     // Fixing Size After Last Property..
	float                                        PostProcessBlendWeight;                            // 0x320(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_37C[0x2C];                                     // Fixing Size After Last Property..
	struct FPostProcessSettings                  PostProcessSettings;                               // 0x350(0x6E0)(Edit, BlueprintVisible, Interp, NativeAccessSpecifierPublic)

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("CameraComponent");
		return Clss;
	}

	void SetUseFieldOfViewForLOD(bool bInUseFieldOfViewForLOD);
	void SetProjectionMode(enum class ECameraProjectionMode InProjectionMode);
	void SetPostProcessBlendWeight(float InPostProcessBlendWeight);
	void SetOrthoWidth(float InOrthoWidth);
	void SetOrthoNearClipPlane(float InOrthoNearClipPlane);
	void SetOrthoFarClipPlane(float InOrthoFarClipPlane);
	void SetFieldOfView(float InFieldOfView);
	void SetConstraintAspectRatio(bool bInConstrainAspectRatio);
	void SetAspectRatio(float InAspectRatio);
	void RemoveBlendable(FInterfaceProperty_ InBlendableObject);
	void OnCameraMeshHiddenChanged();
	void GetCameraView(float DeltaTime, struct FMinimalViewInfo* DesiredView);
	void AddOrUpdateBlendable(FInterfaceProperty_ InBlendableObject, float InWeight);
};

// 0x0 (0x30 - 0x30)
// Class Engine.AudioEngineSubsystem
class UAudioEngineSubsystem : public UDynamicSubsystem
{
public:

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("AudioEngineSubsystem");
		return Clss;
	}

};

// 0x140 (0x168 - 0x28)
// Class Engine.SoundBase
class USoundBase : public UObject
{
public:
	uint8                                        Pad_37D[0x8];                                      // Fixing Size After Last Property..
	class USoundClass*                           SoundClassObject;                                  // 0x30(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, AssetRegistrySearchable, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bDebug : 1;                                        // Mask: 0x1, PropSize: 0x10x38(0x1)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bOverrideConcurrency : 1;                          // Mask: 0x2, PropSize: 0x10x38(0x1)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bEnableBusSends : 1;                               // Mask: 0x4, PropSize: 0x10x38(0x1)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bEnableBaseSubmix : 1;                             // Mask: 0x8, PropSize: 0x10x38(0x1)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bEnableSubmixSends : 1;                            // Mask: 0x10, PropSize: 0x10x38(0x1)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bHasDelayNode : 1;                                 // Mask: 0x20, PropSize: 0x10x38(0x1)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bHasConcatenatorNode : 1;                          // Mask: 0x40, PropSize: 0x10x38(0x1)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bBypassVolumeScaleForPriority : 1;                 // Mask: 0x80, PropSize: 0x10x38(0x1)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EVirtualizationMode               VirtualizationMode;                                // 0x39(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_37E[0x56];                                     // Fixing Size After Last Property..
	TSet<class USoundConcurrency*>               ConcurrencySet;                                    // 0x90(0x50)(Edit, BlueprintVisible, UObjectWrapper, NativeAccessSpecifierPublic)
	struct FSoundConcurrencySettings             ConcurrencyOverrides;                              // 0xE0(0x20)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	float                                        Duration;                                          // 0x100(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, AssetRegistrySearchable, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MaxDistance;                                       // 0x104(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, AssetRegistrySearchable, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        TotalSamples;                                      // 0x108(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, AssetRegistrySearchable, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        Priority;                                          // 0x10C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USoundAttenuation*                     AttenuationSettings;                               // 0x110(0x8)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USoundSubmixBase*                      SoundSubmixObject;                                 // 0x118(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FSoundSubmixSendInfo>          SoundSubmixSends;                                  // 0x120(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	class USoundEffectSourcePresetChain*         SourceEffectChain;                                 // 0x130(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FSoundSourceBusSendInfo>       BusSends;                                          // 0x138(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FSoundSourceBusSendInfo>       PreEffectBusSends;                                 // 0x148(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class UAssetUserData*>                AssetUserData;                                     // 0x158(0x10)(Edit, ExportObject, ZeroConstructor, ContainsInstancedReference, AdvancedDisplay, UObjectWrapper, NativeAccessSpecifierPublic)

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("SoundBase");
		return Clss;
	}

};

// 0x2E8 (0x450 - 0x168)
// Class Engine.SoundWave
class USoundWave : public USoundBase
{
public:
	uint8                                        Pad_37F[0x10];                                     // Fixing Size After Last Property..
	int32                                        CompressionQuality;                                // 0x178(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AssetRegistrySearchable, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                        StreamingPriority;                                 // 0x17C(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class ESoundwaveSampleRateSettings      SampleRateQuality;                                 // 0x180(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_380[0x1];                                      // Fixing Size After Last Property..
	enum class ESoundGroup                       SoundGroup;                                        // 0x182(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bLooping : 1;                                      // Mask: 0x1, PropSize: 0x10x183(0x1)(Edit, NoDestructor, AssetRegistrySearchable, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bStreaming : 1;                                    // Mask: 0x2, PropSize: 0x10x183(0x1)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        BitPad_3E : 6;                                     // Fixing Bit-Field Size..
	enum class ESoundAssetCompressionType        SoundAssetCompressionType;                         // 0x184(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        bSeekableStreaming : 1;                            // Mask: 0x1, PropSize: 0x10x185(0x1)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        bUseBinkAudio : 1;                                 // Mask: 0x2, PropSize: 0x10x185(0x1)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        BitPad_3F : 6;                                     // Fixing Bit-Field Size..
	uint8                                        Pad_381[0x1A];                                     // Fixing Size After Last Property..
	struct FSoundModulationDefaultRoutingSettings ModulationSettings;                                // 0x1A0(0x188)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TArray<float>                                FrequenciesToAnalyze;                              // 0x328(0x10)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FSoundWaveSpectralTimeData>    CookedSpectralTimeData;                            // 0x338(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FSoundWaveEnvelopeTimeData>    CookedEnvelopeTimeData;                            // 0x348(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                        InitialChunkSize;                                  // 0x358(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_382[0x40];                                     // Fixing Size After Last Property..
	uint8                                        BitPad_40 : 5;                                     // Fixing Bit-Field Size..
	uint8                                        bMature : 1;                                       // Mask: 0x20, PropSize: 0x10x39C(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AssetRegistrySearchable, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bManualWordWrap : 1;                               // Mask: 0x40, PropSize: 0x10x39C(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bSingleLine : 1;                                   // Mask: 0x80, PropSize: 0x10x39C(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bIsAmbisonics : 1;                                 // Mask: 0x1, PropSize: 0x10x39D(0x1)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        BitPad_41 : 7;                                     // Fixing Bit-Field Size..
	enum class ESoundWaveLoadingBehavior         LoadingBehavior;                                   // 0x39E(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_383[0x1];                                      // Fixing Size After Last Property..
	class FString                                SpokenText;                                        // 0x3A0(0x10)(ZeroConstructor, Deprecated, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        SubtitlePriority;                                  // 0x3B0(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        Volume;                                            // 0x3B4(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        Pitch;                                             // 0x3B8(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        NumChannels;                                       // 0x3BC(0x4)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, AssetRegistrySearchable, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FSoundWaveCuePoint>            CuePoints;                                         // 0x3C0(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	int32                                        SampleRate;                                        // 0x3D0(0x4)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, AssetRegistrySearchable, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_384[0xC];                                      // Fixing Size After Last Property..
	TArray<struct FSubtitleCue>                  Subtitles;                                         // 0x3E0(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	class UCurveTable*                           Curves;                                            // 0x3F0(0x8)(Edit, ZeroConstructor, NoDestructor, AdvancedDisplay, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCurveTable*                           InternalCurves;                                    // 0x3F8(0x8)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_385[0x50];                                     // Fixing Size Of Struct..

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("SoundWave");
		return Clss;
	}

	void SetSoundAssetCompressionType(enum class ESoundAssetCompressionType InSoundAssetCompressionType, bool bMarkDirty);
	enum class ESoundAssetCompressionType GetSoundAssetCompressionType();
	TArray<struct FSoundWaveCuePoint> GetLoopRegions();
	TArray<struct FSoundWaveCuePoint> GetCuePoints();
};

// 0x50 (0x4A0 - 0x450)
// Class Engine.SoundWaveProcedural
class USoundWaveProcedural : public USoundWave
{
public:
	uint8                                        Pad_386[0x50];                                     // Fixing Size Of Struct..

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("SoundWaveProcedural");
		return Clss;
	}

};

// 0x40 (0x68 - 0x28)
// Class Engine.SoundEffectPreset
class USoundEffectPreset : public UObject
{
public:
	uint8                                        Pad_387[0x40];                                     // Fixing Size Of Struct..

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("SoundEffectPreset");
		return Clss;
	}

};

// 0x0 (0x68 - 0x68)
// Class Engine.SoundEffectSubmixPreset
class USoundEffectSubmixPreset : public USoundEffectPreset
{
public:

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("SoundEffectSubmixPreset");
		return Clss;
	}

};

// 0x0 (0x28 - 0x28)
// Class Engine.ActiveSoundUpdateInterface
class UActiveSoundUpdateInterface : public UInterface
{
public:

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("ActiveSoundUpdateInterface");
		return Clss;
	}

};

// 0x40 (0x68 - 0x28)
// Class Engine.Channel
class UChannel : public UObject
{
public:
	class UNetConnection*                        Connection;                                        // 0x28(0x8)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_388[0x38];                                     // Fixing Size Of Struct..

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("Channel");
		return Clss;
	}

};

// 0x228 (0x290 - 0x68)
// Class Engine.ActorChannel
class UActorChannel : public UChannel
{
public:
	class AActor*                                Actor;                                             // 0x68(0x8)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_389[0xE8];                                     // Fixing Size After Last Property..
	TArray<class UObject*>                       CreateSubObjects;                                  // 0x158(0x10)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	uint8                                        Pad_38A[0x128];                                    // Fixing Size Of Struct..

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("ActorChannel");
		return Clss;
	}

};

// 0x0 (0x28 - 0x28)
// Class Engine.AnimationAssetExtensions
class UAnimationAssetExtensions : public UBlueprintFunctionLibrary
{
public:

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("AnimationAssetExtensions");
		return Clss;
	}

};

// 0x0 (0x28 - 0x28)
// Class Engine.AnimBlueprintClassSubsystem_PropertyAccess
class UAnimBlueprintClassSubsystem_PropertyAccess : public UObject
{
public:

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("AnimBlueprintClassSubsystem_PropertyAccess");
		return Clss;
	}

};

// 0x0 (0x28 - 0x28)
// Class Engine.AnimationDataModelNotifiesExtensions
class UAnimationDataModelNotifiesExtensions : public UBlueprintFunctionLibrary
{
public:

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("AnimationDataModelNotifiesExtensions");
		return Clss;
	}

};

// 0x0 (0x28 - 0x28)
// Class Engine.AnimLayerInterface
class UAnimLayerInterface : public UInterface
{
public:

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("AnimLayerInterface");
		return Clss;
	}

};

// 0x58 (0x80 - 0x28)
// Class Engine.AnimationAsset
class UAnimationAsset : public UObject
{
public:
	uint8                                        Pad_38B[0x10];                                     // Fixing Size After Last Property..
	class USkeleton*                             Skeleton;                                          // 0x38(0x8)(Edit, ZeroConstructor, EditConst, NoDestructor, AssetRegistrySearchable, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_38C[0x20];                                     // Fixing Size After Last Property..
	TArray<class UAnimMetaData*>                 MetaData;                                          // 0x60(0x10)(Edit, ExportObject, ZeroConstructor, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPrivate)
	TArray<class UAssetUserData*>                AssetUserData;                                     // 0x70(0x10)(Edit, ExportObject, ZeroConstructor, ContainsInstancedReference, AdvancedDisplay, Protected, UObjectWrapper, NativeAccessSpecifierProtected)

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("AnimationAsset");
		return Clss;
	}

	float GetPlayLength();
};

// 0x30 (0xB0 - 0x80)
// Class Engine.AnimSequenceBase
class UAnimSequenceBase : public UAnimationAsset
{
public:
	TArray<struct FAnimNotifyEvent>              Notifies;                                          // 0x80(0x10)(ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	float                                        SequenceLength;                                    // 0x90(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, AssetRegistrySearchable, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_38D[0x4];                                      // Fixing Size After Last Property..
	struct FRawCurveTracks                       RawCurveData;                                      // 0x98(0x10)(Protected, NativeAccessSpecifierProtected)
	float                                        RateScale;                                         // 0xA8(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bLoop;                                             // 0xAC(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_38E[0x3];                                      // Fixing Size Of Struct..

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("AnimSequenceBase");
		return Clss;
	}

};

// 0x0 (0x28 - 0x28)
// Class Engine.RawAnimSequenceTrackExtensions
class URawAnimSequenceTrackExtensions : public UBlueprintFunctionLibrary
{
public:

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("RawAnimSequenceTrackExtensions");
		return Clss;
	}

	TArray<struct FVector> GetScaleKeys(struct FRawAnimSequenceTrack& Track);
	TArray<struct FQuat> GetRotationalKeys(struct FRawAnimSequenceTrack& Track);
	TArray<struct FVector> GetPositionalKeys(struct FRawAnimSequenceTrack& Track);
};

// 0x50 (0x78 - 0x28)
// Class Engine.AssetExportTask
class UAssetExportTask : public UObject
{
public:
	class UObject*                               Object;                                            // 0x28(0x8)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UExporter*                             Exporter;                                          // 0x30(0x8)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                Filename;                                          // 0x38(0x10)(BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bSelected;                                         // 0x48(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bReplaceIdentical;                                 // 0x49(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bPrompt;                                           // 0x4A(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bAutomated;                                        // 0x4B(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bUseFileArchive;                                   // 0x4C(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bWriteEmptyFiles;                                  // 0x4D(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_38F[0x2];                                      // Fixing Size After Last Property..
	TArray<class UObject*>                       IgnoreObjectList;                                  // 0x50(0x10)(BlueprintVisible, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	class UObject*                               Options;                                           // 0x60(0x8)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                        Errors;                                            // 0x68(0x10)(BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("AssetExportTask");
		return Clss;
	}

};

// 0xC8 (0xF8 - 0x30)
// Class Engine.AssetManagerSettings
class UAssetManagerSettings : public UDeveloperSettings
{
public:
	TArray<struct FPrimaryAssetTypeInfo>         PrimaryAssetTypesToScan;                           // 0x30(0x10)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	TArray<struct FDirectoryPath>                DirectoriesToExclude;                              // 0x40(0x10)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	TArray<struct FPrimaryAssetRulesOverride>    PrimaryAssetRules;                                 // 0x50(0x10)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	TArray<struct FPrimaryAssetRulesCustomOverride> CustomPrimaryAssetRules;                           // 0x60(0x10)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	bool                                         bOnlyCookProductionAssets;                         // 0x70(0x1)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bShouldManagerDetermineTypeAndName;                // 0x71(0x1)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bShouldGuessTypeAndNameInEditor;                   // 0x72(0x1)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bShouldAcquireMissingChunksOnLoad;                 // 0x73(0x1)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bShouldWarnAboutInvalidAssets;                     // 0x74(0x1)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_390[0x3];                                      // Fixing Size After Last Property..
	TArray<struct FAssetManagerRedirect>         PrimaryAssetIdRedirects;                           // 0x78(0x10)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	TArray<struct FAssetManagerRedirect>         PrimaryAssetTypeRedirects;                         // 0x88(0x10)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	TArray<struct FAssetManagerRedirect>         AssetPathRedirects;                                // 0x98(0x10)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	TSet<class FName>                            MetaDataTagsForAssetRegistry;                      // 0xA8(0x50)(Edit, Config, AdvancedDisplay, NativeAccessSpecifierPublic)

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("AssetManagerSettings");
		return Clss;
	}

};

// 0x8 (0x30 - 0x28)
// Class Engine.AsyncPhysicsData
class UAsyncPhysicsData : public UObject
{
public:
	int32                                        ServerFrame;                                       // 0x28(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                        ReplicationRedundancy;                             // 0x2C(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("AsyncPhysicsData");
		return Clss;
	}

};

// 0x0 (0x28 - 0x28)
// Class Engine.AudioPanelWidgetInterface
class UAudioPanelWidgetInterface : public UInterface
{
public:

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("AudioPanelWidgetInterface");
		return Clss;
	}

	class FName GetIconBrushName();
	class FText GetEditorName();
};

// 0x0 (0x28 - 0x28)
// Class Engine.BlendableInterface
class UBlendableInterface : public UInterface
{
public:

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("BlendableInterface");
		return Clss;
	}

};

// 0x10 (0x38 - 0x28)
// Class Engine.AnalysisProperties
class UAnalysisProperties : public UObject
{
public:
	class FString                                Function;                                          // 0x28(0x10)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("AnalysisProperties");
		return Clss;
	}

};

// 0x140 (0x1C0 - 0x80)
// Class Engine.BlendSpace
class UBlendSpace : public UAnimationAsset
{
public:
	uint8                                        Pad_391[0x8];                                      // Fixing Size After Last Property..
	bool                                         bContainsRotationOffsetMeshSpaceSamples;           // 0x88(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_392[0x3];                                      // Fixing Size After Last Property..
	struct FInterpolationParameter               InterpolationParam[0x3];                           // 0x8C(0x30)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	float                                        TargetWeightInterpolationSpeedPerSec;              // 0xBC(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bTargetWeightInterpolationEaseInOut;               // 0xC0(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bAllowMeshSpaceBlending;                           // 0xC1(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bLoop;                                             // 0xC2(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_393[0x1];                                      // Fixing Size After Last Property..
	float                                        AnimLength;                                        // 0xC4(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class ENotifyTriggerMode                NotifyTriggerMode;                                 // 0xC8(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bInterpolateUsingGrid;                             // 0xC9(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EPreferredTriangulationDirection  PreferredTriangulationDirection;                   // 0xCA(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EBlendSpacePerBoneBlendMode       PerBoneBlendMode;                                  // 0xCB(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
