#pragma once

// Dumper.

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x0 (0x28 - 0x28)
// Class FortniteUI.AthenaChallengeListEntryContextInterface
class UAthenaChallengeListEntryContextInterface : public UInterface
{
public:

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("AthenaChallengeListEntryContextInterface");
		return Clss;
	}

};

// 0x0 (0x28 - 0x28)
// Class FortniteUI.AthenaFrontendFlowInterruptInterface
class UAthenaFrontendFlowInterruptInterface : public UInterface
{
public:

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("AthenaFrontendFlowInterruptInterface");
		return Clss;
	}

};

// 0x50 (0x448 - 0x3F8)
// Class FortniteUI.AthenaFullScreenMapBrowsingControlsWidget
class UAthenaFullScreenMapBrowsingControlsWidget : public UCommonActivatableWidget
{
public:
	class UPanelWidget*                          Panel_PanGroup;                                    // 0x3F8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UPanelWidget*                          Panel_ZoomGroup;                                   // 0x400(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USizeBox*                              SizeBox_PlaceMarker;                               // 0x408(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonTextBlock*                      Text_PlaceMarker;                                  // 0x410(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FText                                  TextPlaceMarker;                                   // 0x418(0x18)(Edit, Protected, NativeAccessSpecifierProtected)
	class FText                                  TextRemoveMarker;                                  // 0x430(0x18)(Edit, Protected, NativeAccessSpecifierProtected)

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("AthenaFullScreenMapBrowsingControlsWidget");
		return Clss;
	}

};

// 0x40 (0x310 - 0x2D0)
// Class FortniteUI.FortHUDElementWidget
class UFortHUDElementWidget : public UCommonUserWidget
{
public:
	uint8                                        Pad_275B[0x8];                                     // Fixing Size After Last Property..
	struct FGameplayTag                          ElementTag;                                        // 0x2D8(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_275C[0x4];                                     // Fixing Size After Last Property..
	struct FGameplayTagContainer                 HUDElementTag;                                     // 0x2E0(0x20)(Edit, BlueprintVisible, Protected, NativeAccessSpecifierProtected)
	enum class ESlateVisibility                  HiddenVisibility;                                  // 0x300(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_275D[0x7];                                     // Fixing Size After Last Property..
	class UTutorialHighlight*                    TutorialHighlight;                                 // 0x308(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("FortHUDElementWidget");
		return Clss;
	}

	void OnVisibilitySetEvent(enum class ESlateVisibility InVisibility);
	bool HasAnyTags(struct FGameplayTagContainer& InTags);
	void HandleOnHUDElementVisibilityChanged(struct FGameplayTagContainer& HiddenHUDElementTags);
	void HandleGetHUDElementWidgetsForTags(struct FGameplayTagContainer& HUDElementTags, TArray<class UFortHUDElementWidget*>* OutWidgets);
	void AppendHUDElementTags(struct FGameplayTagContainer& AdditionalTags);
};

// 0x90 (0x3A0 - 0x310)
// Class FortniteUI.AthenaHUDFeedbackLine
class UAthenaHUDFeedbackLine : public UFortHUDElementWidget
{
public:
	uint8                                        Pad_275E[0x8];                                     // Fixing Size After Last Property..
	class UFortKeybindWidget*                    Keybind_Feedback;                                  // 0x318(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonRichTextBlock*                  RichText_Feedback;                                 // 0x320(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_275F[0x78];                                    // Fixing Size Of Struct..

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("AthenaHUDFeedbackLine");
		return Clss;
	}

	void OnShowEnabledUpdated(bool bShowEnabled);
};

// 0x10 (0x3B0 - 0x3A0)
// Class FortniteUI.AthenaHUDFeedbackLineCooldown
class UAthenaHUDFeedbackLineCooldown : public UAthenaHUDFeedbackLine
{
public:
	uint8                                        Pad_2760[0x10];                                    // Fixing Size Of Struct..

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("AthenaHUDFeedbackLineCooldown");
		return Clss;
	}

	void RegisterAbilityNotify(class AFortPlayerController* PlayerController, class AActor* OldViewTarget, class AActor* NewViewTarget);
	void OnCooldownUpdated(float CooldownDuration, float CooldownRemaining, float CooldownPercentage);
	void OnCooldownTagChanged(const struct FGameplayTag& CooldownTag, int32 Count);
	void OnCooldownStarted();
	void OnCooldownFinished();
};

// 0x0 (0x28 - 0x28)
// Class FortniteUI.FortPrimaryContentInterface
class UFortPrimaryContentInterface : public UInterface
{
public:

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("FortPrimaryContentInterface");
		return Clss;
	}

};

// 0x0 (0x28 - 0x28)
// Class FortniteUI.AthenaHUDPrimaryContentInterface
class UAthenaHUDPrimaryContentInterface : public UFortPrimaryContentInterface
{
public:

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("AthenaHUDPrimaryContentInterface");
		return Clss;
	}

};

// 0x20 (0x2F0 - 0x2D0)
// Class FortniteUI.AthenaInventoryGroupBase
class UAthenaInventoryGroupBase : public UCommonUserWidget
{
public:
	TWeakObjectPtr<class UAthenaInventoryPanel>  ParentInventoryPanel;                              // 0x2D0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortItemTileView*                     ItemTileView;                                      // 0x2D8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EFortItemType                     ItemType;                                          // 0x2E0(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_2761[0x3];                                     // Fixing Size After Last Property..
	int32                                        DefaultNumEntries;                                 // 0x2E4(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bCanBeNavigatedTo;                                 // 0x2E8(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_2762[0x7];                                     // Fixing Size Of Struct..

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("AthenaInventoryGroupBase");
		return Clss;
	}

};

// 0x40 (0x330 - 0x2F0)
// Class FortniteUI.AthenaInventoryGroupResources
class UAthenaInventoryGroupResources : public UAthenaInventoryGroupBase
{
public:
	struct FGameplayTagContainer                 CurrencyItemTags;                                  // 0x2F0(0x20)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FGameplayTagContainer                 IngredientItemTags;                                // 0x310(0x20)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("AthenaInventoryGroupResources");
		return Clss;
	}

};

// 0x0 (0x28 - 0x28)
// Class FortniteUI.FortTabInterface
class UFortTabInterface : public UInterface
{
public:

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("FortTabInterface");
		return Clss;
	}

};

// 0x0 (0x28 - 0x28)
// Class FortniteUI.AthenaInventoryTabInterface
class UAthenaInventoryTabInterface : public UFortTabInterface
{
public:

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("AthenaInventoryTabInterface");
		return Clss;
	}

};

// 0x0 (0x28 - 0x28)
// Class FortniteUI.AthenaItemShopSectionInterface
class UAthenaItemShopSectionInterface : public UInterface
{
public:

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("AthenaItemShopSectionInterface");
		return Clss;
	}

};

// 0x0 (0x28 - 0x28)
// Class FortniteUI.AthenaMapScreenAnalyticsInterface
class UAthenaMapScreenAnalyticsInterface : public UInterface
{
public:

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("AthenaMapScreenAnalyticsInterface");
		return Clss;
	}

};

// 0x0 (0x28 - 0x28)
// Class FortniteUI.AthenaMapScreenContainerTabInterface
class UAthenaMapScreenContainerTabInterface : public UInterface
{
public:

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("AthenaMapScreenContainerTabInterface");
		return Clss;
	}

	void OnTabAddedToMapScreenContainer();
};

// 0x18 (0x410 - 0x3F8)
// Class FortniteUI.FortUIStateWidgetBase
class UFortUIStateWidgetBase : public UCommonActivatableWidget
{
public:
	uint8                                        Pad_2763[0x10];                                    // Fixing Size After Last Property..
	class UCommonActivatableWidgetStack*         WidgetStack_PrimaryContent;                        // 0x408(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("FortUIStateWidgetBase");
		return Clss;
	}

};

// 0x198 (0x5A8 - 0x410)
// Class FortniteUI.AthenaHUDBase
class UAthenaHUDBase : public UFortUIStateWidgetBase
{
public:
	uint8                                        Pad_276B[0x30];                                    // Fixing Size After Last Property..
	TArray<class UUserWidget*>                   MinigameWidgets;                                   // 0x440(0x10)(ExportObject, ZeroConstructor, ContainsInstancedReference, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TSubclassOf<class UUserWidget>               KairosHUDLayerClass;                               // 0x450(0x8)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FMutatorAddedWidgets>          MutatorAddedWidgets;                               // 0x458(0x10)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_276C[0x60];                                    // Fixing Size After Last Property..
	class UAthenaMapScreenContainer*             MapScreenContainer;                                // 0x4C8(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaHUDMenu*                        AthenaHUDMenu;                                     // 0x4D0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonActivatableWidget*              TitleBar;                                          // 0x4D8(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSet<enum class EUIExtensionSlot>            RelevantExtensionSlots;                            // 0x4E0(0x50)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	TSoftClassPtr<class UCommonActivatableWidget> NewEmotePicker;                                    // 0x530(0x28)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftClassPtr<class UCommonActivatableWidget> SquadComsPickerClass;                              // 0x558(0x28)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftClassPtr<class UFortWeaponWheel>        WeaponWheelClass;                                  // 0x580(0x28)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("AthenaHUDBase");
		return Clss;
	}

	void SetZoneCompleted(bool bValue);
	void OnHUDScaleChanged(float HUDScale);
	void OnExtensionWidgetRemoved(enum class EUIExtensionSlot ExtensionSlot, class UUserWidget* Widget);
	void OnExtensionWidgetCreated(enum class EUIExtensionSlot ExtensionSlot, class UUserWidget* Widget);
	void HandleUpdateMinigameUIExtensions(class AFortMinigame* Minigame);
	void HandleRecoverFromPostGame();
	void HandlePickerOpenRequest(enum class EFortPickerMode Mode, int32 InitialOption, bool bIgnoreFirstAccept);
	void HandleOnMutatorRemoved(class AFortGameplayMutator* NewMutator);
	void HandleOnMutatorAdded(class AFortGameplayMutator* NewMutator);
	void HandleNewPanelFromMutator(TSubclassOf<class UUserWidget> PanelClass);
	void HandleMinigamePlayModeChanged(class AFortMinigame* Minigame, bool bIsInPlayMode);
	void HandleMinigameHideHUD(bool bLoading);
	void HandleCursorModeChanging(bool bCursorModeEnabled, class FName ActionName);
	void HandleCursorModeChanged(bool bCursorModeEnabled, class FName ActionName, class UUserWidget* CustomWidget);
	bool GetZoneCompleted();
	void BindVolumeEvents();
};

// 0x20 (0x5C8 - 0x5A8)
// Class FortniteUI.AthenaMobileHUD
class UAthenaMobileHUD : public UAthenaHUDBase
{
public:
	TArray<struct FUIExtension>                  TournamentUIExtensions;                            // 0x5A8(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TArray<struct FUIExtension>                  ArenaTournamentUIExtensions;                       // 0x5B8(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("AthenaMobileHUD");
		return Clss;
	}

};

// 0x0 (0x28 - 0x28)
// Class FortniteUI.AthenaPlayerInfoBaseWidgetInterface
class UAthenaPlayerInfoBaseWidgetInterface : public UInterface
{
public:

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("AthenaPlayerInfoBaseWidgetInterface");
		return Clss;
	}

};

// 0x0 (0x28 - 0x28)
// Class FortniteUI.AthenaPostMatchScreenContainerTabInterface
class UAthenaPostMatchScreenContainerTabInterface : public UInterface
{
public:

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("AthenaPostMatchScreenContainerTabInterface");
		return Clss;
	}

};

// 0x30 (0x2D8 - 0x2A8)
// Class FortniteUI.AthenaQuestCategoryCompletedTracker
class UAthenaQuestCategoryCompletedTracker : public UUserWidget
{
public:
	uint8                                        Pad_276D[0x8];                                     // Fixing Size After Last Property..
	class FText                                  MoreInTimerCompletionText;                         // 0x2B0(0x18)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	bool                                         bShowCompletionTextUpperCase;                      // 0x2C8(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_276E[0x7];                                     // Fixing Size After Last Property..
	class UAthenaChallengeDateTimeTextBlock*     DateTimeText_MoreQuestsLater;                      // 0x2D0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("AthenaQuestCategoryCompletedTracker");
		return Clss;
	}

	bool GetIsProgressBarEnabled();
};

// 0x158 (0x180 - 0x28)
// Class FortniteUI.AthenaReplayActionFeedRowProxyInstance
class UAthenaReplayActionFeedRowProxyInstance : public UObject
{
public:
	uint8                                        Pad_276F[0x8];                                     // Fixing Size After Last Property..
	struct FReplayEliminationEventInfo           RowData;                                           // 0x30(0x150)(BlueprintVisible, BlueprintReadOnly, Transient, NativeAccessSpecifierPublic)

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("AthenaReplayActionFeedRowProxyInstance");
		return Clss;
	}

};

// 0x40 (0x68 - 0x28)
// Class FortniteUI.AthenaReplayBrowserRowProxyInstance
class UAthenaReplayBrowserRowProxyInstance : public UObject
{
public:
	uint8                                        Pad_2770[0x40];                                    // Fixing Size Of Struct..

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("AthenaReplayBrowserRowProxyInstance");
		return Clss;
	}

};

// 0x50 (0x80 - 0x30)
// Class FortniteUI.AthenaVariantPickerConfig
class UAthenaVariantPickerConfig : public UDataAsset
{
public:
	TMap<struct FGameplayTag, struct FAthenaVariantFilterSet> FilterSets;                                        // 0x30(0x50)(Edit, Protected, NativeAccessSpecifierProtected)

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("AthenaVariantPickerConfig");
		return Clss;
	}

};

// 0x0 (0x28 - 0x28)
// Class FortniteUI.BattlePassInputData
class UBattlePassInputData : public UObject
{
public:

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("BattlePassInputData");
		return Clss;
	}

};

// 0x8 (0x30 - 0x28)
// Class FortniteUI.BattlePassEnabledInputData
class UBattlePassEnabledInputData : public UBattlePassInputData
{
public:
	uint8                                        Pad_2771[0x8];                                     // Fixing Size Of Struct..

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("BattlePassEnabledInputData");
		return Clss;
	}

	void GetData(bool* InIsEnabled);
};

// 0x10 (0x38 - 0x28)
// Class FortniteUI.BattlePassBulkBuyInputData
class UBattlePassBulkBuyInputData : public UBattlePassInputData
{
public:
	uint8                                        Pad_2773[0x10];                                    // Fixing Size Of Struct..

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("BattlePassBulkBuyInputData");
		return Clss;
	}

	void GetData(bool* IsPageCompleted, int32* StartingPage, int32* EndingPage, int32* PurchaseCost);
};

// 0x0 (0x28 - 0x28)
// Class FortniteUI.CheckDismissableActivatableWidget
class UCheckDismissableActivatableWidget : public UInterface
{
public:

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("CheckDismissableActivatableWidget");
		return Clss;
	}

};

// 0x0 (0x28 - 0x28)
// Class FortniteUI.CreativeContentBrowserTab_CreationCondition
class UCreativeContentBrowserTab_CreationCondition : public UObject
{
public:

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("CreativeContentBrowserTab_CreationCondition");
		return Clss;
	}

};

// 0x950 (0xC20 - 0x2D0)
// Class FortniteUI.DonutChallengeIdleGame
class UDonutChallengeIdleGame : public UCommonUserWidget
{
public:
	FMulticastInlineDelegateProperty_            OnNewHighScore;                                    // 0x2D0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnDistanceScoreChanged;                            // 0x2E0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnSpeedScoreChanged;                               // 0x2F0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnStyleScoreChanged;                               // 0x300(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnEndMatchScore;                                   // 0x310(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnDayNightCycleChanged;                            // 0x320(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                        Pad_2774[0x140];                                   // Fixing Size After Last Property..
	struct FLinearColor                          BoundsColor;                                       // 0x470(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        DayNightCycleTime;                                 // 0x480(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        PlayerTopSpeed;                                    // 0x484(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        BumpyRideSpeedReduction;                           // 0x488(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2775[0x4];                                     // Fixing Size After Last Property..
	struct FVector2D                             MapSize;                                           // 0x490(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FVector2D                             PlayerCollisionOffset;                             // 0x4A0(0x10)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FVector2D                             PlayerCollisionSize;                               // 0x4B0(0x10)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        MapScale;                                          // 0x4C0(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        MaxNumLevels;                                      // 0x4C4(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        ObjectSpawnPlacementRadius;                        // 0x4C8(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                        NumOfTreeSpawnAttempts;                            // 0x4CC(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                        NumOfRockSpawnAttempts;                            // 0x4D0(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                        NumOfBigRockSpawnAttempts;                         // 0x4D4(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                        NumOfJumpPadSpawnAttempts;                         // 0x4D8(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2776[0x4];                                     // Fixing Size After Last Property..
	class UCurveFloat*                           Curve_BonusSpawn_Trees;                            // 0x4E0(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCurveFloat*                           Curve_BonusSpawn_SmallBumps;                       // 0x4E8(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCurveFloat*                           Curve_BonusSpawn_Bumps;                            // 0x4F0(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCurveFloat*                           Curve_BonusSpawn_JumpPads;                         // 0x4F8(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                  Param_Player_Direction;                            // 0x500(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                  Param_Player_FacingLeft;                           // 0x504(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2777[0x8];                                     // Fixing Size After Last Property..
	struct FSlateBrush                           PlayerBrush;                                       // 0x510(0xC0)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FSlateBrush                           TreeBrush;                                         // 0x5D0(0xC0)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FSlateBrush                           RockBrush;                                         // 0x690(0xC0)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FSlateBrush                           BigRockBrush;                                      // 0x750(0xC0)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FSlateBrush                           JumpPadBrush;                                      // 0x810(0xC0)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FSlateBrush                           TorchBrush;                                        // 0x8D0(0xC0)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FSlateBrush                           MonsterBrush;                                      // 0x990(0xC0)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FSlateBrush                           ChimiBrush;                                        // 0xA50(0xC0)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FSlateBrush                           ArmBrush;                                          // 0xB10(0xC0)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	class UWidgetAnimation*                      Anim_Jump;                                         // 0xBD0(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UWidgetAnimation*                      Anim_MediumJump;                                   // 0xBD8(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UWidgetAnimation*                      Anim_SuperJump;                                    // 0xBE0(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UWidgetAnimation*                      Anim_BumpyRide;                                    // 0xBE8(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UImage*                                Image_Player;                                      // 0xBF0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UImage*                                Image_MobileInput;                                 // 0xBF8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UImage*                                Image_MobileInput_Background;                      // 0xC00(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonLegacy*                   Button_Jump;                                       // 0xC08(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonLegacy*                   Button_MobileJump;                                 // 0xC10(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2778[0x8];                                     // Fixing Size Of Struct..

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("DonutChallengeIdleGame");
		return Clss;
	}

	void TryJump();
	void StartGame();
	void EndSuperJump();
	void EndJump();
	void EndBumpyRide();
	void DebugBPFloat(float InFloat);
	void BPUpdateStyle(int32 NewStyle);
	void BPUpdateSpeed(int32 NewSpeed);
	void BPUpdateDistance(int32 NewDistance);
	void BPShowHighScore(int32 InNewHighScore);
	void BPOnSpeedUpdated(int32 NewCurSpeed);
	void BPOnNextLevelReached();
	void BPOnMonsterNearChanged(bool bIsNearLevelMonster);
	void BPOnJump();
	void BPOnGameInitialized();
	void BPOnFailedJumpPress();
	void BPOnFacingDirectionChanged(bool bIsLeftFacing);
	void BPOnCrash();
	void BPOnCollision(enum class EFortDonutIdleGameObject ObjectType);
	void BPGameOver();
};

// 0x38 (0x568 - 0x530)
// Class FortniteUI.FortActivatablePanel
class UFortActivatablePanel : public UCommonActivatablePanelLegacy
{
public:
	uint8                                        Pad_277A[0x8];                                     // Fixing Size After Last Property..
	bool                                         bIsPushedOnToContentPanelStack;                    // 0x538(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIsAlreadyOnContentPanelStack;                     // 0x539(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EInputPriority                    InputPriority;                                     // 0x53A(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIsClosableByPlayerInput;                          // 0x53B(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPrimaryContentSetup                  PrimaryContentSetup;                               // 0x53C(0x3)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_277B[0x29];                                    // Fixing Size Of Struct..

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("FortActivatablePanel");
		return Clss;
	}

	void RestoreScrollWidget(class UWidget* FallbackWidget);
	void RestoreCenterWidget(class UWidget* FallbackWidget);
	void AsyncPlaySound2D(class UObject* WorldContextObject, TSoftObjectPtr<class USoundBase> SoundToLoad, float VolumeMultiplier, float PitchMultiplier, float StartTime);
};

// 0x10 (0x578 - 0x568)
// Class FortniteUI.DonutIdleGameScreen
class UDonutIdleGameScreen : public UFortActivatablePanel
{
public:
	class UWidgetAnimation*                      Anim_Intro;                                        // 0x568(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UDonutChallengeIdleGame*               Widget_GameLayer;                                  // 0x570(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("DonutIdleGameScreen");
		return Clss;
	}

};

// 0x0 (0x168 - 0x168)
// Class FortniteUI.FortFireModeStreamingVideo
class UFortFireModeStreamingVideo : public UFortBaseStreamingVideo
{
public:

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("FortFireModeStreamingVideo");
		return Clss;
	}

};

// 0x68 (0x460 - 0x3F8)
// Class FortniteUI.FortActivityBrowserAttributionsModal
class UFortActivityBrowserAttributionsModal : public UCommonActivatableWidget
{
public:
	uint8                                        Pad_277C[0x10];                                    // Fixing Size After Last Property..
	class UCommonButtonBase*                     Button_Back;                                       // 0x408(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                     Button_OpenLink;                                   // 0x410(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonRichTextBlock*                  RichText_Description;                              // 0x418(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UScrollBox*                            ScrollBox_Details;                                 // 0x420(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      Text_ActivityName;                                 // 0x428(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonRichTextBlock*                  Text_ActivityOrigin;                               // 0x430(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonRichTextBlock*                  Text_LinkCode;                                     // 0x438(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        ScrollAmount;                                      // 0x440(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_277D[0x1C];                                    // Fixing Size Of Struct..

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("FortActivityBrowserAttributionsModal");
		return Clss;
	}

	class FText GetLinkCodeTextFormat(class FText& LinkCode);
	class FText GetCreatorTextFormat(class FText& CreatorName);
	class FText GetAttributionsTextFormat(class FText& Title, class FText& Author, class FText& License);
};

// 0x28 (0x338 - 0x310)
// Class FortniteUI.FortMobileHUDElement
class UFortMobileHUDElement : public UFortHUDElementWidget
{
public:
	struct FGameplayTag                          SizePropertyTag;                                   // 0x310(0x4)(Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_277E[0x14];                                    // Fixing Size After Last Property..
	int32                                        ForcedZOrder;                                      // 0x328(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_277F[0x4];                                     // Fixing Size After Last Property..
	class UScaleBox*                             ScaleBox_HUDWidgetScale;                           // 0x330(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("FortMobileHUDElement");
		return Clss;
	}

};

// 0x80 (0x3B8 - 0x338)
// Class FortniteUI.FortMobileHUDElementProxy
class UFortMobileHUDElementProxy : public UFortMobileHUDElement
{
public:
	class FText                                  WidgetName;                                        // 0x338(0x18)(Edit, NativeAccessSpecifierPrivate)
	bool                                         AppendWidgetAndBehaviorNames;                      // 0x350(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2780[0x3];                                     // Fixing Size After Last Property..
	struct FLinearColor                          InBoundsHighlightColor;                            // 0x354(0x10)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FLinearColor                          OutOfBoundsProxyHighlightColor;                    // 0x364(0x10)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2781[0x34];                                    // Fixing Size After Last Property..
	class UImage*                                Image_SelectionHighlight;                          // 0x3A8(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UImage*                                Image_OutOfBoundsIndicator;                        // 0x3B0(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("FortMobileHUDElementProxy");
		return Clss;
	}

};

// 0x8 (0x3C0 - 0x3B8)
// Class FortniteUI.FortAutorunLockHUDElementProxy
class UFortAutorunLockHUDElementProxy : public UFortMobileHUDElementProxy
{
public:
	class UOverlay*                              Overlay_AutorunLockZone;                           // 0x3B8(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("FortAutorunLockHUDElementProxy");
		return Clss;
	}

};

// 0x20 (0x358 - 0x338)
// Class FortniteUI.BacchusHUDElement
class UBacchusHUDElement : public UFortMobileHUDElement
{
public:
	bool                                         bHideWhenNotUsingTouch;                            // 0x338(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bUpdatesWithHUDState;                              // 0x339(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bAlwaysShow;                                       // 0x33A(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBacchusHUDStateType              OnInBuildMode;                                     // 0x33B(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBacchusHUDStateType              OnInCombatMode;                                    // 0x33C(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBacchusHUDStateType              OnInEditMode;                                      // 0x33D(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBacchusHUDStateType              OnInCreativeMode;                                  // 0x33E(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBacchusHUDStateType              OnInBattleLabMode;                                 // 0x33F(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBacchusHUDStateType              IsFreeFalling;                                     // 0x340(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBacchusHUDStateType              IsGliding;                                         // 0x341(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBacchusHUDStateType              CanOpenChute;                                      // 0x342(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBacchusHUDStateType              InLockedBus;                                       // 0x343(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBacchusHUDStateType              InUnlockedBus;                                     // 0x344(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBacchusHUDStateType              OnTargeting;                                       // 0x345(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBacchusHUDStateType              OnUsingScopeTargeting;                             // 0x346(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBacchusHUDStateType              OnCanTarget;                                       // 0x347(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBacchusHUDStateType              OnCanUseScopeTargeting;                            // 0x348(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBacchusHUDStateType              OnCrouching;                                       // 0x349(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBacchusHUDStateType              OnCanUseSecondaryAbility;                          // 0x34A(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBacchusHUDStateType              OnDBNO;                                            // 0x34B(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBacchusHUDStateType              OnCarryingDBNO;                                    // 0x34C(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBacchusHUDStateType              OnCarryingHeldObject;                              // 0x34D(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBacchusHUDStateType              OnImprovedDBNO;                                    // 0x34E(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBacchusHUDStateType              OnControllingRCPawn;                               // 0x34F(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBacchusHUDStateType              OnInVehicle;                                       // 0x350(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBacchusHUDStateType              OnDrivingVehicle;                                  // 0x351(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBacchusHUDStateType              OnZiplining;                                       // 0x352(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_2782[0x5];                                     // Fixing Size Of Struct..

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("BacchusHUDElement");
		return Clss;
	}

	void ShowHighlight(bool Show);
	void OnHUDStateUpdate(struct FFortHUDState& NewState);
	void HandleInputMethodChanged(enum class ECommonInputType CurrentInputType);
};

// 0x8 (0x360 - 0x358)
// Class FortniteUI.FortAutorunLockZoneButton
class UFortAutorunLockZoneButton : public UBacchusHUDElement
{
public:
	class UFortAutorunLockZone*                  AutorunLockZone;                                   // 0x358(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("FortAutorunLockZoneButton");
		return Clss;
	}

};

// 0x0 (0x28 - 0x28)
// Class FortniteUI.FortBangWrapperContentInterface
class UFortBangWrapperContentInterface : public UInterface
{
public:

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("FortBangWrapperContentInterface");
		return Clss;
	}

	void OnStopCallout();
	void OnStartCallout(class FName TutorialObjectiveName, enum class ETutorialType TutorialType);
	void OnBangStateChanged(bool bEnabled, int32 Count);
};

// 0x8 (0x38 - 0x30)
// Class FortniteUI.FortColorPickerConfiguration
class UFortColorPickerConfiguration : public UDataAsset
{
public:
	bool                                         bNoColorOptionAvailable;                           // 0x30(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	enum class EColorPickerType                  ColorPickerType;                                   // 0x31(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bInitializeCustomColorFromSelectedSwatch;          // 0x32(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	enum class EColorPickerColorRepresentation   CustomColorRepresentation;                         // 0x33(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2785[0x4];                                     // Fixing Size Of Struct..

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("FortColorPickerConfiguration");
		return Clss;
	}

};

// 0x88 (0x480 - 0x3F8)
// Class FortniteUI.FortCreativeCreateBuildModal
class UFortCreativeCreateBuildModal : public UCommonActivatableWidget
{
public:
	class UCommonAnimatedSwitcher*               Switcher_Content;                                  // 0x3F8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPanelWidget*                          Panel_CreateBuild;                                 // 0x400(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPanelWidget*                          Panel_CreateBuildInProgress;                       // 0x408(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPanelWidget*                          Panel_CreateBuildSucceeded;                        // 0x410(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPanelWidget*                          Panel_CreateBuildFailed;                           // 0x418(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                     Button_PrimaryFunction;                            // 0x420(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                     Button_MobileClose;                                // 0x428(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                     Button_CopyMnemonic;                               // 0x430(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UButton*                               Button_CreatorPortalUrl;                           // 0x438(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      Text_CreatorPortalUrl;                             // 0x440(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      Text_Mnemonic;                                     // 0x448(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      Text_CreateBuildError;                             // 0x450(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortLazyImage*                        LazyImage_CreatorPortalQrCode;                     // 0x458(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bCreateBuildInProgress;                            // 0x460(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2786[0x7];                                     // Fixing Size After Last Property..
	class FString                                CreatedMnemonic;                                   // 0x468(0x10)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2787[0x8];                                     // Fixing Size Of Struct..

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("FortCreativeCreateBuildModal");
		return Clss;
	}

	void OnQrCodeImageUpdated();
	void OnMnemonicCopied();
	void OnCreateBuildSucceeded();
	void OnCreateBuildStarted();
	void OnCreateBuildFailed(const class FString& ErrorCode);
	void OnContentSwitcherTransitioningChanged(bool bIsTransitioning);
	void OnContentSwitcherActiveWidgetChanged(class UWidget* ActiveWidget);
	void HandleCreatorPortalUrlButtonClicked();
	void BP_Reset();
};

// 0x20 (0x1490 - 0x1470)
// Class FortniteUI.FortCreativeCreditsAttributions
class UFortCreativeCreditsAttributions : public UCommonButtonBase
{
public:
	class UTimelineComponent*                    HoverAnimationTimeline;                            // 0x1470(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonRichTextBlock*                  RichText_CreditsAttributionsShortDescription;      // 0x1478(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                        AttributionsPreviewTextWordLimit;                  // 0x1480(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_2788[0x4];                                     // Fixing Size After Last Property..
	class UCurveLinearColor*                     HoverAnimationCurve;                               // 0x1488(0x8)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("FortCreativeCreditsAttributions");
		return Clss;
	}

	void OnAnimationUpdate(const struct FLinearColor& Color);
	float GetHoverAnimationLength();
};

// 0x20 (0x1490 - 0x1470)
// Class FortniteUI.FortCreativeCreditsTeamTitleCard
class UFortCreativeCreditsTeamTitleCard : public UCommonButtonBase
{
public:
	class UCommonTextBlock*                      Text_CreatorTitle;                                 // 0x1470(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      Text_CreatorName;                                  // 0x1478(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      Text_CreatorDescription;                           // 0x1480(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2789[0x8];                                     // Fixing Size Of Struct..

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("FortCreativeCreditsTeamTitleCard");
		return Clss;
	}

};

// 0x40 (0xA8 - 0x68)
// Class FortniteUI.FortCreativeIslandInfoViewModel
class UFortCreativeIslandInfoViewModel : public UMVVMViewModelBase
{
public:
	TArray<class FText>                          IslandIntroduction;                                // 0x68(0x10)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPrivate)
	enum class EDynamicXpCalibrationPhase        XpCalibrationPhase;                                // 0x78(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_278C[0x7];                                     // Fixing Size After Last Property..
	class UTexture2DDynamic*                     ThumbnailTexture;                                  // 0x80(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_278D[0x20];                                    // Fixing Size Of Struct..

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("FortCreativeIslandInfoViewModel");
		return Clss;
	}

	void UnbindViewModel();
	void SetIslandDescriptionTags(TArray<struct FCreativeIslandDescriptionTag>& IslandDescriptionTags);
	bool IsPlayerInAnExperienceTheyOwn();
	void InitializeViewModel();
	void HandleLinkDataQueryComplete(bool bSuccess, const class FString& ErrorMessage, struct FCreativeLoadedLinkData& LinkData);
	void HandleDownloadThumbnailComplete(bool bSuccess, class UTexture2DDynamic* InThumbnailTexture);
	class FText GetIslandTitle();
	TArray<struct FCreativeIslandDescriptionTag> GetIslandDescriptionTags();
	class FText GetIslandCode();
	class FText GetCreatorName();
};

// 0x250 (0x7B8 - 0x568)
// Class FortniteUI.FortMatchmakingKnobsModal
class UFortMatchmakingKnobsModal : public UFortActivatablePanel
{
public:
	float                                        MobileOptionListEntrySpacing;                      // 0x568(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2793[0x4];                                     // Fixing Size After Last Property..
	TArray<class FString>                        ScrolledOffWhitelistedPlayers;                     // 0x570(0x10)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	TArray<class APlayerState*>                  LoadedPlayerArray;                                 // 0x580(0x10)(ZeroConstructor, Transient, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TArray<class UFortUserPermissions*>          PermissionsUserList;                               // 0x590(0x10)(ZeroConstructor, Transient, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	bool                                         bInitializeDataInNativeConstruct;                  // 0x5A0(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_2794[0x27];                                    // Fixing Size After Last Property..
	class UPlaylistUserOptions*                  OptionsAsset;                                      // 0x5C8(0x8)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class UObject*>                       OptionDataProviders;                               // 0x5D0(0x10)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2795[0x10];                                    // Fixing Size After Last Property..
	struct FPlaylistFrontEndData                 FrontEndData;                                      // 0x5F0(0x50)(Transient, NativeAccessSpecifierPrivate)
	TMap<class FString, class FString>           LoadedOptionValues;                                // 0x640(0x50)(Transient, NativeAccessSpecifierPrivate)
	class UFortPlaylistAthena*                   CurrentPlaylist;                                   // 0x690(0x8)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2796[0x40];                                    // Fixing Size After Last Property..
	class UCommonListView*                       OptionsList;                                       // 0x6D8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonTextBlock*                      TextBlock_HeaderText;                              // 0x6E0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonTextBlock*                      TextBlock_TitleText;                               // 0x6E8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonTextBlock*                      TextBlock_DescriptionText;                         // 0x6F0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UImage*                                Image_DisplayImage;                                // 0x6F8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UObject*>                       FilteredOptions;                                   // 0x700(0x10)(ZeroConstructor, Transient, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TSubclassOf<class UUserWidget>               SubcategoryHeaderWidgetClass;                      // 0x710(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TMap<struct FGameplayTag, class UFortCreativePropertySubcategoryHeaderListItem*> SubcategoryHeaderTagToListItems;                   // 0x718(0x50)(Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2797[0x50];                                    // Fixing Size Of Struct..

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("FortMatchmakingKnobsModal");
		return Clss;
	}

	void SetListDataSource(enum class EUFortMatchmakingKnobsDataSource ListType);
	void SetInScrimmage();
	void SetInGameMode(bool bIsInGame);
	void RemoveFromModalLayer();
	void OnSetInGameMode();
	void OnSelectionUpdated(class UFortMatchmakingKnobsSpinnerButton* CurrentSelection);
	void OnHoveredItemChanged(class UObject* Item, bool bIsHovered);
	void OnCurrentItemSelectionChanged(class UObject* Item);
	void OnAcceptAnimationComplete();
	void InitializeData();
	void InitForUserOptionValues(FInterfaceProperty_& UserOptionValues);
	void InitForToyOptionsActor(class AActor* InActor);
	void InitForOptionsComponent(class UFortActorOptionsComponent* OptionsComponent);
	bool HasNonEventProperties();
	bool HasMatchingTags(class UObject* Option, struct FGameplayTagContainer& CategoryTags, struct FGameplayTagContainer& ContextTags);
	bool HasEventFunctionProperty();
	bool HasEventDescriptorProperty();
	void HandleRestorePropertiesClicked();
	void HandleRestoreFunctionsClicked();
	void HandleRestoreEventsClicked();
	void HandleRestoreClicked();
	void HandleNoOptionsLoaded();
	void HandleCancelClicked();
	enum class EFortModifiedStatus GetSpinnerModificationStatus(class UFortMatchmakingKnobsSpinnerButton* SpinnerButton);
	TArray<class FString> GetScrolledOffWhitelistedPlayers();
	enum class EFortModifiedStatus GetModificationStatus(class UObject* Option);
	bool DoesContainString(class UObject* Option, const class FString& String);
	FInterfaceProperty_ BP_GetUserOptionValuesInterface();
	class UFortActorOptionsComponent* BP_GetOptionsComponent();
	FInterfaceProperty_ BP_GetLabelOverrideInterface();
	void ApplyChanges(bool bApplySettingsFromCachedData);
};

// 0x18 (0x7D0 - 0x7B8)
// Class FortniteUI.FortCreativeMyIslandContentDebugPanel
class UFortCreativeMyIslandContentDebugPanel : public UFortMatchmakingKnobsModal
{
public:
	uint8                                        Pad_2798[0x8];                                     // Fixing Size After Last Property..
	TArray<class FString>                        OwnerPermissionAllowList;                          // 0x7C0(0x10)(ZeroConstructor, Config, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("FortCreativeMyIslandContentDebugPanel");
		return Clss;
	}

};

// 0x8 (0x7C0 - 0x7B8)
// Class FortniteUI.FortCreativeMyIslandContentKnobsPanel
class UFortCreativeMyIslandContentKnobsPanel : public UFortMatchmakingKnobsModal
{
public:
	uint8                                        Pad_2799[0x8];                                     // Fixing Size Of Struct..

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("FortCreativeMyIslandContentKnobsPanel");
		return Clss;
	}

};

// 0x0 (0x28 - 0x28)
// Class FortniteUI.FortCreativeMyIslandContentPanelInterface
class UFortCreativeMyIslandContentPanelInterface : public UInterface
{
public:

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("FortCreativeMyIslandContentPanelInterface");
		return Clss;
	}

	void BP_ShouldShowPanel(bool* bOutShouldShowPanel, enum class EFortMinigameState MinigameState, bool bIsInReadOnlyExperience, bool bIsOwnerOfCurrentExperience);
};

// 0x1B8 (0x5B0 - 0x3F8)
// Class FortniteUI.FortCreativeSettingsFlow
class UFortCreativeSettingsFlow : public UCommonActivatableWidget
{
public:
	uint8                                        Pad_279A[0x8];                                     // Fixing Size After Last Property..
	class UWidgetSwitcher*                       Switcher_EditorConnected;                          // 0x400(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                  TabNameID;                                         // 0x408(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_279B[0x4];                                     // Fixing Size After Last Property..
	struct FFortTabButtonLabelInfo               TabButtonLabelInfo;                                // 0x410(0xF0)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                   ChannelBrowserInputRowHandle;                      // 0x500(0x10)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPrivate)
	TSoftClassPtr<class UFortCreativeChannelBrowser> SoftChannelBrowserClass;                           // 0x510(0x28)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                   DeviceBrowserInputRowHandle;                       // 0x538(0x10)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPrivate)
	TSoftClassPtr<class UFortCreativeDeviceBrowser> SoftDeviceBrowserClass;                            // 0x548(0x28)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_279C[0x40];                                    // Fixing Size Of Struct..

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("FortCreativeSettingsFlow");
		return Clss;
	}

};

// 0xB0 (0x660 - 0x5B0)
// Class FortniteUI.FortCreativeMyIslandPanel
class UFortCreativeMyIslandPanel : public UFortCreativeSettingsFlow
{
public:
	uint8                                        Pad_279F[0x8];                                     // Fixing Size After Last Property..
	class UFortTabListWidgetBase*                TabList_MainContent;                               // 0x5B8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonAnimatedSwitcher*               Switcher_MainContent;                              // 0x5C0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FAthenaMapScreenContainerTabInfo      MapScreenContainerTabInfo;                         // 0x5C8(0x50)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	TArray<class FName>                          BlockedTabNames;                                   // 0x618(0x10)(ZeroConstructor, Config, NativeAccessSpecifierPrivate)
	uint8                                        Pad_27A0[0x38];                                    // Fixing Size Of Struct..

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("FortCreativeMyIslandPanel");
		return Clss;
	}

	void OnTabVisibilitiesUpdated();
	void OnMinigameStateChanged(enum class EFortMinigameState MinigameState);
	void OnMinigameSettingsChanged(class UFortMinigameVolumeComponent* MinigameVolumeComponent, class AFortMinigameSettingsBuilding* MinigameSettings);
	void OnActiveMainContentWidgetChanged(class UWidget* ActiveWidget, int32 ActiveWidgetIndex);
	bool IsOwnerOfCurrentExperience();
	void HandleMinigameStateChanged(class AFortMinigame* Minigame, enum class EFortMinigameState MinigameState);
	void HandleMinigameSettingsMachineChanged(class UFortMinigameVolumeComponent* MinigameVolumeComponent, class AFortMinigameSettingsBuilding* MinigameSettings);
	void HandleCreativePermissionsChanged();
	class UFortMinigameVolumeComponent* GetMinigameVolumeComponent();
	class AFortMinigameSettingsBuilding* GetMinigameSettingsMachine();
};

// 0x30 (0x58 - 0x28)
// Class FortniteUI.FortCreativePropertySubcategoryHeaderListItem
class UFortCreativePropertySubcategoryHeaderListItem : public UObject
{
public:
	FMulticastInlineDelegateProperty_            OnIsExpandedChangedDynamicDelegate;                // 0x28(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_27A1[0x20];                                    // Fixing Size Of Struct..

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("FortCreativePropertySubcategoryHeaderListItem");
		return Clss;
	}

	void SetIsExpanded(bool bInIsExpanded);
	void OnIsExpandedChangedDynamic__DelegateSignature(bool bIsExpanded);
	bool IsExpanded();
	struct FGameplayTag GetSubcategoryTag();
};

// 0x50 (0x80 - 0x30)
// Class FortniteUI.FortCreativePropertySubcategoryTagToTextMap
class UFortCreativePropertySubcategoryTagToTextMap : public UDataAsset
{
public:
	TMap<struct FGameplayTag, class FText>       SubcategoryTagToTextMap;                           // 0x30(0x50)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("FortCreativePropertySubcategoryTagToTextMap");
		return Clss;
	}

	class FText GetSubcategoryDisplayName(struct FGameplayTag& SubcategoryTag);
};

// 0x10 (0x540 - 0x530)
// Class FortniteUI.FortCreativeScoreboardPanel
class UFortCreativeScoreboardPanel : public UCommonActivatablePanelLegacy
{
public:
	struct FDataTableRowHandle                   MainMenuInputRowHandle;                            // 0x530(0x10)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("FortCreativeScoreboardPanel");
		return Clss;
	}

};

// 0x58 (0x3D0 - 0x378)
// Class FortniteUI.FortEventDateTimeTextBlock
class UFortEventDateTimeTextBlock : public UCommonTextBlock
{
public:
	uint8                                        Pad_27A5[0x58];                                    // Fixing Size Of Struct..

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("FortEventDateTimeTextBlock");
		return Clss;
	}

	void SetTimespanValue(const struct FTimespan& InTimespan, enum class EDateFormat InFormatStyle);
	void SetDateTimeValue(const struct FDateTime& InDateTime, enum class EDateFormat InFormatStyle, float InRefreshDelay);
	void SetCountDownCompletionText(class FText InCompletionText);
	void OnCurrentTimeTextBlockUpdated__DelegateSignature(double Seconds);
	struct FDateTime GetDateTime();
};

// 0x68 (0x98 - 0x30)
// Class FortniteUI.FortEventLevelData
class UFortEventLevelData : public UDataAsset
{
public:
	class FString                                EventLevelStoreFrontName;                          // 0x30(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UAthenaRewardEventGraph> EventLevelRewards;                                 // 0x40(0x28)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UFortActivatableVideoPanel> CinematicMovieWidget;                              // 0x68(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortStreamMediaSource*                ElectraMediaSource;                                // 0x70(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMediaPlayer*                          StreamedMediaPlayer;                               // 0x78(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  CinematicVideoName;                                // 0x80(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_27A6[0x4];                                     // Fixing Size After Last Property..
	struct FDataTableRowHandle                   InteractionHandle;                                 // 0x88(0x10)(Edit, NoDestructor, NativeAccessSpecifierPublic)

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("FortEventLevelData");
		return Clss;
	}

};

// 0x148 (0x3F0 - 0x2A8)
// Class FortniteUI.FortEditableFilteredCountedTextBox
class UFortEditableFilteredCountedTextBox : public UUserWidget
{
public:
	int32                                        EntryCharLimit;                                    // 0x2A8(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EVirtualKeyboardTrigger           VirtualKeyboardTrigger;                            // 0x2AC(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_27A8[0x3];                                     // Fixing Size After Last Property..
	int32                                        EnforcedEntryCharLimit;                            // 0x2B0(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_27A9[0x4];                                     // Fixing Size After Last Property..
	class FText                                  SuggestionText;                                    // 0x2B8(0x18)(Edit, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_27AA[0x1];                                     // Fixing Size After Last Property..
	bool                                         bShouldValidatePersistentID;                       // 0x2D1(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bAllowLineBreaks;                                  // 0x2D2(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bAllowStyleEditing;                                // 0x2D3(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bIgnoreCharLimitValidation;                        // 0x2D4(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_27AB[0x3];                                     // Fixing Size After Last Property..
	struct FCharRangeList                        AllowedCharacters;                                 // 0x2D8(0x10)(Edit, Protected, NativeAccessSpecifierProtected)
	bool                                         bReplaceUserTextWithSanitizedString;               // 0x2E8(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bAllowSanitizedStrings;                            // 0x2E9(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bUseToxicityServiceSanitization;                   // 0x2EA(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_27AC[0x5];                                     // Fixing Size After Last Property..
	class FText                                  DefaultSanitizationErrorText;                      // 0x2F0(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	class FText                                  AdditionalValidationErrorText;                     // 0x308(0x18)(BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	bool                                         bCurrentlyValid;                                   // 0x320(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_27AD[0x7];                                     // Fixing Size After Last Property..
	class UEditableTextBox*                      EditText;                                          // 0x328(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_27AE[0xB8];                                    // Fixing Size After Last Property..
	class UCommonTextBlock*                      Text_CharCount;                                    // 0x3E8(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("FortEditableFilteredCountedTextBox");
		return Clss;
	}

	void ValidatePersistentID(class FText& Text);
	void UpdateCharacterCount();
	void SetTextWithForcedSanitization(class FText& Text);
	void SetEntryCharLimit(int32 InCharLimit);
	void OnDirtyTextAttempted(bool bIsBadText, bool bAdditionalValidationFailed);
	void HandleTextCommitted(class FText& Text, enum class ETextCommit CommitMethod);
	void HandleTextChanged(class FText& Text);
	bool GetIgnoreCharLimitValidation();
	int32 GetEntryCharLimit();
	bool GetAllowStyleEditing();
	bool GetAllowLineBreaks();
	class FString GetAllowedCharactersAsString();
};

// 0x30 (0x420 - 0x3F0)
// Class FortniteUI.FortFilteredNameEntryWidget
class UFortFilteredNameEntryWidget : public UFortEditableFilteredCountedTextBox
{
public:
	enum class ETextCommit                       LastTextCommittedType;                             // 0x3F0(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_27B0[0x7];                                     // Fixing Size After Last Property..
	class UCommonButtonBase*                     Button_RenameInputButton;                          // 0x3F8(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	FMulticastInlineDelegateProperty_            OnTextCommitByEnter;                               // 0x400(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnRenameInput;                                     // 0x410(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("FortFilteredNameEntryWidget");
		return Clss;
	}

	void HandleOnTextCommitted(class FText& Text, enum class ETextCommit CommitMethod);
};

// 0x0 (0x28 - 0x28)
// Class FortniteUI.FortFrontendOverlayInterface
class UFortFrontendOverlayInterface : public UInterface
{
public:

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("FortFrontendOverlayInterface");
		return Clss;
	}

};

// 0x0 (0x28 - 0x28)
// Class FortniteUI.FortGameSettingRegistryExtension
class UFortGameSettingRegistryExtension : public UFortGameSettingRegistryExtensionBase
{
public:

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("FortGameSettingRegistryExtension");
		return Clss;
	}

};

// 0x0 (0x28 - 0x28)
// Class FortniteUI.FortGlobalActionDetailsDataSource
class UFortGlobalActionDetailsDataSource : public UInterface
{
public:

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("FortGlobalActionDetailsDataSource");
		return Clss;
	}

	void RemoveOnChangeDelegate(FDelegateProperty_& InDelegate);
	struct FFortGlobalActionDetails GetValue();
	void AddOnChangeDelegate(FDelegateProperty_& InDelegate);
};

// 0x8 (0x400 - 0x3F8)
// Class FortniteUI.FortHabaneroInfoEntry
class UFortHabaneroInfoEntry : public UCommonActivatableWidget
{
public:
	class UFortHabaneroDisplayData*              HabaneroDisplayData;                               // 0x3F8(0x8)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("FortHabaneroInfoEntry");
		return Clss;
	}

	void OnSetGameMode(const class FString& GameMode);
};

// 0x50 (0x448 - 0x3F8)
// Class FortniteUI.FortHabaneroInfoModal
class UFortHabaneroInfoModal : public UCommonActivatableWidget
{
public:
	class UVerticalBox*                          Vbox_Panels;                                       // 0x3F8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                     Button_Close;                                      // 0x400(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                     Button_Close_Alt;                                  // 0x408(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                     Button_CloseTouch;                                 // 0x410(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAthenaScrollBox*                      ScrollBox_Panels;                                  // 0x418(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_27B2[0x10];                                    // Fixing Size After Last Property..
	bool                                         bIsHabaneroTimerEnabled;                           // 0x430(0x1)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_27B3[0x17];                                    // Fixing Size Of Struct..

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("FortHabaneroInfoModal");
		return Clss;
	}

	void SetTimerVisibility(enum class ESlateVisibility TimerVisibility);
	void SetTimerText(struct FTimespan& Timespan);
	void SetProgress(const class FString& ProgressKey, int32 CurrentHabanero, int32 CurrentPosition, float ProgressPercent);
	void BP_OnScrollCompleted(bool bScrolledDown);
};

// 0x28 (0x420 - 0x3F8)
// Class FortniteUI.FortHabaneroTierWidget
class UFortHabaneroTierWidget : public UCommonActivatableWidget
{
public:
	uint8                                        Pad_27B4[0x18];                                    // Fixing Size After Last Property..
	class UFortHabaneroDisplayData*              HabaneroDisplayData;                               // 0x410(0x8)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bInitializeToRepresentLocalUser;                   // 0x418(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_27B5[0x7];                                     // Fixing Size Of Struct..

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("FortHabaneroTierWidget");
		return Clss;
	}

	void UpdateWidgetDisplay(struct FFortHabaneroTier& DisplayData);
	void StartQueryForRank();
	void FailedToFindRank();
};

// 0x18 (0x438 - 0x420)
// Class FortniteUI.FortHabaneroLobbyWidget
class UFortHabaneroLobbyWidget : public UFortHabaneroTierWidget
{
public:
	class UCommonButtonBase*                     Button_Info;                                       // 0x420(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTag                          RankedInfoBangTag;                                 // 0x428(0x4)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_27B6[0x4];                                     // Fixing Size After Last Property..
	TSubclassOf<class UFortHabaneroInfoModal>    InfoModalClass;                                    // 0x430(0x8)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("FortHabaneroLobbyWidget");
		return Clss;
	}

	void UpdateProgressToNextHabanero(int32 UnrealRankPlayerPosition, float ProgressPercent);
	void SetBangVisible(bool bIsVisible);
};

// 0x40 (0x70 - 0x30)
// Class FortniteUI.FortHUDVisibilityData
class UFortHUDVisibilityData : public UDataAsset
{
public:
	struct FGameplayTag                          HUDVisibilityGameplayTag;                          // 0x30(0x4)(BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_27B7[0x4];                                     // Fixing Size After Last Property..
	class FText                                  DisplayText;                                       // 0x38(0x18)(BlueprintVisible, NativeAccessSpecifierPublic)
	class FText                                  ToolTipText;                                       // 0x50(0x18)(BlueprintVisible, NativeAccessSpecifierPublic)
	bool                                         Visible;                                           // 0x68(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_27B8[0x7];                                     // Fixing Size Of Struct..

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("FortHUDVisibilityData");
		return Clss;
	}

};

// 0x158 (0x180 - 0x28)
// Class FortniteUI.FortSetting
class UFortSetting : public UObject
{
public:
	uint8                                        Pad_27B9[0x48];                                    // Fixing Size After Last Property..
	class UFortLocalPlayer*                      LocalPlayer;                                       // 0x70(0x8)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortSetting*                          SettingParent;                                     // 0x78(0x8)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortSettingRegistry*                  OwningRegistry;                                    // 0x80(0x8)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_27BA[0x60];                                    // Fixing Size After Last Property..
	struct FFortSettingNameExtensions            CustomExtensions;                                  // 0xE8(0x18)(Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_27BB[0x80];                                    // Fixing Size Of Struct..

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("FortSetting");
		return Clss;
	}

	class FText GetWarningRichText();
	class FText GetDynamicDetails();
	enum class ESlateVisibility GetDisplayNameVisibility();
	class FText GetDisplayName();
	class FString GetDevName();
	class FText GetDescriptionRichText();
};

// 0x0 (0x180 - 0x180)
// Class FortniteUI.FortSettingValue
class UFortSettingValue : public UFortSetting
{
public:

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("FortSettingValue");
		return Clss;
	}

};

// 0x8 (0x188 - 0x180)
// Class FortniteUI.FortInputSettingBase
class UFortInputSettingBase : public UFortSettingValue
{
public:
	uint8                                        Pad_27BC[0x8];                                     // Fixing Size Of Struct..

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("FortInputSettingBase");
		return Clss;
	}

};

// 0x0 (0x28 - 0x28)
// Class FortniteUI.FortItemManagementMulchPanel
class UFortItemManagementMulchPanel : public UInterface
{
public:

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("FortItemManagementMulchPanel");
		return Clss;
	}

	void ShowMulchConfirmationModal();
	void NotifyPanelDeactivated();
	void NotifyPanelActivated();
	void HideMulchConfirmationModal();
};

// 0x0 (0x28 - 0x28)
// Class FortniteUI.FortFrontendInventoryFilterFunctionLibrary
class UFortFrontendInventoryFilterFunctionLibrary : public UBlueprintFunctionLibrary
{
public:

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("FortFrontendInventoryFilterFunctionLibrary");
		return Clss;
	}

	class FText ToText(enum class EFortFrontendInventoryFilter FrontendInventoryFilter);
};

// 0xC8 (0xF0 - 0x28)
// Class FortniteUI.FortPresentationItemLootInfo
class UFortPresentationItemLootInfo : public UObject
{
public:
	struct FFortReceivedItemLootInfo             ItemReceivedInfo;                                  // 0x28(0xC8)(NativeAccessSpecifierPublic)

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("FortPresentationItemLootInfo");
		return Clss;
	}

};

// 0x18 (0x2C0 - 0x2A8)
// Class FortniteUI.ItemReceivedHeaderBase
class UItemReceivedHeaderBase : public UUserWidget
{
public:
	class UFortGiftBoxItem*                      GiftBoxItem;                                       // 0x2A8(0x8)(BlueprintVisible, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                FromUsername;                                      // 0x2B0(0x10)(BlueprintVisible, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("ItemReceivedHeaderBase");
		return Clss;
	}

	void SetBlueprintGiftBoxItem(class UFortGiftBoxItem* GiftBox, const class FString& FromUser, TArray<struct FFortReceivedItemLootInfo>& ItemDefs, bool bSelfGift);
	void InitFromGiftBoxItem_BP();
};

// 0x0 (0x28 - 0x28)
// Class FortniteUI.FortLoadingScreenCustomWidgetInterface
class UFortLoadingScreenCustomWidgetInterface : public UInterface
{
public:

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("FortLoadingScreenCustomWidgetInterface");
		return Clss;
	}

};

// 0x20 (0x2F0 - 0x2D0)
// Class FortniteUI.FortMatchmakingSuggestionWidget
class UFortMatchmakingSuggestionWidget : public UCommonUserWidget
{
public:
	class UWidget*                               SharedDataTestVoting_Container;                    // 0x2D0(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                     Button_SharedDataTest_Accept;                      // 0x2D8(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                     Button_SharedDataTest_Reject;                      // 0x2E0(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      Text_RequestedTextChange;                          // 0x2E8(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("FortMatchmakingSuggestionWidget");
		return Clss;
	}

};

// 0x20 (0x48 - 0x28)
// Class FortniteUI.FortMobileButtonBehaviorComponent
class UFortMobileButtonBehaviorComponent : public UObject
{
public:
	class UFortMobileActionButtonBehavior*       ButtonBehavior;                                    // 0x28(0x8)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UFortButtonBehaviorComponentOverride*> ButtonBehaviorComponentOverrides;                  // 0x30(0x10)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_27BF[0x8];                                     // Fixing Size Of Struct..

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("FortMobileButtonBehaviorComponent");
		return Clss;
	}

};

// 0x0 (0x48 - 0x48)
// Class FortniteUI.FortMobileButtonBehaviorComponent_IconPicker
class UFortMobileButtonBehaviorComponent_IconPicker : public UFortMobileButtonBehaviorComponent
{
public:

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("FortMobileButtonBehaviorComponent_IconPicker");
		return Clss;
	}

};

// 0x10 (0x58 - 0x48)
// Class FortniteUI.FortMobileButtonBehaviorComboComponent_IconPicker
class UFortMobileButtonBehaviorComboComponent_IconPicker : public UFortMobileButtonBehaviorComponent_IconPicker
{
public:
	TArray<struct FQueriedResultIconAssignment>  IconAssignementQueries;                            // 0x48(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, ContainsInstancedReference, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("FortMobileButtonBehaviorComboComponent_IconPicker");
		return Clss;
	}

};

// 0x0 (0x48 - 0x48)
// Class FortniteUI.FortMobileButtonBehaviorComponent_Visibility
class UFortMobileButtonBehaviorComponent_Visibility : public UFortMobileButtonBehaviorComponent
{
public:

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("FortMobileButtonBehaviorComponent_Visibility");
		return Clss;
	}

};

// 0x10 (0x58 - 0x48)
// Class FortniteUI.FortMobileButtonBehaviorComboComponent_Visibility
class UFortMobileButtonBehaviorComboComponent_Visibility : public UFortMobileButtonBehaviorComponent_Visibility
{
public:
	TArray<struct FQueriedResultVisibilityAssignment> VisibilityAssignementQueries;                      // 0x48(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, ContainsInstancedReference, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("FortMobileButtonBehaviorComboComponent_Visibility");
		return Clss;
	}

};

// 0x40 (0x378 - 0x338)
// Class FortniteUI.FortMobileEasyLootGrid
class UFortMobileEasyLootGrid : public UFortMobileHUDElement
{
public:
	class UButton*                               Button_AutoPickUp;                                 // 0x338(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonListView*                       ListView_Items;                                    // 0x340(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UOverlay*                              Overlay_FullBackpack;                              // 0x348(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TWeakObjectPtr<class UFortControllerComponent_Interaction> InteractionComponent;                              // 0x350(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_27C1[0x8];                                     // Fixing Size After Last Property..
	TArray<TWeakObjectPtr<class AActor>>         InteractionItemList;                               // 0x360(0x10)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                        Pad_27C2[0x8];                                     // Fixing Size Of Struct..

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("FortMobileEasyLootGrid");
		return Clss;
	}

	void OnAutoPickupPressed(bool bEnable);
	bool IsEasyLootGridEnabled(class AFortPlayerController* FortPC, class AActor* PickUpItem);
	void HandleAutoPickUpPressed();
};

// 0x8 (0x30 - 0x28)
// Class FortniteUI.FortMobileEasyLootGridItemEntry
class UFortMobileEasyLootGridItemEntry : public UObject
{
public:
	TWeakObjectPtr<class AFortPickup>            PickUpItem;                                        // 0x28(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("FortMobileEasyLootGridItemEntry");
		return Clss;
	}

};

// 0x38 (0x2E0 - 0x2A8)
// Class FortniteUI.FortMobileEasyLootGridListEntry
class UFortMobileEasyLootGridListEntry : public UUserWidget
{
public:
	uint8                                        Pad_27C3[0x8];                                     // Fixing Size After Last Property..
	class UCommonButtonBase*                     Button_PickUp;                                     // 0x2B0(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                     Button_Consume;                                    // 0x2B8(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UTextBlock*                            Text_WeaponName;                                   // 0x2C0(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UTextBlock*                            Text_WeaponRarity;                                 // 0x2C8(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaItemIcon*                       ItemIcon;                                          // 0x2D0(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TWeakObjectPtr<class AFortPickup>            PickUpItem;                                        // 0x2D8(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("FortMobileEasyLootGridListEntry");
		return Clss;
	}

	void SecondaryButtonClicked();
	void PrimaryButtonClicked();
};

// 0x38 (0x60 - 0x28)
// Class FortniteUI.FortMobileHUDWidgetCustomPropertyModel
class UFortMobileHUDWidgetCustomPropertyModel : public UObject
{
public:
	bool                                         bIsVisibleToTheUser;                               // 0x28(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_27C4[0x7];                                     // Fixing Size After Last Property..
	class FString                                PropertyDevName;                                   // 0x30(0x10)(Edit, ZeroConstructor, EditConst, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FText                                  PropertyDisplayName;                               // 0x40(0x18)(Edit, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTag                          PropertyTag;                                       // 0x58(0x4)(Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_27C5[0x4];                                     // Fixing Size Of Struct..

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("FortMobileHUDWidgetCustomPropertyModel");
		return Clss;
	}

};

// 0x8 (0x68 - 0x60)
// Class FortniteUI.FortMobileHUDWidgetCustomPropertyModel_Bool
class UFortMobileHUDWidgetCustomPropertyModel_Bool : public UFortMobileHUDWidgetCustomPropertyModel
{
public:
	bool                                         DefaultValue;                                      // 0x60(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_27C6[0x7];                                     // Fixing Size Of Struct..

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("FortMobileHUDWidgetCustomPropertyModel_Bool");
		return Clss;
	}

};

// 0x0 (0x68 - 0x68)
// Class FortniteUI.FortMobileHUDWidgetCustomPropertyModel_AutorunPreference
class UFortMobileHUDWidgetCustomPropertyModel_AutorunPreference : public UFortMobileHUDWidgetCustomPropertyModel_Bool
{
public:

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("FortMobileHUDWidgetCustomPropertyModel_AutorunPreference");
		return Clss;
	}

};

// 0x10 (0x40 - 0x30)
// Class FortniteUI.FortModalContainerData
class UFortModalContainerData : public UDataAsset
{
public:
	TArray<struct FFortModalContainerSizeEntry>  Entries;                                           // 0x30(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("FortModalContainerData");
		return Clss;
	}

};

// 0x30 (0x3E8 - 0x3B8)
// Class FortniteUI.FortMoveStickHUDElementProxy
class UFortMoveStickHUDElementProxy : public UFortMobileHUDElementProxy
{
public:
	class UOverlay*                              Overlay_Highlights;                                // 0x3B8(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USizeBox*                              SizeBox_AutorunLockZoneHidden;                     // 0x3C0(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USizeBox*                              SizeBox_AutorunLockZoneSize;                       // 0x3C8(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USizeBox*                              SizeBox_AutorunDirectionArrowSpaceSize;            // 0x3D0(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FGameplayTag                          AutorunLockZoneSizePropertyTag;                    // 0x3D8(0x4)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        DefaultAutorunLockZoneSize;                        // 0x3DC(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        DefaultAutorunLockZoneTopPadding;                  // 0x3E0(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_27C7[0x4];                                     // Fixing Size Of Struct..

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("FortMoveStickHUDElementProxy");
		return Clss;
	}

};

// 0x1A8 (0x710 - 0x568)
// Class FortniteUI.FortItemPreviewScreen
class UFortItemPreviewScreen : public UFortActivatablePanel
{
public:
	uint8                                        Pad_27C8[0x10];                                    // Fixing Size After Last Property..
	struct FDataTableRowHandle                   ItemViewUnifiedSupportsCameraControlInputAction;   // 0x578(0x10)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                   ItemViewUnifiedZoomInputAction;                    // 0x588(0x10)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                   ItemViewZoomOutInputAction;                        // 0x598(0x10)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                   ItemViewZoomInInputAction;                         // 0x5A8(0x10)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                   ItemViewRotateInputAction;                         // 0x5B8(0x10)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	class UWidgetAnimation*                      AnimationToHideItemInfo;                           // 0x5C8(0x8)(BlueprintVisible, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bAutoShowDetails;                                  // 0x5D0(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bItemDetailsHidden;                                // 0x5D1(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_27C9[0x2];                                     // Fixing Size After Last Property..
	float                                        HideItemInfoHeaderDurationSecs;                    // 0x5D4(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_27CA[0x8];                                     // Fixing Size After Last Property..
	bool                                         bAllowItemRotation;                                // 0x5E0(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bAllowItemZooming;                                 // 0x5E1(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	enum class EFrontEndCamera                   FrontEndCamera;                                    // 0x5E2(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_27CB[0x1];                                     // Fixing Size After Last Property..
	struct FGameplayTag                          PreviewSceneChangerTag;                            // 0x5E4(0x4)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FGameplayTag                          PreviewSceneChangerOverrideTag;                    // 0x5E8(0x4)(Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_27CC[0x4];                                     // Fixing Size After Last Property..
	class AFortItemPreviewSceneChanger*          PreviewSceneChanger;                               // 0x5F0(0x8)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortItemView*                         ItemViewObject;                                    // 0x5F8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, InstancedReference, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        CameraEntryTransitionDuration;                     // 0x600(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_27CD[0x4];                                     // Fixing Size After Last Property..
	class UCurveFloat*                           CameraEntryTransitionCurve;                        // 0x608(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_27CE[0x80];                                    // Fixing Size After Last Property..
	class UWidget*                               Widget_CameraFrame;                                // 0x690(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                     Button_PreviewAction;                              // 0x698(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                     Button_Camera;                                     // 0x6A0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSet<class UCommonButtonBase*>               PreviewActionButtons;                              // 0x6A8(0x50)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ContainsInstancedReference, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	class UCommonActivatableWidget*              OverrideFocusWidget;                               // 0x6F8(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortItemDownloadIndicator*            ItemDownloadIndicator;                             // 0x700(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonTextBlock*                      Text_DebugPreviewDetails;                          // 0x708(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("FortItemPreviewScreen");
		return Clss;
	}

	void ShowItemDetails();
	void OnPreviewActionButtonUpdated(class FText& RowDisplayName);
	void HideItemDetails();
};

// 0x8 (0x718 - 0x710)
// Class FortniteUI.FortMPItemShopScreen
class UFortMPItemShopScreen : public UFortItemPreviewScreen
{
public:
	uint8                                        Pad_27D0[0x8];                                     // Fixing Size Of Struct..

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("FortMPItemShopScreen");
		return Clss;
	}

	void OnUpdateCMSDataString(const class FString& DataString);
	void OnBackgroundDataLoaded(class UObject* LoadedBackground);
	bool LoadBackgroundData(const class FString& BackgroundData);
};

// 0x0 (0x28 - 0x28)
// Class FortniteUI.FortNodeCanvasEntityInterface
class UFortNodeCanvasEntityInterface : public UInterface
{
public:

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("FortNodeCanvasEntityInterface");
		return Clss;
	}

};

// 0x8 (0x418 - 0x410)
// Class FortniteUI.FortNullHUD
class UFortNullHUD : public UFortUIStateWidgetBase
{
public:
	class UCommonUserWidget*                     ActionBar_BottomBar;                               // 0x410(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("FortNullHUD");
		return Clss;
	}

};

// 0x18 (0x40 - 0x28)
// Class FortniteUI.FortOptionsCategoryHeader
class UFortOptionsCategoryHeader : public UObject
{
public:
	class FText                                  DisplayText;                                       // 0x28(0x18)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("FortOptionsCategoryHeader");
		return Clss;
	}

};

// 0xD8 (0x108 - 0x30)
// Class FortniteUI.FortOptionsMenuInputData
class UFortOptionsMenuInputData : public UDataAsset
{
public:
	class FName                                  ActionName;                                        // 0x30(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_27D1[0x4];                                     // Fixing Size After Last Property..
	class FText                                  DisplayText;                                       // 0x38(0x18)(BlueprintVisible, NativeAccessSpecifierPublic)
	class FText                                  PrimaryText;                                       // 0x50(0x18)(BlueprintVisible, NativeAccessSpecifierPublic)
	class FText                                  SecondaryText;                                     // 0x68(0x18)(BlueprintVisible, NativeAccessSpecifierPublic)
	int32                                        ElementNumber;                                     // 0x80(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_27D2[0x4];                                     // Fixing Size After Last Property..
	class UCommonTextBlock*                      TabText;                                           // 0x88(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFortActionKeyMapping                 ActionKeyMapping;                                  // 0x90(0x78)(NativeAccessSpecifierPublic)

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("FortOptionsMenuInputData");
		return Clss;
	}

	float GetInputScale();
	enum class EFortInputActionGroup GetInputActionGroup();
};

// 0x0 (0x28 - 0x28)
// Class FortniteUI.FortPersistentTabObject
class UFortPersistentTabObject : public UObject
{
public:

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("FortPersistentTabObject");
		return Clss;
	}

	void OnTabInitialized();
	void OnTabExited();
	void OnTabEntered();
	void OnTabDestroyed();
};

// 0x10 (0x2B8 - 0x2A8)
// Class FortniteUI.FortPlayerAvatar
class UFortPlayerAvatar : public UUserWidget
{
public:
	TWeakObjectPtr<class UFortSocialUser>        SocialUser;                                        // 0x2A8(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortSocialAvatarIcon*                 SocialAvatarIcon;                                  // 0x2B0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("FortPlayerAvatar");
		return Clss;
	}

	void OnOnlinePresenceChanged(bool bHidePresence, enum class EPresenceIndicatorState PresenceState);
};

// 0x10 (0x1480 - 0x1470)
// Class FortniteUI.FortPlayerSurveyResponseChoiceBase
class UFortPlayerSurveyResponseChoiceBase : public UCommonButtonBase
{
public:
	class UCommonTextBlock*                      Text_Response;                                     // 0x1470(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_27D3[0x8];                                     // Fixing Size Of Struct..

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("FortPlayerSurveyResponseChoiceBase");
		return Clss;
	}

	void SetChoiceType(enum class EFortPlayerSurveyResponseChoiceType Type);
	void OnSurveyResetChoice();
};

// 0x30 (0x428 - 0x3F8)
// Class FortniteUI.FortPlayerSurveyResponseWidget
class UFortPlayerSurveyResponseWidget : public UCommonActivatableWidget
{
public:
	uint8                                        Pad_27D4[0x30];                                    // Fixing Size Of Struct..

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("FortPlayerSurveyResponseWidget");
		return Clss;
	}

};

// 0x8 (0x2B0 - 0x2A8)
// Class FortniteUI.FortPopupModal
class UFortPopupModal : public UUserWidget
{
public:
	class UCommonButtonLegacy*                   IconTextButton_Close;                              // 0x2A8(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("FortPopupModal");
		return Clss;
	}

};

// 0x8 (0x30 - 0x28)
// Class FortniteUI.FortRichTextTextureDecorator
class UFortRichTextTextureDecorator : public URichTextBlockDecorator
{
public:
	class UObject*                               LoadedResourceObject;                              // 0x28(0x8)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("FortRichTextTextureDecorator");
		return Clss;
	}

};

// 0x0 (0x28 - 0x28)
// Class FortniteUI.FortRichTextTextureDecoratorHelpers
class UFortRichTextTextureDecoratorHelpers : public UBlueprintFunctionLibrary
{
public:

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("FortRichTextTextureDecoratorHelpers");
		return Clss;
	}

	class FText MakeFortRichTextTexture(TSoftObjectPtr<class UTexture2D> InTexture, bool bUseDesiredSize, int32 Width, int32 Height);
	class FText MakeFortRichTextMaterial(TSoftObjectPtr<class UMaterialInterface> InMaterial, bool bUseDesiredSize, int32 Width, int32 Height);
};

// 0x100 (0x130 - 0x30)
// Class FortniteUI.FortServerBrowserActionData
class UFortServerBrowserActionData : public UPrimaryDataAsset
{
public:
	enum class EFortServerBrowserAction          ActionType;                                        // 0x30(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_27D9[0x7];                                     // Fixing Size After Last Property..
	class FText                                  Title;                                             // 0x38(0x18)(Edit, NativeAccessSpecifierPublic)
	class FText                                  Description;                                       // 0x50(0x18)(Edit, NativeAccessSpecifierPublic)
	uint8                                        Pad_27DA[0x8];                                     // Fixing Size After Last Property..
	struct FSlateBrush                           TileImage;                                         // 0x70(0xC0)(Edit, NativeAccessSpecifierPublic)

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("FortServerBrowserActionData");
		return Clss;
	}

};

// 0x30 (0x160 - 0x130)
// Class FortniteUI.FortServerBrowserActionDataPopup
class UFortServerBrowserActionDataPopup : public UFortServerBrowserActionData
{
public:
	TSoftClassPtr<class UCommonActivatableWidget> PopupClass;                                        // 0x130(0x28)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_27DB[0x8];                                     // Fixing Size Of Struct..

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("FortServerBrowserActionDataPopup");
		return Clss;
	}

};

// 0x0 (0x180 - 0x180)
// Class FortniteUI.FortSettingValueDiscrete
class UFortSettingValueDiscrete : public UFortSettingValue
{
public:

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("FortSettingValueDiscrete");
		return Clss;
	}

	TArray<class FText> GetDiscreteOptions();
	int32 GetDiscreteOptionInitialIndex();
	int32 GetDiscreteOptionIndex();
	int32 GetDiscreteOptionDefaultIndex();
	TArray<class FText> GetDisabledOptionsReasons();
	TArray<class FText> GetDisabledOptions();
};

// 0x68 (0x1E8 - 0x180)
// Class FortniteUI.FortSettingValueDiscreteDynamic
class UFortSettingValueDiscreteDynamic : public UFortSettingValueDiscrete
{
public:
	uint8                                        Pad_27DC[0x68];                                    // Fixing Size Of Struct..

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("FortSettingValueDiscreteDynamic");
		return Clss;
	}

};

// 0x0 (0x1E8 - 0x1E8)
// Class FortniteUI.FortSettingValueDiscreteDynamic_Vector2D
class UFortSettingValueDiscreteDynamic_Vector2D : public UFortSettingValueDiscreteDynamic
{
public:

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("FortSettingValueDiscreteDynamic_Vector2D");
		return Clss;
	}

};

// 0x0 (0x1E8 - 0x1E8)
// Class FortniteUI.FortSettingValueDiscreteDynamic_Anchors
class UFortSettingValueDiscreteDynamic_Anchors : public UFortSettingValueDiscreteDynamic_Vector2D
{
public:

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("FortSettingValueDiscreteDynamic_Anchors");
		return Clss;
	}

};

// 0x0 (0x28 - 0x28)
// Class FortniteUI.FortSocialPanelContainerInterface
class UFortSocialPanelContainerInterface : public UInterface
{
public:

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("FortSocialPanelContainerInterface");
		return Clss;
	}

};

// 0x0 (0x28 - 0x28)
// Class FortniteUI.FortSocialSidebarPanelInterface
class UFortSocialSidebarPanelInterface : public UInterface
{
public:

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("FortSocialSidebarPanelInterface");
		return Clss;
	}

};

// 0x9A60 (0x9A90 - 0x30)
// Class FortniteUI.FortSocialStyle
class UFortSocialStyle : public UDataAsset
{
public:
	struct FSocialStyle                          Style;                                             // 0x30(0x9A50)(Edit, NativeAccessSpecifierPublic)
	class USocialStyleDataAsset*                 OverrideStyle;                                     // 0x9A80(0x8)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_27DD[0x8];                                     // Fixing Size Of Struct..

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("FortSocialStyle");
		return Clss;
	}

};

// 0x68 (0x310 - 0x2A8)
// Class FortniteUI.FortSqueegeeWidgetInjectionSlot
class UFortSqueegeeWidgetInjectionSlot : public UUserWidget
{
public:
	enum class ESqueegeeWidgetInjection          DesiredInjection;                                  // 0x2A8(0x1)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_27DE[0x7];                                     // Fixing Size After Last Property..
	struct FSqueegeeStyleParams                  StyleParams;                                       // 0x2B0(0x30)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	class UNamedSlot*                            InjectionSlot;                                     // 0x2E0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortSqueegeeWidget*                   InjectedSqueegeeWidget;                            // 0x2E8(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_27DF[0x20];                                    // Fixing Size Of Struct..

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("FortSqueegeeWidgetInjectionSlot");
		return Clss;
	}

};

// 0x20 (0x2C8 - 0x2A8)
// Class FortniteUI.FortSqueegeeWidget
class UFortSqueegeeWidget : public UUserWidget
{
public:
	uint8                                        Pad_27E0[0x20];                                    // Fixing Size Of Struct..

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("FortSqueegeeWidget");
		return Clss;
	}

};

// 0x10 (0x78 - 0x68)
// Class FortniteUI.UIKitTabGroupViewModel
class UUIKitTabGroupViewModel : public UMVVMViewModelBase
{
public:
	TArray<class UUIKitSelectableButtonViewModel*> Tabs;                                              // 0x68(0x10)(Edit, BlueprintVisible, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("UIKitTabGroupViewModel");
		return Clss;
	}

};

// 0x0 (0x78 - 0x78)
// Class FortniteUI.FortTabGroupViewModel
class UFortTabGroupViewModel : public UUIKitTabGroupViewModel
{
public:

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("FortTabGroupViewModel");
		return Clss;
	}

};

// 0x20 (0x88 - 0x68)
// Class FortniteUI.UIKitSelectableButtonViewModel
class UUIKitSelectableButtonViewModel : public UMVVMViewModelBase
{
public:
	class FText                                  Label;                                             // 0x68(0x18)(Edit, BlueprintVisible, NativeAccessSpecifierPrivate)
	class UTexture2D*                            Icon;                                              // 0x80(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("UIKitSelectableButtonViewModel");
		return Clss;
	}

};

// 0x148 (0x1D0 - 0x88)
// Class FortniteUI.FortTabViewModel
class UFortTabViewModel : public UUIKitSelectableButtonViewModel
{
public:
	bool                                         bEnabled;                                          // 0x88(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bCollapsed;                                        // 0x89(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_27E1[0x6];                                     // Fixing Size After Last Property..
	struct FFortTopBarTabButtonInfo              TabInfo;                                           // 0x90(0x140)(Transient, Protected, NativeAccessSpecifierProtected)

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("FortTabViewModel");
		return Clss;
	}

	enum class EFortUIFeature GetLinkedUIFeature();
	enum class EFFortTopBarTabButtonGroup GetButtonGroup();
	enum class EFortBangType GetBangType();
};

// 0x0 (0x28 - 0x28)
// Class FortniteUI.FortTimespanDataSource
class UFortTimespanDataSource : public UInterface
{
public:

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("FortTimespanDataSource");
		return Clss;
	}

	void RemoveOnChangeDelegate(FDelegateProperty_& InDelegate);
	struct FTimespan GetValue();
	void AddOnChangeDelegate(FDelegateProperty_& InDelegate);
};

// 0x0 (0x28 - 0x28)
// Class FortniteUI.FortUIGameFeatureAction
class UFortUIGameFeatureAction : public UGameFeatureAction
{
public:

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("FortUIGameFeatureAction");
		return Clss;
	}

};

// 0x90 (0xB8 - 0x28)
// Class FortniteUI.FortUIGameFeatureAction_SetLobbyData
class UFortUIGameFeatureAction_SetLobbyData : public UFortUIGameFeatureAction
{
public:
	struct FFrontendLobbyData                    FrontendLobbyData;                                 // 0x28(0x90)(Edit, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("FortUIGameFeatureAction_SetLobbyData");
		return Clss;
	}

};

// 0x28 (0x58 - 0x30)
// Class FortniteUI.FortUISpecialEventSubsystem
class UFortUISpecialEventSubsystem : public UGameInstanceSubsystem
{
public:
	FMulticastInlineDelegateProperty_            OnNewUISpecialEventState;                          // 0x30(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnTemporarySpecialUIEvent;                         // 0x40(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                        Pad_27E2[0x8];                                     // Fixing Size Of Struct..

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("FortUISpecialEventSubsystem");
		return Clss;
	}

	void SpecialUIEventDelegate__DelegateSignature(enum class EFortUISpecialEvents InEventName);
	void SetCurrentUISpecialEventState(enum class EFortUISpecialEvents InNewEventState);
	enum class EFortUISpecialEvents GetCurrentUIEventState();
	void CallTemporarySpecialUIEvent(enum class EFortUISpecialEvents InNewTemporaryEvent);
};

// 0xEC0 (0xEF0 - 0x30)
// Class FortniteUI.FortUIStyleDefinitionAsset
class UFortUIStyleDefinitionAsset : public UDataAsset
{
public:
	struct FFortUIStyleDefinition                StyleDefinition;                                   // 0x30(0xEC0)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("FortUIStyleDefinitionAsset");
		return Clss;
	}

};

// 0x10 (0x2B8 - 0x2A8)
// Class FortniteUI.FortUserWidget
class UFortUserWidget : public UUserWidget
{
public:
	uint8                                        Pad_27E3[0x8];                                     // Fixing Size After Last Property..
	bool                                         bConsumePointerInput;                              // 0x2B0(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_27E4[0x7];                                     // Fixing Size Of Struct..

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("FortUserWidget");
		return Clss;
	}

};

// 0x0 (0x2B8 - 0x2B8)
// Class FortniteUI.FortUserChoiceWidget
class UFortUserChoiceWidget : public UFortUserWidget
{
public:

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("FortUserChoiceWidget");
		return Clss;
	}

	void SetChoices(struct FChoiceData& ChoiceItems);
};

// 0x8 (0x318 - 0x310)
// Class FortniteUI.GamePhaseWidget
class UGamePhaseWidget : public UFortHUDElementWidget
{
public:
	uint8                                        Pad_27E8[0x8];                                     // Fixing Size Of Struct..

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("GamePhaseWidget");
		return Clss;
	}

	void OnMinigameStateChanged(class AFortMinigame* Minigame, enum class EFortMinigameState NewMinigameState);
	void OnMinigameReady(class AFortMinigame* Minigame);
	void MinigameStateChangedEvent(class AFortMinigame* Minigame, enum class EFortMinigameState NewMinigameState);
	void HandleGamePhaseStepChanged(FInterfaceProperty_& InSafeZoneInterface, enum class EAthenaGamePhaseStep GamePhaseStep);
};

// 0x0 (0x28 - 0x28)
// Class FortniteUI.HudBindingCheckInterface
class UHudBindingCheckInterface : public UInterface
{
public:

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("HudBindingCheckInterface");
		return Clss;
	}

	void ShowBindWidgets();
	bool ShouldShowPromptInHud();
	void HideBindWidgets();
	void GetBindActions(TArray<class FName>* OutActions);
};

// 0x48 (0x318 - 0x2D0)
// Class FortniteUI.HUDLayoutToolV2_WidgetPreview
class UHUDLayoutToolV2_WidgetPreview : public UCommonUserWidget
{
public:
	class UCreateHUDWidgetDragDropOperation*     CreateHUDWidgetOperation;                          // 0x2D0(0x8)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_27E9[0x10];                                    // Fixing Size After Last Property..
	float                                        DragDistanceThresholdMillimeters;                  // 0x2E8(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_27EA[0x1C];                                    // Fixing Size After Last Property..
	class UCommonTextBlock*                      TextBlock_InstancesLeftCounter;                    // 0x308(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UBorder*                               Border_Background;                                 // 0x310(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("HUDLayoutToolV2_WidgetPreview");
		return Clss;
	}

	void HandleOperationDrop(class UDragDropOperation* Operation);
};

// 0x8 (0x320 - 0x318)
// Class FortniteUI.HUDLayoutToolV2_AutorunPreview
class UHUDLayoutToolV2_AutorunPreview : public UHUDLayoutToolV2_WidgetPreview
{
public:
	class UOverlay*                              Overlay_AutorunLockZone;                           // 0x318(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("HUDLayoutToolV2_AutorunPreview");
		return Clss;
	}

};

// 0x10 (0x328 - 0x318)
// Class FortniteUI.HUDLayoutToolV2_MoveStickPreview
class UHUDLayoutToolV2_MoveStickPreview : public UHUDLayoutToolV2_WidgetPreview
{
public:
	class UOverlay*                              Overlay_ImprovedMoveStick;                         // 0x318(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UOverlay*                              Overlay_OriginalMoveStick;                         // 0x320(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("HUDLayoutToolV2_MoveStickPreview");
		return Clss;
	}

};

// 0x0 (0x1470 - 0x1470)
// Class FortniteUI.RebootRallyQRCode
class URebootRallyQRCode : public UCommonButtonBase
{
public:

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("RebootRallyQRCode");
		return Clss;
	}

	void SetIsInvite(bool bIsInvite);
};

// 0x10 (0x1480 - 0x1470)
// Class FortniteUI.SidebarListEmptyPanelButton
class USidebarListEmptyPanelButton : public UCommonButtonBase
{
public:
	class UCommonTextBlock*                      ButtonText;                                        // 0x1470(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_27EB[0x8];                                     // Fixing Size Of Struct..

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("SidebarListEmptyPanelButton");
		return Clss;
	}

};

// 0x18 (0x48 - 0x30)
// Class FortniteUI.AthenaSpatialStyleChallengeScreenData
class UAthenaSpatialStyleChallengeScreenData : public UDataAsset
{
public:
	TArray<struct FAthenaSpatialStyleCharacterData> CharacterStyleChallenges;                          // 0x30(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	class UFortChallengeBundleScheduleDefinition* CharacterStyleChallengesSchedule;                  // 0x40(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("AthenaSpatialStyleChallengeScreenData");
		return Clss;
	}

};

// 0x0 (0x28 - 0x28)
// Class FortniteUI.SpatialWidgetInterface
class USpatialWidgetInterface : public UInterface
{
public:

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("SpatialWidgetInterface");
		return Clss;
	}

};

// 0x0 (0x28 - 0x28)
// Class FortniteUI.FortSubscriptionContentInterface
class UFortSubscriptionContentInterface : public UInterface
{
public:

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("FortSubscriptionContentInterface");
		return Clss;
	}

};

// 0x0 (0xC10 - 0xC10)
// Class FortniteUI.ThresholdScrollBox
class UThresholdScrollBox : public UScrollBox
{
public:
	float                                        ScrollThreshold;                                   // 0xC08(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_27EC[0x4];                                     // Fixing Size Of Struct..

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("ThresholdScrollBox");
		return Clss;
	}

};

// 0x20 (0x80 - 0x60)
// Class FortniteUI.FortMobileHUDWidgetCustomPropertyModel_Scalar
class UFortMobileHUDWidgetCustomPropertyModel_Scalar : public UFortMobileHUDWidgetCustomPropertyModel
{
public:
	double                                       DefaultValue;                                      // 0x60(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	double                                       PropertyLowerBound;                                // 0x68(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	double                                       PropertyUpperBound;                                // 0x70(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	double                                       PropertyStepSize;                                  // 0x78(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("FortMobileHUDWidgetCustomPropertyModel_Scalar");
		return Clss;
	}

};

// 0x0 (0x80 - 0x80)
// Class FortniteUI.FortMobileHUDWidgetCustomPropertyModel_Scalar_AutorunPreference
class UFortMobileHUDWidgetCustomPropertyModel_Scalar_AutorunPreference : public UFortMobileHUDWidgetCustomPropertyModel_Scalar
{
public:

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("FortMobileHUDWidgetCustomPropertyModel_Scalar_AutorunPreference");
		return Clss;
	}

};

// 0x40 (0x438 - 0x3F8)
// Class FortniteUI.UIKitTabGroup
class UUIKitTabGroup : public UCommonActivatableWidget
{
public:
	class UCommonButtonGroupBase*                ButtonGroup_Tabs;                                  // 0x3F8(0x8)(BlueprintVisible, ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_27ED[0x28];                                    // Fixing Size After Last Property..
	TArray<class UUIKitSelectableButtonViewModel*> LocalTabsViewModels;                               // 0x428(0x10)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("UIKitTabGroup");
		return Clss;
	}

	void SetInputActions(const struct FDataTableRowHandle& NextTab, const struct FDataTableRowHandle& PreviousTab);
	void HandlePreviousTabInput();
	void HandleNextTabInput();
};

// 0x8 (0x2D8 - 0x2D0)
// Class FortniteUI.FortActiveFriendsViolator
class UFortActiveFriendsViolator : public UCommonUserWidget
{
public:
	class UCommonTextBlock*                      Text_ActivePlayerCount;                            // 0x2D0(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("FortActiveFriendsViolator");
		return Clss;
	}

};

// 0xB8 (0x4B0 - 0x3F8)
// Class FortniteUI.FortServerBrowser
class UFortServerBrowser : public UCommonActivatableWidget
{
public:
	uint8                                        Pad_27EE[0x10];                                    // Fixing Size After Last Property..
	TArray<class UFortServerBrowserActionData*>  SupportedActions;                                  // 0x408(0x10)(Edit, ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TArray<TSoftObjectPtr<class UFortServerBrowserActionData>> ExcludedSupportedActions;                          // 0x418(0x10)(ZeroConstructor, Config, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UFortServerBrowserActionData> DefaultSelectedAction;                             // 0x428(0x28)(Edit, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortServerBrowserListView*            ListView_ServerBrowser;                            // 0x450(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                   NavigateLeftInputAction;                           // 0x458(0x10)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                   NavigateRightInputAction;                          // 0x468(0x10)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                        Pad_27EF[0x10];                                    // Fixing Size After Last Property..
	class UCommonButtonLegacy*                   Button_Cancel;                                     // 0x488(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonLegacy*                   Button_Close;                                      // 0x490(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_27F0[0x18];                                    // Fixing Size Of Struct..

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("FortServerBrowser");
		return Clss;
	}

};

// 0x70 (0x520 - 0x4B0)
// Class FortniteUI.FortServerBrowserCreative
class UFortServerBrowserCreative : public UFortServerBrowser
{
public:
	TSoftObjectPtr<class UFortServerBrowserActionData> DefaultActionIfDiscoveryDisabled;                  // 0x4B0(0x28)(Edit, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_27F1[0x48];                                    // Fixing Size Of Struct..

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("FortServerBrowserCreative");
		return Clss;
	}

};

// 0x68 (0x90 - 0x28)
// Class FortniteUI.FortServerBrowserHelper
class UFortServerBrowserHelper : public UObject
{
public:
	uint8                                        Pad_27F2[0x68];                                    // Fixing Size Of Struct..

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("FortServerBrowserHelper");
		return Clss;
	}

};

// 0x148 (0x3D8 - 0x290)
// Class FortniteUI.FortServerBrowserListView
class UFortServerBrowserListView : public UListViewBase
{
public:
	uint8                                        Pad_27F3[0xE8];                                    // Fixing Size After Last Property..
	enum class EOrientation                      Orientation;                                       // 0x378(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_27F4[0x3];                                     // Fixing Size After Last Property..
	float                                        EntrySpacing;                                      // 0x37C(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_27F5[0x18];                                    // Fixing Size After Last Property..
	TSubclassOf<class UFortCreativeServerInfoTile> CreativeServerInfoTileEntryClass;                  // 0x398(0x8)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UFortServerActionTile>     ServerActionTileEntryClass;                        // 0x3A0(0x8)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UFortServerActionTile>     OwnServerActionTileEntryClass;                     // 0x3A8(0x8)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UFortPlaylistSelectionActionTile> PlaylistSelectionActionTileEntryClass;             // 0x3B0(0x8)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_27F6[0x20];                                    // Fixing Size Of Struct..

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("FortServerBrowserListView");
		return Clss;
	}

};

// 0x18 (0x4C8 - 0x4B0)
// Class FortniteUI.FortServerBrowserPlayground
class UFortServerBrowserPlayground : public UFortServerBrowser
{
public:
	uint8                                        Pad_27F7[0x18];                                    // Fixing Size Of Struct..

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("FortServerBrowserPlayground");
		return Clss;
	}

};

// 0x8 (0x2D8 - 0x2D0)
// Class FortniteUI.FortServerInfoFriendEntry
class UFortServerInfoFriendEntry : public UCommonUserWidget
{
public:
	class UCommonTextBlock*                      Text_FriendName;                                   // 0x2D0(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("FortServerInfoFriendEntry");
		return Clss;
	}

};

// 0x48 (0x1508 - 0x14C0)
// Class FortniteUI.FortServerTileBase
class UFortServerTileBase : public UCommonButtonLegacy
{
public:
	uint8                                        Pad_27F8[0x38];                                    // Fixing Size After Last Property..
	class UCommonTextBlock*                      Text_ServerWarning;                                // 0x14F8(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonLegacy*                   Button_Launch;                                     // 0x1500(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("FortServerTileBase");
		return Clss;
	}

	void OnLaunchButtonEnableChanged(bool bEnableValue);
};

// 0x8 (0x1510 - 0x1508)
// Class FortniteUI.FortServerActionTile
class UFortServerActionTile : public UFortServerTileBase
{
public:
	uint8                                        Pad_27F9[0x8];                                     // Fixing Size Of Struct..

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("FortServerActionTile");
		return Clss;
	}

};

// 0x20 (0x1530 - 0x1510)
// Class FortniteUI.FortNamedServerActionTile
class UFortNamedServerActionTile : public UFortServerActionTile
{
public:
	class UCommonTextBlock*                      Text_ActionTitle;                                  // 0x1510(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      Text_ActionDescription;                            // 0x1518(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UImage*                                Image_Background;                                  // 0x1520(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_27FA[0x8];                                     // Fixing Size Of Struct..

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("FortNamedServerActionTile");
		return Clss;
	}

	void UpdateButtonText();
	bool IsActionIslandSelectType();
};

// 0x0 (0x1530 - 0x1530)
// Class FortniteUI.FortPlaylistSelectionActionTile
class UFortPlaylistSelectionActionTile : public UFortNamedServerActionTile
{
public:

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("FortPlaylistSelectionActionTile");
		return Clss;
	}

};

// 0x20 (0x1528 - 0x1508)
// Class FortniteUI.FortServerInfoTileBase
class UFortServerInfoTileBase : public UFortServerTileBase
{
public:
	class UCommonTextBlock*                      Text_PlayerCount;                                  // 0x1508(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UDynamicEntryBox*                      EntryBox_ServerFriendList;                         // 0x1510(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      Text_OwnerName;                                    // 0x1518(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UVerticalBox*                          VerticalBox_Ownership;                             // 0x1520(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("FortServerInfoTileBase");
		return Clss;
	}

	void RequestUpdateBackgroundImage(int32 FriendListHash);
	void OnOwnerNameUpdated();
};

// 0x18 (0x1540 - 0x1528)
// Class FortniteUI.FortCreativeServerInfoTile
class UFortCreativeServerInfoTile : public UFortServerInfoTileBase
{
public:
	class UCommonTextBlock*                      Text_FriendsPlaying;                               // 0x1528(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class URichTextBlock*                        RichText_RemainingFriends;                         // 0x1530(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_27FB[0x8];                                     // Fixing Size Of Struct..

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("FortCreativeServerInfoTile");
		return Clss;
	}

};

// 0x0 (0x2A8 - 0x2A8)
// Class FortniteUI.ApolloIntroShimBase
class UApolloIntroShimBase : public UUserWidget
{
public:

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("ApolloIntroShimBase");
		return Clss;
	}

	void HandleGamePhaseChanged(enum class EAthenaGamePhase GamePhase);
};

// 0x28 (0x58 - 0x30)
// Class FortniteUI.FortAsyncAction_CheckForStwMfaReward
class UFortAsyncAction_CheckForStwMfaReward : public UBlueprintAsyncActionBase
{
public:
	FMulticastInlineDelegateProperty_            OnCompleted;                                       // 0x30(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnFailed;                                          // 0x40(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class AFortPlayerController*                 PlayerController;                                  // 0x50(0x8)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("FortAsyncAction_CheckForStwMfaReward");
		return Clss;
	}

	class UFortAsyncAction_CheckForStwMfaReward* CheckForStwMfaReward(class AFortPlayerController* PlayerController);
};

// 0x68 (0x98 - 0x30)
// Class FortniteUI.FortAsyncAction_CreateWidgetAsync
class UFortAsyncAction_CreateWidgetAsync : public UBlueprintAsyncActionBase
{
public:
	FMulticastInlineDelegateProperty_            OnComplete;                                        // 0x30(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                        Pad_27FD[0x58];                                    // Fixing Size Of Struct..

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("FortAsyncAction_CreateWidgetAsync");
		return Clss;
	}

	class UFortAsyncAction_CreateWidgetAsync* CreateWidgetAsync(class UObject* WorldContextObject, TSoftClassPtr<class UUserWidget> UserWidgetSoftClass, class APlayerController* OwningPlayer, bool bSuspendInputUntilComplete);
};

// 0x48 (0x78 - 0x30)
// Class FortniteUI.FortAsyncAction_LoadBannerAsset
class UFortAsyncAction_LoadBannerAsset : public UBlueprintAsyncActionBase
{
public:
	FMulticastInlineDelegateProperty_            BannerAssetLoadComplete;                           // 0x30(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                        Pad_27FF[0x38];                                    // Fixing Size Of Struct..

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("FortAsyncAction_LoadBannerAsset");
		return Clss;
	}

	class UFortAsyncAction_LoadBannerAsset* AsyncLoadBannerAsset(class UObject* WorldContextObject, TSoftObjectPtr<class UObject> AssetToLoad, class UMaterialInstanceDynamic* MIDRef, class FName BannerColorName);
};

// 0x28 (0x58 - 0x30)
// Class FortniteUI.FortAsyncAction_LoadCurrentSubgameProfiles
class UFortAsyncAction_LoadCurrentSubgameProfiles : public UBlueprintAsyncActionBase
{
public:
	FMulticastInlineDelegateProperty_            OnSuccess;                                         // 0x30(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnFailure;                                         // 0x40(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class AFortPlayerController*                 PlayerController;                                  // 0x50(0x8)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("FortAsyncAction_LoadCurrentSubgameProfiles");
		return Clss;
	}

	class UFortAsyncAction_LoadCurrentSubgameProfiles* LoadCurrentSubgameProfiles(class AFortPlayerController* PlayerController);
};

// 0x190 (0x1C0 - 0x30)
// Class FortniteUI.FortAsyncAction_ShowConfirmation_NUI
class UFortAsyncAction_ShowConfirmation_NUI : public UBlueprintAsyncActionBase
{
public:
	FMulticastInlineDelegateProperty_            DialogResult;                                      // 0x30(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UObject*                               WorldContextObject;                                // 0x40(0x8)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortLocalPlayer*                      TargetLocalPlayer;                                 // 0x48(0x8)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FFortDialogDescription_NUI            Description;                                       // 0x50(0x160)(ContainsInstancedReference, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2808[0x10];                                    // Fixing Size Of Struct..

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("FortAsyncAction_ShowConfirmation_NUI");
		return Clss;
	}

	class UFortAsyncAction_ShowConfirmation_NUI* ShowSimpleConfirmationDialog_NUI(class UObject* InWorldContextObject, const struct FSlateBrush& Icon, class FText Title, class FText Message, bool bShowConfirm, bool bShowDecline, class UWidget* AdditionalContent, class UWidget* LeftAdditionalContent, class ULocalPlayer* TargetPlayer);
	class UFortAsyncAction_ShowConfirmation_NUI* ShowSimpleConfirmationDialog_CustomInput(class UObject* InWorldContextObject, const struct FSlateBrush& Icon, class FText Title, class FText Message, class FName ConfirmAction, class FName DeclineAction, class UWidget* AdditionalContent, class UWidget* LeftAdditionalContent, bool Cancelable, class ULocalPlayer* TargetPlayer);
	class UFortAsyncAction_ShowConfirmation_NUI* ShowConfirmationDialog_NUI(class UObject* InWorldContextObject, const struct FSlateBrush& Icon, class FText Title, class FText Message, TArray<struct FConfirmationDialogAction>& ConfirmButtonInputActions, class FName& DeclineButtonInputAction, class UWidget* AdditionalContent, class UWidget* LeftAdditionalContent, class ULocalPlayer* TargetPlayer);
};

// 0x48 (0x78 - 0x30)
// Class FortniteUI.FortAsyncAction_PushPrimaryContent
class UFortAsyncAction_PushPrimaryContent : public UBlueprintAsyncActionBase
{
public:
	FMulticastInlineDelegateProperty_            OnPrimaryContentPushed;                            // 0x30(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                        Pad_2809[0x38];                                    // Fixing Size Of Struct..

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("FortAsyncAction_PushPrimaryContent");
		return Clss;
	}

	class UFortAsyncAction_PushPrimaryContent* PushPrimaryContentSoftClassAsyncForPlayer(class APlayerController* ContextPC, TSoftClassPtr<class UCommonActivatableWidget> SoftWidgetClass);
	class UFortAsyncAction_PushPrimaryContent* PushPrimaryContentSoftClassAsync(class UUserWidget* ContextWidget, TSoftClassPtr<class UCommonActivatableWidget> SoftWidgetClass);
	class UFortAsyncAction_PushPrimaryContent* PushPrimaryContentClassAsyncForPlayer(class APlayerController* ContextPC, TSubclassOf<class UCommonActivatableWidget> WidgetClass);
	class UFortAsyncAction_PushPrimaryContent* PushPrimaryContentClassAsync(class UUserWidget* ContextWidget, TSubclassOf<class UCommonActivatableWidget> WidgetClass);
	void OnPrimaryContentPushed__DelegateSignature(class UCommonActivatableWidget* ActivatableWidget);
};

// 0x50 (0x80 - 0x30)
// Class FortniteUI.FortAsyncAction_QueueModalWidget
class UFortAsyncAction_QueueModalWidget : public UBlueprintAsyncActionBase
{
public:
	FMulticastInlineDelegateProperty_            OnModalWidgetQueued;                               // 0x30(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                        Pad_280A[0x40];                                    // Fixing Size Of Struct..

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("FortAsyncAction_QueueModalWidget");
		return Clss;
	}

	class UFortAsyncAction_QueueModalWidget* QueueModalWidgetSoftClassAsyncForPlayer(class APlayerController* PlayerController, TSoftClassPtr<class UCommonActivatableWidget> SoftWidgetClass);
	class UFortAsyncAction_QueueModalWidget* QueueModalWidgetSoftClassAsyncForLocalPlayer(class ULocalPlayer* LocalPlayer, TSoftClassPtr<class UCommonActivatableWidget> SoftWidgetClass);
	class UFortAsyncAction_QueueModalWidget* QueueModalWidgetSoftClassAsync(class UUserWidget* ContextWidget, TSoftClassPtr<class UCommonActivatableWidget> SoftWidgetClass);
	class UFortAsyncAction_QueueModalWidget* QueueModalWidgetClassAsyncForPlayer(class APlayerController* PlayerController, TSubclassOf<class UCommonActivatableWidget> WidgetClass);
	class UFortAsyncAction_QueueModalWidget* QueueModalWidgetClassAsyncForLocalPlayer(class ULocalPlayer* LocalPlayer, TSubclassOf<class UCommonActivatableWidget> WidgetClass);
	class UFortAsyncAction_QueueModalWidget* QueueModalWidgetClassAsync(class UUserWidget* ContextWidget, TSubclassOf<class UCommonActivatableWidget> WidgetClass);
	void OnModalWidgetQueued__DelegateSignature(class UCommonActivatableWidget* ActivatableWidget);
};

// 0x20 (0x2F0 - 0x2D0)
// Class FortniteUI.AthenaFPSBase
class UAthenaFPSBase : public UCommonUserWidget
{
public:
	class UCommonTextBlock*                      FPS;                                               // 0x2D0(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_280B[0x18];                                    // Fixing Size Of Struct..

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("AthenaFPSBase");
		return Clss;
	}

	void HandleShowFPSChanged(bool bInShowFPS);
};

// 0x10 (0x188 - 0x178)
// Class FortniteUI.AthenaMinimap
class UAthenaMinimap : public UWidget
{
public:
	struct FVector2D                             DesiredSize;                                       // 0x178(0x10)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("AthenaMinimap");
		return Clss;
	}

};

// 0x0 (0x310 - 0x310)
// Class FortniteUI.AthenaRecordingBase
class UAthenaRecordingBase : public UFortHUDElementWidget
{
public:

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("AthenaRecordingBase");
		return Clss;
	}

};

// 0x10 (0x2E0 - 0x2D0)
// Class FortniteUI.AthenaTemperatureBase
class UAthenaTemperatureBase : public UCommonUserWidget
{
public:
	class UTextBlock*                            Temperature;                                       // 0x2D0(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_280C[0x8];                                     // Fixing Size Of Struct..

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("AthenaTemperatureBase");
		return Clss;
	}

	void StopTimer();
	void StartTimer();
};

// 0x20 (0x558 - 0x538)
// Class FortniteUI.AthenaLoadingScreenPreviewPanelBase
class UAthenaLoadingScreenPreviewPanelBase : public UAthenaLoadingScreenPreviewPanel
{
public:
	class UNativeWidgetHost*                     LoadingScreenSlot;                                 // 0x538(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_280D[0x8];                                     // Fixing Size After Last Property..
	class UCommonButtonBase*                     Button_Close;                                      // 0x548(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                     Button_CloseTouch;                                 // 0x550(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("AthenaLoadingScreenPreviewPanelBase");
		return Clss;
	}

};

// 0x8 (0x560 - 0x558)
// Class FortniteUI.ApolloIntroLoadingPanel
class UApolloIntroLoadingPanel : public UAthenaLoadingScreenPreviewPanelBase
{
public:
	class UFortPlaylistAthena*                   ApolloIntroPlaylist;                               // 0x558(0x8)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("ApolloIntroLoadingPanel");
		return Clss;
	}

};

// 0x18 (0x328 - 0x310)
// Class FortniteUI.AthenaAIKillsBase
class UAthenaAIKillsBase : public UFortHUDElementWidget
{
public:
	class UTextBlock*                            KillsText;                                         // 0x310(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UObject*                               KillsSource;                                       // 0x318(0x8)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bCustomKillSource;                                 // 0x320(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_280E[0x7];                                     // Fixing Size Of Struct..

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("AthenaAIKillsBase");
		return Clss;
	}

	void SetKillsSourcePlayerState(class AFortPlayerStateAthena* InPlayerState);
	void SetKillsSourcePlayerController(class AFortPlayerControllerAthena* InPlayerController);
};

// 0x20 (0x330 - 0x310)
// Class FortniteUI.AthenaAvailableSquadSlotsListBase
class UAthenaAvailableSquadSlotsListBase : public UFortHUDElementWidget
{
public:
	int32                                        MaxNumberOfAvailableSquadSlots;                    // 0x310(0x4)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bAlwaysDisplayTopEntryAsDetailed;                  // 0x314(0x1)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2811[0xB];                                     // Fixing Size After Last Property..
	class UDynamicEntryBox*                      EntryBox_AvailableSlotsList;                       // 0x320(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaPlayerViewModel*                CachedPlayerVM;                                    // 0x328(0x8)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("AthenaAvailableSquadSlotsListBase");
		return Clss;
	}

	void UpdateSquadFromMinigameOptionChange();
	void UpdateIsTeamMiniGameOnMinigameVolumeChanged(class AFortVolume* Volume);
	void UpdateIsTeamMiniGameOnGameStateChanged(class AFortMinigame* Minigame, enum class EFortMinigameState MinigameState);
	void HandleSquadMemberDisconnected(class AFortPlayerStateAthena* Player);
	void HandlePlayerUniqueIdReplicated(struct FUniqueNetIdRepl& UniqueId);
	void HandlePlayerExitVolume(class APlayerState* ClientPlayerState, class AFortVolume* Volume);
	void HandlePlayerEnterVolume(class APlayerState* ClientPlayerState, class AFortVolume* Volume);
	void HandleGameMemberChanged(uint8 InSquadId, uint8 InTeamIndex, class AFortPlayerStateAthena* ChangedPS);
};

// 0x8 (0x318 - 0x310)
// Class FortniteUI.AthenaAvailableSquadSlotsListEntryBase
class UAthenaAvailableSquadSlotsListEntryBase : public UFortHUDElementWidget
{
public:
	enum class EAvailableSquadSlotsListEntryState CurrentEntryState;                                 // 0x310(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_2812[0x7];                                     // Fixing Size Of Struct..

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("AthenaAvailableSquadSlotsListEntryBase");
		return Clss;
	}

	void BP_OnEntryStateUpdated(enum class EAvailableSquadSlotsListEntryState NewEntryState);
};

// 0xB0 (0x5E0 - 0x530)
// Class FortniteUI.AthenaCareerScreen
class UAthenaCareerScreen : public UCommonActivatablePanelLegacy
{
public:
	TSoftClassPtr<class UAthenaLeaderboardScreenBase> LeaderboardsScreenClass;                           // 0x530(0x28)(Edit, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftClassPtr<class UAthenaReplayBrowserScreenBase> ReplayBrowserScreenClass;                          // 0x558(0x28)(Edit, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                   BackToSocialTabInputActionRowHandle;               // 0x580(0x10)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	class UCommonTextBlock*                      Text_AccountLevel;                                 // 0x590(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                     Button_Leaderboards;                               // 0x598(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                     Button_Replays;                                    // 0x5A0(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaFeatTimelineListView*           ListView_FeatTimeline;                             // 0x5A8(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      Text_ChapterContext;                               // 0x5B0(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UBacchusCloseButton*                   Mobile_CloseButton;                                // 0x5B8(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      Text_MobileTabLabel;                               // 0x5C0(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UImage*                                Image_LeftFill;                                    // 0x5C8(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UImage*                                Image_RightFill;                                   // 0x5D0(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UImage*                                Image_Gradient;                                    // 0x5D8(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("AthenaCareerScreen");
		return Clss;
	}

	void ShowFeats(bool bHasCompletedFeats);
};

// 0x8 (0x2B0 - 0x2A8)
// Class FortniteUI.AthenaChallengeEntry
class UAthenaChallengeEntry : public UUserWidget
{
public:
	class UCommonRichTextBlock*                  Text_CurrentTask;                                  // 0x2A8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("AthenaChallengeEntry");
		return Clss;
	}

};

// 0xA8 (0x3B8 - 0x310)
// Class FortniteUI.AthenaChallengesWidget
class UAthenaChallengesWidget : public UFortHUDElementWidget
{
public:
	uint8                                        Pad_2814[0x40];                                    // Fixing Size After Last Property..
	class UCommonTextBlock*                      Text_Challenges;                                   // 0x350(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDynamicEntryBox*                      DynamicEntryBox_ChallengeEntries;                  // 0x358(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_2815[0x50];                                    // Fixing Size After Last Property..
	struct FFortPrioritizedWidgetData            PrioritizedWidgetData;                             // 0x3B0(0x2)(Edit, BlueprintVisible, NoDestructor, Protected, NativeAccessSpecifierProtected)
	bool                                         bXPSystemRequiredForChallenges;                    // 0x3B2(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_2816[0x5];                                     // Fixing Size Of Struct..

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("AthenaChallengesWidget");
		return Clss;
	}

	bool IsXPSystemRequiredForChallenges();
	void HandleDisplayDynamicQuestUpdate(class UFortQuestObjectiveInfo* QuestObjective, bool DisplayStatusUpdate, bool DisplayAnnouncementUpdate);
	void BP_WidgetIsFinished();
	void BP_OnWidgetActivated();
};

// 0x150 (0x548 - 0x3F8)
// Class FortniteUI.AthenaCollectionScreenContainer
class UAthenaCollectionScreenContainer : public UCommonActivatableWidget
{
public:
	uint8                                        Pad_2817[0x20];                                    // Fixing Size After Last Property..
	struct FAthenaMapScreenContainerTabInfo      MapTabInfo;                                        // 0x418(0x50)(Edit, NativeAccessSpecifierPublic)
	class UCommonVisibilitySwitcher*             VisibilitySwitcher_Content;                        // 0x468(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FAthenaCollectionScreenContainerTabInfo> TabInfos;                                          // 0x470(0x10)(Edit, ZeroConstructor, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                   NextTabInputAction;                                // 0x480(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                   PreviousTabInputAction;                            // 0x490(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPrivate)
	class UDynamicEntryBox*                      EntryBox_TabButtons;                               // 0x4A0(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      Text_TabTitle;                                     // 0x4A8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<struct FAthenaCollectionScreenContainerTabInfo> ActiveTabInfos;                                    // 0x4B0(0x10)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2818[0x88];                                    // Fixing Size Of Struct..

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("AthenaCollectionScreenContainer");
		return Clss;
	}

	void EnableTabActions();
	void DisableTabActions();
	void BP_OnShowTabsSet(bool bShowTabs);
};

// 0x60 (0x1520 - 0x14C0)
// Class FortniteUI.AthenaCollectionScreenContainerTabButton
class UAthenaCollectionScreenContainerTabButton : public UCommonButtonLegacy
{
public:
	class UCommonLazyImage*                      LazyImage_Icon;                                    // 0x14C0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                CollectionType;                                    // 0x14C8(0x10)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FVector2D                             ImageSize_Mobile;                                  // 0x14D8(0x10)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FText                                  TabTitle;                                          // 0x14E8(0x18)(NativeAccessSpecifierPrivate)
	struct FGameplayTagContainer                 CategoryTags;                                      // 0x1500(0x20)(NativeAccessSpecifierPrivate)

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("AthenaCollectionScreenContainerTabButton");
		return Clss;
	}

	void SetIcon(TSoftObjectPtr<class UObject> LazyObject);
	void BP_ShowBang(bool bShow);
};

// 0x48 (0x358 - 0x310)
// Class FortniteUI.AthenaCommonPrioritizedWidget
class UAthenaCommonPrioritizedWidget : public UFortHUDElementWidget
{
public:
	uint8                                        Pad_2819[0x40];                                    // Fixing Size After Last Property..
	bool                                         bAutoManagePriorityByVisibility;                   // 0x350(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FFortPrioritizedWidgetData            PrioritizationData;                                // 0x351(0x2)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_281A[0x5];                                     // Fixing Size Of Struct..

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("AthenaCommonPrioritizedWidget");
		return Clss;
	}

	void OnStompFailed();
	void OnStompedByOtherWidget();
	void K2_OnBecomeInactive();
	void K2_OnBecomeActive();
};

// 0x610 (0x920 - 0x310)
// Class FortniteUI.AthenaCompassBase
class UAthenaCompassBase : public UFortHUDElementWidget
{
public:
	class UMaterialInstanceDynamic*              CompassMaterial;                                   // 0x310(0x8)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UImage*                                Image_Compass;                                     // 0x318(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FSlateBrush                           MarkerBrush;                                       // 0x320(0xC0)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FSlateBrush                           HeadingIndicatorBrush;                             // 0x3E0(0xC0)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FSlateBrush                           StormIndicatorBrush;                               // 0x4A0(0xC0)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	float                                        MarkerVerticalOffset;                              // 0x560(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        DistanceTextVerticalOffset;                        // 0x564(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        DistanceTextHorizontalOffset;                      // 0x568(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_281B[0x4];                                     // Fixing Size After Last Property..
	struct FSlateFontInfo                        HeadingFont;                                       // 0x570(0x58)(Edit, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FSlateFontInfo                        DistanceTextFont;                                  // 0x5C8(0x58)(Edit, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FSlateBrush                           TeammateGunshotIndicatorBrush;                     // 0x620(0xC0)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FSlateBrush                           EnemyGunshotIndicatorBrush;                        // 0x6E0(0xC0)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	float                                        TimeToShowGunshotIndicators;                       // 0x7A0(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_281C[0x4];                                     // Fixing Size After Last Property..
	class UCurveFloat*                           GunshotIndicatorScaleOverTime;                     // 0x7A8(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCurveFloat*                           GunshotIndicatorScaleByStrength;                   // 0x7B0(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCurveFloat*                           GunshotIndicatorAlphaOverTime;                     // 0x7B8(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCurveFloat*                           GunshotIndicatorAlphaByHeading;                    // 0x7C0(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_281D[0x8];                                     // Fixing Size After Last Property..
	struct FSlateBrush                           DefaultPinnedQuestIconBrush;                       // 0x7D0(0xC0)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	float                                        PinnedQuestAlphaRotCutoff;                         // 0x890(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        PinnedQuestDistanceRotCutoff;                      // 0x894(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        PinnedQuestIconVerticalOffset;                     // 0x898(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        PinnedQuestDistanceTextVerticalOffset;             // 0x89C(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FSlateFontInfo                        PinnedQuestDistanceTextFont;                       // 0x8A0(0x58)(Edit, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_281E[0x28];                                    // Fixing Size Of Struct..

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("AthenaCompassBase");
		return Clss;
	}

};

// 0x80 (0x478 - 0x3F8)
// Class FortniteUI.AthenaConfirmationWindow
class UAthenaConfirmationWindow : public UCommonActivatableWidget
{
public:
	class UCommonTextBlock*                      Text_Title;                                        // 0x3F8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      Text_PostConfirmation;                             // 0x400(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonRichTextBlock*                  RichText_Description;                              // 0x408(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortLazyImage*                        Image_MainIcon;                                    // 0x410(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UDynamicEntryBox*                      EntryBox_Buttons;                                  // 0x418(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UBacchusCloseButton*                   Button_Close;                                      // 0x420(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonBorder*                         Border_TapToCloseZone;                             // 0x428(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UWidgetAnimation*                      BoundAnim_PostConfirm;                             // 0x430(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                   CancelAction;                                      // 0x438(0x10)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPrivate)
	TSubclassOf<class UCommonButtonBase>         ConfirmButtonClass;                                // 0x448(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UCommonButtonBase>         DeclineButtonClass;                                // 0x450(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UCommonButtonBase>         CancelButtonClass;                                 // 0x458(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_281F[0x18];                                    // Fixing Size Of Struct..

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("AthenaConfirmationWindow");
		return Clss;
	}

	void OnShowConfirmationContent();
	void OnSetButtonText(class UCommonButtonBase* Button, class FText& Text);
	struct FEventReply HandleTapToCloseZoneMouseButtonDown(const struct FGeometry& MyGeometry, struct FPointerEvent& MouseEvent);
};

// 0xA8 (0x3B8 - 0x310)
// Class FortniteUI.FortActorIndicatorWidget
class UFortActorIndicatorWidget : public UFortHUDElementWidget
{
public:
	uint8                                        Pad_2821[0x8];                                     // Fixing Size After Last Property..
	class AActor*                                IndicatedActor;                                    // 0x318(0x8)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UPrimitiveComponent*                   IndicatedActorComponent;                           // 0x320(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                               RelativeLocation;                                  // 0x328(0x18)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        MaxDistance;                                       // 0x340(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bClampOnScreen;                                    // 0x344(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bShowClampToScreenArrow;                           // 0x345(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_2822[0x2];                                     // Fixing Size After Last Property..
	struct FElevationArrowData                   ElevationArrowData;                                // 0x348(0x1C)(Edit, BlueprintVisible, NoDestructor, Protected, NativeAccessSpecifierProtected)
	bool                                         bUseScreenSpacePosition;                           // 0x364(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_2823[0x3];                                     // Fixing Size After Last Property..
	struct FVector2D                             ScreenSpaceRelativeOffset;                         // 0x368(0x10)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        ScreenPriority;                                    // 0x378(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_2824[0x3C];                                    // Fixing Size Of Struct..

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("FortActorIndicatorWidget");
		return Clss;
	}

	void SetIndicatedActor(class AActor* NewIndicatorActor);
	void OnTargetActorChanged(class AActor* TargetedActor);
	bool IsIndicatingActor(class AActor* OtherActor);
	void Init(class AActor* TargetedActor);
	void Deinit();
};

// 0x290 (0x648 - 0x3B8)
// Class FortniteUI.AthenaMarkedActorIndicator
class UAthenaMarkedActorIndicator : public UFortActorIndicatorWidget
{
public:
	uint8                                        Pad_2825[0x28];                                    // Fixing Size After Last Property..
	struct FFortWorldMarkerData                  MarkerData;                                        // 0x3E0(0x180)(BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	struct FMarkedActorDisplayInfo               MarkerDisplay;                                     // 0x560(0xB8)(BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	class UFortMarkerDetailsTable*               DetailsTable;                                      // 0x618(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        FreshLargeItemShowTime;                            // 0x620(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        IndicatorDotSizeThreshold;                         // 0x624(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UWidgetSwitcher*                       Switcher_IndicatorSize;                            // 0x628(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPanelWidget*                          Panel_SmallIndicator;                              // 0x630(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPanelWidget*                          Panel_LargeIndicator;                              // 0x638(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      Text_Distance;                                     // 0x640(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("AthenaMarkedActorIndicator");
		return Clss;
	}

	void OnSetMarkerData(struct FFortWorldMarkerData& FortWorldMarkerData);
};

// 0x40 (0x688 - 0x648)
// Class FortniteUI.AthenaContextTutorialIndicator
class UAthenaContextTutorialIndicator : public UAthenaMarkedActorIndicator
{
public:
	float                                        OffscreenMaxTreshold;                              // 0x648(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_2826[0x4];                                     // Fixing Size After Last Property..
	class UOverlay*                              Overlay_Icon_1;                                    // 0x650(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2827[0x4];                                     // Fixing Size After Last Property..
	float                                        ScreenEdgePaddingSizePercent;                      // 0x65C(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2828[0x28];                                    // Fixing Size Of Struct..

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("AthenaContextTutorialIndicator");
		return Clss;
	}

	void SwitchIndicatorSize();
	void SetScreenPercent(float Percent);
	void SetIndicatorText(class FText& Text);
	void PlayOutAnimation();
	void PlayInAnimation();
	void PlayBounceAnimation();
	float GetMinTreshold();
	float GetMaxTreshold();
	float GetMaxOffscreenTreshold();
	float GetCurrentDotProduct();
};

// 0x0 (0x3B8 - 0x3B8)
// Class FortniteUI.AthenaContextualChallengesWidget
class UAthenaContextualChallengesWidget : public UAthenaChallengesWidget
{
public:

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("AthenaContextualChallengesWidget");
		return Clss;
	}

	bool ShouldOutroAutomatically();
	void OnResetOutroDelay();
	void OnNewContextualHeader(class FText& NewText);
	void HandleToggleFullscreenMap(bool bFullscreenMapVisible);
	void HandleNewContextualObjectives(TArray<class UFortQuestItem*>& InContextualQuests);
	float GetOutroDelay();
};

// 0x58 (0x328 - 0x2D0)
// Class FortniteUI.AthenaCosmeticUnlockingInfo
class UAthenaCosmeticUnlockingInfo : public UCommonUserWidget
{
public:
	class UCommonRichTextBlock*                  RichText_StaticUnlockingText;                      // 0x2D0(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonRichTextBlock*                  RichText_UnlockingText;                            // 0x2D8(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UProgressBar*                          ProgressBar_StepsCompleted;                        // 0x2E0(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonRichTextBlock*                  RichText_ProgressCompletion;                       // 0x2E8(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FString                                EmphasisStyle;                                     // 0x2F0(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FString                                ProgressCompletionNumericStyle;                    // 0x300(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaCosmeticItemDefinition*         CosmeticItemDef;                                   // 0x310(0x8)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2829[0x10];                                    // Fixing Size Of Struct..

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("AthenaCosmeticUnlockingInfo");
		return Clss;
	}

	void ShowUnlockingInfoForCosmeticVariant(class UAthenaCosmeticItemDefinition* InCosmeticItemDef, struct FGameplayTag& InVariantChannel, struct FGameplayTag& InVariant);
	void ShowUnlockingInfoForCosmetic(class UAthenaCosmeticItemDefinition* InCosmeticItemDef);
	void ShowUnlockingInfo(class UAthenaCosmeticItemDefinition* UnlockItem, class UFortItemDefinition* UnlockSource);
	void ShowSeasonUnlockingInfo(int32 SeasonNumber, int32 TierNumber);
	void RequestUpdateAnim();
	void RequestOutroAnim();
	void RequestIntroAnim();
	void OutroAnimFinished();
	void OnUnlockingInfoSet(bool bShowProgression);
	void HideUnlockingInfo();
};

// 0x48 (0x358 - 0x310)
// Class FortniteUI.AthenaCountdownWidgetBase
class UAthenaCountdownWidgetBase : public UFortHUDElementWidget
{
public:
	uint8                                        Pad_282D[0x40];                                    // Fixing Size After Last Property..
	struct FFortPrioritizedWidgetData            PrioritizationData;                                // 0x350(0x2)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_282E[0x6];                                     // Fixing Size Of Struct..

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("AthenaCountdownWidgetBase");
		return Clss;
	}

	void OnDisplayWarningMessage(class FText& FirstLineText, class FText& SecondLineText);
	void OnCountdownUpdate(int32 TimeRemaining, class FText& CountdownUpdateText);
	void OnCountdownStopped();
	void OnCountdownStarted(int32 TimeRemaining, class FText& CountdownIntroText);
	void OnCountdownFinished();
	void HandleGamePhaseStepChanged(FInterfaceProperty_& SafeZoneInterface, enum class EAthenaGamePhaseStep GamePhaseStep);
	void HandleCountdownUpdate(int32 TimeRemaining);
	void HandleCountdownStopped();
	void HandleCountdownStarted(int32 TimeRemaining);
	void HandleCountdownFinished();
};

// 0x48 (0x358 - 0x310)
// Class FortniteUI.AthenaCurieStatusWidget
class UAthenaCurieStatusWidget : public UFortHUDElementWidget
{
public:
	uint8                                        Pad_2830[0x48];                                    // Fixing Size Of Struct..

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("AthenaCurieStatusWidget");
		return Clss;
	}

	void SetPlayerState(class AFortPlayerStateAthena* PlayerState);
	void OnPlayerStatePawnChanged();
	void OnHandleSpectatingChanged(class AFortPlayerStateZone* NewSpectatingTarget);
	void OnCurieStateRemoved(struct FGameplayTag& RemovedState);
	void OnCurieStateDetachedFromSpectator(class UObject* InOwner, const struct FCurieContainerHandle& ContainerHandle, struct FGameplayTag& ElementIdentifier);
	void OnCurieStateAttachedToSpectator(class UObject* InOwner, const struct FCurieContainerHandle& ContainerHandle, struct FGameplayTag& ElementIdentifier);
	void OnCurieStateAdded(struct FGameplayTag& AddedState);
	bool HasState(const struct FGameplayTag& CurieState);
};

// 0x140 (0x410 - 0x2D0)
// Class FortniteUI.FortItemPickerBase
class UFortItemPickerBase : public UCommonUserWidget
{
public:
	FMulticastInlineDelegateProperty_            OnSelectionChangedEvent;                           // 0x2D0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                        Pad_2834[0x18];                                    // Fixing Size After Last Property..
	FMulticastInlineDelegateProperty_            OnSelectionCommittedEvent;                         // 0x2F8(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                        Pad_2835[0x48];                                    // Fixing Size After Last Property..
	FMulticastInlineDelegateProperty_            OnItemHoveredEvent;                                // 0x350(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                        Pad_2836[0x18];                                    // Fixing Size After Last Property..
	FMulticastInlineDelegateProperty_            OnItemUnhovered;                                   // 0x378(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                        Pad_2837[0x18];                                    // Fixing Size After Last Property..
	class UFortItemTileView*                     PickerTileView;                                    // 0x3A0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UListView*                             ItemListViewWidget;                                // 0x3A8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_2838[0x10];                                    // Fixing Size After Last Property..
	bool                                         bConfirmSelectionIfAlreadySelectedAfterOneClick;   // 0x3C0(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_2839[0x7];                                     // Fixing Size After Last Property..
	class UObject*                               CurrentSelectedItem;                               // 0x3C8(0x8)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	FInterfaceProperty_                          ItemViewContext;                                   // 0x3D0(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_283A[0x30];                                    // Fixing Size Of Struct..

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("FortItemPickerBase");
		return Clss;
	}

	bool TryCommitSelectedItem();
	void SetSelectedItem(class UFortItem* ItemToSelect);
	bool SetSelectedIndex(int32 Index);
	void OnItemSelectionScriptDelegate__DelegateSignature(class UFortItem* SelectedItem);
	bool IsNullItemExplicitlySelected();
	class UFortItem* GetSelectedItem();
	FInterfaceProperty_ GetListViewInterface();
	int32 GetIndexForItem(class UFortItem* Item);
	void ClearSelection();
	void CenterSelectedItemTileWidget();
	bool CanItemBeComitted(class UFortItem* ItemToCommit);
};

// 0x168 (0x578 - 0x410)
// Class FortniteUI.AthenaCustomizationPicker
class UAthenaCustomizationPicker : public UFortItemPickerBase
{
public:
	FMulticastInlineDelegateProperty_            OnCosmeticSelectionSaving;                         // 0x410(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnCosmeticSelectionSaved;                          // 0x420(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMap<enum class EInventoryContentSortType, class FText> SortLabels;                                        // 0x430(0x50)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TArray<struct FFortAthenaItemManagementInventoryFilterTabLabelInfo> FilterTabLabelInfoArray;                           // 0x480(0x10)(Edit, EditFixedSize, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                     Button_JumpToTop;                                  // 0x490(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                     Button_TextSearch;                                 // 0x498(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                     Button_SortAndFilter;                              // 0x4A0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                  CurrentFilterName;                                 // 0x4A8(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_283E[0x26];                                    // Fixing Size After Last Property..
	bool                                         bArchiveFiltering;                                 // 0x4D2(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_283F[0x5];                                     // Fixing Size After Last Property..
	class UCommonTextBlock*                      Text_SortTag;                                      // 0x4D8(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      Text_FilterTag;                                    // 0x4E0(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      Text_NumArchived;                                  // 0x4E8(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UWidget*                               Widget_ArchivedTag;                                // 0x4F0(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	enum class EAthenaCustomizationCategory      CustomizeCategory;                                 // 0x4F8(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2840[0x3];                                     // Fixing Size After Last Property..
	int32                                        SubslotIndex;                                      // 0x4FC(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        ItemOffsetForJumpToTopButton;                      // 0x500(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2841[0x4];                                     // Fixing Size After Last Property..
	class UAthenaCustomizationPickerSortAndFilterBlade* Blade_SortAndFilter;                               // 0x508(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UUserWidget*                           Tooltip_ArchiveFilter;                             // 0x510(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bAllowUnownedItems;                                // 0x518(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bAllowCommits;                                     // 0x519(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bOneItemPerSlot;                                   // 0x51A(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2842[0x15];                                    // Fixing Size After Last Property..
	TArray<class UObject*>                       InitialPickerItems;                                // 0x530(0x10)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	class UFortItem*                             ItemListeningTo;                                   // 0x540(0x8)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaCosmeticAccountItem*            LocalCampaignHeroItem;                             // 0x548(0x8)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2843[0x28];                                    // Fixing Size Of Struct..

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("AthenaCustomizationPicker");
		return Clss;
	}

	void SetFilter(class FName FilterName);
	void SearchText(class FText& Text);
	void OnUpdateArchiveFilterTooltipText(class FText& Text);
	void OnShowArchiveFilterTooltip(bool bShowTooltip);
	void OnSearchEnabled(bool bEnabled);
	void OnNoItemsAvailableInFilter(class FText& EmptyDisplayText);
	void OnItemsAvailableInFilter();
	void OnCosmeticChangeSaveEvent__DelegateSignature();
	bool HasSelectableTile();
	void HandleSelectedItemHasChanged(bool ItemChanged, bool AmmoChanged, bool IngredientsChanged);
	void HandleButtonTextSearchClicked();
	void HandleArchiveFilterTooltipDismissed();
	class FText GetQualifiedFilterDisplayName(enum class EAthenaFilterDisplayType InTopFilterDisplaySetting);
	void EndCustomizationCategory();
	void BP_OnUpdateNumArchivedItems(int32 InNumArchivedItems);
	void BeginCustomizationCategory(enum class EAthenaCustomizationCategory Category, int32 SubslotToEdit, bool bInAllowUnownedItems, bool bInOneItemPerSlot);
};

// 0x158 (0x428 - 0x2D0)
// Class FortniteUI.AthenaCustomizationPickerSortAndFilterBlade
class UAthenaCustomizationPickerSortAndFilterBlade : public UCommonUserWidget
{
public:
	class UWidget*                               Widget_Sorts;                                      // 0x2D0(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UWidget*                               Widget_Filters;                                    // 0x2D8(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortDynamicEntryBox*                  DynamicEntryBox_SortButtons;                       // 0x2E0(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortDynamicEntryBox*                  DynamicEntryBox_FilterButtons;                     // 0x2E8(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonGroupBase*                ButtonGroup_Sorts;                                 // 0x2F0(0x8)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonGroupBase*                ButtonGroup_Filters;                               // 0x2F8(0x8)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2847[0x128];                                   // Fixing Size Of Struct..

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("AthenaCustomizationPickerSortAndFilterBlade");
		return Clss;
	}

	bool IsBladeOpen();
	void HandleCloseAnimationFinished();
	class UCommonButtonBase* GetSortButtonAtIndex(int32 DesiredIndex);
	int32 GetNumSorts();
	int32 GetNumFilters();
	class UCommonButtonBase* GetFilterButtonAtIndex(int32 DesiredIndex);
	TArray<class UUserWidget*> GetAllSortAndFilterButtons();
	void CloseBlade();
	void BP_SetSortOrFilterButtonDisplayName(class UCommonButtonBase* SortOrFilterButton, class FText& DisplayName);
	void BP_OnSortOrFilterButtonCreated(class UCommonButtonBase* NewButton);
	void BP_OnBladeOpen();
	void BP_OnBladeClose();
	void BP_OnArchiveFilteringSet(bool bEnabled);
	void BP_HighlightSortOrFilterButton(class UCommonButtonBase* SortOrFilterButton, bool bHighlight);
};

// 0x20 (0x14E0 - 0x14C0)
// Class FortniteUI.FortCosmeticItemTileButton
class UFortCosmeticItemTileButton : public UCommonButtonLegacy
{
public:
	uint8                                        Pad_2848[0x8];                                     // Fixing Size After Last Property..
	class UFortCosmeticItemCard*                 ItemWidget;                                        // 0x14C8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class UFortItem>              Item;                                              // 0x14D0(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        ItemCardWidth;                                     // 0x14D8(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        MobileScalingFactor;                               // 0x14DC(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("FortCosmeticItemTileButton");
		return Clss;
	}

};

// 0x20 (0x1500 - 0x14E0)
// Class FortniteUI.AthenaCustomizationPickerTileButton
class UAthenaCustomizationPickerTileButton : public UFortCosmeticItemTileButton
{
public:
	uint8                                        Pad_2849[0x8];                                     // Fixing Size After Last Property..
	class UFortBangWrapper_NUI*                  Bang;                                              // 0x14E8(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UImage*                                Image_Favorite;                                    // 0x14F0(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UImage*                                Image_ClassIcon;                                   // 0x14F8(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("AthenaCustomizationPickerTileButton");
		return Clss;
	}

	void OnUpdateExclusiveWarning(bool bShouldWarn);
	void OnEquippedStateChanged(bool bEquipped, bool bOnDifferentSlot);
	void OnChangeOwnedState(bool bOwned);
	void OnArchivedStatusUpdated(bool bShowAsArchived, bool bUseAnimations);
};

// 0x500 (0xC10 - 0x710)
// Class FortniteUI.AthenaCustomizationScreen
class UAthenaCustomizationScreen : public UFortItemPreviewScreen
{
public:
	bool                                         bCustomizationSelectionBeingProcessed;             // 0x710(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_2850[0x7];                                     // Fixing Size After Last Property..
	struct FAthenaCustomizationParams            CustomizationParams;                               // 0x718(0x48)(BlueprintVisible, Protected, NativeAccessSpecifierProtected)
	enum class EAthenaCustomizationCategory      InitialCustomizationCategory;                      // 0x760(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_2851[0x7];                                     // Fixing Size After Last Property..
	class FText                                  CategoryDisplayNames[0x17];                        // 0x768(0x228)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	class FText                                  ItemTypeDisplayNames[0x17];                        // 0x990(0x228)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2852[0x18];                                    // Fixing Size After Last Property..
	TSubclassOf<class UAthenaItemSelectorScreenBase> ItemSelectorScreenClass;                           // 0xBD0(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaItemSelectorScreenBase*         ItemSelectorScreen;                                // 0xBD8(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2853[0x8];                                     // Fixing Size After Last Property..
	struct FDataTableRowHandle                   OpenNameLoadoutInputAction;                        // 0xBE8(0x10)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPrivate)
	class UWidgetAnimation*                      BoundAnim_Intro;                                   // 0xBF8(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UWidgetAnimation*                      BoundAnim_Outro;                                   // 0xC00(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortCosmeticLoadoutSelector*          LoadoutSelector;                                   // 0xC08(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("AthenaCustomizationScreen");
		return Clss;
	}

	void ShowLockerSlot(enum class EAthenaCustomizationCategory CustomizationCategory, int32 SlotIndex, bool bCanShowEmpty);
	void ShiftItemsVariantOption(class UAthenaCosmeticAccountItem* Item, int32 VariantChannelIndex);
	void SetCustomizationSelectionBeingProcessed(bool bIsBeingProcessed);
	void OnLoadoutChanged();
	class FText GetItemTypeDisplayNames(enum class EAthenaCustomizationCategory InCategory);
	class UFortItem* GetFavoriteItemForCategory(enum class EAthenaCustomizationCategory CustomizationType, int32 SubslotIndex);
	class FText GetCategoryDisplayName(enum class EAthenaCustomizationCategory InCategory);
};

// 0x7A8 (0xEB8 - 0x710)
// Class FortniteUI.AthenaCustomizationScreenBase
class UAthenaCustomizationScreenBase : public UFortItemPreviewScreen
{
public:
	bool                                         bCustomizationSelectionBeingProcessed;             // 0x710(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_285C[0x7];                                     // Fixing Size After Last Property..
	struct FAthenaCustomizationParams            CustomizationParams;                               // 0x718(0x48)(BlueprintVisible, Protected, NativeAccessSpecifierProtected)
	enum class EAthenaCustomizationCategory      FirstCustomizationCategory;                        // 0x760(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_285D[0x197];                                   // Fixing Size After Last Property..
	class FText                                  CategoryDisplayNames[0x17];                        // 0x8F8(0x228)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	class FText                                  ItemTypeDisplayNames[0x17];                        // 0xB20(0x228)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	uint8                                        Pad_285E[0x30];                                    // Fixing Size After Last Property..
	TSubclassOf<class UAthenaItemSelectorScreenBase> ItemSelectorScreenClass;                           // 0xD78(0x8)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UFortActivatablePanel>     LoadoutSelectorScreenClass;                        // 0xD80(0x8)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UFortBannerSelectModal>    BannerSelectModalClass;                            // 0xD88(0x8)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UFortNameLoadoutPopup>     NameLoadoutPopupClass;                             // 0xD90(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_285F[0x8];                                     // Fixing Size After Last Property..
	class UCommonButtonBase*                     LastHoveredSlot;                                   // 0xDA0(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2860[0x8];                                     // Fixing Size After Last Property..
	struct FDataTableRowHandle                   OpenNameLoadoutInputAction;                        // 0xDB0(0x10)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPrivate)
	TArray<enum class EAthenaCustomizationCategory> BuiltInEmoteCategoryPriorities;                    // 0xDC0(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	bool                                         bDisplayBuiltInEmotesInEmoteRow;                   // 0xDD0(0x1)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2861[0x7];                                     // Fixing Size After Last Property..
	class UWidgetAnimation*                      BoundAnim_Intro;                                   // 0xDD8(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UWidgetAnimation*                      BoundAnim_Outro;                                   // 0xDE0(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UWidget*                               Container_Loadouts_GodTileArea;                    // 0xDE8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                     Button_Loadouts;                                   // 0xDF0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                     Button_QuickSavePreset;                            // 0xDF8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                     Button_SavePreset;                                 // 0xE00(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                     Button_RandomPresets;                              // 0xE08(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortCosmeticLoadoutSelector*          Loadout_Selector;                                  // 0xE10(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortCosmeticLoadoutCard*              LoadoutCard_AppliedAnimation;                      // 0xE18(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPanelWidget*                          Panel_GearSlotRow;                                 // 0xE20(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaCustomizationSlotSelectorButton* Slot_Pickaxe;                                      // 0xE28(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaCustomizationSlotSelectorButton* Slot_Glider;                                       // 0xE30(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaCustomizationSlotSelectorButton* Slot_Contrail;                                     // 0xE38(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaCustomizationSlotSelectorButton* Slot_LoadingScreen;                                // 0xE40(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPanelWidget*                          Panel_EmoteSlotRow;                                // 0xE48(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPanelWidget*                          Panel_WrapSlotRow;                                 // 0xE50(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPanelWidget*                          Panel_AccountSlotRow;                              // 0xE58(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortBannerSlotButton*                 Banner_Button;                                     // 0xE60(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaLockerItemInfo*                 ItemInfo_Display;                                  // 0xE68(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                     Button_BackToGame;                                 // 0xE70(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2862[0x40];                                    // Fixing Size Of Struct..

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("AthenaCustomizationScreenBase");
		return Clss;
	}

	void ShowLockerSlot(enum class EAthenaCustomizationCategory CustomizationCategory, int32 SlotIndex, bool bCanShowEmpty);
	bool ShouldShowActionBarTooltip();
	bool ShouldDisplayNextRandomPresetName();
	void ShiftItemsVariantOption(class UAthenaCosmeticAccountItem* Item, int32 VariantChannelIndex);
	void SetCustomizationSelectionBeingProcessed(bool bIsBeingProcessed);
	void ResetToCurrentLoadout();
	void RandomizeCurrentLoadout();
	void QuickSaveToolTipSeen();
	void QuickRenameClicked();
	void OnRefreshForNewLoadout(const class FString& LoadoutName, bool bIsShuffleTile);
	void OnQuickSaveComplete();
	void OnQuickRenameStatusUpdated(bool bIsAvailable, class FText& LoadoutName);
	void OnPlayerToggledRandomPresets(bool bNowEnabled);
	void OnModifiedStatusUpdated(bool bIsModified, bool bCanShowToolTip);
	void OnIntroAppliedPreset();
	void OnClearAllBangsUpdated(bool bIsAvailable);
	void OnBeginSavingLoadouts();
	void OnBeginPickingLoadouts();
	void OnBeginPickingCustomizationSlot(class UAthenaCustomizationSlotSelectorButton* SlotButton);
	void HandleInventoryUpdated(TSet<class FString>& ItemChangeFlags, int64 ProfileRevision);
	class FText GetItemTypeDisplayNames(enum class EAthenaCustomizationCategory InCategory);
	class UFortItem* GetFavoriteItemForCategory(enum class EAthenaCustomizationCategory CustomizationType, int32 SubslotIndex);
	class FText GetCategoryDisplayName(enum class EAthenaCustomizationCategory InCategory);
	void ClearAllSlots();
	void ClearAllBangsClicked();
	bool CanShowRandomizeAndReset();
	void ActionBarToolTipSeen();
};

// 0xD0 (0x1590 - 0x14C0)
// Class FortniteUI.AthenaCustomizationSlotSelectorButton
class UAthenaCustomizationSlotSelectorButton : public UCommonButtonLegacy
{
public:
	class FText                                  CategoryDisplayName;                               // 0x14C0(0x18)(Edit, Protected, NativeAccessSpecifierProtected)
	class FText                                  CategoryDescription;                               // 0x14D8(0x18)(Edit, Protected, NativeAccessSpecifierProtected)
	enum class EAthenaCustomizationCategory      CustomizationType;                                 // 0x14F0(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_2866[0x3];                                     // Fixing Size After Last Property..
	int32                                        SubslotIndex;                                      // 0x14F4(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EFortBangType                     BangType;                                          // 0x14F8(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bAllowUnownedItems;                                // 0x14F9(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bOneItemPerSlot;                                   // 0x14FA(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_2867[0x5];                                     // Fixing Size After Last Property..
	class UMaterialInstance*                     OverrideSlotImage;                                 // 0x1500(0x8)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortCosmeticItemCard*                 ItemWidget;                                        // 0x1508(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTag                          RequiredSlotGameplayTag;                           // 0x1510(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_2868[0x4];                                     // Fixing Size After Last Property..
	TSoftObjectPtr<class UTexture2D>             DefaultEmptyTexture;                               // 0x1518(0x28)(Edit, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        CardWidth;                                         // 0x1540(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_2869[0x2C];                                    // Fixing Size After Last Property..
	class UFortItem*                             LocalCampaignHeroPartItem;                         // 0x1570(0x8)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UImage*                                Image_Favorite;                                    // 0x1578(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UImage*                                Image_ClassIcon;                                   // 0x1580(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortBangWrapper_NUI*                  Bang_Wrapper;                                      // 0x1588(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("AthenaCustomizationSlotSelectorButton");
		return Clss;
	}

	void SetCustomizationType(enum class EAthenaCustomizationCategory NewType, int32 InSubslotIndex, struct FGameplayTag& RequiredSlotTag);
	void SetCardDefaultImageAndWidth(TSoftObjectPtr<class UTexture2D>& InDefaultImage, float InWidth);
	void OnUpdateExclusiveWarning(bool bShouldWarn);
	void OnModifiedStatusUpdated(bool bIsModified);
	void OnCustomizationSlotActiveStateChanged(bool bInAttachableCosmeticAvailable, bool bInActive);
	void OnCardImageAndWidthChanged(TSoftObjectPtr<class UTexture2D>& Image, float Width);
	void OnArchivedStatusUpdated(bool bArchived);
	bool IsSlotFilled();
	void HandleDifferentHeroLoadoutActivated(class UFortMcpProfileCampaign* Profile);
	void GetCustomizationSlotActiveState(bool* bOutAttachableCosmeticAvailable, bool* bOutActive);
	class UFortItem* GetCampaignHeroPartItem();
};

// 0x58 (0x368 - 0x310)
// Class FortniteUI.AthenaDiscoverabilityBase
class UAthenaDiscoverabilityBase : public UFortHUDElementWidget
{
public:
	uint8                                        Pad_286A[0x48];                                    // Fixing Size After Last Property..
	struct FFortPrioritizedWidgetData            PrioritizationData;                                // 0x358(0x2)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_286B[0x6];                                     // Fixing Size After Last Property..
	class UFortControllerComponent_MapDiscoverability* AssociatedComponent;                               // 0x360(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("AthenaDiscoverabilityBase");
		return Clss;
	}

	void OnStompFailed();
	void OnStompedByOtherWidget();
	void K2_OnBecomeInactive();
	void K2_OnBecomeActive();
	void CommonVisitedEvent(struct FGameplayTag& NewTag);
	void CommonDiscoveredEvent(struct FGameplayTag& NewTag);
	void CommonArrivalEvent(struct FGameplayTag& NewTag);
};

// 0x0 (0x2B8 - 0x2B8)
// Class FortniteUI.AthenaDiscoverabilityDisplay_Extension
class UAthenaDiscoverabilityDisplay_Extension : public UFortUserWidget
{
public:

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("AthenaDiscoverabilityDisplay_Extension");
		return Clss;
	}

	void OnCommonArrivalEvent(struct FGameplayTag& NewTag);
};

// 0xD8 (0x440 - 0x368)
// Class FortniteUI.AthenaDiscoveredAreaOverlay
class UAthenaDiscoveredAreaOverlay : public UAthenaDiscoverabilityBase
{
public:
	uint8                                        Pad_286E[0xD8];                                    // Fixing Size Of Struct..

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("AthenaDiscoveredAreaOverlay");
		return Clss;
	}

	void OnNewDiscovery(class FText& LocalizedLocationName, TSoftObjectPtr<class USoundCue>& DiscoveredSoundCue, bool bIsNamedLocation, bool bIsDiscovered);
	void BP_HandlePlaylistExtensionWidgetCreated(class UUserWidget* Widget, enum class EUIExtensionSlot SlotType);
};

// 0x8 (0x650 - 0x648)
// Class FortniteUI.AthenaEliminationIndicator
class UAthenaEliminationIndicator : public UAthenaMarkedActorIndicator
{
public:
	uint8                                        Pad_286F[0x8];                                     // Fixing Size Of Struct..

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("AthenaEliminationIndicator");
		return Clss;
	}

};

// 0x0 (0x2A8 - 0x2A8)
// Class FortniteUI.AthenaEliminationOverlayBase
class UAthenaEliminationOverlayBase : public UUserWidget
{
public:

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("AthenaEliminationOverlayBase");
		return Clss;
	}

};

// 0xA8 (0x400 - 0x358)
// Class FortniteUI.AthenaEquippedItemBase
class UAthenaEquippedItemBase : public UBacchusHUDElement
{
public:
	enum class EEquippedWeaponDisplay            CurrentMode;                                       // 0x358(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_2875[0xB];                                     // Fixing Size After Last Property..
	int32                                        AmountConsideredInfinite;                          // 0x364(0x4)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FText                                  DefaultOutOfAmmoText;                              // 0x368(0x18)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	class UCommonVisibilitySwitcher*             Switcher_Content;                                  // 0x380(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPanelWidget*                          Panel_ResourceContent;                             // 0x388(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPanelWidget*                          Panel_AmmoContent;                                 // 0x390(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPanelWidget*                          Panel_UtilityContent;                              // 0x398(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UImage*                                Image_AmmoIcon;                                    // 0x3A0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UImage*                                Image_ResourceIcon;                                // 0x3A8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UImage*                                Image_UtilityIcon;                                 // 0x3B0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      Text_MagazineAmmoCount;                            // 0x3B8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      Text_SurplusAmmoCount;                             // 0x3C0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      Text_ResourceCount;                                // 0x3C8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      Text_UtilityAmmoCount;                             // 0x3D0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      Text_OutOfAmmo;                                    // 0x3D8(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UScaleBox*                             RootScaleBox;                                      // 0x3E0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	enum class ESlateVisibility                  WeaponEquipVisibility;                             // 0x3E8(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2876[0x7];                                     // Fixing Size After Last Property..
	TArray<struct FGameplayAttribute>            TrackedAttributes;                                 // 0x3F0(0x10)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("AthenaEquippedItemBase");
		return Clss;
	}

	void HandleWorldItemsChanged();
	void HandleWeaponTargetingChanged(bool bIsTargeting);
	void HandleWeaponReloadStarted(float ReloadTime, enum class EFortWeaponReloadType ReloadType);
	void HandleWeaponReloadCancelled();
	void HandleWeaponOverheatValueChanged(float CurrentValue, float MaxValue, enum class EFortWeaponOverheatState State, bool bIsInCooldown);
	void HandleWeaponEquipped(class AFortWeapon* NewWeapon, class AFortWeapon* PrevWeapon);
	void HandleViewTargetChanged();
	void HandleSecondaryFireReleased(class AFortWeapon* Weapon);
	void HandleSecondaryFirePressed(class AFortWeapon* Weapon);
	void HandleLocalAmmoChanged(int32 LocalCount, int32 LocalRemaining);
	void HandleBuildingMaterialChanged();
	void BP_HandleWeaponTargetingChanged(bool bIsTargeting);
	void BP_HandleWeaponReloadStarted(float ReloadTime, enum class EFortWeaponReloadType ReloadType);
	void BP_HandleWeaponReloadCancelled(class AFortWeapon* Weapon);
	void BP_HandleWeaponOverheatValueChanged(float CurrentValue, float MaxValue, enum class EFortWeaponOverheatState State, bool bIsInCooldown);
	void BP_HandleWeaponModeChanged(enum class EEquippedWeaponDisplay Mode);
	void BP_HandleWeaponEquipped(class AFortWeapon* NewWeapon, class AFortWeapon* PrevWeapon);
	void BP_HandleSecondaryFireReleased();
	void BP_HandleSecondaryFirePressed();
	void BP_HandleResourceTypeChanged(class UFortResourceItemDefinition* Item, int32 ResourceCount);
	void BP_HandleResourceCountChanged(int32 ResourceCount);
	void BP_HandleHideReserveAmmoChanged(bool bHideReserveAmmo);
	void BP_HandleHasBulletsPerClipChanged(bool bHasBulletsPerClip);
	void BP_HandleHasAmmoChanged(bool bHasAmmo);
	void BP_HandleAmmoCountChanged(int32 MagazineAmmoCount, int32 SurplusAmmoCount, int32 TotalRemaining);
};

// 0x0 (0x568 - 0x568)
// Class FortniteUI.AthenaEventGamesBase
class UAthenaEventGamesBase : public UFortActivatablePanel
{
public:

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("AthenaEventGamesBase");
		return Clss;
	}

};

// 0x28 (0x340 - 0x318)
// Class FortniteUI.AthenaGamePhaseWidgetBase
class UAthenaGamePhaseWidgetBase : public UGamePhaseWidget
{
public:
	class UTextBlock*                            Text_RemainingTime;                                // 0x318(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMaterialInterface*                    StormComingFontMaterial;                           // 0x320(0x8)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        StormComingWarningTime;                            // 0x328(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2877[0x14];                                    // Fixing Size Of Struct..

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("AthenaGamePhaseWidgetBase");
		return Clss;
	}

	void OnUpdateGamePhaseIcon(enum class EAthenaGamePhaseStep GamePhaseStep);
	void HandleCountdownUpdate(int32 TimeRemaining);
};

// 0x20 (0x330 - 0x310)
// Class FortniteUI.AthenaGenericHUDTimerWidgetBase
class UAthenaGenericHUDTimerWidgetBase : public UFortHUDElementWidget
{
public:
	uint8                                        Pad_2878[0x10];                                    // Fixing Size After Last Property..
	class UTextBlock*                            TimeText;                                          // 0x320(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_2879[0x8];                                     // Fixing Size Of Struct..

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("AthenaGenericHUDTimerWidgetBase");
		return Clss;
	}

	void HandleGamePhaseChanged(enum class EAthenaGamePhase GamePhase);
};

// 0x8 (0x2D8 - 0x2D0)
// Class FortniteUI.AthenaGlobalCurrencyWidget
class UAthenaGlobalCurrencyWidget : public UCommonUserWidget
{
public:
	class UCommonNumericTextBlock*               CurrencyTotalText;                                 // 0x2D0(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("AthenaGlobalCurrencyWidget");
		return Clss;
	}

	void HandleOnItemCountChanged(class UFortItemDefinition* Definition, int32 Delta);
};

// 0x50 (0x368 - 0x318)
// Class FortniteUI.AthenaHUDGamePhaseChangingBase
class UAthenaHUDGamePhaseChangingBase : public UGamePhaseWidget
{
public:
	uint8                                        Pad_287C[0x40];                                    // Fixing Size After Last Property..
	struct FFortPrioritizedWidgetData            PrioritizationData;                                // 0x358(0x2)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_287D[0xE];                                     // Fixing Size Of Struct..

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("AthenaHUDGamePhaseChangingBase");
		return Clss;
	}

	void BP_UpdateMessaging(enum class EAthenaGamePhaseStep Step, class FText& Message, class FText& TimeText);
	void BP_HandleGamePhaseStepChanged(enum class EAthenaGamePhaseStep Step);
};

// 0x20 (0x330 - 0x310)
// Class FortniteUI.AthenaHUDPlayerActionAlertBase
class UAthenaHUDPlayerActionAlertBase : public UFortHUDElementWidget
{
public:
	struct FGameplayTag                          HideStormAlertTag;                                 // 0x310(0x4)(Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_287F[0x1C];                                    // Fixing Size Of Struct..

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("AthenaHUDPlayerActionAlertBase");
		return Clss;
	}

	void RequestNextAlert();
	void BP_ShowAlert(enum class EAthenaPlayerActionAlert Alert, class FText& DetailText);
	void BP_OnAlertsCleared();
};

// 0xD0 (0x3E0 - 0x310)
// Class FortniteUI.AthenaIndicatorLayerBase
class UAthenaIndicatorLayerBase : public UFortHUDElementWidget
{
public:
	class UFortActorCanvas*                      GeneralIndicators;                                 // 0x310(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortActorCanvas*                      NameIndicators;                                    // 0x318(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UAthenaPlayerIndicatorBase> PlayerIndicatorClass;                              // 0x320(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                        PlayerIndicatorPoolSize;                           // 0x328(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2880[0x4];                                     // Fixing Size After Last Property..
	struct FUserWidgetPool                       PlayerIndicatorWidgetPool;                         // 0x330(0x88)(Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	class UAthenaPlayerViewModel*                PlayerVM;                                          // 0x3B8(0x8)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USlateVectorArtData*                   TeamIndicatorMesh;                                 // 0x3C0(0x8)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bWasTargeting;                                     // 0x3C8(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2881[0x17];                                    // Fixing Size Of Struct..

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("AthenaIndicatorLayerBase");
		return Clss;
	}

	void OnTargetingChanged(bool bTargeting);
	void OnTargetChangedNative(bool bTargeting);
	void HandleIndicatorModeChanged(bool bIndicatorsEnabled);
};

// 0x30 (0x14F0 - 0x14C0)
// Class FortniteUI.AthenaInventoryEquipButtonBase
class UAthenaInventoryEquipButtonBase : public UCommonButtonLegacy
{
public:
	class UFortMultiSizeItemCard*                ItemWidget;                                        // 0x14C0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UWidget*                               EmptyImage;                                        // 0x14C8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        SlotIndex;                                         // 0x14D0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_2882[0x4];                                     // Fixing Size After Last Property..
	TArray<struct FVector2D>                     ButtonSizeBySlotUsage;                             // 0x14D8(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_2883[0x8];                                     // Fixing Size Of Struct..

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("AthenaInventoryEquipButtonBase");
		return Clss;
	}

};

// 0x20 (0x14E0 - 0x14C0)
// Class FortniteUI.AthenaInventoryItemTileButton
class UAthenaInventoryItemTileButton : public UCommonButtonLegacy
{
public:
	uint8                                        Pad_2884[0x8];                                     // Fixing Size After Last Property..
	class UAthenaItemIcon*                       ItemIcon;                                          // 0x14C8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2885[0x10];                                    // Fixing Size Of Struct..

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("AthenaInventoryItemTileButton");
		return Clss;
	}

	void OnItemChanged(class UFortItem* Item);
	class UFortItem* GetItemToRepresent();
};

// 0x330 (0xA40 - 0x710)
// Class FortniteUI.AthenaItemSelectorScreenBase
class UAthenaItemSelectorScreenBase : public UFortItemPreviewScreen
{
public:
	uint8                                        Pad_2889[0x10];                                    // Fixing Size After Last Property..
	TSubclassOf<class UCommonButtonBase>         TabButtonType;                                     // 0x720(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TMap<enum class EAthenaCustomizationCategory, struct FFortTabButtonLabelInfo> ItemCategoryButtonLabelInfo;                       // 0x728(0x50)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_288A[0x8];                                     // Fixing Size After Last Property..
	struct FFortTabButtonLabelInfo               VariantButtonLabelInfo;                            // 0x780(0xF0)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                     Button_ConfirmSelection;                           // 0x870(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                     Button_EditStyle;                                  // 0x878(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                     Button_ConfirmStyle;                               // 0x880(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                     Button_CommitArchiveChange;                        // 0x888(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                     Button_ApplyToAll;                                 // 0x890(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                     Button_CloseSortAndFilterBlade;                    // 0x898(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                     Button_Back;                                       // 0x8A0(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                     Button_Favorite;                                   // 0x8A8(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                     Button_Unfavorite;                                 // 0x8B0(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UWidget*                               Widget_ArchiveModeButtonContainer;                 // 0x8B8(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortCTAButton*                        Button_ArchiveMode;                                // 0x8C0(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortCTAButton*                        Button_UnarchiveMode;                              // 0x8C8(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortCTAButton*                        Button_ViewInBattlePass;                           // 0x8D0(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UWidget*                               Widget_ShowArchivedItemsButtonContainer;           // 0x8D8(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                     Button_ShowArchivedItems;                          // 0x8E0(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                     Button_HideArchivedItems;                          // 0x8E8(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                     Button_CloseTouch;                                 // 0x8F0(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDynamicEntryBox*                      EntryBox_CustomBottomBarActions;                   // 0x8F8(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAthenaCustomizationPicker*            Picker_ItemSelector;                               // 0x900(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAthenaCustomizationPickerSortAndFilterBlade* Blade_SortAndFilter;                               // 0x908(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UVerticalBox*                          ItemInfo;                                          // 0x910(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortItemBaseWidget*                   Item_HeaderInfo;                                   // 0x918(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bVariantZoomUsesSnap;                              // 0x920(0x1)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_288B[0x7];                                     // Fixing Size After Last Property..
	class UFortItem*                             CurrentPreviewItem;                                // 0x928(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAthenaCosmeticItemDefinition*         CurrentPreviewItemDef;                             // 0x930(0x8)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FMcpVariantChannelInfo>        CurrentPreviewVariantChannels;                     // 0x938(0x10)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<struct FMcpVariantChannelInfo>        CachedVariantChannels;                             // 0x948(0x10)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_288C[0x1];                                     // Fixing Size After Last Property..
	enum class ELockerScreenState                LockerState;                                       // 0x959(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_288D[0x6];                                     // Fixing Size After Last Property..
	class UFortVariantPicker*                    Picker_VariantSelector;                            // 0x960(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaCosmeticUnlockingInfo*          UnlockingInfo;                                     // 0x968(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_288E[0x41];                                    // Fixing Size After Last Property..
	enum class EAthenaCustomizationCategory      CustomizeCategory;                                 // 0x9B1(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_288F[0x6];                                     // Fixing Size After Last Property..
	TSoftClassPtr<class ULockerConfirmationModal> LockerConfirmationModalClass;                      // 0x9B8(0x28)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                  ArchiveMaterialParameterName;                      // 0x9E0(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        ArchiveMaterialParameterEquippingValue;            // 0x9E4(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        ArchiveMaterialParameterArchivingValue;            // 0x9E8(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2890[0x4];                                     // Fixing Size After Last Property..
	class UUserWidget*                           Tooltip_LockerArchivingCleanup;                    // 0x9F0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UUserWidget*                           Tooltip_ArchiveMode;                               // 0x9F8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UUserWidget*                           Tooltip_ArchivedItems;                             // 0xA00(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2891[0x28];                                    // Fixing Size After Last Property..
	int32                                        SubslotIndex;                                      // 0xA30(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_2892[0xC];                                     // Fixing Size Of Struct..

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("AthenaItemSelectorScreenBase");
		return Clss;
	}

	void StartItemCustomization(struct FAthenaCustomizationParams& Params);
	void SaveAndExit_ApplyToAllSlots();
	void SaveAndExit(bool bApplyToAllSlots);
	void OnUpdateLockerArchivingCleanupTooltipText(class FText& Text);
	void OnUpdateExclusiveItemCallout(bool bShouldShow, class FText& CalloutText);
	void OnUpdateArchiveModeTooltipText(class FText& Text);
	void OnUpdateArchivedItemsTooltipText(class FText& Text);
	void OnTabSelectionChanged(bool bShowingVariants);
	void OnShowLockerArchivingCleanupTooltip(bool bShowTooltip);
	void OnShowArchiveModeTooltip(bool bShowTooltip);
	void OnShowArchivedItemsTooltip(bool bShowTooltip);
	void OnLockerScreenStateChanged();
	void OnItemSelectionCommited(class UFortItem* SelectedItem);
	void OnItemSelectedChanged(class UFortItem* SelectedItem);
	void OnHideItemInfoHeader(bool bShouldHide);
	void OnFinishedItemSetup(class FText& CategoryDisplayName, class FText& ItemDisplayTypeName, enum class EAthenaCustomizationCategory SelectedCategory, class UMaterialInstance* OverrideSlotImage);
	void OnFinishedItemSave();
	void OnCurrentItemChanged(class UFortItem* SelectedItem);
	bool IsItemOwned(class UFortItem* Item);
	void IsAlternateActionHovered(bool bAlternateActionHovered);
	void HandleShowArchivedItemsTooltipDismissed();
	void HandleSearchTextChanged(class FText& NewText);
	void HandleScreenAnalytics(bool bItemChanged);
	void HandlePickerMarkedItemsChanged(int32 MarkedCount);
	void HandleLockerArchivingCleanupTooltipDismissed();
	void HandleCommitArchiveChangeClicked();
	void HandleArchiveModeTooltipDismissed();
	void HandleAboutToClose();
	class UFortItem* GetCurrentItem();
	void ExitEditStyle();
	void EnterEditStyle();
	void BP_HandleBack();
};

// 0x238 (0x7A0 - 0x568)
// Class FortniteUI.AthenaLeaderboardScreenBase
class UAthenaLeaderboardScreenBase : public UFortActivatablePanel
{
public:
	class UFortTabListWidgetBase_Legacy*         LeaderboardTabList;                                // 0x568(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonRotator*                        MatchRotator;                                      // 0x570(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonRotator*                        LeaderboardTypeRotator;                            // 0x578(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonTextBlock*                      RefreshTimeText;                                   // 0x580(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonTextBlock*                      NoDataMessageText;                                 // 0x588(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonBorder*                         BorderLocalUserFocus;                              // 0x590(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UWidget*                               Widget_ProfileStats;                               // 0x598(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortProfileStatsRow*                  AthenaStats_Wins;                                  // 0x5A0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortProfileStatsRow*                  AthenaStats_SecondTierFinishes;                    // 0x5A8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortProfileStatsRow*                  AthenaStats_ThirdTierFinishes;                     // 0x5B0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortProfileStatsRow*                  AthenaStats_Eliminations;                          // 0x5B8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortProfileStatsRow*                  AthenaStats_MatchesPlayer;                         // 0x5C0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                     Button_ChangeFlag;                                 // 0x5C8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortFlagImage*                        Image_YourFlag;                                    // 0x5D0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                  LTMPlaylistDefaultName;                            // 0x5D8(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_2895[0x4];                                     // Fixing Size After Last Property..
	TSubclassOf<class UFortFlagSelectionModal>   FortFlagSelectionModalClass;                       // 0x5E0(0x8)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TMap<class FName, class UFortProfileStatsRow*> ActiveProfileRows;                                 // 0x5E8(0x50)(ExportObject, Transient, ContainsInstancedReference, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	uint8                                        Pad_2896[0x90];                                    // Fixing Size After Last Property..
	class UDataTable*                            PlaylistsData;                                     // 0x6C8(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TMap<class FName, class UCommonButtonBase*>  ActiveTabButtons;                                  // 0x6D0(0x50)(BlueprintVisible, ExportObject, Transient, ContainsInstancedReference, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TArray<class UFortLeaderboardRowProxyInstance*> RowProxies;                                        // 0x720(0x10)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	class UFortLeaderboardRowProxyInstance*      LocalUserRowProxy;                                 // 0x730(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FLeaderboardFilter                    CurrentLeaderboardFilter;                          // 0x738(0x18)(Transient, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_2897[0x50];                                    // Fixing Size Of Struct..

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("AthenaLeaderboardScreenBase");
		return Clss;
	}

	void OnUpdateTabButtonText(class UCommonButtonBase* Button, struct FAthenaPlaylistLeaderboardData& PlaylistTabData);
	void OnUpdateListHeader(struct FAthenaPlaylistLeaderboardData& PlaylistTabData);
	void OnUpdateLeaderboardListUI(bool bWasSuccessful, class UFortLeaderboardRowProxyInstance* LocalUserRow, class FText& QueryErrorStr);
	void OnQueryStarted();
	void OnQueryFinished();
	void OnPlaylistChanged(class FName NewPlaylistName, enum class ECommonInputType NewInputType);
	void OnMatchTypeChanged(int32 MatchTypeIndex);
	void OnFriendsFilterChanged(int32 FriendsFilterIndex);
	void OnActiveLeaderboardTabChanged(int32 ActiveWidgetIndex);
	bool CanShowFriendsOnlyLeaderboard();
};

// 0x0 (0x3B8 - 0x3B8)
// Class FortniteUI.AthenaLevelBarBase
class UAthenaLevelBarBase : public UFortActorIndicatorWidget
{
public:

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("AthenaLevelBarBase");
		return Clss;
	}

};

// 0x10 (0x2E0 - 0x2D0)
// Class FortniteUI.AthenaLoadoutEntryWidget
class UAthenaLoadoutEntryWidget : public UCommonUserWidget
{
public:
	class UFortAthenaInventoryLoadout*           SelectedLoadout;                                   // 0x2D0(0x8)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_2898[0x8];                                     // Fixing Size Of Struct..

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("AthenaLoadoutEntryWidget");
		return Clss;
	}

	void SetLoadout(class UFortAthenaInventoryLoadout* NewLoadout);
	void OnLoadoutPicked();
};

// 0x20 (0x588 - 0x568)
// Class FortniteUI.AthenaLoadoutWidget
class UAthenaLoadoutWidget : public UFortActivatablePanel
{
public:
	TArray<class UAthenaLoadoutEntryWidget*>     EntryWidgets;                                      // 0x568(0x10)(ExportObject, ZeroConstructor, ContainsInstancedReference, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TSubclassOf<class UAthenaLoadoutEntryWidget> EntryWidgetClass;                                  // 0x578(0x8)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_2899[0x8];                                     // Fixing Size Of Struct..

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("AthenaLoadoutWidget");
		return Clss;
	}

	void OnLoadoutChosen(class UFortAthenaInventoryLoadout* SelectedLoadout);
	void AddEntryWidget(class UAthenaLoadoutEntryWidget* NewWidget);
};

// 0x68 (0x5D0 - 0x568)
// Class FortniteUI.FortLobbyWidget
class UFortLobbyWidget : public UFortActivatablePanel
{
public:
	uint8                                        Pad_289A[0x10];                                    // Fixing Size After Last Property..
	class AAthenaSquadPedestalGroup*             SquadPedestalGroup;                                // 0x578(0x8)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class AFortTeamMemberPedestal*>       VisualOrderedPedestals;                            // 0x580(0x10)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                        Pad_289B[0x20];                                    // Fixing Size After Last Property..
	class UFortRadialPicker*                     Radial_EmotePicker;                                // 0x5B0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortLobbyPlayerPanel*                 PlayerPanel_PlayerOptions;                         // 0x5B8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                   EmoteInputAction;                                  // 0x5C0(0x10)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("FortLobbyWidget");
		return Clss;
	}

	void OnPlayerPanelHidden();
	void OnPlayerClicked();
	void HandleEmoteClicked(bool* bPassThrough);
	void DynamicHandleLoadingScreenVisibilityChanged(bool IsVisible);
};

// 0x220 (0x7F0 - 0x5D0)
// Class FortniteUI.AthenaLobbyBase
class UAthenaLobbyBase : public UFortLobbyWidget
{
public:
	uint8                                        Pad_28A0[0xD8];                                    // Fixing Size After Last Property..
	class UContentWidget*                        Content_MatchmakingWidget;                         // 0x6A8(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UEmergencyNoticeBase*                  Notice_Emergency;                                  // 0x6B0(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortAthenaMOTDTeaserWidget*           FortAthenaMOTDTeaserWidget_Main;                   // 0x6B8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonBorder*                         LobbyDetails_Default;                              // 0x6C0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortTournamentLobbyPanel*             LobbyDetails_Tournament;                           // 0x6C8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortDivisionLobbyPanel*               LobbyDetails_ShowdownDivision;                     // 0x6D0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonWidgetSwitcherLegacy*           Switcher_LobbyDetailsMode;                         // 0x6D8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                     Button_GenericLink;                                // 0x6E0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                     Button_Quests;                                     // 0x6E8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                     Button_ShadowPlayHighlights;                       // 0x6F0(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UVerticalBox*                          VerticalBox_LobbyDetails;                          // 0x6F8(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UVerticalBox*                          VerticalBox_LobbyDetails_ExtensionHolder;          // 0x700(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
