#pragma once

// Dumper.

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x5980 (0x60B0 - 0x730)
// AnimBlueprintGeneratedClass GrindRail_Player_LayerAnimBP.GrindRail_Player_LayerAnimBP_C
class UGrindRail_Player_LayerAnimBP_C : public UFortGrindRailLayerAnimInstance
{
public:
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0x730(0x8)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimBlueprintGeneratedMutableData    __AnimBlueprintMutables;                           // 0x738(0x58)(HasGetValueTypeHash)
	struct FAnimSubsystemInstance                AnimBlueprintExtension_PropertyAccess;             // 0x790(0x8)()
	struct FAnimSubsystemInstance                AnimBlueprintExtension_Base;                       // 0x798(0x8)()
	struct FAnimNode_Root                        AnimGraphNode_Root_7;                              // 0x7A0(0x20)()
	struct FAnimNode_LinkedInputPose             AnimGraphNode_LinkedInputPose_8;                   // 0x7C0(0xC0)()
	struct FAnimNode_LinkedInputPose             AnimGraphNode_LinkedInputPose_7;                   // 0x880(0xC0)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_81;                 // 0x940(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_80;                 // 0x968(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_79;                 // 0x990(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_78;                 // 0x9B8(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_77;                 // 0x9E0(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_76;                 // 0xA08(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_75;                 // 0xA30(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_74;                 // 0xA58(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_73;                 // 0xA80(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_72;                 // 0xAA8(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_71;                 // 0xAD0(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_70;                 // 0xAF8(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_69;                 // 0xB20(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_68;                 // 0xB48(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_67;                 // 0xB70(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_66;                 // 0xB98(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_65;                 // 0xBC0(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_64;                 // 0xBE8(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_63;                 // 0xC10(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_62;                 // 0xC38(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_61;                 // 0xC60(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_60;                 // 0xC88(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_59;                 // 0xCB0(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_58;                 // 0xCD8(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_57;                 // 0xD00(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_56;                 // 0xD28(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_55;                 // 0xD50(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_54;                 // 0xD78(0x28)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_32;                   // 0xDA0(0x48)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_41;                      // 0xDE8(0x20)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_31;                   // 0xE08(0x48)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_40;                      // 0xE50(0x20)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_30;                   // 0xE70(0x48)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_39;                      // 0xEB8(0x20)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_29;                   // 0xED8(0x48)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_38;                      // 0xF20(0x20)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_28;                   // 0xF40(0x48)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_37;                      // 0xF88(0x20)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_27;                   // 0xFA8(0x48)()
	struct FAnimNode_RotateRootBone              AnimGraphNode_RotateRootBone_6;                    // 0xFF0(0xA8)()
	struct FAnimNode_RotateRootBone              AnimGraphNode_RotateRootBone_5;                    // 0x1098(0xA8)()
	struct FAnimNode_RotationOffsetBlendSpace    AnimGraphNode_RotationOffsetBlendSpace_5;          // 0x1140(0x118)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_36;                      // 0x1258(0x20)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_26;                   // 0x1278(0x48)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_35;                      // 0x12C0(0x20)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_25;                   // 0x12E0(0x48)()
	struct FAnimNode_RotateRootBone              AnimGraphNode_RotateRootBone_4;                    // 0x1328(0xA8)()
	struct FAnimNode_RotateRootBone              AnimGraphNode_RotateRootBone_3;                    // 0x13D0(0xA8)()
	struct FAnimNode_RotationOffsetBlendSpace    AnimGraphNode_RotationOffsetBlendSpace_4;          // 0x1478(0x118)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_34;                      // 0x1590(0x20)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_24;                   // 0x15B0(0x48)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_33;                      // 0x15F8(0x20)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_23;                   // 0x1618(0x48)()
	struct FAnimNode_RotateRootBone              AnimGraphNode_RotateRootBone_2;                    // 0x1660(0xA8)()
	struct FAnimNode_RotateRootBone              AnimGraphNode_RotateRootBone_1;                    // 0x1708(0xA8)()
	struct FAnimNode_RotationOffsetBlendSpace    AnimGraphNode_RotationOffsetBlendSpace_3;          // 0x17B0(0x118)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_32;                      // 0x18C8(0x20)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_22;                   // 0x18E8(0x48)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_31;                      // 0x1930(0x20)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_21;                   // 0x1950(0x48)()
	struct FAnimNode_RotationOffsetBlendSpace    AnimGraphNode_RotationOffsetBlendSpace_2;          // 0x1998(0x118)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_30;                      // 0x1AB0(0x20)()
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine_10;                     // 0x1AD0(0xC8)()
	struct FAnimNode_RotateRootBone              AnimGraphNode_RotateRootBone;                      // 0x1B98(0xA8)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_1;                   // 0x1C40(0x48)()
	struct FAnimNode_Root                        AnimGraphNode_Root_6;                              // 0x1C88(0x20)()
	struct FAnimNode_LinkedInputPose             AnimGraphNode_LinkedInputPose_6;                   // 0x1CA8(0xC0)()
	struct FAnimNode_Root                        AnimGraphNode_Root_5;                              // 0x1D68(0x20)()
	struct FAnimNode_LinkedInputPose             AnimGraphNode_LinkedInputPose_5;                   // 0x1D88(0xC0)()
	struct FAnimNode_Root                        AnimGraphNode_Root_4;                              // 0x1E48(0x20)()
	struct FAnimNode_LinkedInputPose             AnimGraphNode_LinkedInputPose_4;                   // 0x1E68(0xC0)()
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_4;                    // 0x1F28(0x100)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_53;                 // 0x2028(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_52;                 // 0x2050(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_51;                 // 0x2078(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_50;                 // 0x20A0(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_49;                 // 0x20C8(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_48;                 // 0x20F0(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_47;                 // 0x2118(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_46;                 // 0x2140(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_45;                 // 0x2168(0x28)()
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_11;                    // 0x2190(0x28)()
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_14;                    // 0x21B8(0xC8)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_20;                   // 0x2280(0x48)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_29;                      // 0x22C8(0x20)()
	struct FAnimNode_ApplyMeshSpaceAdditive      AnimGraphNode_ApplyMeshSpaceAdditive;              // 0x22E8(0xD0)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_19;                   // 0x23B8(0x48)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_18;                   // 0x2400(0x48)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool;                     // 0x2448(0x48)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2;             // 0x2490(0x20)()
	struct FAnimNode_RefPose                     AnimGraphNode_LocalRefPose;                        // 0x24B0(0x10)()
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend;                    // 0x24C0(0xE0)()
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_13;                    // 0x25A0(0xC8)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_7;                  // 0x2668(0x70)()
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone;                          // 0x26D8(0x128)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_2;             // 0x2800(0x20)()
	struct FAnimNode_ResetRoot                   AnimGraphNode_ResetRoot;                           // 0x2820(0xD8)()
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_10;                    // 0x28F8(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_44;                 // 0x2920(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_43;                 // 0x2948(0x28)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_17;                   // 0x2970(0x48)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_28;                      // 0x29B8(0x20)()
	struct FAnimNode_RefPose                     AnimGraphNode_IdentityPose;                        // 0x29D8(0x10)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_27;                      // 0x29E8(0x20)()
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine_9;                      // 0x2A08(0xC8)()
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_12;                    // 0x2AD0(0xC8)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_26;                      // 0x2B98(0x20)()
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine_8;                      // 0x2BB8(0xC8)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_25;                      // 0x2C80(0x20)()
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_9;                     // 0x2CA0(0x28)()
	struct FAnimNode_ModifyCurve                 AnimGraphNode_ModifyCurve_1;                       // 0x2CC8(0x100)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_24;                      // 0x2DC8(0x20)()
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine_7;                      // 0x2DE8(0xC8)()
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_3;                    // 0x2EB0(0x100)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_6;                  // 0x2FB0(0x70)()
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_2;                    // 0x3020(0x100)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_42;                 // 0x3120(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_41;                 // 0x3148(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_40;                 // 0x3170(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_39;                 // 0x3198(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_38;                 // 0x31C0(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_37;                 // 0x31E8(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_36;                 // 0x3210(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_35;                 // 0x3238(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_34;                 // 0x3260(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_33;                 // 0x3288(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_32;                 // 0x32B0(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_31;                 // 0x32D8(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_30;                 // 0x3300(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_29;                 // 0x3328(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_28;                 // 0x3350(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_27;                 // 0x3378(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_26;                 // 0x33A0(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_25;                 // 0x33C8(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_24;                 // 0x33F0(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_23;                 // 0x3418(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_22;                 // 0x3440(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_21;                 // 0x3468(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_20;                 // 0x3490(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_19;                 // 0x34B8(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_18;                 // 0x34E0(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_17;                 // 0x3508(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_16;                 // 0x3530(0x28)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_16;                   // 0x3558(0x48)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_23;                      // 0x35A0(0x20)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_15;                   // 0x35C0(0x48)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_22;                      // 0x3608(0x20)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_15;                 // 0x3628(0x28)()
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine_6;                      // 0x3650(0xC8)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_21;                      // 0x3718(0x20)()
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_8;                     // 0x3738(0x28)()
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_11;                    // 0x3760(0xC8)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_14;                   // 0x3828(0x48)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_20;                      // 0x3870(0x20)()
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_7;                     // 0x3890(0x28)()
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_10;                    // 0x38B8(0xC8)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_13;                   // 0x3980(0x48)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_19;                      // 0x39C8(0x20)()
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_9;                     // 0x39E8(0xC8)()
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_6;                     // 0x3AB0(0x28)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_5;                  // 0x3AD8(0x70)()
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_8;                     // 0x3B48(0xC8)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_14;                 // 0x3C10(0x28)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_12;                   // 0x3C38(0x48)()
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_7;                     // 0x3C80(0xC8)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_11;                   // 0x3D48(0x48)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_18;                      // 0x3D90(0x20)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_10;                   // 0x3DB0(0x48)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_17;                      // 0x3DF8(0x20)()
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine_5;                      // 0x3E18(0xC8)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_16;                      // 0x3EE0(0x20)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_13;                 // 0x3F00(0x28)()
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_5;                     // 0x3F28(0x28)()
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_6;                     // 0x3F50(0xC8)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_12;                 // 0x4018(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_11;                 // 0x4040(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_10;                 // 0x4068(0x28)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_9;                    // 0x4090(0x48)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_15;                      // 0x40D8(0x20)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_8;                    // 0x40F8(0x48)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_14;                      // 0x4140(0x20)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_7;                    // 0x4160(0x48)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_13;                      // 0x41A8(0x20)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_9;                  // 0x41C8(0x28)()
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine_4;                      // 0x41F0(0xC8)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_12;                      // 0x42B8(0x20)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_8;                  // 0x42D8(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_7;                  // 0x4300(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_6;                  // 0x4328(0x28)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_6;                    // 0x4350(0x48)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_11;                      // 0x4398(0x20)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_5;                    // 0x43B8(0x48)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_10;                      // 0x4400(0x20)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_5;                  // 0x4420(0x28)()
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine_3;                      // 0x4448(0xC8)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_9;                       // 0x4510(0x20)()
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_4;                     // 0x4530(0x28)()
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_5;                     // 0x4558(0xC8)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_4;                  // 0x4620(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_3;                  // 0x4648(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_2;                  // 0x4670(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_1;                  // 0x4698(0x28)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_4;                    // 0x46C0(0x48)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_8;                       // 0x4708(0x20)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_3;                    // 0x4728(0x48)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_7;                       // 0x4770(0x20)()
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine_2;                      // 0x4790(0xC8)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_6;                       // 0x4858(0x20)()
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_3;                     // 0x4878(0x28)()
	struct FAnimNode_LinkedAnimLayer             AnimGraphNode_LinkedAnimLayer;                     // 0x48A0(0xC8)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_5;                       // 0x4968(0x20)()
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_2;                     // 0x4988(0x28)()
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_4;                     // 0x49B0(0xC8)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_2;                    // 0x4A78(0x48)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_4;                       // 0x4AC0(0x20)()
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_1;                     // 0x4AE0(0x28)()
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_3;                     // 0x4B08(0xC8)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult;                    // 0x4BD0(0x28)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_1;                    // 0x4BF8(0x48)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_3;                       // 0x4C40(0x20)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer;                      // 0x4C60(0x48)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_2;                       // 0x4CA8(0x20)()
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine_1;                      // 0x4CC8(0xC8)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_1;                       // 0x4D90(0x20)()
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose;                       // 0x4DB0(0x28)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult;                         // 0x4DD8(0x20)()
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine;                        // 0x4DF8(0xC8)()
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_1;                    // 0x4EC0(0x100)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_4;                  // 0x4FC0(0x70)()
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose;                      // 0x5030(0x100)()
	struct FFortAnimNode_GrindRailSlopeWarping   FortAnimGraphNode_GrindRailSlopeWarping;           // 0x5130(0x340)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_1;             // 0x5470(0x20)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_1;             // 0x5490(0x20)()
	struct FAnimNode_ModifyCurve                 AnimGraphNode_ModifyCurve;                         // 0x54B0(0x100)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_3;                  // 0x55B0(0x70)()
	struct FAnimNode_Root                        AnimGraphNode_Root_3;                              // 0x5620(0x20)()
	struct FAnimNode_LinkedInputPose             AnimGraphNode_LinkedInputPose_3;                   // 0x5640(0xC0)()
	struct FAnimNode_LegIK                       AnimGraphNode_LegIK;                               // 0x5700(0xF8)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x57F8(0x20)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x5818(0x20)()
	struct FAnimNode_Root                        AnimGraphNode_Root_2;                              // 0x5838(0x20)()
	struct FAnimNode_LinkedInputPose             AnimGraphNode_LinkedInputPose_2;                   // 0x5858(0xC0)()
	struct FAnimNode_LinkedInputPose             AnimGraphNode_LinkedInputPose_1;                   // 0x5918(0xC0)()
	struct FAnimNode_Root                        AnimGraphNode_Root_1;                              // 0x59D8(0x20)()
	struct FAnimNode_LinkedInputPose             AnimGraphNode_LinkedInputPose;                     // 0x59F8(0xC0)()
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_2;                     // 0x5AB8(0xC8)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_2;                  // 0x5B80(0x70)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_1;                  // 0x5BF0(0x70)()
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_1;                     // 0x5C60(0xC8)()
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive;                       // 0x5D28(0xC8)()
	struct FAnimNode_RotationOffsetBlendSpace    AnimGraphNode_RotationOffsetBlendSpace_1;          // 0x5DF0(0x118)()
	struct FAnimNode_RotationOffsetBlendSpace    AnimGraphNode_RotationOffsetBlendSpace;            // 0x5F08(0x118)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer;                    // 0x6020(0x70)()
	struct FAnimNode_Root                        AnimGraphNode_Root;                                // 0x6090(0x20)()

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("GrindRail_Player_LayerAnimBP_C");
		return Clss;
	}

	void MovementMode_LowerBodyOverride(const struct FPoseLink& InLowerBodyPose, const struct FPoseLink& InSourcePose, struct FPoseLink* MovementMode_LowerBodyOverride);
	void MovementMode_LocomotionAdditives(const struct FPoseLink& InLocomotionAdditivesPose, struct FPoseLink* MovementMode_LocomotionAdditives);
	void MovementMode_SourcePose(const struct FPoseLink& InSourcePoseBase, struct FPoseLink* MovementMode_SourcePose);
	void MovementMode_FullBodyOverride(const struct FPoseLink& InputPoseFullBody, struct FPoseLink* MovementMode_FullBodyOverride);
	void MovementMode_FinalPoseOverride(const struct FPoseLink& InFinalPose, struct FPoseLink* MovementMode_FinalPoseOverride);
