#pragma once

// Dumper.

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x7EC (0x3C5C - 0x3470)
// BlueprintGeneratedClass NPC_Pawn_Parent.NPC_Pawn_Parent_C
class ANPC_Pawn_Parent_C : public AFortAIPawn
{
public:
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0x3470(0x8)(ZeroConstructor, Transient, DuplicateTransient)
	class USoundLibraryComponent*                SoundLibrary;                                      // 0x3478(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UFortPawnComponent_CustomDepth*        FortPawnComponent_CustomDepth;                     // 0x3480(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCapsuleComponent*                     WeaponCapsuleCollision;                            // 0x3488(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UFortTaggedNavFiltersComponent*        FortTaggedNavFilters;                              // 0x3490(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UFortActorComponent_Affiliation*       FortActorComponent_Affiliation;                    // 0x3498(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USoundLibraryComponent*                SoundLibrary_Component;                            // 0x34A0(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                       MovementAudioComponent;                            // 0x34A8(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNPC_VoiceComponent_C*                 NPC_VoiceComponent;                                // 0x34B0(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                       VOAudioComponent;                                  // 0x34B8(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UFortWidgetComponent*                  NPCStatusWidget;                                   // 0x34C0(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                        Timeline_ScaleMeshInOrOut_MeshScaleAlpha_9DAAC0B243D26E4160CEC3A458AE0E86; // 0x34C8(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class ETimelineDirection                Timeline_ScaleMeshInOrOut__Direction_9DAAC0B243D26E4160CEC3A458AE0E86; // 0x34CC(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_9141[0x3];                                     // Fixing Size After Last Property..
	class UTimelineComponent*                    Timeline_ScaleMeshInOrOut;                         // 0x34D0(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UClass*                                GE_NPC_RecentlyDamaged;                            // 0x34D8(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	enum class Enum_NPC_AlertLevel               NPC_AlertLevel;                                    // 0x34E0(0x1)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	enum class Enum_NPC_AlertLevel               NPC_AlertLevelPrevious;                            // 0x34E1(0x1)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_9142[0x6];                                     // Fixing Size After Last Property..
	TMap<enum class Enum_NPC_AlertLevel, struct FGameplayTag> NPC_AlertLevelToTagMap;                            // 0x34E8(0x50)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                         NPC_StatusWidgetHealthBarDisabled;                 // 0x3538(0x1)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_9143[0x3];                                     // Fixing Size After Last Property..
	struct FGameplayTag                          GameplayCue_PickupGrabbed;                         // 0x353C(0x4)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	enum class EFortRarity                       NPC_BestLootRarityInInventory;                     // 0x3540(0x1)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	bool                                         NPC_DebugPawn;                                     // 0x3541(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         NPC_ShowInventoryRarityVisuals;                    // 0x3542(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_9144[0x5];                                     // Fixing Size After Last Property..
	double                                       InventoryGlowDelay;                                // 0x3548(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                        NPC_NumberOfInventoryItemsToDeliverHF;             // 0x3550(0x28)(Edit, BlueprintVisible)
	bool                                         NPC_SpawnInvisible;                                // 0x3578(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         NPC_ScaleMeshInOnSpawn;                            // 0x3579(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_9145[0x6];                                     // Fixing Size After Last Property..
	struct FGameplayTagContainer                 TC_NPC_SpawnAbilityTag;                            // 0x3580(0x20)(Edit, BlueprintVisible)
	struct FGameplayTagContainer                 TC_NPC_AlternateSpawnAbilityTag;                   // 0x35A0(0x20)(Edit, BlueprintVisible)
	bool                                         NPC_IsSpawning;                                    // 0x35C0(0x1)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_9146[0x7];                                     // Fixing Size After Last Property..
	double                                       NPC_OriginalGravityScale;                          // 0x35C8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                              NPC_OriginalRotationRate;                          // 0x35D0(0x18)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                         NPC_HasPawnGoal;                                   // 0x35E8(0x1)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_9147[0x7];                                     // Fixing Size After Last Property..
	class AActor*                                NPC_PawnGoalActor;                                 // 0x35F0(0x8)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                        NPC_NumberOfInventoryItemsToConsumeBeforeFullHF;   // 0x35F8(0x28)(Edit, BlueprintVisible)
	bool                                         NPC_PawnIsDestroyingBuildingForNavigation;         // 0x3620(0x1)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_9148[0x7];                                     // Fixing Size After Last Property..
	struct FScalableFloat                        MaxIdleVODelay;                                    // 0x3628(0x28)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                        MinIdleVODelay;                                    // 0x3650(0x28)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                        NPC_DeathDropLootDelay;                            // 0x3678(0x28)(Edit, BlueprintVisible)
	class FName                                  NPC_DeathDropLootTierGroupName;                    // 0x36A0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_9149[0x4];                                     // Fixing Size After Last Property..
	struct FGameplayTagContainer                 NPC_DeathDropLootRequiredDamageTags;               // 0x36A8(0x20)(Edit, BlueprintVisible)
	struct FGameplayTagContainer                 NPC_DeathDropLootForbiddenDamageTags;              // 0x36C8(0x20)(Edit, BlueprintVisible)
	struct FGameplayTagContainer                 GrantStartingItemsAbilityTC;                       // 0x36E8(0x20)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                         NPC_HasItemInInventory;                            // 0x3708(0x1)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_914A[0x3];                                     // Fixing Size After Last Property..
	struct FGameplayTag                          VoiceTag_FullAlertIdle;                            // 0x370C(0x4)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                          VoiceTag_Idle;                                     // 0x3710(0x4)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                          VoiceTag_ReturnToIdle;                             // 0x3714(0x4)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                          VoiceTag_LostTarget;                               // 0x3718(0x4)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                          VoiceTag_Suspicious;                               // 0x371C(0x4)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                          VoiceTag_FullAlert;                                // 0x3720(0x4)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_914B[0x4];                                     // Fixing Size After Last Property..
	TArray<struct FStruct_NPC_TargetSlots>       NPC_TargetSlotsHF;                                 // 0x3728(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                         NPC_DamageCanCancelIntroPhase;                     // 0x3738(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_914C[0x7];                                     // Fixing Size After Last Property..
	struct FGameplayTagQuery                     TQ_NPC_DamageTagsThatCanCancelIntroPhase;          // 0x3740(0x48)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UClass*                                GE_NPC_IntroPhaseBehaviorCooldown;                 // 0x3788(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                 TC_IntroBehaviorActive;                            // 0x3790(0x20)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                         Debug_NPC_AlertLevelForced;                        // 0x37B0(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         NPC_PawnCanInteractInternal;                       // 0x37B1(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_914D[0x6];                                     // Fixing Size After Last Property..
	struct FScalableFloat                        NPC_PrimtiveDataFloatSetRandomlyInRange;           // 0x37B8(0x28)(Edit, BlueprintVisible)
	struct FScalableFloat                        NPC_PrimtiveDataFloatIndexHF;                      // 0x37E0(0x28)(Edit, BlueprintVisible)
	struct FScalableFloat                        NPC_PrimtiveDataFloatMinRangeHF;                   // 0x3808(0x28)(Edit, BlueprintVisible)
	struct FScalableFloat                        NPC_PrimtiveDataFloatMaxRangeHF;                   // 0x3830(0x28)(Edit, BlueprintVisible)
	class AActor*                                NPC_Leader;                                        // 0x3858(0x8)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, RepNotify, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                          GameplayCue_LeaderSet;                             // 0x3860(0x4)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_914E[0x4];                                     // Fixing Size After Last Property..
	double                                       NPC_Skeletal_Mesh_Index;                           // 0x3868(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                            TamedSound;                                        // 0x3870(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                       StateChangeSound;                                  // 0x3878(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                        NPC_ShouldDespawnFromStormHF;                      // 0x3880(0x28)(Edit, BlueprintVisible)
	struct FScalableFloat                        NPC_DespawnTimerHF;                                // 0x38A8(0x28)(Edit, BlueprintVisible)
	struct FGameplayTag                          NPC_DespawnGameplayTag;                            // 0x38D0(0x4)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_914F[0x4];                                     // Fixing Size After Last Property..
	struct FTimerHandle                          NPC_TestIsInSafeZoneTimer;                         // 0x38D8(0x8)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                          NPC_DespawnFromStormTimer;                         // 0x38E0(0x8)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                         NPC_isTryingToDespawn;                             // 0x38E8(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_9150[0x3];                                     // Fixing Size After Last Property..
	struct FGameplayTag                          NPC_ResetIntroGameplayTags;                        // 0x38EC(0x4)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	double                                       SelectedPrimitiveDataFloat;                        // 0x38F0(0x8)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                          GameplayCue_Death;                                 // 0x38F8(0x4)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_9151[0x4];                                     // Fixing Size After Last Property..
	TArray<class UMaterialInterface*>            OG_Materials;                                      // 0x3900(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                         NPC_Apply_GE_for_Swimming;                         // 0x3910(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_9152[0x7];                                     // Fixing Size After Last Property..
	class UClass*                                NPC_GE_ClassToApplyForSwimming;                    // 0x3918(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                         Exit_Burst_GC;                                     // 0x3920(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_9153[0x3];                                     // Fixing Size After Last Property..
	struct FActiveGameplayEffectHandle           NPC_GE_AppliedForSwimming;                         // 0x3924(0x8)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	class FName                                  GoalActorBBKey;                                    // 0x392C(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                          GameplayCueLureInterest;                           // 0x3930(0x4)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_9154[0x4];                                     // Fixing Size After Last Property..
	class UObject*                               NPC_PreviousLureGoal;                              // 0x3938(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                          Exit_Water;                                        // 0x3940(0x4)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                          Enter_Water;                                       // 0x3944(0x4)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                        NPC_MaxDistanceFromDamagedNPCToDrawHeallthBarHF;   // 0x3948(0x28)(Edit, BlueprintVisible)
	struct FScalableFloat                        NPC_HealthBarHideTimeAfterDeathHF;                 // 0x3970(0x28)(Edit, BlueprintVisible)
	struct FScalableFloat                        NPC_PlayEffectWhenLuredHF;                         // 0x3998(0x28)(Edit, BlueprintVisible)
	struct FScalableFloat                        NPC_PawnCanInteractHF;                             // 0x39C0(0x28)(Edit, BlueprintVisible)
	struct FScalableFloat                        NPC_AllowInteractOnlyWhenUnawareHF;                // 0x39E8(0x28)(Edit, BlueprintVisible)
	struct FScalableFloat                        NPC_AllowInteractWhenHasLeaderHF;                  // 0x3A10(0x28)(Edit, BlueprintVisible)
	struct FScalableFloat                        NPC_AllowDrownInShallowWaterHF;                    // 0x3A38(0x28)(Edit, BlueprintVisible)
	bool                                         NPC_IsInventoryInitialized;                        // 0x3A60(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_9155[0x3];                                     // Fixing Size After Last Property..
	float                                        LeaderClearedCueDelay;                             // 0x3A64(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                          GameplayCue_LeaderCleared;                         // 0x3A68(0x4)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                         IsGCForLeaderSetLooping;                           // 0x3A6C(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_9156[0x3];                                     // Fixing Size After Last Property..
	struct FGameplayTag                          NPC_DeathByStormTag;                               // 0x3A70(0x4)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                         NPC_TryDespawnAbility;                             // 0x3A74(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_9157[0x3];                                     // Fixing Size After Last Property..
	struct FActiveGameplayEffectHandle           GeOutsideSafeZoneDamageHandle;                     // 0x3A78(0x8)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                         IsGEStormDamageInit;                               // 0x3A80(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         NPC_MeshScalingInProgress;                         // 0x3A81(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         NPC_DisableCapsuleOverlapsWhenScalingOut;          // 0x3A82(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_9158[0x5];                                     // Fixing Size After Last Property..
	struct FVector                               NPC_OriginalMeshScale;                             // 0x3A88(0x18)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_            NPCScaleMeshInCompleted;                           // 0x3AA0(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_            NPCScaleMeshOutCompleted;                          // 0x3AB0(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                         NPC_CanDropLoot;                                   // 0x3AC0(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_9159[0x7];                                     // Fixing Size After Last Property..
	struct FScalableFloat                        NPC_StaleDespawnTestDistance_HF;                   // 0x3AC8(0x28)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                        NPC_StaleDespawnTimeThreshold_HF;                  // 0x3AF0(0x28)(Edit, BlueprintVisible, DisableEditOnInstance)
	double                                       NPC_LastNonStaleCheckTime;                         // 0x3B18(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         bCanBeDamagedByNullInstigator;                     // 0x3B20(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         IsEnteringWater;                                   // 0x3B21(0x1)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_915A[0x6];                                     // Fixing Size After Last Property..
	FMulticastInlineDelegateProperty_            NPCPawnInteractWithDispatcher;                     // 0x3B28(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                         NPCDynamicBlockConversionOnInteract;               // 0x3B38(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         NPC_TempInteractOverride;                          // 0x3B39(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_915B[0x6];                                     // Fixing Size After Last Property..
	class USoundBase*                            HeadShot_Sound;                                    // 0x3B40(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class FName                                  Headshot_FX_Socket;                                // 0x3B48(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         UseHeadShotFX;                                     // 0x3B4C(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_915C[0x3];                                     // Fixing Size After Last Property..
	struct FGameplayTagContainer                 TC_WeaponTypesAllowedForHeadshotFX;                // 0x3B50(0x20)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                         AllowHeadshot;                                     // 0x3B70(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_915D[0x7];                                     // Fixing Size After Last Property..
	double                                       AdditiveHitReactRetriggerDelay;                    // 0x3B78(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                          Additive_Hit_React_Montage;                        // 0x3B80(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                            Death_Normal_Sound;                                // 0x3B88(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                       HeadshotFXEmitterTemplate;                         // 0x3B90(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class USoundLibrary*>                 SoundLibs_Default;                                 // 0x3B98(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class USoundLibrary*>                 SoundLibs_Alert;                                   // 0x3BA8(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	class USoundLibrary*                         CurrentSoundLib;                                   // 0x3BB8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class USoundLibrary*>                 SoundLibs_Aggressive;                              // 0x3BC0(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class USoundLibrary*>                 SoundLibs_Foley;                                   // 0x3BD0(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class USoundLibrary*>                 SoundLibs_Foley_Water;                             // 0x3BE0(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	class USoundLibrary*                         CurrentFoleyLib;                                   // 0x3BF0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                       Custom_Depth_Update_Rate;                          // 0x3BF8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                Class;                                             // 0x3C00(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TSubclassOf<class UGameplayEffect>           GE_Converted;                                      // 0x3C08(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle           GE_Converted_Handle;                               // 0x3C10(0x8)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                       NPC_Death_Time;                                    // 0x3C18(0x8)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	float                                        ScaleMeshInOrOutPlayRate;                          // 0x3C20(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         AllowSkipScaleOutIfNotRecentlyRendered;            // 0x3C24(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_915E[0x3];                                     // Fixing Size After Last Property..
	FMulticastInlineDelegateProperty_            NPCAlertLevelUpdated;                              // 0x3C28(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FGameplayTagContainer                 GameplayTagsToBlockHitReact;                       // 0x3C38(0x20)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTag                          GCInstantDeathTag;                                 // 0x3C58(0x4)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("NPC_Pawn_Parent_C");
		return Clss;
	}

	void Orphaned(bool* IsOrphaned, class AFortPawn** AttachedPawn);
